-- @作者: baidwwy
-- @邮箱:  313738139@qq.com
-- @创建时间:   2023-01-03 09:00:53
-- @最后修改来自: baidwwy
-- @Last Modified time: 2026-02-27 10:19:27
local 副本_归墟应变 = class()
local sj = 取随机数
local format = string.format
local insert = table.insert
local ceil = math.ceil
local floor = math.floor
local wps = 取物品数据
local typ = type
local random = 取随机数
-- local npc={1="1",2="2",3="3",4="4"} --模型,名字

function 副本_归墟应变:初始化()
	地图处理类.地图数据[8210]={npc={},单位={},传送圈={}} --乌鸡国皇宫
	地图处理类.地图玩家[8210]={}
	地图处理类.地图坐标[8210]=地图处理类.地图坐标[1111]
	地图处理类.地图单位[8210]={}
	地图处理类.单位编号[8210]=1000

	地图处理类.地图数据[8211]={npc={},单位={},传送圈={}} --七绝山山洞
	地图处理类.地图玩家[8211]={}
	地图处理类.地图坐标[8211]=地图处理类.地图坐标[1002]
	地图处理类.地图单位[8211]={}
	地图处理类.单位编号[8211]=1000

	地图处理类.地图数据[8212]={npc={},单位={},传送圈={}} --金兜洞
	地图处理类.地图玩家[8212]={}
	地图处理类.地图坐标[8212]=地图处理类.地图坐标[1183]
	地图处理类.地图单位[8212]={}
	地图处理类.单位编号[8212]=1000

	地图处理类.地图数据[8213]={npc={},单位={},传送圈={}} --金兜洞
	地图处理类.地图玩家[8213]={}
	地图处理类.地图坐标[8213]=地图处理类.地图坐标[1202]
	地图处理类.地图单位[8213]={}
	地图处理类.单位编号[8213]=1000
end

function 副本_归墟应变:开启副本(id)
	if 玩家数据[id].队伍==0 or 玩家数据[id].队长==false  then
		常规提示(id,"#Y/该任务必须组队完成且由队长领取")
		return
	elseif 取队伍人数(id)<1 and 调试模式==false then
		常规提示(id,"#Y请组队挑战")
		return
	elseif  取等级要求(id,50)==false then
		常规提示(id,"#Y此副本要求角色等级不能低于50级")
		return
	end
	local 队伍id=玩家数据[id].队伍
	for n=1,#队伍数据[队伍id].成员数据 do
		local 临时id=队伍数据[队伍id].成员数据[n]
		if 副本数据.归墟应变.完成[临时id]~=nil then
		常规提示(id,"#Y"..玩家数据[临时id].角色.名称.."本日已经完成过此副本了")
		return
		elseif  玩家数据[id].队长 ==true then
			玩家数据[id].道具:消耗背包道具(玩家数据[id].连接id,id,"归墟应变",1)
		elseif 玩家数据[临时id].角色:取任务(560)~=0 then
			常规提示(id,"#Y"..玩家数据[临时id].角色.名称.."正在进行副本任务，无法领取新的副本")
			return
		end
	end
	副本数据.归墟应变.进行[id]={进程=1}
	local 任务id,ZU=取唯一任务(560,id)
	任务数据[任务id]={
		id=任务id,
		起始=os.time(),
		结束=72000,
		玩家id=0,
		DWZ=ZU,
		销毁=true,
		副本重置=true,
		队伍组=ZU,
		副本id=id,
		PlayerGroup = table.copy(队伍数据[队伍id].成员数据),
		类型=560
	}
	任务处理类:添加队伍任务(id,任务id,"#Y你开启了归墟应变副本")
	刷新任务560(id)
end

function 刷新任务560(id)
	local id = 任务处理类:取副本id(id,560)
	if 副本数据.归墟应变.进行[id]==nil then
		return
	end
	玩家数据[id].zhandou=0
	local 队伍id=玩家数据[id].队伍
	if 副本数据.归墟应变.进行[id].进程==1 then
		local 地图=8210 --长安城
		local 任务id=id.."_561_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="羊力大仙",
			模型="龙太子",
			武器="天龙破城",
			锦衣="青花瓷",
			x=126,
			y=23,
			方向=0,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=561
		}
		地图处理类:添加单位(任务id)
		local 地图=8210 --长安城
		local 任务id=id.."_561_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="鹿力大仙",
			模型="逍遥生",
			武器="浩气长舒",
			锦衣="浮生",
			x=79,
			y=78,
			方向=1,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=561
		}
		地图处理类:添加单位(任务id)
		local 地图=8210 --长安城
		local 任务id=id.."_561_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="虎力大仙",
			模型="虎头怪",
			武器="碧血干戚",
			锦衣="浮生",
			x=116,
			y=117,
			方向=1,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=561
		}
		地图处理类:添加单位(任务id)
		地图处理类:跳转地图(id,8210,30,148) --跳转到动画地图
	elseif 副本数据.归墟应变.进行[id].进程==2 then
		任务处理类:删除副本单位(id,560,561)
		local 地图=8211 --长安城
		local 任务id=id.."_562_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="袁天罡",
			模型="袁天罡",
			x=31,
			y=72,
			方向=0,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=562
		}
		地图处理类:添加单位(任务id)
		local 地图=8211 --长安城
		local 任务id=id.."_562_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="杜如晦",
			模型="考官2",
			x=35,
			y=69,
			方向=0,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=562
		}
		地图处理类:添加单位(任务id)
		local 地图=8211 --长安城
		local 任务id=id.."_562_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="殷丞相",
			模型="考官2",
			x=40,
			y=68,
			方向=0,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=562
		}
		地图处理类:添加单位(任务id)
		local 地图=8211 --长安城
		local 任务id=id.."_562_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="魏征",
			模型="考官2",
			x=43,
			y=64,
			方向=0,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=562
		}
		地图处理类:添加单位(任务id)
		-- local 地图=8211 --长安城
		-- local 任务id=id.."_562_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		-- 任务数据[任务id]={
		-- 	id=任务id,
		-- 	起始=os.time(),
		-- 	结束=3600,
		-- 	销毁=true,
		-- 	副本重置=true,
		-- 	玩家id=0,
		-- 	队伍组={},
		-- 	名称="尉迟恭德",
		-- 	模型="男人_将军",
		-- 	x=40,
		-- 	y=68,
		-- 	方向=0,
		-- 	副本id=id,
		-- 	地图编号=地图,
		-- 	地图名称=取地图名称(地图),
		-- 	类型=562
		-- }
		-- 地图处理类:添加单位(任务id)
		local 地图=8211 --长安城
		local 任务id=id.."_562_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="尉迟恭德",
			模型="男人_将军",
			x=52,
			y=70,
			方向=2,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=562
		}
		地图处理类:添加单位(任务id)
		local 地图=8211 --长安城
		local 任务id=id.."_562_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="程咬金",
			模型="男人_程咬金",
			x=48,
			y=72,
			方向=2,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=562
		}
		地图处理类:添加单位(任务id)
		local 地图=8211 --长安城
		local 任务id=id.."_562_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="秦琼",
			模型="秦琼",
			x=40,
			y=74,
			方向=2,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=562
		}
		地图处理类:添加单位(任务id)
		local 地图=8211 --长安城
		local 任务id=id.."_562_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="李世民",
			模型="皇帝",
			x=43,
			y=69,
			方向=3,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=562
		}
		地图处理类:添加单位(任务id)
		local 地图=8211 --长安城
		local 任务id=id.."_562_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="玄奘法师",
			模型="唐僧",
			x=50,
			y=64,
			方向=3,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=562
		}
		地图处理类:添加单位(任务id)

		local 地图=8211 --长安城
		local 任务id=id.."_562_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="李元吉",
			模型="鬼将",
			显示饰品=true,
			x=63,
			y=71,
			方向=3,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=562
		}
		地图处理类:添加单位(任务id)
		local 地图=8211 --长安城
		local 任务id=id.."_563_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="李建成",
			模型="鬼将",
			显示饰品=true,
			x=73,
			y=73,
			方向=3,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=563
		}
		地图处理类:添加单位(任务id)
		地图处理类:跳转地图(id,8211,29,78)
	elseif 副本数据.归墟应变.进行[id].进程==3 then
	elseif 副本数据.归墟应变.进行[id].进程==4 then
		任务处理类:删除副本单位(id,560,562)
		任务处理类:删除副本单位(id,560,563)
		local 地图=8212 --长安城
		local 任务id=id.."_564_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="宝箱",
			模型="宝箱",
			x=92,
			y=19,
			方向=0,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=564
		}
		地图处理类:添加单位(任务id)
		地图处理类:跳转地图(id,8212,100,72) --跳转到动画地图
	elseif 副本数据.归墟应变.进行[id].进程==5 then
			任务处理类:删除副本单位(id,560,564)
			local 任务id=id.."_565_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			local 地图=8213 --长安城
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="护命符",
				模型="进阶雷龙",
				销毁=true,
				副本重置=true,
				x=129,
				y=59,
				方向=0,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=565
			}
			地图处理类:添加单位(任务id)
			地图处理类:跳转地图(id,8213,67,61) --跳转到动画地图
	elseif 副本数据.归墟应变.进行[id].进程==6 then
		任务处理类:删除副本单位(id,560,565)
		local 任务id=玩家数据[id].角色:取任务(560)
		local text1 = {"梦幻西游真好玩！","我还要充钱。","归墟应变副本（完）"}
		for n=1,#队伍数据[队伍id].成员数据 do
			local 临时id=队伍数据[队伍id].成员数据[n]
			玩家数据[临时id].角色:取消任务(任务id)
			副本数据.归墟应变.完成[临时id]=true
			地图处理类:跳转地图(id,1001,224,118)
			发送数据(玩家数据[临时id].连接id,6557,{文本=text1,类型="归墟副本结束",字体=nil,音乐=nil,背景=nil,横排显示=true,动画=nil})
		end
	end
end

function 副本_归墟应变:怪物对话内容(id,类型,标识,地图)
	local 对话数据={}
	对话数据.模型=任务数据[标识].模型
	对话数据.名称=任务数据[标识].名称
	local 副本id = 任务处理类:取副本id(id,560)
	if 副本id == 0 or 副本id ~= id  then
		对话数据.对话="只有创建副本的队长才能和我对话"
		return 对话数据
	end
	if 副本数据.归墟应变.进行[副本id].进程==1 then
		if    对话数据.名称=="羊力大仙" then
			对话数据.对话 = "欢迎来到梦幻西游"
			对话数据.选项 = {"我来了","我准备一下"}
		elseif	对话数据.名称=="鹿力大仙" then
			对话数据.对话 = "欢迎来到梦幻西游"
			对话数据.选项 = {"我来了","我准备一下"}
		elseif	对话数据.名称=="虎力大仙" then
			对话数据.对话 = "欢迎来到梦幻西游"
			对话数据.选项 = {"我来了","我准备一下"}
		end
	elseif 副本数据.归墟应变.进行[副本id].进程==2 then
		if 对话数据.名称=="李元吉" then
			对话数据.对话 = "欢迎来到梦幻西游"
			对话数据.选项 = {"挑战你","我准备一下"}
			else
			对话数据.对话 = "欢迎来到梦幻西游"
			对话数据.选项 = {"参观参观"}
		end
	elseif 副本数据.归墟应变.进行[副本id].进程==3 then
			if 对话数据.名称=="李建成" then
				对话数据.对话 = "欢迎来到梦幻西游"
				对话数据.选项 = {"挑战你","我准备一下"}
			end
	elseif 副本数据.归墟应变.进行[副本id].进程==4 then
			if 对话数据.名称=="宝箱" then
				对话数据.对话 = "欢迎来到梦幻西游"
				对话数据.选项 = {"挑战你","我准备一下"}
			end
	elseif 副本数据.归墟应变.进行[副本id].进程==5 then
			if 对话数据.名称=="护命符" then
				对话数据.对话 = "欢迎来到梦幻西游"
				对话数据.选项 = {"挑战你","我准备一下"}
			end
	end
	return 对话数据
end

function 副本_归墟应变:对话事件处理(id,名称,事件,类型)
	local 副本id = 任务处理类:取副本id(id,560)
	if 类型 == 561 and 名称=="羊力大仙" and  事件=="我来了" then
		if 副本数据.归墟应变.进行[副本id].进程==1 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,103030,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 561 and 名称=="鹿力大仙" and  事件=="我来了" then
		if 副本数据.归墟应变.进行[副本id].进程==1 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,103030,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 561 and 名称=="虎力大仙" and  事件=="我来了" then
		if 副本数据.归墟应变.进行[副本id].进程==1 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,103030,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 562 and 名称=="李元吉" and  事件=="挑战你" then
		if 副本数据.归墟应变.进行[副本id].进程==2 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,103031,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 563 and 名称=="李建成" and  事件=="挑战你" then
		if 副本数据.归墟应变.进行[副本id].进程==3 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,103032,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 564 and 名称=="宝箱" and  事件=="挑战你" then
		if 副本数据.归墟应变.进行[副本id].进程==4 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,103033,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 565 and 名称=="护命符" and  事件=="挑战你" then
		if 副本数据.归墟应变.进行[副本id].进程==5 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,103034,玩家数据[id].地图单位.标识)
		end
	end
end

function 副本_归墟应变:战斗胜利处理(id组,战斗类型,任务id)
	local id = id组[1]
	local 副本id = 任务处理类:取副本id(id,560)
	if 副本id == 0 then return end
	if 战斗类型 == 103030 then
		副本数据.归墟应变.进行[副本id]={进程=2}
		任务数据[任务id].zhandou = nil
		刷新任务560(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 103031 then
		副本数据.归墟应变.进行[副本id]={进程=3}
		任务数据[任务id].zhandou = nil
		刷新任务560(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 103032 then
		副本数据.归墟应变.进行[副本id]={进程=4}
		任务数据[任务id].zhandou = nil
		刷新任务560(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 103033 then
		副本数据.归墟应变.进行[副本id]={进程=5}
		任务数据[任务id].zhandou = nil
		刷新任务560(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 103034 then
		副本数据.归墟应变.进行[副本id]={进程=6}
		任务数据[任务id].zhandou = nil
		刷新任务560(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	end
end

function 副本_归墟应变:完成奖励(id组,战斗类型)
	if 战斗类型 == 103030 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(2650,4100)+500000
			local 银子=等级*取随机数(3500,3800)+9000
			玩家数据[cyid].角色:添加经验(经验*HDPZ["归墟应变"].经验,"归墟应变",1)
			玩家数据[cyid].角色:添加银子(银子*HDPZ["归墟应变"].银子,"归墟应变",1)
			玩家数据[cyid].角色:添加副本积分(20)
			if 取随机数()<=HDPZ["归墟应变"].爆率 then
				local 链接={提示=format("#S(归墟应变)#Y梦幻西游为高手玩家打造的副本，#G/%s#Y少侠在归墟应变中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
				local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["归墟应变"].ITEM),"归墟应变")
				if 数量== 9999 then --环
					玩家数据[cyid].道具:给予道具(cyid,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
				else
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,数量,参数,链接)
				end
			end
		end--百晓星君
	elseif 战斗类型 == 103031 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(2650,4100)+500000
			local 银子=等级*取随机数(3500,3800)+9000
			玩家数据[cyid].角色:添加经验(经验*HDPZ["归墟应变"].经验,"归墟应变",1)
			玩家数据[cyid].角色:添加银子(银子*HDPZ["归墟应变"].银子,"归墟应变",1)
			玩家数据[cyid].角色:添加副本积分(20)
			if 取随机数()<=HDPZ["归墟应变"].爆率 then
				local 链接={提示=format("#S(归墟应变)#Y梦幻西游为高手玩家打造的副本，#G/%s#Y少侠在归墟应变中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
				local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["归墟应变"].ITEM),"归墟应变")
				if 数量== 9999 then --环
					玩家数据[cyid].道具:给予道具(cyid,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
				else
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,数量,参数,链接)
				end
			end
		end--兰虎
	elseif 战斗类型 == 103032 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(2650,4100)+500000
			local 银子=等级*取随机数(3500,3800)+9000
			玩家数据[cyid].角色:添加经验(经验*HDPZ["归墟应变"].经验,"归墟应变",1)
			玩家数据[cyid].角色:添加银子(银子*HDPZ["归墟应变"].银子,"归墟应变",1)
			玩家数据[cyid].角色:添加副本积分(20)
			if 取随机数()<=HDPZ["归墟应变"].爆率 then
				local 链接={提示=format("#S(归墟应变)#Y梦幻西游为高手玩家打造的副本，#G/%s#Y少侠在归墟应变中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
				local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["归墟应变"].ITEM),"归墟应变")
				if 数量== 9999 then --环
					玩家数据[cyid].道具:给予道具(cyid,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
				else
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,数量,参数,链接)
				end
			end
		end--郑镖头
	elseif 战斗类型 == 103033 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(2650,4100)+500000
			local 银子=等级*取随机数(3500,3800)+9000
			玩家数据[cyid].角色:添加经验(经验*HDPZ["归墟应变"].经验,"归墟应变",1)
			玩家数据[cyid].角色:添加银子(银子*HDPZ["归墟应变"].银子,"归墟应变",1)
			玩家数据[cyid].角色:添加副本积分(20)
			if 取随机数()<=HDPZ["归墟应变"].爆率 then
				local 链接={提示=format("#S(归墟应变)#Y梦幻西游为高手玩家打造的副本，#G/%s#Y少侠在归墟应变中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
				local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["归墟应变"].ITEM),"归墟应变")
				if 数量== 9999 then --环
					玩家数据[cyid].道具:给予道具(cyid,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
				else
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,数量,参数,链接)
				end
			end
		end--郑镖头
	elseif 战斗类型 == 103034 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(2650,4100)+500000
			local 银子=等级*取随机数(7000,7500)+9000
			玩家数据[cyid].角色:添加经验(经验*HDPZ["归墟应变"].经验,"归墟应变",1)
			玩家数据[cyid].角色:添加银子(银子*HDPZ["归墟应变"].银子,"归墟应变",1)
			玩家数据[cyid].角色:添加副本积分(20)
			if 取随机数()<=HDPZ["归墟应变"].爆率 then
				local 链接={提示=format("#S(归墟应变)#Y梦幻西游为高手玩家打造的副本，#G/%s#Y少侠在归墟应变中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
				local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["归墟应变"].ITEM),"归墟应变")
				if 数量== 9999 then --环
					玩家数据[cyid].道具:给予道具(cyid,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
				else
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,数量,参数,链接)
				end
			end
		end--郑镖头
	end
end

function 副本_归墟应变:任务说明(玩家id,任务id)
	local 说明 = {}
	local 副本id=任务数据[任务id].副本id
	if 副本数据.归墟应变.进行[副本id]==nil then
		说明={"归墟应变","#L您的副本已经完成"}
	else
		local 进程=副本数据.归墟应变.进行[副本id].进程
		       if 进程==1 then
			说明={"副本·车迟国",format("#L战斗特性：#Y应变\n与#Y/羊力大仙#L，#Y鹿力大仙#L，#Y虎力大仙#L战斗。剩余时间%s分钟。)（可在#Y方舟#L处取消任务，或重新返回轮回之虚）\n【难度★★★】",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==2 then
			说明={"副本·水陆大会",format("#L战斗特性：#Y应变\n与".."#Y/qqq|李元吉*8211*临时npc*63*71/李元吉".."#L战斗。剩余时间%s分钟。)（可在#Y方舟#L处取消任务，或重新返回轮回之虚）\n【难度★★★】",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==3 then
			说明={"副本·水陆大会",format("#L战斗特性：#Y应变\n与".."#Y/qqq|李建成*8211*临时npc*73*73/李建成".."#L战斗。剩余时间%s分钟。)（可在#Y方舟#L处取消任务，或重新返回轮回之虚）\n【难度★★★】",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==4 then
			说明={"副本·无底洞",format("#L战斗特性：#Y应变\n与".."#Y/qqq|宝箱*8212*临时npc*92*19/宝箱".."#L战斗。剩余时间%s分钟。)（可在#Y方舟#L处取消任务，或重新返回轮回之虚）\n【难度★★★】",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==5 then
			说明={"副本·通天河",format("#L战斗特性：#Y应变\n与".."#Y/qqq|护命符*8213*临时npc*129*59/护命符".."#L战斗。剩余时间%s分钟。)（可在#Y方舟#L处取消任务，或重新返回轮回之虚）\n【难度★★★】",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		end
	end
	return 说明
end

return 副本_归墟应变
