-- @作者: baidwwy
-- @邮箱:  313738139@qq.com
-- @创建时间:   2023-01-03 09:00:53
-- @最后修改来自: baidwwy
-- @Last Modified time: 2026-02-27 10:19:23
local 副本_归墟激战 = class()
local sj = 取随机数
local format = string.format
local insert = table.insert
local ceil = math.ceil
local floor = math.floor
local wps = 取物品数据
local typ = type
local random = 取随机数
-- local npc={1="1",2="2",3="3",4="4"} --模型,名字

function 副本_归墟激战:初始化()
	地图处理类.地图数据[8203]={npc={},单位={},传送圈={}} --乌鸡国皇宫
	地图处理类.地图玩家[8203]={}
	地图处理类.地图坐标[8203]=地图处理类.地图坐标[1236]
	地图处理类.地图单位[8203]={}
	地图处理类.单位编号[8203]=1000

	地图处理类.地图数据[8204]={npc={},单位={},传送圈={}} --七绝山山洞
	地图处理类.地图玩家[8204]={}
	地图处理类.地图坐标[8204]=地图处理类.地图坐标[1210]
	地图处理类.地图单位[8204]={}
	地图处理类.单位编号[8204]=1000

	地图处理类.地图数据[8205]={npc={},单位={},传送圈={}} --金兜洞
	地图处理类.地图玩家[8205]={}
	地图处理类.地图坐标[8205]=地图处理类.地图坐标[1228]
	地图处理类.地图单位[8205]={}
	地图处理类.单位编号[8205]=1000

	地图处理类.地图数据[8206]={npc={},单位={},传送圈={}} --金兜洞
	地图处理类.地图玩家[8206]={}
	地图处理类.地图坐标[8206]=地图处理类.地图坐标[1215]
	地图处理类.地图单位[8206]={}
	地图处理类.单位编号[8206]=1000
end

function 副本_归墟激战:开启副本(id)
	if 玩家数据[id].队伍==0 or 玩家数据[id].队长==false  then
		常规提示(id,"#Y/该任务必须组队完成且由队长领取")
		return
	elseif 取队伍人数(id)<1 and 调试模式==false then
		常规提示(id,"#Y请组队挑战")
		return
	elseif  取等级要求(id,50)==false then
		常规提示(id,"#Y此副本要求角色等级不能低于50级")
		return
	end
	local 队伍id=玩家数据[id].队伍
	for n=1,#队伍数据[队伍id].成员数据 do
		local 临时id=队伍数据[队伍id].成员数据[n]
		if 副本数据.归墟激战.完成[临时id]~=nil then
		常规提示(id,"#Y"..玩家数据[临时id].角色.名称.."本日已经完成过此副本了")
		return
		elseif  玩家数据[id].队长 ==true then
			玩家数据[id].道具:消耗背包道具(玩家数据[id].连接id,id,"归墟激战",1)
		elseif 玩家数据[临时id].角色:取任务(540)~=0 then
			常规提示(id,"#Y"..玩家数据[临时id].角色.名称.."正在进行副本任务，无法领取新的副本")
			return
		end
	end
	副本数据.归墟激战.进行[id]={进程=1}
	local 任务id,ZU=取唯一任务(540,id)
	任务数据[任务id]={
		id=任务id,
		起始=os.time(),
		结束=72000,
		玩家id=0,
		DWZ=ZU,
		销毁=true,
		副本重置=true,
		队伍组=ZU,
		副本id=id,
		PlayerGroup = table.copy(队伍数据[队伍id].成员数据),
		类型=540
	}
	任务处理类:添加队伍任务(id,任务id,"#Y你开启了归墟激战副本")
	刷新任务540(id)
end

function 刷新任务540(id)
	local id = 任务处理类:取副本id(id,540)
	if 副本数据.归墟激战.进行[id]==nil then
		return
	end
	玩家数据[id].zhandou=0
	local 队伍id=玩家数据[id].队伍
	if 副本数据.归墟激战.进行[id].进程==1 then
		local 地图=8203 --长安城
		local 任务id=id.."_541_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="黄风怪",
			模型="进阶炎魔神",
			显示饰品=true,
			x=16,
			y=20,
			方向=0,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=541
		}
		地图处理类:添加单位(任务id)
		地图处理类:跳转地图(id,8203,44,37) --跳转到动画地图
	elseif 副本数据.归墟激战.进行[id].进程==2 then
		任务处理类:删除副本单位(id,540,541)
		local 地图=8204 --长安城
		local 任务id=id.."_542_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="圣婴大王",
			模型="小魔头",
			显示饰品=true,
			x=169,
			y=111,
			方向=0,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=542
		}
		地图处理类:添加单位(任务id)
		地图处理类:跳转地图(id,8204,18,54) --跳转到动画地图
	elseif 副本数据.归墟激战.进行[id].进程==3 then
			任务处理类:删除副本单位(id,540,542)
			local 任务id=id.."_543_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			local 地图=8205 --长安城
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="巫罗幻象",
				模型="巫蛮儿",
				锦衣="浮生绡·点黛",
				武器="云雷万里",
				销毁=true,
				副本重置=true,
				x=59,
				y=21,
				方向=0,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=543
			}
			地图处理类:添加单位(任务id)
			地图处理类:跳转地图(id,8205,12,42) --跳转到动画地图
	elseif 副本数据.归墟激战.进行[id].进程==4 then
			任务处理类:删除副本单位(id,540,543)
			local 任务id=id.."_544_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			local 地图=8206 --长安城
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="黑熊怪",
				模型="黑熊精",
				显示饰品=true,
				销毁=true,
				副本重置=true,
				x=54,
				y=29,
				方向=0,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=544
			}
			地图处理类:添加单位(任务id)
			地图处理类:跳转地图(id,8206,105,83) --跳转到动画地图
	elseif 副本数据.归墟激战.进行[id].进程==5 then
		任务处理类:删除副本单位(id,540,544)
		local 任务id=玩家数据[id].角色:取任务(540)
		local text1 = {"梦幻西游真好玩！","我还要充钱。","归墟激战副本（完）"}
		for n=1,#队伍数据[队伍id].成员数据 do
			local 临时id=队伍数据[队伍id].成员数据[n]
			玩家数据[临时id].角色:取消任务(任务id)
			副本数据.归墟激战.完成[临时id]=true
			地图处理类:跳转地图(id,1001,224,118)
			发送数据(玩家数据[临时id].连接id,6557,{文本=text1,类型="归墟副本结束",字体=nil,音乐=nil,背景=nil,横排显示=true,动画=nil})
		end
	end
end

function 副本_归墟激战:怪物对话内容(id,类型,标识,地图)
	local 对话数据={}
	对话数据.模型=任务数据[标识].模型
	对话数据.名称=任务数据[标识].名称
	local 副本id = 任务处理类:取副本id(id,540)
	if 副本id == 0 or 副本id ~= id  then
		对话数据.对话="只有创建副本的队长才能和我对话"
		return 对话数据
	end
	if 副本数据.归墟激战.进行[副本id].进程==1 then
		if 对话数据.名称=="黄风怪" then
			对话数据.对话 = "欢迎来到梦幻西游"
			对话数据.选项 = {"我来了","我准备一下"}
		end
	elseif 副本数据.归墟激战.进行[副本id].进程==2 then
		if 对话数据.名称=="圣婴大王" then
			对话数据.对话 = "欢迎来到梦幻西游"
			对话数据.选项 = {"挑战你","我准备一下"}
		end
	elseif 副本数据.归墟激战.进行[副本id].进程==3 then
			if 对话数据.名称=="巫罗幻象" then
				对话数据.对话 = "欢迎来到梦幻西游"
				对话数据.选项 = {"挑战你","我准备一下"}
			end
	elseif 副本数据.归墟激战.进行[副本id].进程==4 then
			if 对话数据.名称=="黑熊怪" then
				对话数据.对话 = "欢迎来到梦幻西游"
				对话数据.选项 = {"挑战你","我准备一下"}
			end
	end
	return 对话数据
end

function 副本_归墟激战:对话事件处理(id,名称,事件,类型)
	local 副本id = 任务处理类:取副本id(id,540)
	if 类型 == 541 and 名称=="黄风怪" and  事件=="我来了" then
		if 副本数据.归墟激战.进行[副本id].进程==1 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,103010,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 542 and 名称=="圣婴大王" and  事件=="挑战你" then
		if 副本数据.归墟激战.进行[副本id].进程==2 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,103011,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 543 and 名称=="巫罗幻象" and  事件=="挑战你" then
		if 副本数据.归墟激战.进行[副本id].进程==3 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,103012,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 544 and 名称=="黑熊怪" and  事件=="挑战你" then
		if 副本数据.归墟激战.进行[副本id].进程==4 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,103013,玩家数据[id].地图单位.标识)
		end
	end
end

function 副本_归墟激战:战斗胜利处理(id组,战斗类型,任务id)
	local id = id组[1]
	local 副本id = 任务处理类:取副本id(id,540)
	if 副本id == 0 then return end
	if 战斗类型 == 103010 then
		副本数据.归墟激战.进行[副本id]={进程=2}
		任务数据[任务id].zhandou = nil
		刷新任务540(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 103011 then
		副本数据.归墟激战.进行[副本id]={进程=3}
		任务数据[任务id].zhandou = nil
		刷新任务540(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 103012 then
		副本数据.归墟激战.进行[副本id]={进程=4}
		任务数据[任务id].zhandou = nil
		刷新任务540(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 103013 then
		副本数据.归墟激战.进行[副本id]={进程=5}
		任务数据[任务id].zhandou = nil
		刷新任务540(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	end
end

function 副本_归墟激战:完成奖励(id组,战斗类型)
	if 战斗类型 == 103010 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(2650,4100)+500000
			local 银子=等级*取随机数(110,120)+9000
			玩家数据[cyid].角色:添加经验(经验*HDPZ["归墟激战"].经验,"归墟激战",1)
			玩家数据[cyid].角色:添加银子(银子*HDPZ["归墟激战"].银子,"归墟激战",1)
			玩家数据[cyid].角色:添加副本积分(20)
			if 取随机数()<=HDPZ["归墟激战"].爆率 then
				local 链接={提示=format("#S(归墟激战)#Y梦幻西游为高手玩家打造的副本，#G/%s#Y少侠在归墟激战中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
				local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["归墟激战"].ITEM),"归墟激战")
				if 数量== 9999 then --环
					玩家数据[cyid].道具:给予道具(cyid,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
				else
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,数量,参数,链接)
				end
			end
		end--百晓星君
	elseif 战斗类型 == 103011 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(2650,4100)+500000
			local 银子=等级*取随机数(110,120)+80000
			玩家数据[cyid].角色:添加经验(经验*HDPZ["归墟激战"].经验,"归墟激战",1)
			玩家数据[cyid].角色:添加银子(银子*HDPZ["归墟激战"].银子,"归墟激战",1)
			玩家数据[cyid].角色:添加副本积分(20)
			if 取随机数()<=HDPZ["归墟激战"].爆率 then
				local 链接={提示=format("#S(归墟激战)#Y梦幻西游为高手玩家打造的副本，#G/%s#Y少侠在归墟激战中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
				local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["归墟激战"].ITEM),"归墟激战")
				if 数量== 9999 then --环
					玩家数据[cyid].道具:给予道具(cyid,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
				else
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,数量,参数,链接)
				end
			end
		end--兰虎
	elseif 战斗类型 == 103012 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(2650,4100)+500000
			local 银子=等级*取随机数(110,120)+80000
			玩家数据[cyid].角色:添加经验(经验*HDPZ["归墟激战"].经验,"归墟激战",1)
			玩家数据[cyid].角色:添加银子(银子*HDPZ["归墟激战"].银子,"归墟激战",1)
			玩家数据[cyid].角色:添加副本积分(20)
			if 取随机数()<=HDPZ["归墟激战"].爆率 then
				local 链接={提示=format("#S(归墟激战)#Y梦幻西游为高手玩家打造的副本，#G/%s#Y少侠在归墟激战中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
				local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["归墟激战"].ITEM),"归墟激战")
				if 数量== 9999 then --环
					玩家数据[cyid].道具:给予道具(cyid,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
				else
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,数量,参数,链接)
				end
			end
		end--郑镖头
	elseif 战斗类型 == 103013 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(2650,4100)+500000
			local 银子=等级*取随机数(110,120)+80000
			玩家数据[cyid].角色:添加经验(经验*HDPZ["归墟激战"].经验,"归墟激战",1)
			玩家数据[cyid].角色:添加银子(银子*HDPZ["归墟激战"].银子,"归墟激战",1)
			玩家数据[cyid].角色:添加副本积分(20)
			if 取随机数()<=HDPZ["归墟激战"].爆率 then
				local 链接={提示=format("#S(归墟激战)#Y梦幻西游为高手玩家打造的副本，#G/%s#Y少侠在归墟激战中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
				local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["归墟激战"].ITEM),"归墟激战")
				if 数量== 9999 then --环
					玩家数据[cyid].道具:给予道具(cyid,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
				else
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,数量,参数,链接)
				end
			end
		end--郑镖头
	end
end

function 副本_归墟激战:任务说明(玩家id,任务id)
	local 说明 = {}
	local 副本id=任务数据[任务id].副本id
	if 副本数据.归墟激战.进行[副本id]==nil then
		说明={"归墟激战","#L您的副本已经完成"}
	else
		local 进程=副本数据.归墟激战.进行[副本id].进程
		       if 进程==1 then
			说明={"副本·前世今生",format("#L战斗特性：#Y激战\n与".."#Y/qqq|黄风怪*8203*临时npc*16*20/黄风怪".."#L战斗。剩余时间%s分钟。)（可在#Y方舟#L处取消任务，或重新返回轮回之虚）\n【难度★★★】",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==2 then
			说明={"副本·红孩儿",format("#L战斗特性：#Y激战\n与".."#Y/qqq|圣婴大王*8204*临时npc*169*111/圣婴大王".."#L战斗。剩余时间%s分钟。)（可在#Y方舟#L处取消任务，或重新返回轮回之虚）\n【难度★★★】",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==3 then
			说明={"副本·后羿陵墓",format("#L战斗特性：#Y激战\n与".."#Y/qqq|巫罗幻象*8205*临时npc*59*21/巫罗幻象".."#L战斗。剩余时间%s分钟。)（可在#Y方舟#L处取消任务，或重新返回轮回之虚）\n【难度★★★】",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==4 then
			说明={"副本·黑风山",format("#L战斗特性：#Y激战\n与".."#Y/qqq|黑熊怪*8206*临时npc*54*29/黑熊怪".."#L战斗。剩余时间%s分钟。)（可在#Y方舟#L处取消任务，或重新返回轮回之虚）\n【难度★★★】",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		end
	end
	return 说明
end

return 副本_归墟激战
