
local 副本_归墟共生 = class()
local sj = 取随机数
local format = string.format
local insert = table.insert
local ceil = math.ceil
local floor = math.floor
local wps = 取物品数据
local typ = type
local random = 取随机数

function 副本_归墟共生:初始化()
	地图处理类.地图数据[8200]={npc={},单位={},传送圈={}} --乌鸡国皇宫
	地图处理类.地图玩家[8200]={}
	地图处理类.地图坐标[8200]=地图处理类.地图坐标[1209]
	地图处理类.地图单位[8200]={}
	地图处理类.单位编号[8200]=1000

	地图处理类.地图数据[8201]={npc={},单位={},传送圈={}} --七绝山山洞
	地图处理类.地图玩家[8201]={}
	地图处理类.地图坐标[8201]=地图处理类.地图坐标[1126]
	地图处理类.地图单位[8201]={}
	地图处理类.单位编号[8201]=1000

	地图处理类.地图数据[8202]={npc={},单位={},传送圈={}} --金兜洞
	地图处理类.地图玩家[8202]={}
	地图处理类.地图坐标[8202]=地图处理类.地图坐标[1211]
	地图处理类.地图单位[8202]={}
	地图处理类.单位编号[8202]=1000
end

function 副本_归墟共生:开启副本(id)
	if 玩家数据[id].队伍==0 or 玩家数据[id].队长==false  then
		常规提示(id,"#Y/该任务必须组队完成且由队长领取")
		return
	elseif 取队伍人数(id)<1 and 调试模式==false then
		常规提示(id,"#Y请组队挑战")
		return
	elseif  取等级要求(id,53)==false then
		常规提示(id,"#Y此副本要求角色等级不能低于50级")
		return
	end
	local 队伍id=玩家数据[id].队伍
	for n=1,#队伍数据[队伍id].成员数据 do
		local 临时id=队伍数据[队伍id].成员数据[n]
		if 副本数据.归墟共生.完成[临时id]~=nil then
		常规提示(id,"#Y"..玩家数据[临时id].角色.名称.."本日已经完成过此副本了")
		return
		elseif  玩家数据[id].队长 ==true then --这里可以选择所有玩家
			玩家数据[id].道具:消耗背包道具(玩家数据[id].连接id,id,"归墟共生",1)
		elseif 玩家数据[临时id].角色:取任务(530)~=0 then
			常规提示(id,"#Y"..玩家数据[临时id].角色.名称.."正在进行副本任务，无法领取新的副本")
			return
		end
	end
	副本数据.归墟共生.进行[id]={进程=1}
	local 任务id,ZU=取唯一任务(530,id)
	任务数据[任务id]={
		id=任务id,
		起始=os.time(),
		结束=72000,
		玩家id=0,
		DWZ=ZU,
		销毁=true,
		副本重置=true,
		队伍组=ZU,
		副本id=id,
		PlayerGroup = table.copy(队伍数据[队伍id].成员数据),
		类型=530
	}
	任务处理类:添加队伍任务(id,任务id,"#Y你开启了归墟共生副本")
	刷新任务530(id)
end

function 刷新任务530(id)
	local id = 任务处理类:取副本id(id,530)
	if 副本数据.归墟共生.进行[id]==nil then
		return
	end
	玩家数据[id].zhandou=0
	local 队伍id=玩家数据[id].队伍
	if 副本数据.归墟共生.进行[id].进程==1 then
		local 地图=8200 --长安城
		local 任务id=id.."_531_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="乌鸡国王",
			模型="文伯",
			x=50,
			y=47,
			方向=0,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=531
		}
		地图处理类:添加单位(任务id)
		地图处理类:跳转地图(id,8200,29,56) --跳转到动画地图
	elseif 副本数据.归墟共生.进行[id].进程==2 then
		任务处理类:删除副本单位(id,530,531)
		local 地图=8201 --长安城
		local 任务id=id.."_532_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="红鳞蛇妖",
			模型="千年蛇魅",
			显示饰品=true,
			x=102,
			y=75,
			方向=0,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=532
		}
		地图处理类:添加单位(任务id)
		地图处理类:跳转地图(id,8201,18,51) --跳转到动画地图
	elseif 副本数据.归墟共生.进行[id].进程==3 then
			任务处理类:删除副本单位(id,530,532)
			local 任务id=id.."_533_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			local 地图=8202 --长安城
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="金兜大王",
				模型="牛魔王",
				显示饰品=true,
				销毁=true,
				副本重置=true,
				x=38,
				y=24,
				方向=0,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=533
			}
			地图处理类:添加单位(任务id)
			地图处理类:跳转地图(id,8202,12,42) --跳转到动画地图
	elseif 副本数据.归墟共生.进行[id].进程==4 then
		任务处理类:删除副本单位(id,530,533)
		local 任务id=玩家数据[id].角色:取任务(530)
		local text1 = {"梦幻西游真好玩！","我还要充钱。","归墟共生副本（完）"}
		for n=1,#队伍数据[队伍id].成员数据 do
			local 临时id=队伍数据[队伍id].成员数据[n]
			玩家数据[临时id].角色:取消任务(任务id)
			副本数据.归墟共生.完成[临时id]=true
			地图处理类:跳转地图(id,1001,224,118)
			发送数据(玩家数据[临时id].连接id,6557,{文本=text1,类型="归墟副本结束",字体=nil,音乐=nil,背景=nil,横排显示=true,动画=nil})
		end
	end
end

function 副本_归墟共生:怪物对话内容(id,类型,标识,地图)
	local 对话数据={}
	对话数据.模型=任务数据[标识].模型
	对话数据.名称=任务数据[标识].名称
	local 副本id = 任务处理类:取副本id(id,530)
	if 副本id == 0 or 副本id ~= id  then
		对话数据.对话="只有创建副本的队长才能和我对话"
		return 对话数据
	end
	if 副本数据.归墟共生.进行[副本id].进程==1 then
		if 对话数据.名称=="乌鸡国王" then
			对话数据.对话 = "欢迎来到梦幻西游"
			对话数据.选项 = {"我来了","我准备一下"}
		end
	elseif 副本数据.归墟共生.进行[副本id].进程==2 then
		if 对话数据.名称=="红鳞蛇妖" then
			对话数据.对话 = "欢迎来到梦幻西游"
			对话数据.选项 = {"挑战你","我准备一下"}
		end
	elseif 副本数据.归墟共生.进行[副本id].进程==3 then
			if 对话数据.名称=="金兜大王" then
				对话数据.对话 = "欢迎来到梦幻西游"
				对话数据.选项 = {"挑战你","我准备一下"}
			end
	end
	return 对话数据
end

function 副本_归墟共生:对话事件处理(id,名称,事件,类型)
	local 副本id = 任务处理类:取副本id(id,530)
	if 类型 == 531 and 名称=="乌鸡国王" and  事件=="我来了" then
		if 副本数据.归墟共生.进行[副本id].进程==1 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,103000,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 532 and 名称=="红鳞蛇妖" and  事件=="挑战你" then
		if 副本数据.归墟共生.进行[副本id].进程==2 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,103001,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 533 and 名称=="金兜大王" and  事件=="挑战你" then
		if 副本数据.归墟共生.进行[副本id].进程==3 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,103002,玩家数据[id].地图单位.标识)
		end
	end
end

function 副本_归墟共生:战斗胜利处理(id组,战斗类型,任务id)
	local id = id组[1]
	local 副本id = 任务处理类:取副本id(id,530)
	if 副本id == 0 then return end
	if 战斗类型 == 103000 then
		副本数据.归墟共生.进行[副本id]={进程=2}
		任务数据[任务id].zhandou = nil
		刷新任务530(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 103001 then
		副本数据.归墟共生.进行[副本id]={进程=3}
		任务数据[任务id].zhandou = nil
		刷新任务530(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 103002 then
		副本数据.归墟共生.进行[副本id]={进程=4}
		任务数据[任务id].zhandou = nil
		刷新任务530(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	end
end

function 副本_归墟共生:完成奖励(id组,战斗类型)
	if 战斗类型 == 103000 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(2650,4100)+500000
			local 银子=等级*取随机数(3500,3800)+9000
			玩家数据[cyid].角色:添加经验(经验*HDPZ["归墟共生"].经验,"归墟共生",1)
			玩家数据[cyid].角色:添加银子(银子*HDPZ["归墟共生"].银子,"归墟共生",1)
			玩家数据[cyid].角色:添加副本积分(20)
			if 取随机数()<=HDPZ["归墟共生"].爆率 then
				local 链接={提示=format("#S(归墟共生)#Y梦幻西游为高手玩家打造的副本，#G/%s#Y少侠在归墟共生中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
				local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["归墟共生"].ITEM),"归墟共生")
				if 数量== 9999 then --环
					玩家数据[cyid].道具:给予道具(cyid,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
				else
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,数量,参数,链接)
				end
			end
		end
	elseif 战斗类型 == 103001 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(2650,4100)+500000
			local 银子=等级*取随机数(3500,3800)+9000
			玩家数据[cyid].角色:添加经验(经验*HDPZ["归墟共生"].经验,"归墟共生",1)
			玩家数据[cyid].角色:添加银子(银子*HDPZ["归墟共生"].银子,"归墟共生",1)
			玩家数据[cyid].角色:添加副本积分(20)
			if 取随机数()<=HDPZ["归墟共生"].爆率 then
				local 链接={提示=format("#S(归墟共生)#Y梦幻西游为高手玩家打造的副本，#G/%s#Y少侠在归墟共生中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
				local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["归墟共生"].ITEM),"归墟共生")
				if 数量== 9999 then --环
					玩家数据[cyid].道具:给予道具(cyid,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
				else
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,数量,参数,链接)
				end
			end
		end--兰虎
	elseif 战斗类型 == 103002 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(2650,4100)+500000
			local 银子=等级*取随机数(7000,7500)+9000
			玩家数据[cyid].角色:添加经验(经验*HDPZ["归墟共生"].经验,"归墟共生",1)
			玩家数据[cyid].角色:添加银子(银子*HDPZ["归墟共生"].银子,"归墟共生",1)
			玩家数据[cyid].角色:添加副本积分(20)
			if 取随机数()<=HDPZ["归墟共生"].爆率 then
				local 链接={提示=format("#S(归墟共生)#Y梦幻西游为高手玩家打造的副本，#G/%s#Y少侠在归墟共生中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
				local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["归墟共生"].ITEM),"归墟共生")
				if 数量== 9999 then --环
					玩家数据[cyid].道具:给予道具(cyid,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
				else
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,数量,参数,链接)
				end
			end
		end--郑镖头
	end
end

function 副本_归墟共生:任务说明(玩家id,任务id)
	local 说明 = {}
	local 副本id=任务数据[任务id].副本id
	if 副本数据.归墟共生.进行[副本id]==nil then
		说明={"归墟共生","#L您的副本已经完成"}
	else
		local 进程=副本数据.归墟共生.进行[副本id].进程
		       if 进程==1 then
			说明={"副本·乌鸡",format("#L战斗特性：#Y共生\n与".."#Y/qqq|乌鸡国王*8200*临时npc*50*47/乌鸡国王".."#L战斗。剩余时间%s分钟。)（可在#Y方舟#L处取消任务，或重新返回轮回之虚）\n【难度★★★】",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==2 then
			说明={"副本·七绝山",format("#L战斗特性：#Y共生\n与".."#Y/qqq|红鳞蛇妖*8201*临时npc*102*75/红鳞蛇妖".."#L战斗。剩余时间%s分钟。)（可在#Y方舟#L处取消任务，或重新返回轮回之虚）\n【难度★★★】",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==3 then
			说明={"副本·金兜洞",format("#L战斗特性：#Y共生\n与".."#Y/qqq|金兜大王*8202*临时npc*38*24/金兜大王".."#L战斗。剩余时间%s分钟。)（可在#Y方舟#L处取消任务，或重新返回轮回之虚）\n【难度★★★】",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		end
	end
	return 说明
end

return 副本_归墟共生
