-- @Author: baidwwy
-- @Date:   2023-10-29 20:38:02
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2026-03-06 09:27:42

local 战斗准备类 = class()
function 战斗准备类:初始化()
	self.战斗盒子={}
	self.WPEtime=os.time()
	self.jingzhi=0
	self.xiaxian=0
end
function 战斗准备类:创建玩家战斗(玩家id, 序号, 对方id,地图,单挑模式)
	if 玩家数据[玩家id].zhandou ~= 0 and 玩家数据[对方id].zhandou ~= 0 then
	    return
	end
	if 玩家数据[对方id]==nil or (玩家数据[对方id]~=nil and 玩家数据[对方id].角色.战斗开关) and  玩家数据[对方id].zhandou ~= 0 then
		if 玩家数据[玩家id].队伍 == 0 then
			玩家数据[玩家id].zhandou = 玩家数据[对方id].zhandou
			玩家数据[玩家id].角色.战斗开关 = true
			地图处理类:设置战斗开关(玩家id,true)
			self.战斗盒子[玩家数据[玩家id].zhandou]:进入观战(玩家id,对方id)
			常规提示(玩家id,"#Y/正在观战#/R"..玩家数据[对方id].角色.名称.."#Y/的战斗")
		else
			常规提示(玩家id,"#Y/组队中不可以观战或者对方正在战斗战斗")
		end
		return
	end
	if 玩家id==对方id then
		常规提示(玩家id,"#Y/自己人啊大哥！")
		return
	end
	if 玩家数据[玩家id].队伍 ~= 0 and 玩家数据[对方id].队伍 ~=0 and 玩家数据[玩家id].队伍 == 玩家数据[对方id].队伍 then
		常规提示(玩家id,"#Y/自己人啊大哥！")
		return
	end
	if 玩家数据[对方id].队伍~=0 and 玩家数据[对方id].队长==false  then
	    对方id=玩家数据[对方id].队伍
	end
	-- if 玩家数据[玩家id].结束等待-os.time()>1 then
	-- 	常规提示(玩家id,"#Y你刚战斗不久，还不能进行PK")
	-- 	return
	-- end
	-- if 玩家数据[对方id].结束等待-os.time()>1 then
	-- 	常规提示(玩家id,"#Y对方刚战斗不久，还不能进行PK")
	-- 	return
	-- end
	-- if (玩家数据[玩家id].队伍 ~= 0 or 玩家数据[对方id].队伍 ~= 0) and 序号 == 200003 then
	-- 	常规提示(玩家id,"#Y/该模式禁止组队！")
	-- 	return
	-- end
	self.临时id = 玩家id
	self.临时id = self.临时id + 0
	if 玩家数据[玩家id].队伍 == 0 then
		玩家数据[玩家id].zhandou = self.临时id
		玩家数据[玩家id].角色.战斗开关 = true
		地图处理类:设置战斗开关(玩家id,true)
	else
		 for n=1,#队伍数据[玩家数据[玩家id].队伍].成员数据 do
		 	local cyid=队伍数据[玩家数据[玩家id].队伍].成员数据[n]
			if 玩家数据[cyid].队伍==玩家数据[玩家id].队伍 then
				玩家数据[cyid].zhandou=self.临时id
				玩家数据[cyid].角色.战斗开关=true
				地图处理类:设置战斗开关(cyid,true)
			end
		end
	end
	--==接收方
	-- 200005，勾魂索
	-- 200001，PK台
	-- 200003，比武大会
	-- 200004，剑会
	-- 200002，帮战
	if 玩家数据[对方id].队伍 == 0 then
		玩家数据[对方id].zhandou = self.临时id
		玩家数据[对方id].角色.战斗开关 = true
		地图处理类:设置战斗开关(对方id,true)
		if 序号 == 200003 or 序号 == 200002 or 序号 == 200007 then
			常规提示(对方id,"#Y/你进入了由#R/" .. 玩家数据[玩家id].角色.名称 .. "#Y/发起的战斗中")
		end
	else
		for n=1,#队伍数据[玩家数据[对方id].队伍].成员数据 do
			local cyid=队伍数据[玩家数据[对方id].队伍].成员数据[n]
			if 玩家数据[cyid].队伍==玩家数据[对方id].队伍 then
				玩家数据[cyid].zhandou=self.临时id
				玩家数据[cyid].角色.战斗开关=true
				地图处理类:设置战斗开关(cyid,true)
				if 序号 == 200003 or 序号 == 200002 or 序号 == 200007 then
					常规提示(cyid,"#Y/你进入了由#r/" .. 玩家数据[玩家id].角色.名称 .. "#Y/发起的战斗中")
				end
			end
		end
	end

	self.战斗盒子[self.临时id] = 战斗处理类.创建()
	self.战斗盒子[self.临时id]:进入战斗(玩家id, 序号, 对方id, 地图,true,nil,单挑模式)
end

function 战斗准备类:创建战斗(玩家id,序号,任务id,地图,属性)
	if 玩家数据[玩家id].zhandou~=0 then
	    return
	end
	local 临时id=玩家id
	临时id=临时id
	if 序号==100001 or 序号==100007 then --暗雷和明雷
		if 玩家数据[玩家id].角色.剧情.附加.野外战斗 ~= nil  and 玩家数据[玩家id].角色.地图数据.编号 == 玩家数据[玩家id].角色.剧情.地图 then
			local fhz = 活动怪物处理(玩家数据[玩家id].角色.剧情.附加.野外战斗,任务id,玩家id)
			if #fhz > 0 then
				玩家数据[玩家id].zhandou=临时id
				if 玩家数据[玩家id].队伍==0 then
					玩家数据[玩家id].角色.战斗开关=true
					地图处理类:设置战斗开关(玩家id,true)
				else
					for n=1,#队伍数据[玩家数据[玩家id].队伍].成员数据 do
						if 玩家数据[队伍数据[玩家数据[玩家id].队伍].成员数据[n]].队伍==玩家数据[玩家id].队伍 then
							玩家数据[队伍数据[玩家数据[玩家id].队伍].成员数据[n]].zhandou=临时id
							玩家数据[队伍数据[玩家数据[玩家id].队伍].成员数据[n]].角色.战斗开关=true
							地图处理类:设置战斗开关(队伍数据[玩家数据[玩家id].队伍].成员数据[n],true)
						end
					end
				end
				self.战斗盒子[临时id]=战斗处理类.创建(os.time())
				self.战斗盒子[临时id]:进入战斗(玩家id,玩家数据[玩家id].角色.剧情.附加.野外战斗,任务id,fhz)
			else
				self.战斗盒子[临时id] = nil
			end
		else
			玩家数据[玩家id].zhandou=临时id
			if 玩家数据[玩家id].队伍==0 then
				玩家数据[玩家id].角色.战斗开关=true
				地图处理类:设置战斗开关(玩家id,true)
			else
				for n=1,#队伍数据[玩家数据[玩家id].队伍].成员数据 do
					if 玩家数据[队伍数据[玩家数据[玩家id].队伍].成员数据[n]].队伍==玩家数据[玩家id].队伍 then
						玩家数据[队伍数据[玩家数据[玩家id].队伍].成员数据[n]].zhandou=临时id
						玩家数据[队伍数据[玩家数据[玩家id].队伍].成员数据[n]].角色.战斗开关=true
						地图处理类:设置战斗开关(队伍数据[玩家数据[玩家id].队伍].成员数据[n],true)
					end
				end
			end
			self.战斗盒子[临时id]=战斗处理类.创建(os.time())
			self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,地图)
		end
		return
	--end
  elseif 序号==154000 then
        玩家数据[玩家id].zhandou=临时id
        if 玩家数据[玩家id].队伍==0 then
          玩家数据[玩家id].角色.战斗开关=true
          地图处理类:设置战斗开关(玩家id,true)
        else
          for n=1,#队伍数据[玩家数据[玩家id].队伍].成员数据 do
            if 玩家数据[队伍数据[玩家数据[玩家id].队伍].成员数据[n]].队伍==玩家数据[玩家id].队伍 then
              玩家数据[队伍数据[玩家数据[玩家id].队伍].成员数据[n]].zhandou=临时id
              玩家数据[队伍数据[玩家数据[玩家id].队伍].成员数据[n]].角色.战斗开关=true
              地图处理类:设置战斗开关(队伍数据[玩家数据[玩家id].队伍].成员数据[n],true)
            end
          end
        end
        self.战斗盒子[临时id]=战斗处理类.创建(os.time())
        self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取系统属性(属性),true)
        return
        elseif 序号==154001 then
              玩家数据[玩家id].zhandou=临时id
              if 玩家数据[玩家id].队伍==0 then
                玩家数据[玩家id].角色.战斗开关=true
                地图处理类:设置战斗开关(玩家id,true)
              else
                for n=1,#队伍数据[玩家数据[玩家id].队伍].成员数据 do
                  if 玩家数据[队伍数据[玩家数据[玩家id].队伍].成员数据[n]].队伍==玩家数据[玩家id].队伍 then
                    玩家数据[队伍数据[玩家数据[玩家id].队伍].成员数据[n]].zhandou=临时id
                    玩家数据[队伍数据[玩家数据[玩家id].队伍].成员数据[n]].角色.战斗开关=true
                    地图处理类:设置战斗开关(队伍数据[玩家数据[玩家id].队伍].成员数据[n],true)
                  end
                end
              end
              self.战斗盒子[临时id]=战斗处理类.创建(os.time())
              self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取系统属性(属性),true)
              return
  end
	-------------------------------------怪物属性-------------------------------------
	local Shifouyou=怪物属性.GUAIWU[tostring(序号)]
	-- print(Shifouyou,11111)
	if Shifouyou then
		local shux=Shifouyou(任务id,玩家id,序号,属性)
		玩家数据[玩家id].zhandou=临时id
		if 玩家数据[玩家id].队伍==0 then
			玩家数据[玩家id].角色.战斗开关=true
			地图处理类:设置战斗开关(玩家id,true)
		else
			for n=1,#队伍数据[玩家数据[玩家id].队伍].成员数据 do
				if 玩家数据[队伍数据[玩家数据[玩家id].队伍].成员数据[n]].队伍==玩家数据[玩家id].队伍 then
					玩家数据[队伍数据[玩家数据[玩家id].队伍].成员数据[n]].zhandou=临时id
					玩家数据[队伍数据[玩家数据[玩家id].队伍].成员数据[n]].角色.战斗开关=true
					地图处理类:设置战斗开关(队伍数据[玩家数据[玩家id].队伍].成员数据[n],true)
				end
			end
		end
		self.战斗盒子[临时id]=战斗处理类.创建(os.time())
		self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,shux)
		return
	else
		local fhz = 活动怪物处理(序号,任务id,玩家id)
		-- print(#fhz,22222)
		if #fhz > 0 then
			玩家数据[玩家id].zhandou=临时id
			if 玩家数据[玩家id].队伍==0 then
				玩家数据[玩家id].角色.战斗开关=true
				地图处理类:设置战斗开关(玩家id,true)
			else
				for n=1,#队伍数据[玩家数据[玩家id].队伍].成员数据 do
					if 玩家数据[队伍数据[玩家数据[玩家id].队伍].成员数据[n]].队伍==玩家数据[玩家id].队伍 then
						玩家数据[队伍数据[玩家数据[玩家id].队伍].成员数据[n]].zhandou=临时id
						玩家数据[队伍数据[玩家数据[玩家id].队伍].成员数据[n]].角色.战斗开关=true
						地图处理类:设置战斗开关(队伍数据[玩家数据[玩家id].队伍].成员数据[n],true)
					end
				end
			end
			self.战斗盒子[临时id]=战斗处理类.创建(os.time())
			self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,fhz)
		else
			self.战斗盒子[临时id] = nil
		end
	end
end



function 战斗准备类:取系统属性(属性)
  local 假人随机阵法 = {"普通","天覆阵","地载阵","风扬阵","云垂阵","龙飞阵","虎翼阵","鸟翔阵","蛇蟠阵","鹰啸阵","雷绝阵"}
  local 战斗单位={}
  for i=1,#属性 do
    if 属性[i].门派~=nil then
      local 临时数据 = self:取系统假人随机属性(属性[i].门派,属性[i].等级)
      local 武器数据 = 取可佩带武器名称(临时数据.模型,属性[i].等级)
      战斗单位[i]={
        名称=属性[i].名称
        ,模型=临时数据.模型
        ,伤害=math.floor(属性[i].伤害*1.1)
        ,气血=math.floor(属性[i].气血*1.1)
        ,法伤=math.floor(属性[i].法伤*1.1)
        ,速度=math.floor(属性[i].速度*1.1)
        ,防御=math.floor(属性[i].防御*1.1)
        ,法防=math.floor(属性[i].法防*1.1)
        ,躲闪=属性[i].等级*2
        ,魔法=属性[i].魔法+2000
        ,等级=属性[i].等级
        ,技能={}
        ,愤怒=150
        ,队伍=0
        ,主动技能=临时数据.技能
        ,位置=属性[i].位置
        ,攻击修炼=属性[i].攻击修炼
        ,防御修炼=属性[i].防御修炼
        ,法术修炼=属性[i].法术修炼
        ,抗法修炼=属性[i].抗法修炼
        ,角色=属性[i].角色
        ,武器=取武器数据(武器数据[1],武器数据[2])
        ,五维属性=属性[i].五维属性
        ,门派=临时数据.门派
        ,奇经八脉=临时数据.奇经八脉
        ,附加状态=临时数据.附加状态
        ,追加法术=临时数据.追加法术
        ,武器伤害=属性[i].武器伤害
        ,法宝=临时数据.法宝
        ,AI战斗=属性[i].AI战斗
      }
    else
      local 临时数据 = self:取系统假人BB技能(属性[i].五维属性,属性[i].技能)
      local 模型名称 = 取随机怪(175,属性[i].参战等级)[2]
      战斗单位[i]={
        名称=模型名称
        ,模型=模型名称
        ,伤害=math.floor(属性[i].伤害*0.9)
        ,气血=math.floor(属性[i].气血*0.9)
        ,法伤=math.floor(属性[i].法伤*0.9)
        ,速度=math.floor(属性[i].速度*0.9)
        ,防御=math.floor(属性[i].防御*0.9)
        ,法防=math.floor(属性[i].法防*0.9)
        ,躲闪=属性[i].等级*2
        ,魔法=属性[i].魔法+2000
        ,等级=属性[i].等级
        ,技能=临时数据.技能
        ,主动技能=临时数据.主动技能
        ,位置=属性[i].位置
        ,攻击修炼=属性[i].攻击修炼
        ,防御修炼=属性[i].防御修炼
        ,法术修炼=属性[i].法术修炼
        ,抗法修炼=属性[i].抗法修炼
        ,角色分类=属性[i].角色分类
        ,五维属性=属性[i].五维属性
        ,内丹数据=属性[i].内丹数据
        ,追加法术=临时数据.追加法术
        ,AI战斗=属性[i].AI战斗
      }
    end
  end

  战斗单位[1].附加阵法=假人随机阵法[取随机数(1,#假人随机阵法)]
  return 战斗单位
end
function 战斗准备类:取系统假人随机属性(门派,等级)
  local 随机门派 = 取随机数(1,225)
  local 返回数据 = {}
  --人物中可以添加 技能,门派,模型,附加状态,法术追加,奇经八脉.
  -- 经脉格式为 {神焰=3,XXX=3}
  -- 追加法术 附加状态格式为 {[1]={等级=等级,名称="变身"}}
  -- 法宝格式为 法宝={[1]={名称="五火神焰印",境界=16},[2]={名称="金甲仙衣",境界=9},[3]={名称="拭剑石",境界=9}}
    if 随机门派<=15 then
      --狮驼岭门派模型
      local 角色模型 = {"虎头怪","巨魔王"}
      返回数据.门派="狮驼岭"
      返回数据.技能={"鹰击","狮搏","象形","连环击"}
      返回数据.模型=角色模型[取随机数(1,#角色模型)]
      返回数据.奇经八脉={}
      返回数据.法宝={[1]={名称="金甲仙衣",境界=9}}
      返回数据.追加法术={}
      返回数据.附加状态={[1]={等级=等级,名称="变身"}}
    elseif 随机门派<=30 then
      --大唐官府门派模型
      local 角色模型 = {"飞燕女","英女侠","逍遥生","剑侠客"}
      返回数据.门派="大唐官府"
      返回数据.技能={"烟雨剑法","后发制人","破釜沉舟","杀气诀"}
      返回数据.模型=角色模型[取随机数(1,#角色模型)]
      返回数据.奇经八脉={}
      返回数据.法宝={[1]={名称="金甲仙衣",境界=9}}
      返回数据.追加法术={}
      返回数据.附加状态={}
    --凌波城门派模型
    elseif 随机门派<=45 then
      local 角色模型 = {"舞天姬","玄彩娥","龙太子","神天兵","羽灵神"}
      返回数据.门派="凌波城"
      返回数据.技能={"天崩地裂","翻江搅海","碎星诀","浪涌"}
      返回数据.模型=角色模型[取随机数(1,#角色模型)]
      返回数据.奇经八脉={}
      返回数据.法宝={[1]={名称="金甲仙衣",境界=9}}
      返回数据.追加法术={}
      返回数据.附加状态={}
    elseif 随机门派<=60 then
      --天宫门派模型
      local 角色模型 = {"舞天姬","玄彩娥","龙太子","神天兵"}
      返回数据.门派="天宫"
      返回数据.技能={"天雷斩","雷霆万钧","雷霆万钧","天神护体","天神护法"}
      返回数据.模型=角色模型[取随机数(1,#角色模型)]
      返回数据.奇经八脉={}
      返回数据.法宝={[1]={名称="金甲仙衣",境界=9}}
      返回数据.追加法术={}
      返回数据.附加状态={}
    elseif 随机门派<=75 then
      --龙宫门派模型
      local 角色模型 = {"舞天姬","玄彩娥","龙太子","神天兵","羽灵神"}
      返回数据.门派="龙宫"
      返回数据.技能={"龙卷雨击","龙腾","二龙戏珠","亢龙归海"}
      返回数据.模型=角色模型[取随机数(1,#角色模型)]
      返回数据.奇经八脉={}
      返回数据.法宝={[1]={名称="金甲仙衣",境界=9}}
      返回数据.追加法术={}
      返回数据.附加状态={}
    elseif 随机门派<=90 then
      --神木林门派模型
      local 角色模型 = {"飞燕女","英女侠","巫蛮儿","逍遥生","剑侠客"}
      返回数据.门派="神木林"
      返回数据.技能={"落叶萧萧","密润","风卷残云"}
      返回数据.模型=角色模型[取随机数(1,#角色模型)]
      返回数据.奇经八脉={}
      返回数据.法宝={[1]={名称="金甲仙衣",境界=9}}
      返回数据.追加法术={}
      返回数据.附加状态={}
      elseif 随机门派<=105 then
      --魔王寨门派模型
      local 角色模型 = {"虎头怪","巨魔王"}
      返回数据.门派="魔王寨"
      返回数据.技能={"火甲术","摇头摆尾","三昧真火","飞砂走石","牛劲"}
      返回数据.模型=角色模型[取随机数(1,#角色模型)]
      返回数据.奇经八脉={}
      返回数据.法宝={[1]={名称="金甲仙衣",境界=9}}
      返回数据.追加法术={}
      返回数据.附加状态={}
      elseif 随机门派<=120 then
      --化生寺门派模型
      local 角色模型 = {"逍遥生","剑侠客"}
      返回数据.门派="化生寺"
      返回数据.技能={"推气过宫","活血","金刚护体","金刚护法","唧唧歪歪"}
      返回数据.模型=角色模型[取随机数(1,#角色模型)]
      返回数据.奇经八脉={}
      返回数据.法宝={[1]={名称="金甲仙衣",境界=9}}
      返回数据.追加法术={}
      返回数据.附加状态={}
    elseif 随机门派<=135 then
      --普陀山门派模型
      local 角色模型 = {"舞天姬","玄彩娥","桃夭夭"}
      返回数据.门派="普陀山"
      返回数据.技能={"普渡众生","波澜不惊","晶清诀","灵动九天"}
      返回数据.模型=角色模型[取随机数(1,#角色模型)]
      返回数据.奇经八脉={}
      返回数据.法宝={[1]={名称="金甲仙衣",境界=9}}
      返回数据.追加法术={}
      返回数据.附加状态={}
    elseif 随机门派<=150 then
      --普陀山门派模型
      local 角色模型 = {"虎头怪","巨魔王"}
      返回数据.门派="阴曹地府"
      返回数据.技能={"阎罗令","判官令","百爪狂杀","尸腐毒"}
      返回数据.模型=角色模型[取随机数(1,#角色模型)]
      返回数据.奇经八脉={}
      返回数据.法宝={[1]={名称="金甲仙衣",境界=9}}
      返回数据.追加法术={}
      返回数据.附加状态={}
    elseif 随机门派<=165 then
      --无底洞门派模型
      local 角色模型 = {"虎头怪","巨魔王"}
      返回数据.门派="无底洞"
      返回数据.技能={"地涌金莲","夺命咒","金身舍利","摧心术","明光宝烛"}
      返回数据.模型=角色模型[取随机数(1,#角色模型)]
      返回数据.奇经八脉={}
      返回数据.法宝={[1]={名称="金甲仙衣",境界=9}}
      返回数据.追加法术={}
      返回数据.附加状态={}
    -- elseif 随机门派<=180 then
    --   --盘丝洞门派模型
    --   local 角色模型 = {"骨精灵","狐美人","鬼潇潇"}
    --   返回数据.门派="盘丝洞"
    --   返回数据.技能={"含情脉脉","瘴气","魔音摄魂","盘丝阵","幻镜术","天罗地网"}
    --   返回数据.模型=角色模型[取随机数(1,#角色模型)]
    --   返回数据.奇经八脉={}
    --   返回数据.法宝={[1]={名称="金甲仙衣",境界=9}}
    --   返回数据.追加法术={}
    --   返回数据.附加状态={}
    elseif 随机门派<=195 then
      --方寸山门派模型
      local 角色模型 = {"飞燕女","英女侠","逍遥生","剑侠客"}
      返回数据.门派="方寸山"
      返回数据.技能={"碎甲符","定身符","失心符","五雷咒","落雷符","分身术"}
      返回数据.模型=角色模型[取随机数(1,#角色模型)]
      返回数据.奇经八脉={}
      返回数据.法宝={[1]={名称="金甲仙衣",境界=9}}
      返回数据.追加法术={}
      返回数据.附加状态={}
    elseif 随机门派<=210 then
      --五庄观门派模型
      local 角色模型 = {"龙太子","神天兵","羽灵神"}
      返回数据.门派="五庄观"
      返回数据.技能={"日月乾坤","飘渺式","烟雨剑法","生命之泉"}
      返回数据.模型=角色模型[取随机数(1,#角色模型)]
      返回数据.奇经八脉={}
      返回数据.法宝={[1]={名称="金甲仙衣",境界=9}}
      返回数据.追加法术={}
      返回数据.附加状态={}
    elseif 随机门派<=225 then
      --女儿村门派模型
      local 角色模型 = {"飞燕女","英女侠"}
      返回数据.门派="女儿村"
      返回数据.技能={"一笑倾城","满天花雨","红袖添香","雨落寒沙"}
      返回数据.模型=角色模型[取随机数(1,#角色模型)]
      返回数据.奇经八脉={}
      返回数据.法宝={[1]={名称="金甲仙衣",境界=9}}
      返回数据.追加法术={}
      返回数据.附加状态={}
    end
  return 返回数据
end
function 战斗准备类:取系统假人BB技能(属性,技能)
  local 最高属性 = {"力量",0}
  --结算出最高宠物属性
  --BB身上可以添加 主动技能 和 技能
  for n,v in pairs(属性) do
    if v>最高属性[2] then
      最高属性[1]=n
      最高属性[2]=v
    end
  end

  --如果最高属性与力量相等则为力量
  if 最高属性[2]== 属性["力量"] then
    最高属性[1]="力量"
  end
  --判断最高属性决定BB技能
  if 最高属性[1] == "力量" then
    local 高级技能 = {"从天而降","嗜血追击","须弥真言","灵能激发","高级反震","高级吸血","高级反击","高级连击","高级飞行","高级夜战","高级隐身","高级感知","高级再生","高级冥思","高级慧根","高级必杀","高级幸运","高级神迹","高级招架","高级永恒","高级敏捷","高级强力","高级法术抵抗","高级防御","高级偷袭","高级毒","高级驱鬼","高级鬼魂术","高级魔之心","高级神佑复生","高级精神集中","高级否定信仰","高级法术连击","高级法术暴击","高级法术波动","高级雷属性吸收","高级土属性吸收","高级火属性吸收","高级水属性吸收"}
    local 主动技能 = {"壁垒击破","法术防御","奔雷咒","泰山压顶","水漫金山","地狱烈火","八凶法阵","月光","天降灵葫","上古灵符","叱咤风云","力劈华山","剑荡四方","死亡召唤","善恶有报","壁垒击破","惊心一剑"}
    local 数量 = 0
    local 返回 = {技能={},主动技能={}}
    for n=1,#技能 do
      for i=1,#高级技能 do
        if 技能[n] == 高级技能[i] then
          数量 = 数量 + 1
          返回.技能[#返回.技能+1] = 技能[n]
          table.remove(高级技能,i)
          break
        end
      end
    end
    if #技能 - 数量 > 0 then
      for n=1,#技能 - 数量 do
        local jns = 取随机数(1,#高级技能)
        返回.技能[#返回.技能+1] = 高级技能[jns]
        table.remove(高级技能,jns)
      end
    end
    返回.主动技能 = {主动技能[取随机数(1,#主动技能)]}
    return 返回
  elseif 最高属性[1] == "魔力" then
    local 高级技能 = {"从天而降","嗜血追击","须弥真言","灵能激发","高级反震","高级吸血","高级反击","高级连击","高级飞行","高级夜战","高级隐身","高级感知","高级再生","高级冥思","高级慧根","高级必杀","高级幸运","高级神迹","高级招架","高级永恒","高级敏捷","高级强力","高级法术抵抗","高级防御","高级偷袭","高级毒","高级驱鬼","高级鬼魂术","高级魔之心","高级神佑复生","高级精神集中","高级否定信仰","高级法术连击","高级法术暴击","高级法术波动","高级雷属性吸收","高级土属性吸收","高级火属性吸收","高级水属性吸收"}
    local 主动技能 = {"壁垒击破","法术防御","奔雷咒","泰山压顶","水漫金山","地狱烈火","八凶法阵","月光","天降灵葫","上古灵符","叱咤风云","力劈华山","剑荡四方","死亡召唤","善恶有报","壁垒击破","惊心一剑"}
    local 数量 = 0
    local 返回 = {技能={},主动技能={}}
    for n=1,#技能 do
      for i=1,#高级技能 do
        if 技能[n] == 高级技能[i] then
          数量 = 数量 + 1
          返回.技能[#返回.技能+1] = 技能[n]
          table.remove(高级技能,i)
          break
        end
      end
    end
    if #技能 - 数量 > 0 then
      for n=1,#技能 - 数量 do
        local jns = 取随机数(1,#高级技能)
        返回.技能[#返回.技能+1] = 高级技能[jns]
        table.remove(高级技能,jns)
      end
    end
    返回.主动技能 = {主动技能[取随机数(1,#主动技能)]}
    return 返回
  else
    local 高级技能 = {"从天而降","嗜血追击","须弥真言","灵能激发","高级反震","高级吸血","高级反击","高级连击","高级飞行","高级夜战","高级隐身","高级感知","高级再生","高级冥思","高级慧根","高级必杀","高级幸运","高级神迹","高级招架","高级永恒","高级敏捷","高级强力","高级法术抵抗","高级防御","高级偷袭","高级毒","高级驱鬼","高级鬼魂术","高级魔之心","高级神佑复生","高级精神集中","高级否定信仰","高级法术连击","高级法术暴击","高级法术波动","高级雷属性吸收","高级土属性吸收","高级火属性吸收","高级水属性吸收"}
    local 主动技能 = {"壁垒击破","法术防御","奔雷咒","泰山压顶","水漫金山","地狱烈火","八凶法阵","月光","天降灵葫","上古灵符","叱咤风云","力劈华山","剑荡四方","死亡召唤","善恶有报","壁垒击破","惊心一剑"}
    local 数量 = 0
    local 返回 = {技能={},主动技能={}}
    for n=1,#技能 do
      for i=1,#高级技能 do
        if 技能[n] == 高级技能[i] then
          数量 = 数量 + 1
          返回.技能[#返回.技能+1] = 技能[n]
          table.remove(高级技能,i)
          break
        end
      end
    end
    if #技能 - 数量 > 0 then
      for n=1,#技能 - 数量 do
        local jns = 取随机数(1,#高级技能)
        返回.技能[#返回.技能+1] = 高级技能[jns]
        table.remove(高级技能,jns)
      end
    end
    返回.主动技能 = {主动技能[取随机数(1,#主动技能)]}
    return 返回
  end
end






function 战斗准备类:更新(dt)
	for n, v in pairs(self.战斗盒子) do
		if self.战斗盒子[n]~=nil then
			self.战斗盒子[n]:更新()
		end
		if self.战斗盒子[n].结束条件 then
			self.战斗盒子[n]=nil
		-- else
		end
	end
end

function 战斗准备类:数据处理(玩家id,序号,内容,参数)

	if 玩家数据[玩家id].zhandou==0 or self.战斗盒子[玩家数据[玩家id].zhandou]==nil then
		return 0
	else
		self.战斗盒子[玩家数据[玩家id].zhandou]:数据处理(玩家id,序号,内容,参数)
	end
end

function 战斗准备类:显示(x,y)end
return 战斗准备类