-- @Author: baidwwy
-- @Date:   2024-01-20 03:35:19
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2025-09-25 23:16:55
--======================================================================--
-- @作者: baidwwy@vip.qq.com(313738139) 老毕
-- 单机GGE研究群: 34211 9466 (如果要研究商业 那请勿进!)
-- @创建时间:   2018-03-03 02:34:19
-- @Last Modified time: 2024-01-20 03:44:35
-- 梦幻西游游戏资源破解 baidwwy@vip.qq.com(313738139) 老毕   和 C++PrimerPlus 717535046 这俩位大神破解梦幻西游所有资源
--======================================================================--
local 仙玉处理类 = class() ----------佬伍修改（增加仙玉寄售功能）
function 仙玉处理类:初始化(文件) end
function 仙玉处理类:仙玉寄售(id,数据)
  local 数量 = math.ceil(数据.数量)
  local 单价 = math.ceil(数据.单价)
  if not 验证数字(数量) then return end
  if not 验证数字(单价) then return end
  if 数据.数量 < 50 then
    常规提示(id,"#Y/至少50点起售")
    return
  end

  if 玩家数据[id].角色:扣除仙玉(数量,"仙玉寄售") then
    local 识别码 = 取随机数(1,9999)..随机序列
    仙玉数据.寄售中[#仙玉数据.寄售中+1]=玩家数据[id].角色.账号.."*"..id.."*"..数量.."*"..单价.."*"..os.time().."*"..识别码
    随机序列=随机序列+1
    常规提示(id,"#Y/恭喜你，上架仙玉成功(若您在线则出售银子直接到账,若未在线则银子会存放在本NPC处,请记得及时领取)")
    广播消息({内容=format("#Y[仙玉寄售员]#G%s#W以#R/%s#W两银子每点仙玉的价格在我这里寄售了#R/%s点仙玉。#84",玩家数据[id].角色.名称,单价,数量),频道="xt"})
    发送数据(玩家数据[id].连接id,255,{商品=仙玉数据.寄售中,银子=玩家数据[id].角色.银子,仙玉=取仙玉(id)})
  else
    常规提示(id,"#Y/你好像没有这么多的仙玉")
  end
end

function 仙玉处理类:仙玉取回(id,数据)
  local 编号 = 数据.编号
  local 识别码 = tonumber(数据.识别码)
  if 仙玉数据.寄售中[编号]==nil then
    常规提示(id,"#Y/仙玉数据已经更新,请重新选择1")
    发送数据(玩家数据[id].连接id,255,{商品=仙玉数据.寄售中,银子=玩家数据[id].角色.银子,仙玉=取仙玉(id)})
    return
  end
  local 临时仙玉数据 = 分割文本5(仙玉数据.寄售中[编号],"*")
  if 临时仙玉数据[2] + 0 ~= id then
    常规提示(id,"#Y/仙玉数据已经更新,请重新选择2")
    发送数据(玩家数据[id].连接id,255,{商品=仙玉数据.寄售中,银子=玩家数据[id].角色.银子,仙玉=取仙玉(id)})
    return
  elseif 临时仙玉数据[6] ~= 识别码 then
    常规提示(id,"#Y/仙玉数据已经更新,请重新选择3")
    发送数据(玩家数据[id].连接id,255,{商品=仙玉数据.寄售中,银子=玩家数据[id].角色.银子,仙玉=取仙玉(id)})
    return
  else
    table.remove(仙玉数据.寄售中,编号)
    玩家数据[id].角色:添加仙玉(临时仙玉数据[3]+0,"取回上架仙玉")
    常规提示(id,"#Y/取回成功")
    发送数据(玩家数据[id].连接id,255,{商品=仙玉数据.寄售中,银子=玩家数据[id].角色.银子,仙玉=取仙玉(id)})
  end
end

function 仙玉处理类:仙玉购买(id,数据)
  local 编号 = 数据.编号
  local 数量 = math.ceil(数据.数量)
  local 识别码 = tonumber(数据.识别码)
  if not 验证数字(数量) then return end
  if 仙玉数据.寄售中[编号]==nil then
    常规提示(id,"#Y/仙玉数据已经更新,请重新选择")
    发送数据(玩家数据[id].连接id,255,{商品=仙玉数据.寄售中,银子=玩家数据[id].角色.银子,仙玉=取仙玉(id)})
    return
  elseif 数量 < 1 then
    常规提示(id,"#Y/仙玉1点起购买")
    return
  end
  local 临时仙玉数据 = 分割文本5(仙玉数据.寄售中[编号],"*")
  if 临时仙玉数据[6] ~= 识别码 then
    常规提示(id,"#Y/仙玉数据已经更新,请重新选择")
    发送数据(玩家数据[id].连接id,255,{商品=仙玉数据.寄售中,银子=玩家数据[id].角色.银子,仙玉=取仙玉(id)})
    return
  elseif tonumber(临时仙玉数据[3]) < 数量 then
    常规提示(id,"#Y/该仙玉剩余数量不足")
    发送数据(玩家数据[id].连接id,255,{商品=仙玉数据.寄售中,银子=玩家数据[id].角色.银子,仙玉=取仙玉(id)})
    return
  elseif 取银子(id) < 数量*临时仙玉数据[4] then
    常规提示(id,"#Y/你没有这么多得银两")
    return
  else
    玩家数据[id].角色:扣除银子(数量*临时仙玉数据[4],0,0,"购买仙玉",1)
    临时仙玉数据[3]=临时仙玉数据[3]-数量
    玩家数据[id].角色:添加仙玉(数量,"购买仙玉")
    if 临时仙玉数据[3] <= 0 then
      table.remove(仙玉数据.寄售中,编号)
    else
      仙玉数据.寄售中[编号] = 临时仙玉数据[1].."*"..临时仙玉数据[2].."*"..临时仙玉数据[3].."*"..临时仙玉数据[4].."*"..临时仙玉数据[5].."*"..临时仙玉数据[6]
    end
    local 手续费=tonumber(f函数.读配置(程序目录.."配置文件.ini","其他设置","寄售仙玉手续费")) or 0.05
    local 添加银子 = math.floor(数量*临时仙玉数据[4]*(1-手续费))
    if 玩家数据[tonumber(临时仙玉数据[2])] then
      玩家数据[tonumber(临时仙玉数据[2])].角色:添加银子(添加银子,"出售仙玉",1)
    else
      if 仙玉数据[tonumber(临时仙玉数据[2])] then
        仙玉数据[tonumber(临时仙玉数据[2])] = 仙玉数据[tonumber(临时仙玉数据[2])] + 添加银子
      else
        仙玉数据[tonumber(临时仙玉数据[2])] = 添加银子
      end
    end
    local 日志=读入文件([[自动充值记录.txt]])
    if string.len(日志)>102400 then
      写出文件([[sql\]]..时间转换(os.time()).."自动充值记录.txt",日志)
      日志=""
    end
    日志=日志..时间转换(os.time())..format("具体信息：数字id(%s)通过仙玉交易员购买%s仙玉成功攻击花费[%s],出售ID[%s]\n",id,数量,(数量*临时仙玉数据[4]),临时仙玉数据[2])
    写出文件([[自动充值记录.txt]],日志)
    常规提示(id,"#Y/购买成功")
    发送数据(玩家数据[id].连接id,255,{商品=仙玉数据.寄售中,银子=玩家数据[id].角色.银子,仙玉=取仙玉(id)})
  end
end

function 仙玉处理类:更新(dt) end
function 仙玉处理类:显示(x,y) end
return 仙玉处理类