-- @Author: baidwwy
-- @Date:   2023-11-28 09:34:46
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2026-05-15 11:28:51

local 商城处理类 = class()
local a=0
local 商城类型 = {"银子商城","仙玉商城","特殊商城","锦衣商品","祥瑞商品","足迹商品","光环商品","锻造商品","法宝","灵宝","礼包商品","施法特效","战锦商品","攻击特效","地煞积分","天罡积分","神器积分","强化符","武器装扮"}
function 商城处理类:初始化()
	self.购买组号=nil
	self.购买编号=nil
	self.购买数量=nil
	self.购买分类=nil
	a=RpbARGB.序列
end

function 商城处理类:加载商品()
	self.商品组 = {}
	self.商品组[18] = {银子商城={},仙玉商城={},锻造商品={},特殊商城={},锦衣商品={},祥瑞商品={},足迹商品={},光环商品={},地煞积分={},天罡积分={},神器积分={},强化符={},法宝={},灵宝={},礼包商品={},施法特效={},战锦商品={},攻击特效={},武器装扮={}}
	self:商品()
end

function 商城处理类:数据处理(id,内容)
	self.购买组号 = 内容.组号 + 0
	self.购买编号 = 内容.编号
	self.购买数量 = 内容.数量+0
	self.购买分类 = 内容.分类
	local 银子=玩家数据[id].角色.银子
	local 积分=0
	local 消费类别 = "仙玉"
	if self.购买分类 == "银子商城"  or self.购买分类 == "强化符"  or self.购买分类 == "锻造商品"   then
		消费类别 = "银子" end
	if self.购买分类 == "法宝" then 消费类别 = "银子" end
	if self.购买分类 == "神器积分" then 消费类别 = "神器积分" end
	if self.购买分类 == "地煞积分" then 消费类别 = "地煞积分" end
	if self.购买分类 == "天罡积分" then 消费类别 = "天罡积分" end
	-- if self.购买分类 == "祥瑞套装" then
	-- 	for k,v in pairs(self.商品组[self.购买组号][self.购买分类]) do
	-- 		if v.名称 == 内容.名称 then
	-- 			self.购买编号 = k
	-- 		end
	-- 	end
	-- end
	local 价格 = self.商品组[self.购买组号][self.购买分类][self.购买编号].价格
	local 名称 = self.商品组[self.购买组号][self.购买分类][self.购买编号].名称
	local 临时道具 = table.loadstring(table.tostring(self.商品组[self.购买组号][self.购买分类][self.购买编号]))
	if self.购买数量 == nil or (self.购买数量 ~= nil and self.购买数量 < 1) or not 判断是否为数字(self.购买数量) then
		self.购买数量 = 1
	else
		self.购买数量 = self.购买数量 + 0
	end
	self.购买数量=qz(self.购买数量)
	if self.购买数量>99 then
	    self.购买数量=99
	end
	if 价格~=qz(价格) then
		print("商城物品价格被修改，玩家ID=  "..id)
		__S服务:断开连接(玩家数据[id].连接id)
	    return
	end
	if self.购买分类== "宝宝" and not 玩家数据[id].角色:取新增宝宝数量() then
 		发送数据(玩家数据[id].连接id, 7, "#y/您当前无法携带更多的召唤兽了")
  		return false
 	end
 	if self.购买分类== "宝宝" or self.购买分类 == "祥瑞商品" or self.购买分类 == "法宝" or self.购买分类 == "灵宝" then
 		self.购买数量 = 1
 	end
	local 购买价格 = tonumber(价格*self.购买数量)
	if 消费是否满足(id, 购买价格, 消费类别) then
		if self.购买分类== "宝宝" then
			玩家数据[id].召唤兽:添加召唤兽(nil,nil,nil,nil,nil,nil,nil,nil,nil,nil,nil,nil,临时道具)
			常规提示(id,"#Y你购买了#R/"..self.商品组[self.购买组号][self.购买分类][self.购买编号].名称.."#Y/宝宝!")

		elseif self.购买分类 == "祥瑞商品" then
		    if 玩家数据[id].角色.坐骑列表~= nil and #玩家数据[id].角色.坐骑列表==7 then
		      	常规提示(id,"#Y/购买[#R/"..self.商品组[self.购买组号][self.购买分类][self.购买编号].名称.."#Y/]坐骑失败!携带坐骑数量已上限.")
		      	return false
		    else
		     	常规提示(id,"#Y你购买了[#R/"..self.商品组[self.购买组号][self.购买分类][self.购买编号].名称.."#Y/]坐骑!")
		      	全局坐骑资料:获取坐骑(id,self.商品组[self.购买组号][self.购买分类][self.购买编号].名称)
		      	发送数据(玩家数据[id].连接id,61,玩家数据[id].角色.坐骑列表)
		    end
		else
			local 临时给予道具2 = 取物品数据(名称)
			if 临时给予道具2 and 临时给予道具2[2] == 1000 then
				local 道具格子=玩家数据[id].角色:取法宝格子()
				if 道具格子==0 then
					常规提示(id,"您的法宝栏已经满啦")
					return
				end
				玩家数据[id].道具:给予法宝(id,名称)
			elseif 临时给予道具2 and 临时给予道具2[2] == 1002 then
				if 玩家数据[id].角色.等级<109 then
					常规提示(id,"109级才可以购买！")
					return
				end
				local 道具格子=玩家数据[id].角色:取灵宝格子()
				if 道具格子==0 then
					常规提示(id,"您的灵宝栏已经满啦")
					return
				end
				玩家数据[id].道具:给予灵宝(id,名称)
			else
				if 临时道具.可叠加 then
					local 道具格子=玩家数据[id].角色:取道具格子()
					if 道具格子==0 then
						常规提示(id,"请清理下道具栏吧")
						return
					end
					if 名称=="魔兽要诀" or 名称=="高级魔兽要诀" or 名称=="特殊魔兽要诀" or 名称=="召唤兽内丹" or 名称=="高级召唤兽内丹"  then
					      	local 参数 = 临时道具.技能
				       		if 参数 == nil then
				           			if 名称=="召唤兽内丹" then
								参数=取内丹()
						           	elseif 名称=="高级召唤兽内丹" then
					 			参数=取内丹("高级")
				           			elseif 名称=="魔兽要诀" then
				    	  			参数=取低级要诀()
				           			elseif 名称=="高级魔兽要诀" then
				                			参数=取高级要诀()
				           			elseif 名称=="特殊魔兽要诀" then
				                			参数=取特殊要诀()
				           			end
					        	end
						玩家数据[id].道具:给予道具(id,名称,nil,参数,"商城购买")
					else
						玩家数据[id].道具:系统购买道具(id,名称,self.购买数量,价格*self.购买数量,临时道具,消费类别,"商城购买")--可叠加购买
					end
				else
					local 真实数量=0
					for i = 1, self.购买数量 do
						if 玩家数据[id].角色:取道具格子() > 0 then
							真实数量 = 真实数量 + 1
							if 名称=="150制造指南书" or 名称=="140制造指南书"  or 名称=="130制造指南书" or 名称=="120制造指南书" then
								local 临时数据 =分割文本(名称,"制造指南书")
								玩家数据[id].道具:给予道具(id,"制造指南书",{临时数据[1]/10,临时数据[1]/10},nil,"商城购买")
							elseif 名称=="150百炼精铁"or 名称=="140百炼精铁"  or 名称=="130百炼精铁" or 名称=="120百炼精铁"   then
								local 临时数据 =分割文本(名称,"百炼精铁")
								玩家数据[id].道具:给予道具(id,"百炼精铁",临时数据[1]+0,nil,"商城购买")
							elseif 名称=="炫彩ID" then
								玩家数据[id].道具:给予道具(id,"炫彩ID",nil,nil,"商城购买")
							elseif 名称=="60灵饰指南书" then
								玩家数据[id].道具:给予道具(id,"灵饰指南书",{6,6},nil,"商城购买")
							elseif 名称=="80灵饰指南书" then
								玩家数据[id].道具:给予道具(id,"灵饰指南书",{8,8},nil,"商城购买")
							elseif 名称=="100灵饰指南书" then
								玩家数据[id].道具:给予道具(id,"灵饰指南书",{10,10},nil,"商城购买")
							elseif 名称=="120灵饰指南书" then
								玩家数据[id].道具:给予道具(id,"灵饰指南书",{12,12},nil,"商城购买")
							elseif 名称=="140灵饰指南书" then
								玩家数据[id].道具:给予道具(id,"灵饰指南书",{14,14},nil,"商城购买")
							elseif 名称=="60元灵晶石" then
								玩家数据[id].道具:给予道具(id,"元灵晶石",{6,6},nil,"商城购买")
							elseif 名称=="80元灵晶石" then
								玩家数据[id].道具:给予道具(id,"元灵晶石",{8,8},nil,"商城购买")
							elseif 名称=="100元灵晶石" then
								玩家数据[id].道具:给予道具(id,"元灵晶石",{10,10},nil,"商城购买")
							elseif 名称=="120元灵晶石" then
								玩家数据[id].道具:给予道具(id,"元灵晶石",{12,12},nil,"商城购买")
							elseif 名称=="140元灵晶石" then
								玩家数据[id].道具:给予道具(id,"元灵晶石",{14,14},nil,"商城购买")
							elseif 名称=="钟灵石" then
								玩家数据[id].道具:给予道具(id,"钟灵石",nil,特效,"商城购买")
							elseif 名称=="三级未激活符石" then
								玩家数据[id].道具:给予道具(id,"未激活的符石",3,nil,"商城购买")
							elseif 名称=="二级未激活符石" then
								玩家数据[id].道具:给予道具(id,"未激活的符石",2,nil,"商城购买")
							elseif 名称=="一级未激活符石" then
								玩家数据[id].道具:给予道具(id,"未激活的符石",1,nil,"商城购买")
							elseif 名称=="玲珑宝图" or 名称=="高级藏宝图" or  名称=="藏宝图" or  名称=="炼妖石" or  名称=="上古锻造图策" then
								玩家数据[id].道具:给予道具(id,名称,nil,nil,"商城购买")
							elseif 名称=="魔兽要诀" or 名称=="高级魔兽要诀" or 名称=="特殊魔兽要诀" or 名称=="召唤兽内丹" or 名称=="高级召唤兽内丹" or 名称=="点化石" then
								        local 参数 = 临时道具.技能
								        if 参数 == nil then
								           	if 名称=="召唤兽内丹" then
								              	参数=取内丹()
								           	elseif 名称=="高级召唤兽内丹" then
								              	参数=取内丹("高级")
								           	elseif 名称=="魔兽要诀" then
								    	  	参数=取低级要诀()
								           	elseif 名称=="高级魔兽要诀" then
								                	参数=取高级要诀()
								           	elseif 名称=="特殊魔兽要诀" then
								                	参数=取特殊要诀()
								           	elseif 名称=="点化石" then
								              	local 生成几率 = 取随机数()
								              	if 生成几率<= 5 then
								                 	参数=取特殊要诀()
								              	elseif 生成几率<= 35 and 生成几率>=6 then
								                    参数=取高级要诀()
								              	else
								                   	参数=取低级要诀()
								              	end
								           	end
								        end
								        玩家数据[id].道具:给予道具(id,名称,nil,参数,"商城购买")
							else
								if self.购买分类== "锦衣商品" or  self.购买分类== "战锦商品" or  self.购买分类== "光环商品" or self.购买分类== "施法特效" or self.购买分类== "足迹商品" or self.购买分类== "攻击特效" then
									if 玩家数据[id].角色.锦衣次数 and 玩家数据[id].角色.锦衣次数>0 then
										玩家数据[id].角色.锦衣次数=玩家数据[id].角色.锦衣次数-1
										if 玩家数据[id].角色.锦衣次数<=0 then
											玩家数据[id].角色.锦衣次数=0
										end
										玩家数据[id].道具:给予锦衣道具(id,名称)
										常规提示(id,"你消耗一次购买锦衣次数，当前次数剩余：#G"..玩家数据[id].角色.锦衣次数)
										return
									end
									玩家数据[id].道具:给予锦衣道具(id,名称,价格,消费类别)
									return
								end
								玩家数据[id].道具:系统购买道具(id,名称,nil,价格,临时道具,消费类别,"商城购买")
							end
						else
							常规提示(id,"由于道具栏空间不足，本次成功购买了"..真实数量.."件该物品")
							break
						end
					end
					购买价格 = tonumber(价格*真实数量)
				end
			end
		end
		消费扣除(id, 购买价格, 消费类别, "商城购买")
	else
		常规提示(id,"#Y少侠身上并没有那么多的#R"..消费类别.."#Y购买该物品哦!")
		-- return
	end
end

function 商城处理类:取商品组数据(id, 序号)
	if id >400000 then
		return
	end
	self.发送消息 = {}
	序号 = 序号 + 0
	序号 = 18 --之前是19
	self.商品组[序号].组号 = 18
	self.商品组[序号].银子 = 玩家数据[id].角色.银子--sj.xy+0
	self.商品组[序号].角色限制 = 玩家数据[id].角色.造型
	self.商品组[序号].仙玉 = 取仙玉(id)
	-- self.商品组[序号].积分数 = {神器积分=玩家数据[id].角色.神器积分 or 0,天罡积分=玩家数据[id].角色.天罡积分 or 0,地煞积分=玩家数据[id].角色.地煞积分 or 0}
	刷新玩家货币(玩家数据[id].连接id,id)
	发送数据(玩家数据[id].连接id, 3700, self.商品组[序号])
end

function 商城处理类:商品()
	self.商品组[18] = {银子商城={},仙玉商城={},锻造商品={},强化符={},特殊商城={},锦衣商品={},祥瑞商品={},足迹商品={},光环商品={},法宝={},灵宝={},礼包商品={},施法特效={},战锦商品={},宝宝={},地煞积分={},天罡积分={},神器积分={},攻击特效={},武器装扮={}}
	for i,v in pairs(商城数据) do
		for n = 1, #商城类型 do
			if 商城数据[i].商城类型 and 商城数据[i].商城类型 == 商城类型[n] then

				if 商城数据[i].名称 == "红色合成旗" then
					   商城数据[i].xy = {[2]={y=11,x=495},[5]={y=273,x=12},[3]={y=117,x=457},[7]={y=108,x=201},[1]={y=7,x=312},[4]={y=173,x=408},[6]={y=240,x=277},[8]={y=248,x=474},[9]={y=197,x=475},[10]={y=167,x=364},[11]={y=86,x=292},[12]={y=180,x=130},[13]={y=19,x=383},[14]={y=266,x=323},[15]={y=264,x=182},[16]={y=141,x=496},[17]={y=93,x=133},[18]={y=117,x=231},[19]={y=36,x=355},[20]={y=72,x=412},[21]={y=264,x=184},[22]={y=53,x=108},[23]={y=266,x=324},[24]={y=210,x=344},[25]={y=218,x=398}}
				elseif 商城数据[i].名称 == "黄色合成旗" then
				       商城数据[i].xy = {[1]={y=13,x=13},[2]={y=55,x=29},[3]={y=120,x=55},[4]={y=133,x=167},[5]={y=13,x=209},[6]={y=48,x=111}}
				elseif 商城数据[i].名称 == "蓝色合成旗" then
				       商城数据[i].xy = {[1]={y=203,x=141},[2]={y=183,x=33},[3]={y=74,x=52},[4]={y=14,x=107},[5]={y=104,x=18},[6]={y=146,x=125}}
				elseif 商城数据[i].名称 == "白色合成旗" then
					   商城数据[i].xy = {[1]={y=117,x=57},[2]={y=81,x=107},[3]={y=36,x=64},[4]={y=18,x=232},[5]={y=108,x=260},[6]={y=122,x=174}}
				elseif 商城数据[i].名称 == "绿色合成旗" then
					   商城数据[i].xy = {[1]={y=92,x=581},[2]={y=42,x=579},[3]={y=63,x=16},[4]={y=17,x=24},[5]={y=14,x=217},[6]={y=98,x=201},[7]={y=16,x=170}}
				end
				if 商城数据[i].符石属性 then
					商城数据[i].符石属性 =table.copy(商城数据[i].符石属性)
				end
				if 商城数据[i].名称 == "未激活的符石" then
					商城数据[i].子类 = 商城数据[i].等级
				end
				if 商城数据[i].名称 == "钟灵石" then
					商城数据[i].特效 = 商城数据[i].技能
					商城数据[i].气血 = "点化灵饰"
					商城数据[i].等级 = 商城数据[i].等级
				end
				if 商城数据[i].名称 == "特殊魔兽要诀" or 商城数据[i].名称 == "超级魔兽要诀" then
					商城数据[i].附带技能 = 商城数据[i].技能
				end
				if 商城数据[i].名称 == "摄灵珠" or 商城数据[i].名称 == "高级摄灵珠" then
					商城数据[i].灵气 = 商城数据[i].品阶 or 1
				end
				商城数据[i].可叠加 = 商城数据[i].可叠加 or 0
				商城数据[i].可叠加 = 商城数据[i].可叠加 ~= 0 and true or false
				-- table.insert(self.商品组[18][商城类型[n]], 商城数据[i])
				self.商品组[18][商城类型[n]][#self.商品组[18][商城类型[n]] + 1] = table.copy(商城数据[i])
			end
		end
	end
	for i,v in pairs(商城宝宝) do
		local 商城宝宝s={}
		if v and v.技能 then
			商城宝宝s=v
		    商城宝宝s.技能 = table.copy(v.技能)
		if v.种类 == "神兽" then
			商城宝宝s.寿命 = "★永生★"
		end
		-- table.insert(self.商品组[18]["宝宝"], 商城宝宝[i])
		self.商品组[18]["宝宝"][#self.商品组[18]["宝宝"] + 1] = table.copy(商城宝宝s)
		end
	end
	-- ====================== 新增商品开始 ======================
    local 灵饰120灵饰礼包 = {
        名称 = "120灵饰礼包",
        价格 = 15000000,
        商城类型 = "银子商城",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["银子商城"], 灵饰120灵饰礼包)

    local 灵饰140灵饰礼包 = {
        名称 = "140灵饰礼包",
        价格 = 20000000,
        商城类型 = "银子商城",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["银子商城"], 灵饰140灵饰礼包)

    -- local 灵饰160随机灵饰箱 = {
    --     名称 = "160随机灵饰箱",
    --     价格 = 10000000,
    --     商城类型 = "银子商城",
    --     可叠加 = true,
    -- }
    -- table.insert(self.商品组[18]["银子商城"], 灵饰160随机灵饰箱)

    -- local 驱赶烟花 = {
    --     名称 = "驱赶烟花",          -- 商品名称（必填）
    --     价格 = 1000,                -- 价格（100银子，必填）
    --     商城类型 = "银子商城",     -- 所属分类（必填，对应顶部商城类型）
    --     可叠加 = true,             -- 是否可叠加（true/false）
    -- }
    -- table.insert(self.商品组[18]["银子商城"], 驱赶烟花)

    local 特殊元宵礼包 = {
        名称 = "特殊元宵礼包",
        价格 = 2000000,
        商城类型 = "银子商城",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["银子商城"], 特殊元宵礼包)

    local 新三级符石礼包 = {
        名称 = "新三级符石礼包",
        价格 = 1500000,
        商城类型 = "银子商城",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["银子商城"], 新三级符石礼包)

    local 星石礼包 = {
        名称 = "星石礼包",
        价格 = 2000000,
        商城类型 = "银子商城",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["银子商城"], 星石礼包)

    local 珍珠160 = {
        名称 = "珍珠",
        价格 = 100000,
        等级 = 160,
        商城类型 = "银子商城",
        可叠加 = false,
    }
    table.insert(self.商品组[18]["银子商城"], 珍珠160)

    local 玄灵珠·回春礼包 = {
        名称 = "玄灵珠·回春礼包",
        价格 = 1000000000,
        商城类型 = "锻造商品",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["锻造商品"], 玄灵珠·回春礼包)

    local 玄灵珠·空灵礼包 = {
        名称 = "玄灵珠·空灵礼包",
        价格 = 1000000000,
        商城类型 = "锻造商品",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["锻造商品"], 玄灵珠·空灵礼包)

    local 玄灵珠·破军礼包 = {
        名称 = "玄灵珠·破军礼包",
        价格 = 1000000000,
        商城类型 = "锻造商品",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["锻造商品"], 玄灵珠·破军礼包)

    local 玄灵珠·噬魂礼包 = {
        名称 = "玄灵珠·噬魂礼包",
        价格 = 1000000000,
        商城类型 = "锻造商品",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["锻造商品"], 玄灵珠·噬魂礼包)

    local 五色灵尘礼包 = {
        名称 = "五色灵尘礼包",
        价格 = 1000000000,
        商城类型 = "锻造商品",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["锻造商品"], 五色灵尘礼包)

    local 打造熟练度礼包 = {
        名称 = "打造熟练度礼包",
        价格 = 500000000,
        商城类型 = "锻造商品",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["锻造商品"], 打造熟练度礼包)

    local BB装备75级礼包 = {
        名称 = "BB装备75级礼包",
        价格 = 1000000,
        商城类型 = "银子商城",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["银子商城"], BB装备75级礼包)

    local BB装备95级礼包 = {
        名称 = "BB装备95级礼包",
        价格 = 5000000,
        商城类型 = "银子商城",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["银子商城"], BB装备95级礼包)

    local BB装备115级礼包 = {
        名称 = "BB装备115级礼包",
        价格 = 9000000,
        商城类型 = "银子商城",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["银子商城"], BB装备115级礼包)

    local BB装备135级礼包 = {
        名称 = "BB装备135级礼包",
        价格 = 13000000,
        商城类型 = "银子商城",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["银子商城"], BB装备135级礼包)

    local BB装备155级礼包 = {
        名称 = "BB装备155级礼包",
        价格 = 17000000,
        商城类型 = "银子商城",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["银子商城"], BB装备155级礼包)

    local 装备120无级别礼包 = {
        名称 = "120无级别礼包",
        价格 = 10000000,
        商城类型 = "银子商城",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["银子商城"], 装备120无级别礼包)

    local 装备130无级别礼包 = {
        名称 = "130无级别礼包",
        价格 = 20000000,
        商城类型 = "银子商城",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["银子商城"], 装备130无级别礼包)

    -- local 装备140无级别礼包 = {
    --     名称 = "140无级别礼包",
    --     价格 = 30000000,
    --     商城类型 = "银子商城",
    --     可叠加 = true,
    -- }
    -- table.insert(self.商品组[18]["银子商城"], 装备140无级别礼包)

    -- local 装备150无级别礼包 = {
    --     名称 = "150无级别礼包",
    --     价格 = 40000000,
    --     商城类型 = "银子商城",
    --     可叠加 = true,
    -- }
    -- table.insert(self.商品组[18]["银子商城"], 装备150无级别礼包)

    -- local 装备160无级别随机装备 = {
    --     名称 = "160无级别随机装备",
    --     价格 = 10000000,
    --     商城类型 = "银子商城",
    --     可叠加 = true,
    -- }
    -- table.insert(self.商品组[18]["银子商城"], 装备160无级别随机装备)


local 沸涌炎海的信标 = {
        名称 = "沸涌炎海的信标",
        价格 = 100000000,
        商城类型 = "银子商城",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["银子商城"], 沸涌炎海的信标)

    local 钢铁炼境的信标 = {
        名称 = "钢铁炼境的信标",
        价格 = 100000000,
        商城类型 = "银子商城",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["银子商城"], 钢铁炼境的信标)

    local 雷鸣废土的信标 = {
        名称 = "雷鸣废土的信标",
        价格 = 100000000,
        商城类型 = "银子商城",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["银子商城"], 雷鸣废土的信标)

    local 幽夜暗域的信标 = {
        名称 = "幽夜暗域的信标",
        价格 = 100000000,
        商城类型 = "银子商城",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["银子商城"], 幽夜暗域的信标)

    local 混乱终末的信标 = {
        名称 = "混乱终末的信标",
        价格 = 100000000,
        商城类型 = "银子商城",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["银子商城"], 混乱终末的信标)

    local 伟大虚空的信标 = {
        名称 = "伟大虚空的信标",
        价格 = 100000000,
        商城类型 = "银子商城",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["银子商城"], 伟大虚空的信标)

    local 巅峰领域的信标 = {
        名称 = "巅峰领域的信标",
        价格 = 100000000,
        商城类型 = "银子商城",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["银子商城"], 巅峰领域的信标)

--======仙玉商城======--

    local 特性宝珠 = {
        名称 = "特性宝珠",
        价格 = 500,
        商城类型 = "仙玉商城",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["仙玉商城"], 特性宝珠)

    local 超简易宝珠 = {
        名称 = "超简易宝珠",
        价格 = 500,
        商城类型 = "仙玉商城",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["仙玉商城"], 超简易宝珠)

    local 斩妖帖 = {
        名称 = "斩妖帖",
        价格 = 200,
        商城类型 = "仙玉商城",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["仙玉商城"], 斩妖帖)

    -- local 善恶棋盘 = {
    --     名称 = "善恶棋盘",
    --     价格 = 100,
    --     商城类型 = "仙玉商城",
    --     可叠加 = true,
    -- }
    -- table.insert(self.商品组[18]["仙玉商城"], 善恶棋盘)

    -- local 扫荡卡 = {
    --     名称 = "扫荡卡",
    --     价格 = 500,
    --     商城类型 = "仙玉商城",
    --     可叠加 = true,
    -- }
    -- table.insert(self.商品组[18]["仙玉商城"], 扫荡卡)

    -- local 玉刚卯 = {
    --     名称 = "玉刚卯",
    --     价格 = 1,
    --     商城类型 = "仙玉商城",
    --     可叠加 = true,
    -- }
    -- table.insert(self.商品组[18]["仙玉商城"], 玉刚卯)

    -- local 兽魂技能转换符 = {
    --     名称 = "兽魂技能转换符",
    --     价格 = 20000,
    --     商城类型 = "仙玉商城",
    --     可叠加 = true,
    -- }
    -- table.insert(self.商品组[18]["仙玉商城"], 兽魂技能转换符)

    -- local 五彩神石 = {
    --     名称 = "五彩神石",
    --     价格 = 1,
    --     商城类型 = "仙玉商城",
    --     可叠加 = true,
    -- }
    -- table.insert(self.商品组[18]["仙玉商城"], 五彩神石)

    -- local 青花瓷锦衣 = {
    --     名称 = "青花瓷锦衣",
    --     价格 = 1,
    --     商城类型 = "仙玉商城",
    --     可叠加 = true,
    -- }
    -- table.insert(self.商品组[18]["仙玉商城"], 青花瓷锦衣)

    -- local 锦红彩笺 = {
    --     名称 = "锦红彩笺",
    --     价格 = 1,
    --     商城类型 = "仙玉商城",
    --     可叠加 = true,
    -- }
    -- table.insert(self.商品组[18]["仙玉商城"], 锦红彩笺)

    -- local 破境·白虎坠 = {
    --     名称 = "破境·白虎坠",
    --     价格 = 8000,
    --     商城类型 = "仙玉商城",
    --     可叠加 = true,
    -- }
    -- table.insert(self.商品组[18]["仙玉商城"], 破境·白虎坠)

    -- local 破境·朱雀坠 = {
    --     名称 = "破境·朱雀坠",
    --     价格 = 8000,
    --     商城类型 = "仙玉商城",
    --     可叠加 = true,
    -- }
    -- table.insert(self.商品组[18]["仙玉商城"], 破境·朱雀坠)

    -- local 破境·玄武坠 = {
    --     名称 = "破境·玄武坠",
    --     价格 = 8000,
    --     商城类型 = "仙玉商城",
    --     可叠加 = true,
    -- }
    -- table.insert(self.商品组[18]["仙玉商城"], 破境·玄武坠)

    -- local 破境·青龙坠 = {
    --     名称 = "破境·青龙坠",
    --     价格 = 8000,
    --     商城类型 = "仙玉商城",
    --     可叠加 = true,
    -- }
    -- table.insert(self.商品组[18]["仙玉商城"], 破境·青龙坠)

    -- local 蕴灵晶体 = {
    --     名称 = "蕴灵晶体",
    --     价格 = 5000,
    --     商城类型 = "仙玉商城",
    --     可叠加 = true,
    -- }
    -- table.insert(self.商品组[18]["仙玉商城"], 蕴灵晶体)

    -- local 归墟共生 = {
    --     名称 = "归墟共生",
    --     价格 = 88888888,
    --     商城类型 = "仙玉商城",
    --     可叠加 = true,
    -- }
    -- table.insert(self.商品组[18]["仙玉商城"], 归墟共生)

    -- local 归墟激战 = {
    --     名称 = "归墟激战",
    --     价格 = 88888888,
    --     商城类型 = "仙玉商城",
    --     可叠加 = true,
    -- }
    -- table.insert(self.商品组[18]["仙玉商城"], 归墟激战)

    -- local 归墟悟空 = {
    --     名称 = "归墟悟空",
    --     价格 = 88888888,
    --     商城类型 = "仙玉商城",
    --     可叠加 = true,
    -- }
    -- table.insert(self.商品组[18]["仙玉商城"], 归墟悟空)

    -- local 归墟应变 = {
    --     名称 = "归墟应变",
    --     价格 = 88888888,
    --     商城类型 = "仙玉商城",
    --     可叠加 = true,
    -- }
    -- table.insert(self.商品组[18]["仙玉商城"], 归墟应变)

    local 奖池抽奖 = {
        名称 = "奖池抽奖",
        价格 = 1000,
        商城类型 = "仙玉商城",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["仙玉商城"], 奖池抽奖)

    local 指定门派秘籍 = {
        名称 = "指定门派秘籍",
        价格 = 500,
        商城类型 = "仙玉商城",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["仙玉商城"], 指定门派秘籍)

    --======积分商城======--
     local 观照万象碎片 = {
        名称 = "观照万象碎片",
        价格 = 500,
        商城类型 = "天罡积分",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["天罡积分"], 观照万象碎片)

    local 圣婴大王碎片 = {
        名称 = "圣婴大王碎片",
        价格 = 300,
        商城类型 = "天罡积分",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["天罡积分"], 圣婴大王碎片)

    local 灵饰80灵饰自选礼包 = {
        名称 = "80灵饰自选礼包",
        价格 = 40000,
        商城类型 = "天罡积分",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["天罡积分"], 灵饰80灵饰自选礼包)

    local 灵饰100灵饰自选礼包 = {
        名称 = "100灵饰自选礼包",
        价格 = 80000,
        商城类型 = "天罡积分",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["天罡积分"], 灵饰100灵饰自选礼包)

    local 灵饰120灵饰自选礼包 = {
        名称 = "120灵饰自选礼包",
        价格 = 120000,
        商城类型 = "天罡积分",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["天罡积分"], 灵饰120灵饰自选礼包)

    local 灵饰140灵饰自选礼包 = {
        名称 = "140灵饰自选礼包",
        价格 = 180000,
        商城类型 = "天罡积分",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["天罡积分"], 灵饰140灵饰自选礼包)

    local 焕彩石 = {
        名称 = "焕彩石",
        价格 = 1000,
        商城类型 = "地煞积分",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["地煞积分"], 焕彩石)

    local 凤纹灵坠 = {
        名称 = "凤纹灵坠",
        价格 = 500,
        商城类型 = "地煞积分",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["地煞积分"], 凤纹灵坠)

    local 超级否定信仰碎片 = {
        名称 = "超级否定信仰碎片",
        价格 = 500,
        商城类型 = "神器积分",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["神器积分"], 超级否定信仰碎片)

    local 装备强化石 = {
        名称 = "装备强化石",
        价格 = 3000,
        商城类型 = "神器积分",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["神器积分"], 装备强化石)

    --======礼包商品======--

    local 阵营礼物包 = {
        名称 = "阵营礼物包",
        价格 = 500,
        商城类型 = "礼包商品",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["礼包商品"], 阵营礼物包)

    local 称号材料礼包 = {
        名称 = "称号材料礼包",
        价格 = 10000,
        商城类型 = "礼包商品",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["礼包商品"], 称号材料礼包)

    local 灵韵精华礼包 = {
        名称 = "灵韵精华礼包",
        价格 = 10000,
        商城类型 = "礼包商品",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["礼包商品"], 灵韵精华礼包)

    local 自选特殊兽诀 = {
        名称 = "自选特殊兽决",
        价格 = 50000,
        商城类型 = "礼包商品",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["礼包商品"], 自选特殊兽诀)

    local 自选超级兽诀 = {
        名称 = "自选超级兽决",
        价格 = 100000,
        商城类型 = "礼包商品",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["礼包商品"], 自选超级兽诀)

    local 飞廉礼包 = {
        名称 = "飞廉礼包",
        价格 = 500000,
        商城类型 = "礼包商品",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["礼包商品"], 飞廉礼包)

    local 红孩儿礼包 = {
        名称 = "红孩儿礼包",
        价格 = 500000,
        商城类型 = "礼包商品",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["礼包商品"], 红孩儿礼包)

    local 鲲鹏礼包 = {
        名称 = "鲲鹏礼包",
        价格 = 1000000,
        商城类型 = "礼包商品",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["礼包商品"], 鲲鹏礼包)

    local 五福鲲鹏礼包血 = {
        名称 = "五福鲲鹏礼包(血)",
        价格 = 5000000,
        商城类型 = "礼包商品",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["礼包商品"], 五福鲲鹏礼包血)

    local 五福鲲鹏礼包物 = {
        名称 = "五福鲲鹏礼包(物)",
        价格 = 5000000,
        商城类型 = "礼包商品",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["礼包商品"], 五福鲲鹏礼包物)

    local 五福鲲鹏礼包法 = {
        名称 = "五福鲲鹏礼包(法)",
        价格 = 5000000,
        商城类型 = "礼包商品",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["礼包商品"], 五福鲲鹏礼包法)

    local 武器自选礼包 = {
        名称 = "武器自选礼包",
        价格 = 500000,
        商城类型 = "礼包商品",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["礼包商品"], 武器自选礼包)

    local 衣服自选礼包 = {
        名称 = "衣服自选礼包",
        价格 = 500000,
        商城类型 = "礼包商品",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["礼包商品"], 衣服自选礼包)

    local 鞋子自选礼包 = {
        名称 = "鞋子自选礼包",
        价格 = 500000,
        商城类型 = "礼包商品",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["礼包商品"], 鞋子自选礼包)

    local 腰带自选礼包 = {
        名称 = "腰带自选礼包",
        价格 = 500000,
        商城类型 = "礼包商品",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["礼包商品"], 腰带自选礼包)

    local 项链自选礼包 = {
        名称 = "项链自选礼包",
        价格 = 500000,
        商城类型 = "礼包商品",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["礼包商品"], 项链自选礼包)

    local 头盔自选礼包 = {
        名称 = "头盔自选礼包",
        价格 = 500000,
        商城类型 = "礼包商品",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["礼包商品"], 头盔自选礼包)

    local 灵饰160灵饰自选礼包 = {
        名称 = "160灵饰自选礼包",
        价格 = 1000000,
        商城类型 = "礼包商品",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["礼包商品"], 灵饰160灵饰自选礼包)

     local 上古玉魄阳自选 = {
        名称 = "上古玉魄阳自选",
        价格 = 1000000,
        商城类型 = "礼包商品",
        可叠加 = false,
    }
    table.insert(self.商品组[18]["礼包商品"], 上古玉魄阳自选)

    local 上古玉魄阴自选 = {
        名称 = "上古玉魄阴自选",
        价格 = 1000000,
        商城类型 = "礼包商品",
        可叠加 = false,
    }
    table.insert(self.商品组[18]["礼包商品"], 上古玉魄阴自选)

    local 自选钟灵石 = {
        名称 = "自选钟灵石",
        价格 = 1000000,
        商城类型 = "礼包商品",
        可叠加 = true,
    }
    table.insert(self.商品组[18]["礼包商品"], 自选钟灵石)

    -- local 九天揽月称谓礼包 = {
    --     名称 = "九天揽月称谓礼包",
    --     价格 = 8888888,
    --     商城类型 = "礼包商品",
    --     可叠加 = true,
    -- }
    -- table.insert(self.商品组[18]["礼包商品"], 九天揽月称谓礼包)

    -- local 威震天下称谓礼包 = {
    --     名称 = "威震天下称谓礼包",
    --     价格 = 8888888,
    --     商城类型 = "礼包商品",
    --     可叠加 = true,
    -- }
    -- table.insert(self.商品组[18]["礼包商品"], 威震天下称谓礼包)

    -- local 傲视群雄唯我独尊称谓礼包 = {
    --     名称 = "傲视群雄唯我独尊称谓礼包",
    --     价格 = 8888888,
    --     商城类型 = "礼包商品",
    --     可叠加 = true,
    -- }
    -- table.insert(self.商品组[18]["礼包商品"], 傲视群雄唯我独尊称谓礼包)

    -- local 神豪称谓礼包 = {
    --     名称 = "神豪称谓礼包",
    --     价格 = 8888888,
    --     商城类型 = "礼包商品",
    --     可叠加 = true,
    -- }
    -- table.insert(self.商品组[18]["礼包商品"], 神豪称谓礼包)

    -- local 独步西游若等闲称谓礼包 = {
    --     名称 = "独步西游若等闲称谓礼包",
    --     价格 = 8888888,
    --     商城类型 = "礼包商品",
    --     可叠加 = true,
    -- }
    -- table.insert(self.商品组[18]["礼包商品"], 独步西游若等闲称谓礼包)

    -- local 一举成名天下惊称谓礼包 = {
    --     名称 = "一举成名天下惊称谓礼包",
    --     价格 = 8888888,
    --     商城类型 = "礼包商品",
    --     可叠加 = true,
    -- }
    -- table.insert(self.商品组[18]["礼包商品"], 一举成名天下惊称谓礼包)

    -- local 苍茫三界主沉浮称谓礼包 = {
    --     名称 = "苍茫三界主沉浮称谓礼包",
    --     价格 = 8888888,
    --     商城类型 = "礼包商品",
    --     可叠加 = true,
    -- }
    -- table.insert(self.商品组[18]["礼包商品"], 苍茫三界主沉浮称谓礼包)


-- ====================== 新增商品结束 ======================
end

return 商城处理类