-- @Author: baidwwy
-- @Date:   2025-04-08 18:32:39
-- @Last Modified by:   tangguo
-- @Last Modified time: 2026-05-11 10:19:12
-- @Author              : GGELUA
-- @Last Modified by    : baidwwy
-- @Date                : 2024-01-10 00:24:35
-- @Last Modified time  : 2024-01-14 16:32:45

--======================================================================--
--======================================================================--
local 抽奖处理 = class()

function 抽奖处理:初始化()
end

function 抽奖处理:设置钥匙神秘宝箱(id,连接id)
	神秘宝箱[id]={}
	local 奖励=取随机数(1,1195)
	if 抽奖数据.钥匙神秘宝箱 then
		for i = 1, 24 do
			if 抽奖数据.钥匙神秘宝箱["物品"..i] then
				神秘宝箱[id][#神秘宝箱[id] + 1] = table.copy(抽奖数据.钥匙神秘宝箱["物品"..i])
			end
		end
		for i = 1, #神秘宝箱[id] do
			if i > 1 and 奖励 > 神秘宝箱[id][i-1].权重 and 奖励 <= 神秘宝箱[id][i].权重 then
				神秘宝箱[id].中奖 = i
				break
			elseif i == 1 and 奖励 <= 神秘宝箱[id][i].权重 then
				神秘宝箱[id].中奖 = i
				break
			end
		end
	end
	发送数据(连接id,85,{道具=神秘宝箱[id],类型="钥匙"})
end
function 抽奖处理:嘉年华抽奖(id)
	local 消耗=JNHXHJF
	抽奖转盘[id]={中奖=取随机数(1,12)}
		for n=1,12 do
				local 名称 = ""
				local 参数 = {}
				local 备注 = ""
				local 奖励 = 取随机数(1,1700)
				local 说明 = ""

				if 奖励<= 50 then
					名称="灵韵精华"
    					说明 = "给予召唤兽增加潜力点，最多可以使用20个。"
    	-- 			elseif 奖励<= 80 then
					-- 名称="多福红包"
				 -- 	说明 = "年年岁岁红包来，点滴心意倍关怀。\n#Y【内容】获得#G18-28元#Y赞助，此赞助包含VIP积分与仙玉"
    				elseif 奖励<= 60 then
					名称="平安红包"
						说明="手指高低钱串串，朝堂上下乐融融。眼观春色人人醉，脚踏青云路路通。\n#Y【内容】获得#G1-10元#Y赞助，此赞助包含VIP积分与仙玉"
				elseif 奖励<= 150 then
					 名称="五彩神石"
                				 说明 = "五中光芒坠向人间。\n#Y【使用】用于召唤兽进化\n#Y【效果】每次进化所有资质+50,成长+0.05,可进化5次,第5次可改变宠物类型#R(神兽-特殊神兽)"
				elseif 奖励<= 200 then
					名称="大金砖"
						说明="闪闪发光，可获得1E银子"
				elseif 奖励<= 250 then
					名称="灵兜兜"
						说明="生肖神兽们最喜欢的玩具，再积攒99个神兜兜，就可以挑一个生肖神兽带回家哦"
				-- elseif 奖励<= 488 then
				-- 	名称="仙玉"
				-- 		说明="可获得500-1000的仙玉"
				elseif 奖励<= 570 then
					名称="神兜兜"
						说明="三界之内神兽们最喜欢的玩具，积攒99个，神兽就会跟您回家哦。积攒3000个+10个灵兜兜，超级鲲鹏就会跟您回家哦。"
				elseif 奖励<= 600 then
					名称="高级魔兽要诀"
						说明="记载着上古魔兽特技，可供你的召唤兽学习。"
				elseif 奖励<= 645 then
					名称="红包碎片"
						说明="年年岁岁红包来，点滴心意倍关怀。集齐66个可兑换平安红包\n5%获得多福红包\n2%获得进财红包\n【右键使用】"
				elseif 奖励<= 700 then
					名称="青花瓷锦衣·碎片"
						说明="集齐50个碎片右键可以兑换一个召唤兽锦衣，青花瓷系列"
				elseif 奖励<= 710 then
					名称="翻一番"
						说明="用于抵扣翻一番首次消耗的仙玉!\n右键使用增加 翻一番次数：1"
				elseif 奖励<= 750 then
					名称="特效宝珠"
       	 				说明 = "蕴含天地精华的宝珠，可为一件人物装备随机附加一种特殊效果。                    #G【说明】#Y:该道具100%附加一种特效,5%几率出无级别限制    #G【保底】#Y：同一件装备使用30次必出无级别限制"
				elseif 奖励<= 850 then
					名称="词条洗练石"
						说明="对已有词条的装备使用，随机更换装备的词条种类。"
				elseif 奖励<= 900 then
					名称="词条属性石"
						说明="当前装备词条数量和类型不变，词条数值随机刷新。"
				elseif 奖励<= 940 then
					名称="超级兽诀·碎片"
						说明="外形很像某种兽决，上面依稀记载着上古魔兽特技。\n#Y【特别说明】获得50个碎片后，右键可以进行合成。"
				elseif 奖励<= 998 then
					名称="特殊兽诀·碎片"
						说明= "外形很像某种兽决，上面依稀记载着上古魔兽特技。\n#Y【特别说明】获得50个碎片后，右键可以进行合成。"
				elseif 奖励<= 1000 then
					名称="超简易宝珠"
						说明="诞生在“万山之祖的”昆仑山脉，吸取了日月之精华，天地之灵气。有一定的概率为人物灵饰附加#R超级简易#W特效。"
				elseif 奖励<= 1050 then
					名称="仙丹"
						说明="可获得大量经验。"
				elseif 奖励<= 1070 then
					名称="仙露丸子"
						说明="用于召唤兽赐福超级技能，长安天台下找到超级神柚NPC"
				elseif 奖励<= 1150 then
					 名称="钟灵石"
						说明="拥有特性的灵石，可点化灵饰，获得指定类型的特性效果。\n随机获得1-5级"
				elseif 奖励<= 1220 then
					 名称="玉刚卯"
						说明="玉刚卯\n#Y【特殊】用于为锦衣洗练特殊效果的玉石"

				elseif 奖励<= 1300 then
					 名称="神兜兜"
						说明="三界之内神兽们最喜欢的玩具，积攒99个，神兽就会跟您回家哦。积攒3000个+10个灵兜兜，超级鲲鹏就会跟您回家哦。"
				elseif 奖励<= 1450 then
					 名称="特殊兽诀·碎片"
						说明= "外形很像某种兽决，上面依稀记载着上古魔兽特技。\n#Y【特别说明】获得50个碎片后，右键可以进行合成。"
				elseif 奖励<= 1700 then
					名称="仙丹"
						说明="可获得大量经验。"
				end
				抽奖转盘[id][n]={
						名称=名称,
						说明=说明,
						参数={参数[1],参数[2],参数[3]},
						备注=备注
				}
		end
		发送数据(玩家数据[id].连接id,107.1,{道具=抽奖转盘[id],秘宝宝箱=1,积分=玩家数据[id].角色.嘉年华积分,消耗积分=消耗})
end

function 抽奖处理:嘉年华转盘抽奖处理(id)
	local 消耗=JNHXHJF
	if 抽奖转盘[id]==nil then
		常规提示(id,"#Y抽奖转盘数据异常！")
		return
	elseif  not   玩家数据[id].角色:扣除嘉年华积分(消耗) then
		return
	else
			local 序号 = 抽奖转盘[id].中奖
			local 名称 = 抽奖转盘[id][序号].名称
			local 参数 = 抽奖转盘[id][序号].参数
			local 数量 = tonumber(抽奖转盘[id][序号].数量) or 1
			抽奖转盘[id]=nil
			if 名称 == "召唤兽内丹" then
				玩家数据[id].道具:给予道具(id,名称,1,nil,"嘉年华转盘抽奖")
			elseif 名称 == "高级召唤兽内丹" then
				玩家数据[id].道具:给予道具(id,名称,1,nil,"嘉年华转盘抽奖")
			elseif 名称 == "仙丹" then
				if 数量 == 1 then 数量 = 200000 end
				玩家数据[id].角色:添加经验(数量,"转盘抽奖",1)
			elseif 名称 == "八级变身卡" then
				玩家数据[id].道具:给予道具(id,"怪物卡片",8,nil,"嘉年华转盘抽奖")
			elseif 名称 == "金刚石" or 名称 == "夜光珠" or 名称 == "龙鳞" or 名称 == "定魂珠" or 名称 == "避水珠"  then
				玩家数据[id].道具:给予道具(id,名称,1,nil,"嘉年华转盘抽奖")
			elseif 名称 == "特效宝珠" then
				玩家数据[id].道具:给予道具(id,名称,1,nil,"嘉年华转盘抽奖")
			elseif 名称 == "五彩神石" then
				玩家数据[id].道具:给予道具(id,名称,取随机数(1,2),nil,"嘉年华转盘抽奖")
			elseif 名称 == "超简易宝珠" then
				玩家数据[id].道具:给予道具(id,名称,1,nil,"嘉年华转盘抽奖")
			elseif 名称 == "玉刚卯" then
				玩家数据[id].道具:给予道具(id,名称,取随机数(1,3),nil,"嘉年华转盘抽奖")
			elseif 名称 == "彩果" then
				玩家数据[id].道具:给予道具(id,名称,1,nil,"嘉年华转盘抽奖")
			elseif 名称 == "强化石" then
				local 名称1=取强化石()
				玩家数据[id].道具:给予道具(id,名称1,取随机数(1,3),nil,"嘉年华转盘抽奖")
				名称 = 名称1
			elseif 名称 == "宝石" then
				local 名称1=取宝石()
				玩家数据[id].道具:给予道具(id,名称1,取随机数(1,2),nil,"嘉年华转盘抽奖")
				名称 = 名称1
			elseif 名称 == "金砖" then
				玩家数据[id].角色:添加银子(数量,"转盘抽奖",1)
			elseif 名称 == "仙玉" then
				添加仙玉(id, 玩家数据[id].账号,取随机数(500,1000), "转盘抽奖")
			elseif 名称 == "钟灵石" then
				玩家数据[id].道具:给予道具(id,名称,取随机数(1,5),nil,"嘉年华转盘抽奖")
			elseif 名称 == "摇钱树苗" then
				玩家数据[id].道具:给予道具(id,名称,1,nil,"嘉年华转盘抽奖")
			elseif 名称 == "青花瓷锦衣·碎片" then
				玩家数据[id].道具:给予道具(id,名称,取随机数(1,3),nil,"嘉年华转盘抽奖")
			elseif 名称 == "特赦令牌" then
				玩家数据[id].道具:给予道具(id,名称,1,nil,"嘉年华转盘抽奖")
			elseif 名称 == "超级金柳露" then
				玩家数据[id].道具:给予道具(id,名称,1,nil,"嘉年华转盘抽奖")
			elseif 名称 == "高级魔兽要诀" then
				玩家数据[id].道具:给予道具(id,名称,1,nil,"嘉年华转盘抽奖")

			else
				玩家数据[id].道具:给予道具(id,名称,数量,nil,"嘉年华转盘抽奖")
			end
			常规提示(id,"#Y/你获得了#G"..名称)
			发送公告("#Y玩家#R"..玩家数据[id].角色.名称.."#Y在嘉年华转盘抽奖中获得了物品#R"..名称.."#Y大家快来围观！！！")
		-- end
	end
end


function 抽奖处理:大转盘抽奖(id)
	抽奖转盘[id]={中奖=取随机数(1,14)}
		for n=1,14 do
				local 名称 = ""
				local 参数 = {}
				local 备注 = ""
				local 奖励 = 取随机数(1,1150)
				local 说明 = ""
				if 奖励<= 70 then
					 名称="召唤兽内丹"
						说明="上古魔兽遗留下来的精气经万年而成的内丹，可供你的召唤兽学习。"
				elseif 奖励<= 170 then
					名称="高级召唤兽内丹"
						说明="可获得大量经验。"
				elseif 奖励<= 200 then
					名称="法宝精华"
						说明="蕴含法宝精华灵气，使用后可增加1点法宝精华。"
				elseif 奖励<= 250 then
					名称="宝石袋"
						说明="内藏随机数量的宝石，使用后可获得随机宝石。"
				elseif 奖励<= 485 then
					名称="仙丹"
						说明="可获得大量经验。"
				elseif 奖励<= 488 then
					名称="特效宝珠"
						说明="美石为玉，玉为石之精华，大地之舍利子，是人间祛邪避凶的灵石。有一定的概率为人物装备附加#R无级别限制#W特效。"
				elseif 奖励<= 570 then
					名称="灵犀之屑"
						说明="带有灵气的石头，是强化装备所需的原料之一。"
				elseif 奖励<= 600 then
					名称="高级魔兽要诀"
						说明="记载着上古魔兽特技，可供你的召唤兽学习。"
				elseif 奖励<= 645 then
					名称="摇钱树苗"
						说明="一种非常难得的仙露，据说有着令万物回归到原始状态的奇效。"
				elseif 奖励<= 700 then
					名称="宝石"
						说明="获得随机宝石。是用来合成镶嵌的神奇矿石。"
				elseif 奖励<= 710 then
					名称="摇钱树苗"
						说明="可获得大量经验。"
				elseif 奖励<= 750 then
					名称="特效宝珠"
						说明="一种非常难得的仙露，据说有着令万物回归到原始状态的奇效。"
				elseif 奖励<= 850 then
					名称="特殊兽诀·碎片"
						说明="外形很像某种兽决，上面依稀记载着上古魔兽特技。\n#Y【特别说明】获得50个碎片后，右键可以进行合成。"
				elseif 奖励<= 900 then
					名称="强化石"
						说明="带有灵气的石头，是强化装备所需的原料之一。"
				elseif 奖励<= 940 then
					名称="法宝精华"
						说明="蕴含法宝精华灵气，使用后可增加1点法宝精华。"
				elseif 奖励<= 998 then
					名称="强化石"
						说明="带有灵气的石头，是强化装备所需的原料之一。"
				elseif 奖励<= 1000 then
					名称="超简易宝珠"
						说明="诞生在“万山之祖的”昆仑山脉，吸取了日月之精华，天地之灵气。有一定的概率为人物灵饰附加#R超级简易#W特效。"
				elseif 奖励<= 1050 then
					名称="仙丹"
						说明="可获得大量经验。"
				elseif 奖励<= 1070 then
					名称="强化石"
						说明="带有灵气的石头，是强化装备所需的原料之一。"
				elseif 奖励<= 1150 then
					 名称="神兜兜"
						说明="三界之内神兽们最喜欢的玩具，积攒99个，神兽就会跟您回家哦。"
				end
				抽奖转盘[id][n]={
						名称=名称,
						说明=说明,
						参数={参数[1],参数[2],参数[3]},
						备注=备注
				}
		end
		发送数据(玩家数据[id].连接id,107,{道具=抽奖转盘[id],秘宝宝箱=1})
end



function 抽奖处理:钥匙宝箱抽奖(id,数据,类型) ---给与抽奖物品的--新手机缘宝箱
	if 神秘宝箱[id]==nil then
		常规提示(id,"数据异常！")
		return
	end
	local 序号=神秘宝箱[id].中奖
	local 名称=神秘宝箱[id][序号].名称
	神秘宝箱[id]=nil
	local 链接 = {提示=format("#S(乌金宝箱)#Y玩家#R/%s#Y使用乌金宝箱抽到了",玩家数据[id].角色.名称),频道="xt",结尾="#80#Y！"}
	if 类型=="黄铜宝箱" then
		链接 = {提示=format("#S(黄铜宝箱)#Y玩家#R/%s#Y使用黄铜宝箱抽到了",玩家数据[id].角色.名称),频道="xt",结尾="#80#Y！"}
	elseif 类型=="赤金宝箱" then
		链接 = {提示=format("#S(赤金宝箱)#Y玩家#R/%s#Y使用赤金宝箱抽到了",玩家数据[id].角色.名称),频道="xt",结尾="#80#Y！"}
	elseif 类型=="神奇宝箱" then
		链接 = {提示=format("#S(神奇宝箱)#Y玩家#R/%s#Y使用神奇宝箱抽到了",玩家数据[id].角色.名称),频道="xt",结尾="#80#Y！"}
	end
	if 名称=="红玛瑙" or 名称=="太阳石" or 名称=="舍利子" or 名称=="黑宝石" or 名称=="月亮石" or 名称=="光芒石" then
		玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,2),nil,链接,"不存共享")
		常规提示(id,"#Y你获得了#R"..名称)
	elseif 名称=="星辉石" then
		玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接,"不存共享")
		常规提示(id,"#Y你获得了#R"..名称)
	elseif 名称=="高级兽诀" then
		local 名称1="高级魔兽要诀"
		玩家数据[id].道具:给予超链接道具(id,名称1,nil,nil,链接,"不存共享")
		常规提示(id,"#Y/你获得了"..名称1)
	elseif 名称=="特效宝珠" then
		玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接,"不存共享")
		常规提示(id,"#Y你获得了#R"..名称)
	elseif 名称=="超简易宝珠" then
		玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接,"不存共享")
		常规提示(id,"#Y你获得了#R"..名称)
	elseif 名称=="神兜兜" then
		玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接,"不存共享")
		常规提示(id,"#Y你获得了1个#R"..名称)
	elseif 名称=="金砖" then
		玩家数据[id].角色:添加储备(取随机数(300000,500000),"新手礼包",1)
	elseif 名称=="仙丹" then
		玩家数据[id].角色:添加经验(取随机数(130000,250000),"新手礼包",1)
	elseif 名称=="超级金柳露" or 名称=="五宝盒" or 名称=="超级净瓶玉露" or 名称=="彩果" then
		玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接,"不存共享")
		常规提示(id,"#Y你获得了#R"..名称)
	elseif 名称=="指南书" then
		玩家数据[id].道具:给予书铁(id,{14,15},1,nil,"不存共享")
		常规提示(id,"#Y你获得了#R"..名称)
	else
		玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接,"不存共享")
		常规提示(id,"#Y你获得了#G"..名称)
	end
end

function 抽奖处理:转盘抽奖(id)
	抽奖转盘[id]={中奖=取随机数(1,14)}
	local 抽奖转盘数据 = {}
	if 抽奖数据.抽奖转盘 then
		for i = 1, 24 do
			if 抽奖数据.抽奖转盘["物品"..i] then
				抽奖转盘数据[#抽奖转盘数据 + 1] = table.copy(抽奖数据.抽奖转盘["物品"..i])
			end
		end
		for n=1,14 do
			local 名称 = ""
			local 参数 = {}
			local 备注 = ""
			local 奖励 = 取随机数(1,1150)
			local 说明 = ""
			for i = 1, #抽奖转盘数据 do
				if i > 1 and 奖励 > 抽奖转盘数据[i-1].权重 and 奖励 <= 抽奖转盘数据[i].权重 then
					名称 = 抽奖转盘数据[i].名称
					说明 = 抽奖转盘数据[i].说明
					break
				elseif i == 1 and 奖励 <= 抽奖转盘数据[i].权重 then
					名称 = 抽奖转盘数据[i].名称
					说明 = 抽奖转盘数据[i].说明
					break
				end
			end
			抽奖转盘[id][n]={
				名称=名称,
				说明=说明,
				参数={参数[1],参数[2],参数[3]},
				备注=备注
			}
		end
	end
	发送数据(玩家数据[id].连接id,107,{道具=抽奖转盘[id],秘宝宝箱=1})
end

function 抽奖处理:转盘抽奖处理(id)
	if 抽奖转盘[id]==nil then
		常规提示(id,"#Y抽奖转盘数据异常！")
		return
	else
		if type(抽奖转盘[id].中奖) == "table"  then
			while #抽奖转盘[id].中奖 > 0 do
				local 序号 = 抽奖转盘[id].中奖[1]
				local 名称 = 抽奖转盘[id][序号].名称
				local 参数 = 抽奖转盘[id][序号].参数
				local 数量 = tonumber(抽奖转盘[id][序号].数量) or 1
				if 名称 == "召唤兽内丹" then
					玩家数据[id].道具:给予道具(id,名称,1)
				elseif 名称 == "高级召唤兽内丹" then
					玩家数据[id].道具:给予道具(id,名称,1)
				elseif 名称 == "仙丹" then
					if 数量 == 1 then 数量 = 200000 end
					玩家数据[id].角色:添加经验(数量,"转盘抽奖",1)
				elseif 名称 == "八级变身卡" then
					玩家数据[id].道具:给予道具(id,"怪物卡片",8)
				elseif 名称 == "金刚石" or 名称 == "夜光珠" or 名称 == "龙鳞" or 名称 == "定魂珠" or 名称 == "避水珠"  then
					玩家数据[id].道具:给予道具(id,名称)
				elseif 名称 == "特效宝珠" then
					玩家数据[id].道具:给予道具(id,名称,1)
				elseif 名称 == "超简易宝珠" then
					玩家数据[id].道具:给予道具(id,名称,1)
				elseif 名称 == "彩果" then
					玩家数据[id].道具:给予道具(id,名称,1)
				elseif 名称 == "强化石" then
					local 名称1=取强化石()
					玩家数据[id].道具:给予道具(id,名称1,取随机数(1,3))
					名称 = 名称1
				elseif 名称 == "宝石" then
					local 名称1=取宝石()
					玩家数据[id].道具:给予道具(id,名称1,取随机数(1,2))
					名称 = 名称1
				elseif 名称 == "金砖" then
					玩家数据[id].角色:添加银子(数量,"转盘抽奖",1)
				elseif 名称 == "仙玉" then
					添加仙玉(id,玩家数据[id].账号, qz(数量), "转盘抽奖")
				elseif 名称 == "八级变身卡" then
					玩家数据[id].道具:给予道具(id,"怪物卡片",8)
				elseif 名称 == "摇钱树苗" then
					玩家数据[id].道具:给予道具(id,名称,1)
				elseif 名称 == "特赦令牌" then
					玩家数据[id].道具:给予道具(id,名称,1)
				elseif 名称 == "超级金柳露" then
					玩家数据[id].道具:给予道具(id,名称,1)
				elseif 名称 == "高级魔兽要诀" then
					玩家数据[id].道具:给予道具(id,名称)
				-- elseif 名称 == "随机神兽" then
				-- 	local 随机神兽 = 取随机神兽()
				-- 	名称 = 随机神兽
				-- 	local 事件 = "物理型（单点爆伤）"
				-- 	if 取随机数() >= 50 then 事件 = "法术型（秒伤）" end
				-- 	玩家数据[id].召唤兽:添加神兽(随机神兽,事件,true)
				-- elseif 悠悠 and (名称 == "红孩儿" or 名称 == "超级飞廉" or 名称 == "恶魔泡泡" or 名称 == "自在心猿") then
				-- 	local 事件 = "物理型（单点爆伤）"
				-- 	玩家数据[id].召唤兽:添加神兽(名称,事件,true)
				else
					玩家数据[id].道具:给予道具(id,名称,数量)
				end
				常规提示(id,"#Y/你获得了#G"..名称)
				if 悠悠 then
					发送公告("#Y玩家#R"..玩家数据[id].角色.名称.."#Y在转盘抽奖中获得了物品#R"..名称.."#Y大家快来围观！！！")
				end
				table.remove(抽奖转盘[id].中奖, 1)
			end
			抽奖转盘[id]=nil
		else
			local 序号 = 抽奖转盘[id].中奖
			local 名称 = 抽奖转盘[id][序号].名称
			local 参数 = 抽奖转盘[id][序号].参数
			local 数量 = tonumber(抽奖转盘[id][序号].数量) or 1
			抽奖转盘[id]=nil
			if 名称 == "召唤兽内丹" then
				玩家数据[id].道具:给予道具(id,名称,1)
			elseif 名称 == "高级召唤兽内丹" then
				玩家数据[id].道具:给予道具(id,名称,1)
			elseif 名称 == "仙丹" then
				if 数量 == 1 then 数量 = 200000 end
				玩家数据[id].角色:添加经验(数量,"转盘抽奖",1)
			elseif 名称 == "八级变身卡" then
				玩家数据[id].道具:给予道具(id,"怪物卡片",8)
			elseif 名称 == "金刚石" or 名称 == "夜光珠" or 名称 == "龙鳞" or 名称 == "定魂珠" or 名称 == "避水珠"  then
				玩家数据[id].道具:给予道具(id,名称)
			elseif 名称 == "特效宝珠" then
				玩家数据[id].道具:给予道具(id,名称,1)
			elseif 名称 == "超简易宝珠" then
				玩家数据[id].道具:给予道具(id,名称,1)
			elseif 名称 == "彩果" then
				玩家数据[id].道具:给予道具(id,名称,1)
			elseif 名称 == "强化石" then
				local 名称1=取强化石()
				玩家数据[id].道具:给予道具(id,名称1,取随机数(1,3))
				名称 = 名称1
			elseif 名称 == "宝石" then
				local 名称1=取宝石()
				玩家数据[id].道具:给予道具(id,名称1,取随机数(1,2))
				名称 = 名称1
			elseif 名称 == "金砖" then
				玩家数据[id].角色:添加银子(数量,"转盘抽奖",1)
			elseif 名称 == "仙玉" then
				添加仙玉(id, 玩家数据[id].账号,qz(数量), "转盘抽奖")
			elseif 名称 == "八级变身卡" then
				玩家数据[id].道具:给予道具(id,"怪物卡片",8)
			elseif 名称 == "摇钱树苗" then
				玩家数据[id].道具:给予道具(id,名称,1)
			elseif 名称 == "特赦令牌" then
				玩家数据[id].道具:给予道具(id,名称,1)
			elseif 名称 == "超级金柳露" then
				玩家数据[id].道具:给予道具(id,名称,1)
			elseif 名称 == "高级魔兽要诀" then
				玩家数据[id].道具:给予道具(id,名称)
			-- elseif 名称 == "随机神兽" then
			-- 	local 随机神兽 = 取随机神兽()
			-- 	名称 = 随机神兽
			-- 	local 事件 = "物理型（单点爆伤）"
			-- 	if 取随机数() >= 50 then 事件 = "法术型（秒伤）" end
			-- 	玩家数据[id].召唤兽:添加神兽(随机神兽,事件,true)
			-- elseif 悠悠 and (名称 == "红孩儿" or 名称 == "超级飞廉" or 名称 == "恶魔泡泡" or 名称 == "自在心猿") then
			-- 	local 事件 = "物理型（单点爆伤）"
			-- 	玩家数据[id].召唤兽:添加神兽(名称,事件,true)
			else
				玩家数据[id].道具:给予道具(id,名称,数量)
			end
			常规提示(id,"#Y/你获得了#G"..名称)
			if 悠悠 then
				发送公告("#Y玩家#R"..玩家数据[id].角色.名称.."#Y在转盘抽奖中获得了物品#R"..名称.."#Y大家快来围观！！！")
			end
		end
	end
end

function 抽奖处理:设置仙玉宝箱1(id, 连接id)
	抽奖转盘[id]={}
	local 奖励=取随机数(1,1150)
	if 抽奖数据.仙玉抽奖1 then
		for i = 1, 24 do
			if 抽奖数据.仙玉抽奖1["物品"..i] then
				抽奖转盘[id][#抽奖转盘[id] + 1] = table.copy(抽奖数据.仙玉抽奖1["物品"..i])
			end
		end
		for i = 1, #抽奖转盘[id] do
			if i > 1 and 奖励 > 抽奖转盘[id][i-1].权重 and 奖励 <= 抽奖转盘[id][i].权重 then
				抽奖转盘[id].中奖 = i
				break
			elseif i == 1 and 奖励 <= 抽奖转盘[id][i].权重 then
				抽奖转盘[id].中奖 = i
				break
			end
		end
	end
	发送数据(连接id,85,{道具=抽奖转盘[id],类型="仙玉"})
end

function 抽奖处理:设置仙玉宝箱3(id, 连接id)
	抽奖转盘[id]={}
	local 奖励=取随机数(1,1150)
	if 抽奖数据.仙玉抽奖1 then
		for i = 1, 24 do
			if 抽奖数据.仙玉抽奖1["物品"..i] then
				抽奖转盘[id][#抽奖转盘[id] + 1] = table.copy(抽奖数据.仙玉抽奖1["物品"..i])
			end
		end
		抽奖转盘[id].中奖 = {}
		for n=1,10 do
			奖励=取随机数(1,1150)
			for i = 1, #抽奖转盘[id] do
				if i > 1 and 奖励 > 抽奖转盘[id][i-1].权重 and 奖励 <= 抽奖转盘[id][i].权重 then
					抽奖转盘[id].中奖[#抽奖转盘[id].中奖+1] = i
					break
				elseif i == 1 and 奖励 <= 抽奖转盘[id][i].权重 then
					抽奖转盘[id].中奖[#抽奖转盘[id].中奖+1] = i
					break
				end
			end
		end
	end
	发送数据(连接id,85,{道具=抽奖转盘[id],类型="仙玉"})
end

function 抽奖处理:设置仙玉宝箱4(id, 连接id)
	抽奖转盘[id]={}
	local 奖励=取随机数(1,1150)
	if 抽奖数据.仙玉抽奖1 then
		for i = 1, 24 do
			if 抽奖数据.仙玉抽奖1["物品"..i] then
				抽奖转盘[id][#抽奖转盘[id] + 1] = table.copy(抽奖数据.仙玉抽奖1["物品"..i])
			end
		end
		抽奖转盘[id].中奖 = {}
		for n=1,20 do
			奖励=取随机数(1,1150)
			for i = 1, #抽奖转盘[id] do
				if i > 1 and 奖励 > 抽奖转盘[id][i-1].权重 and 奖励 <= 抽奖转盘[id][i].权重 then
					抽奖转盘[id].中奖[#抽奖转盘[id].中奖+1] = i
					break
				elseif i == 1 and 奖励 <= 抽奖转盘[id][i].权重 then
					抽奖转盘[id].中奖[#抽奖转盘[id].中奖+1] = i
					break
				end
			end
		end
	end
	发送数据(连接id,85,{道具=抽奖转盘[id],类型="仙玉"})
end

function 抽奖处理:设置仙玉宝箱2(id, 连接id)
	抽奖转盘[id]={中奖=取随机数(1,14)}
	local 抽奖转盘数据 = {}
	if 抽奖数据.仙玉抽奖2 then
		for i = 1, 24 do
			if 抽奖数据.仙玉抽奖2["物品"..i] then
				抽奖转盘数据[#抽奖转盘数据 + 1] = table.copy(抽奖数据.仙玉抽奖2["物品"..i])
			end
		end
		for n=1,14 do
			local 名称 = ""
			local 参数 = {}
			local 备注 = ""
			local 奖励 = 取随机数(1,1150)
			local 说明 = ""
			local 数量 = 1
			for i = 1, #抽奖转盘数据 do
				if i > 1 and 奖励 > 抽奖转盘数据[i-1].权重 and 奖励 <= 抽奖转盘数据[i].权重 then
					名称 = 抽奖转盘数据[i].名称
					说明 = 抽奖转盘数据[i].说明
					数量 = 抽奖转盘数据[i].说明 or 1
					break
				elseif i == 1 and 奖励 <= 抽奖转盘数据[i].权重 then
					名称 = 抽奖转盘数据[i].名称
					说明 = 抽奖转盘数据[i].说明
					数量 = 抽奖转盘数据[i].说明 or 1
					break
				end
			end
			抽奖转盘[id][n]={
				名称=名称,
				说明=说明,
				参数={参数[1],参数[2],参数[3]},
				备注=备注,
				数量=数量
			}
		end
	end
	发送数据(玩家数据[id].连接id,107,{道具=抽奖转盘[id],秘宝宝箱=1})
end



return 抽奖处理
