
__S服务 = require("Script/ggeserver")()
--加载类
local dsawws=1.2
math.randomseed(tostring(os.time()):reverse():sub(1, 7))
require("lfs")
程序目录=lfs.currentdir()..[[\]]
-- 程序目录1=程序目录
初始目录=程序目录
format = string.format
f函数=require("ffi函数2")
ffi = require("ffi")
-- dkjson = require("dkjson")
ffi.cdef[[
    const char* yz(const char *s);
    const char* qjqm(const char *b);
	void*   CreateFileA(const char*,int,int,void*,int,int,void*);
	bool    DeviceIoControl(void*,int,void*,int,void*,int,void*,void*);
	bool  CloseHandle(void*);
	//
	int      OpenClipboard(void*);
	void*    GetClipboardData(unsigned);
	int      CloseClipboard();
	void*    GlobalLock(void*);
	int      GlobalUnlock(void*);
	size_t   GlobalSize(void*);
	//
	int   GetPrivateProfileStringA(const char*, const char*, const char*, const char*, unsigned, const char*);
	bool  WritePrivateProfileStringA(const char*, const char*, const char*, const char*);

	int   OpenClipboard(void*);
	void*   GetClipboardData(unsigned);
	int   CloseClipboard();
	void*   GlobalLock(void*);
	int   GlobalUnlock(void*);
	size_t  GlobalSize(void*);

	int   EmptyClipboard();
	void*   GlobalAlloc(unsigned, unsigned);
	void*   GlobalFree(void*);
	void*   lstrcpy(void*,const char*);
	void*   SetClipboardData(unsigned,void*);
	//
	typedef struct {
		unsigned long i[2]; /* number of _bits_ handled mod 2^64 */
		unsigned long buf[4]; /* scratch buffer */
		unsigned char in[64]; /* input buffer */
		unsigned char digest[16]; /* actual digest after MD5Final call */
	} MD5_CTX;
	void MD5Init(MD5_CTX *);
	void MD5Update(MD5_CTX *, const char *, unsigned int);
	void MD5Final(MD5_CTX *);
	//
	int   MessageBoxA(void *, const char*, const char*, int);
	void  Sleep(int);
	int   _access(const char*, int);
]]



RpbARGB=toBooa(dsawws)
随机序列=0
错误日志={}
local __N连接数  = 0
__PC客户信息   = {}
__AD客户信息   = {}
总控客户信息 = {}
fgf="*-*"
fgc="@+@"

require("Script/角色处理类/召唤兽处理类")()

local _iasdiwrp=RpbARGB["b"]
网关ip=_iasdiwrp






启动区服 = 1
兽诀顶书上限 = 8
吸附基础概率 = 20
词条定制 = true
自动抓鬼全队限制 = true
 自己 = true
if 自己 then
	连接ip =  '127.0.0.1'
	网关连接ip = '127.0.0.1'
	PC端口 = "9016"
	AD端口 = "9015"

end
自动回收定制 = true
盲盒抽奖定制 = true
收购定制 = true
公共世界BOSS定制 = true
强化技能定制 = true
分角色累充定制 = true
充值7日排行定制 = true
特殊兽诀三换一 = true
超级兽诀三换一 = true

_QJBT="服务端后台"..启动区服.."区"
__S服务:置标题(_QJBT)
ItemData = {}
商城数据 = {}
指定时间累充数据 = {}

全局数据 = {
	全局账号信息 = {},
	全局角色信息 = {},
	全局召唤兽信息 = {},
	全局神器信息 = {},
	全局道具信息 = {},
	全局道具仓库信息 = {},
	全局召唤兽仓库信息 = {},
	全局累充信息 = {},
	全局累充金额 = {},
}

日志统计 = {}
初始化完毕 = false

-- 账号信息 = {}
require("Script/初始化脚本")
加载全局数据()
-- 假人事件类=require("Script/系统处理类/假人事件类")() --9.22注释
线程 = require("Script/线程/定时器")(1,"Script/线程/线程循环") -- 战斗线程
线程2 = require("Script/线程/定时器2")(1,"Script/线程/线程循环2")--任务线程
线程3 = require("Script/线程/定时器3")(1,"Script/线程/线程循环3")--道具更新线程 角色更新
--网络线程 = require("Script/线程/定时器4")(1,"Script/线程/线程循环4")--网络线程
线程5 = require("Script/线程/定时器5")(1,"Script/线程/线程循环5")--地图线程
线程6 = require("Script/线程/定时器6")(1,"Script/线程/线程循环6")--假人线程 --9.22注释 改为通用线程 1.勾魂索
线程7 = require("Script/线程/定时器7")(1,"Script/线程/线程循环7")--zdzg外挂线程
线程8 = require("Script/线程/定时器8")(1,"Script/线程/线程循环8") --活动线程启动中
-- 线程9 = require("Script/线程/定时器9")(1,"Script/线程/线程循环9")
-- 线程10 = require("Script/线程/定时器10")(1,"Script/线程/线程循环10")
线程11 = require("Script/线程/定时器11")(1,"Script/线程/线程循环11") --假人线程启动中
线程12 = require("Script/线程/定时器12")(1,"Script/线程/线程循环12") --支付线程启动中

__S服务:启动(连接ip,PC端口,"PC")
require("Script/安卓通信")
function __S服务:启动成功()
	return 0
end

function __S服务:连接进入(ID,IP,PORT)
	if IP == 连接ip and (not 服务端参数["安卓网关id"] or not 服务端参数["PC网关id"]) then
		__S服务:输出(string.format('PC网关进入(%s):%s:%s',ID, IP,PORT))
		__PC客户信息[ID] = {
			IP = IP,
			认证=os.time(),
			PORT = PORT,
			网关=true
		}
	else
		__S服务:输出(string.format('其他客户进入(%s):%s:%s',ID, IP,PORT))
		__PC客户信息[ID] = {
			IP = IP,
			认证=os.time(),
			PORT = PORT,
		}
	end
end

function __S服务:连接退出(ID)
	if __PC客户信息[ID] then
		if __PC客户信息[ID].网关 then
			__S服务:输出(string.format('PC网关客户退出(%s):%s:%s', ID,__PC客户信息[ID].IP,__PC客户信息[ID].PORT))
		else
		  __S服务:输出(string.format('其他连接退出(%s):%s:%s', ID,__PC客户信息[ID].IP,__PC客户信息[ID].PORT))
		end
	else
		__S服务:输出("连接不存在(连接退出)。")
	end
end

function __S服务:数据到达(ID,...)
	local arg = {...}
	if __PC客户信息[ID] then
		if __PC客户信息[ID].GJ then
		 小巷子网关:数据处理(arg[1],table.loadstring(arg[2]))
		-- GM工具类:数据处理(arg[1],table.loadstring(arg[2]))
		 GM工具ID=ID
		elseif arg[1] == 9528 then
			__PC客户信息[ID].GJ=true
            __S服务:输出( "GM工具已连接,可以正常使用了！")
			return
		end
		if __PC客户信息[ID].网关 then
			if arg[1] == 9527 then
	      		__PC客户信息[ID].类型 = arg[2]
	      		服务端参数[arg[2] .. "网关id"]=ID
	      		__S服务:输出(arg[2] .. "网关已经验证成功,可以正常使用了！")
		  --   elseif arg[1] >= 880001 and arg[1] <= 900000 then
				-- web网关:数据处理(arg[1], arg[2], ID)
			else
				if __PC客户信息[ID].类型 == nil then
          			--__S服务:输出(string.format('网关客户(%s)尚未验证类型:%s:%s',ID,__PC客户信息[ID].IP,__PC客户信息[ID].PORT))
          			--__S服务:断开连接(ID)
          			return
        		end
				网络处理类:数据处理(arg[1],arg[2])
			end
		end
	else
		__S服务:输出("连接不存在(数据到达)。")
	end
end

function __S服务:错误事件(ID,EO,IE)
	if __PC客户信息[ID] then
		__S服务:输出(string.format('错误事件(%s):%s,%s:%s', ID,__错误[EO] or EO,__PC客户信息[ID].IP,__PC客户信息[ID].PORT))
	else
		__S服务:输出("连接不存在(错误事件)。")
	end
end
-- if __gge.isdebug == nil then

    --if 初始化充值() == "1" then
      -- 内充开启 = true
      -- __S服务:输出("初始化内充成功")
    --else
    -- 内充开启 = false
     -- __S服务:输出("初始化内充失败")
    --end
-- end
-- function isPortInUse(port)
--   local command = string.format('netstat -ano | findstr :%d', port)
--   local handle = io.popen(command)
--   local result = handle:read("*a")
--   handle:close()
--   return result ~= ""
-- end

-- local ports = f函数.读配置(程序目录.."config.ini","mainconfig","Getway")
-- if not isPortInUse(ports) then
-- 	os.execute(程序目录.."启动网关")
-- end

-- local ports = f函数.读配置(程序目录.."config.ini","mainconfig","AdGetway")
-- if not isPortInUse(ports) then
-- 	os.execute(程序目录.."启动安卓网关")
-- end

装饰属性 = {
	锦衣属性 = {
		浪淘纱 = {气血=1000,魔法=0,伤害=0,防御=0,法伤=0,法防=0,速度=0,体质=0,魔力=0,力量=0,耐力=0,敏捷=0},
		浪淘纱墨黑 = {气血=1000,魔法=0,伤害=0,防御=0,法伤=0,法防=0,速度=0,体质=0,魔力=0,力量=0,耐力=0,敏捷=0},
		冰寒绡月白 = {气血=1000,魔法=0,伤害=0,防御=0,法伤=0,法防=0,速度=0,体质=0,魔力=0,力量=0,耐力=0,敏捷=0},
		飞天舞 = {气血=1000,魔法=0,伤害=0,防御=0,法伤=0,法防=0,速度=0,体质=0,魔力=0,力量=0,耐力=0,敏捷=0},
		飞天舞朝露 = {气血=1000,魔法=0,伤害=0,防御=0,法伤=0,法防=0,速度=0,体质=0,魔力=0,力量=0,耐力=0,敏捷=0},
		羽仙歌 = {气血=1000,魔法=0,伤害=0,防御=0,法伤=0,法防=0,速度=0,体质=0,魔力=0,力量=0,耐力=0,敏捷=0},
		其他 = {气血=500,魔法=0,伤害=0,防御=0,法伤=0,法防=0,速度=0,体质=0,魔力=0,力量=0,耐力=0,敏捷=0},
	},
	祥瑞属性 = {
		九尾冰狐 = {气血=3000,魔法=0,伤害=0,防御=100,法伤=0,法防=0,速度=0,体质=0,魔力=0,力量=0,耐力=0,敏捷=0},
		吾皇 = {气血=3000,魔法=0,伤害=0,防御=100,法伤=0,法防=0,速度=0,体质=0,魔力=0,力量=0,耐力=0,敏捷=0},
		战火穷奇 = {气血=3000,魔法=0,伤害=0,防御=100,法伤=0,法防=0,速度=0,体质=0,魔力=0,力量=0,耐力=0,敏捷=0},
		白金战火穷奇 = {气血=3000,魔法=0,伤害=0,防御=100,法伤=0,法防=0,速度=0,体质=0,魔力=0,力量=0,耐力=0,敏捷=0},
		其他 = {气血=3000,魔法=0,伤害=0,防御=50,法伤=0,法防=0,速度=0,体质=0,魔力=0,力量=0,耐力=0,敏捷=0},
	},
	光环属性 = {
		其他 = {气血=0,魔法=0,伤害=0,防御=0,法伤=0,法防=20,速度=0,体质=0,魔力=0,力量=0,耐力=0,敏捷=0},
	},
	足迹属性 = {
		其他 = {气血=0,魔法=0,伤害=0,防御=0,法伤=0,法防=0,速度=20},
	},
	祥瑞套装属性 = {
		其他 = {气血=0,魔法=0,伤害=0,防御=0,法伤=0,法防=0,速度=0,体质=10,魔力=10,力量=10,耐力=10,敏捷=10},
	},
}

道具排序表={}
function 读取背包排序表()
道具排序表["新春飞行符"] = 1 道具排序表["超级合成旗"] = 2 道具排序表["门派传送旗"] = 3 道具排序表["红色合成旗"] = 4 道具排序表["黄色合成旗"] = 5
道具排序表["蓝色合成旗"] = 6 道具排序表["绿色合成旗"] = 7 道具排序表["飞行符"] = 8 道具排序表["密信"] = 9
道具排序表["超级魔兽要诀"] = 97 道具排序表["特殊兽决"] = 97 道具排序表["高级魔兽要诀"] = 98 道具排序表["魔兽要诀"] = 99
道具排序表["百炼精铁"] = 100 道具排序表["制造指南书"] = 101 道具排序表["灵饰指南书"] = 102 道具排序表["元灵晶石"] = 103 道具排序表["炼妖石"] = 104 道具排序表["上古锻造图策"] = 105
 道具排序表["召唤兽内丹"] = 108 道具排序表["高级召唤兽内丹"] = 109 道具排序表["藏宝图"] = 110 道具排序表["高级藏宝图"] = 111
道具排序表["金银锦盒"] = 112 道具排序表["特赦令牌"] = 113 道具排序表["金柳露"] = 114 道具排序表["超级金柳露"] = 115 道具排序表["元宵"] = 116 道具排序表["炼兽真经"] = 117
道具排序表["摄妖香"] = 118 道具排序表["洞冥草"] = 119 道具排序表["飞行符"] = 120 道具排序表["天眼通符"] = 121 道具排序表["秘制红罗羹"] = 122 道具排序表["秘制绿罗羹"] = 123
道具排序表["红色合成旗"] = 124 道具排序表["黄色合成旗"] = 125 道具排序表["蓝色合成旗"] = 126 道具排序表["绿色合成旗"] = 127 道具排序表["白色合成旗"] = 128 道具排序表["红色导标旗"] = 129
道具排序表["绿色导标旗"] = 130 道具排序表["蓝色导标旗"] = 131 道具排序表["白色导标旗"] = 132 道具排序表["黄色导标旗"] = 133 道具排序表["海马"] = 134 道具排序表["吸附石"] = 135
道具排序表["圣兽丹"] = 136 道具排序表["月华露"] = 137 道具排序表["易经丹"] = 138 道具排序表["玉葫灵髓"] = 139 道具排序表["清灵净瓶"] = 140 道具排序表["神兵图鉴"] = 141
道具排序表["神兵图鉴"] = 142 道具排序表["强化符"] = 143 道具排序表["分解符"] = 144 道具排序表["灵箓"] = 145 道具排序表["碎星锤"] = 146 道具排序表["超级碎星锤"] = 147
道具排序表["天眼珠"] = 154 道具排序表["珍珠"] = 155 道具排序表["初级清灵仙露"] = 156 道具排序表["中级清灵仙露"] = 157 道具排序表["高级清灵仙露"] = 158 道具排序表["青龙石"] = 159
道具排序表["白虎石"] = 160 道具排序表["朱雀石"] = 161 道具排序表["玄武石"] = 162 道具排序表["星辉石"] = 163 道具排序表["光芒石"] = 164 道具排序表["月亮石"] = 165
道具排序表["太阳石"] = 166 道具排序表["舍利子"] = 167 道具排序表["红玛瑙"] = 168 道具排序表["黑宝石"] = 169 道具排序表["神秘石"] = 170 道具排序表["未激活的符石"] = 171
道具排序表["陨铁"] = 172 道具排序表["战魄"] = 173 道具排序表["未激活的星石"] = 174 道具排序表["符石卷轴"] = 175 道具排序表["神兜兜"] = 176 道具排序表["彩果"] = 177
道具排序表["特效宝珠"] = 178 道具排序表["装备双加石"] = 179 道具排序表["双加洗炼石"] = 180 道具排序表["宠物饰品通用丹"] = 181 道具排序表["钟灵石"] = 182 道具排序表["点化石"] = 183
道具排序表["附魔宝珠"] = 184 道具排序表["钨金"] = 185 道具排序表["顺逆神针"] = 186 道具排序表["变身卡"] = 187 道具排序表["空白强化符"] = 188 道具排序表["三界悬赏令"] = 189
道具排序表["怪物卡片"] = 190 道具排序表["摇钱树苗"] = 191 道具排序表["修炼果"] = 192 道具排序表["金刚石"] = 193  道具排序表["定魂珠"] = 194  道具排序表["夜光珠"] = 195 道具排序表["避水珠"] = 196
道具排序表["龙鳞"] = 197 道具排序表["灵犀玉"] = 198 道具排序表["未鉴定的灵犀玉"] = 199  道具排序表["九转金丹"] = 200  道具排序表["特技书"] = 201
道具排序表["九转金丹礼包"] = 202 道具排序表["九眼天珠礼包"] = 203 道具排序表["灵犀之屑"] = 204 道具排序表["160附魔宝珠礼包"] = 205 道具排序表["特效宝珠礼包"] = 206
道具排序表["低级兽决礼包"] = 207 道具排序表["高级兽决礼包"] = 208 道具排序表["特性宝珠"] = 209 道具排序表["特技书"] = 210 道具排序表["超简易宝珠"] = 211
道具排序表["愤怒符"] = 212 道具排序表["精魄灵石"] = 213 道具排序表["玲珑宝图"] = 214 道具排序表["鬼谷子"] = 215 道具排序表["三界悬赏令"] = 216
道具排序表["金鸦火羽（高级）"] = 217 道具排序表["特殊兽决·碎片"] = 218 道具排序表["水晶糕"] = 219 道具排序表["元宵礼盒"] = 220
道具排序表["桂花酒酿元宵"] = 221 道具排序表["芝麻沁香元宵"] = 222 道具排序表["细磨豆沙元宵"] = 223 道具排序表["蜜糖腰果元宵"] = 224
道具排序表["山楂拔丝元宵"] = 225 道具排序表["滑玉莲蓉元宵"] = 226 道具排序表["如意丹"] = 227 道具排序表["翠叶环"] = 228 道具排序表["明月珰"] = 229
道具排序表["玉蝶翩"] = 230
道具排序表["点星芒"] = 231 道具排序表["凤羽流苏"] = 232 道具排序表["焰云霞珠"] = 233 道具排序表["芝兰佩"] = 234 道具排序表["逸云佩"] = 235
道具排序表["莲音玦"] = 236 道具排序表["相思染"] = 237 道具排序表["玄龙苍珀"] = 238 道具排序表["碧海青天"] = 239 道具排序表["枫华戒"] = 240
道具排序表["芙蓉戒"] = 241 道具排序表["金麟绕"] = 242 道具排序表["悦碧水"] = 243 道具排序表["九曜光华"] = 244 道具排序表["香木镯"] = 245
道具排序表["翡玉镯"] = 246 道具排序表["墨影扣"] = 247 道具排序表["花映月"] = 248 道具排序表["金水菩提"] = 249 道具排序表["浮雪幻音"] = 250
道具排序表["弑皇"] = 251 道具排序表["裂天"] = 252 道具排序表["擒龙"] = 253 道具排序表["浮犀"] = 254 道具排序表["九霄"] = 255 道具排序表["离钩"] = 256
道具排序表["星瀚"] = 257 道具排序表["醍醐"] = 258 道具排序表["碎寂"] = 259 道具排序表["霜陨"] = 260 道具排序表["鸣鸿"] = 261 道具排序表["弦月"] = 262
道具排序表["赤明"] = 263 道具排序表["若木"] = 264 道具排序表["长息"] = 265 道具排序表["荒尘"] = 266 道具排序表["晴雪"] = 267 道具排序表["浑天玄火盔"] = 268
 道具排序表["乾元鸣凤冕"] = 269 道具排序表["混元一气甲"] = 270 道具排序表["鎏金浣月衣"] = 271 道具排序表["辟尘分光履"] = 272 道具排序表["紫霄云芒带"] = 273
 道具排序表["落霞陨星坠"] = 274 道具排序表["紫金磐龙甲"] = 275 道具排序表["五彩凤翅衣"] = 276 道具排序表["金丝逐日履"] = 277 道具排序表["磐龙凤翔带"] = 278
 道具排序表["紫金碧玺佩"] = 279 道具排序表["天龙破城"] = 280 道具排序表["碧血干戚"] = 281 道具排序表["霜冷九州"] = 282 道具排序表["紫电青霜"] = 283
 道具排序表["揽月摘星"] = 284 道具排序表["忘川三途"] = 285 道具排序表["浩气长舒"] = 286 道具排序表["丝萝乔木"] = 287 道具排序表["狂澜碎岳"] = 288
 道具排序表["牧云清歌"] = 289 道具排序表["无关风月"] = 290 道具排序表["朝夕"] = 291 道具排序表["业火三灾"] = 292 道具排序表["碧海潮生"] = 293
 道具排序表["云雷万里"] = 294 道具排序表["九霄风雷"] = 295 道具排序表["百辟镇魂"] = 296 道具排序表["夭桃秾李"] = 297 道具排序表["浮生归梦"] = 298
 道具排序表["紫金磐龙冠"] = 299 道具排序表["金珰紫焰冠"] =300 道具排序表["120无级别礼包"] = 301 道具排序表["焕彩石"] = 302



end
读取背包排序表()