-- @Author: baidwwy
-- @Date:   2023-09-10 04:41:22
-- @Last 光唏蜀黍QQ:29582348
-- @Last Modified time: 2025-12-13 22:16:34
local 人族_青丘秘辛 = class()
function 人族_青丘秘辛:初始化()
  地图处理类.地图数据[10046]={npc={},单位={},传送圈={}}
  地图处理类.地图玩家[10046]={}
  地图处理类.地图坐标[10046]=地图处理类.地图坐标[1284]
  地图处理类.地图单位[10046]={}
  地图处理类.单位编号[10046]=1000
end
function 人族_青丘秘辛:取人族_青丘秘辛境界相同(id)
    local 玩家境界 = 时空之钥[id] and 时空之钥[id].境界
    if not 玩家境界 then
        添加最后对话(id, "你的境界数据尚未记录。")
        return false
    end
    if 玩家数据[id].队伍 ~= 0 then
        local 境界相同 = true
        for i = 1, #队伍数据[玩家数据[id].队伍].成员数据 do
            local lsid = 队伍数据[玩家数据[id].队伍].成员数据[i]
            if lsid ~= id then
                local 队员境界 = 时空之钥[lsid] and 时空之钥[lsid].境界
                if not 队员境界 then
                    添加最后对话(id, 玩家数据[lsid].角色.名称 .. "的境界数据尚未记录。")
                    境界相同 = false
                    break
                elseif 队员境界 ~= 玩家境界 then
                    添加最后对话(id, 玩家数据[lsid].角色.名称 .. "的境界与你不同。")
                    境界相同 = false
                    break
                end
            end
        end
        if 境界相同 then
            --添加最后对话(id, "你与队伍成员的境界相同。")
            return true
        else
            return false
        end
    else
        --添加最后对话(id, "你当前不在队伍中。")
        return false
    end
end
function 人族_青丘秘辛:开启人族_青丘秘辛副本(id)
  if 玩家数据[id].队伍==0 or 玩家数据[id].队长==false  then
    常规提示(id,"#Y/该任务必须组队完成且由队长领取")
    return
  elseif 取队伍人数(id)<1 then
    常规提示(id,"#Y此副本要求队伍人数不低于5人")
    return
  elseif  取等级要求(id,60)==false then
    常规提示(id,"#Y此副本要求角色等级不能低于60级")
    return
  -- elseif self:取人族_青丘秘辛境界相同(id)==false then
  --  -- 常规提示(id,玩家数据[id].角色.名称 .. "的境界与你不同。")
  --   return
  elseif 取队员任务存在(玩家数据[id].队伍,2591) then
    常规提示(id,"#Y/队伍中已有队员正在进行该副本任,无法领取新的副本")
    return
  end
  local 任务id=id.."_2591_"..os.time().."_"..随机序列.."_"..取随机数(1,999)
  时空之钥[id].人族.青丘秘辛.进行={进程=1,主任务id=任务id}
  self:设置人族青丘秘辛副本(id)
  任务数据[任务id]={
    id=任务id,
    起始=os.time(),
    结束=7200,
    玩家id={},
    队伍组={},
    副本id=id,
    类型=2591
  }
  local 队伍id=玩家数据[id].队伍
  for n=1,#队伍数据[队伍id].成员数据 do
    local 临时id=队伍数据[队伍id].成员数据[n]
      任务数据[任务id].队伍组[#任务数据[任务id].队伍组+1]=临时id
      玩家数据[临时id].角色:添加任务(任务id)
      任务处理类:副本传送(临时id,32)
      常规提示(临时id,"#Y你开启了人族青丘秘辛副本")
  end
end
function 人族_青丘秘辛:设置人族青丘秘辛副本(id)
  local 地图=0
  local 随机名称={}
  local 随机模型={}
  if 时空之钥[id].人族.青丘秘辛.进行.进程==1 then
    时空之钥[id].人族.青丘秘辛.进行.小蜜蜂=0
    local 任务id=id.."_2592_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
    地图=10046
    任务数据[任务id]={
      id=任务id,
      起始=os.time(),
      结束=7200,
      玩家id=id,
      队伍组={},
      名称="小蜜蜂",
      模型="蝴蝶仙子",
      染色方案=2079,
      染色组={5,0},
      x=70,
      y=186,
      方向=0,
      副本id=id,
      地图编号=地图,
      地图名称=取地图名称(地图),
      类型=2592
    }
    地图处理类:添加单位(任务id)
 elseif 时空之钥[id].人族.青丘秘辛.进行.进程==2 then
    时空之钥[id].人族.青丘秘辛.进行.兽变妖狐=0
    local 任务id=id.."_2593_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
    地图=10046
    任务数据[任务id]={
      id=任务id,
      起始=os.time(),
      结束=7200,
      玩家id=id,
      队伍组={},
      名称="兽变妖狐",
      模型="进阶狂豹兽形",
      x=41,
      y=157,
      方向=0,
      副本id=id,
      地图编号=地图,
      地图名称=取地图名称(地图),
      类型=2593
    }
    地图处理类:添加单位(任务id)
  elseif 时空之钥[id].人族.青丘秘辛.进行.进程==3 then
    时空之钥[id].人族.青丘秘辛.进行.入侵妖魔=0
    local 任务id=id.."_2594_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
    地图=10046
    任务数据[任务id]={
      id=任务id,
      起始=os.time(),
      结束=7200,
      玩家id=id,
      队伍组={},
      名称="入侵妖魔",
      模型="进阶犀牛将军人形",
      染色方案=64, --粉
      染色组={[1]=1,[2]=0},
      x=79,
      y=153,
      方向=0,
      副本id=id,
      地图编号=地图,
      地图名称=取地图名称(地图),
      类型=2594
    }
    地图处理类:添加单位(任务id)
  elseif 时空之钥[id].人族.青丘秘辛.进行.进程==4 then
    时空之钥[id].人族.青丘秘辛.进行.兽变阿宝=0
    local 任务id=id.."_2595_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
    地图=10046
    任务数据[任务id]={
      id=任务id,
      起始=os.time(),
      结束=7200,
      玩家id=id,
      队伍组={},
      名称="兽变阿宝",
      模型="锦衣龙鲤",
      x=100,
      y=128,
      方向=0,
      副本id=id,
      地图编号=地图,
      地图名称=取地图名称(地图),
      类型=2595
    }
    地图处理类:添加单位(任务id)
  elseif 时空之钥[id].人族.青丘秘辛.进行.进程==5 then
    时空之钥[id].人族.青丘秘辛.进行.静影沉璧=0
    local 任务id=id.."_2596_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
    地图=10046
    任务数据[任务id]={
      id=任务id,
      起始=os.time(),
      结束=7200,
      玩家id=id,
      队伍组={},
      名称="静影沉璧",
      模型="涂山雪",
      x=65,
      y=129,
      方向=0,
      副本id=id,
      地图编号=地图,
      地图名称=取地图名称(地图),
      类型=2596
    }
    地图处理类:添加单位(任务id)
  elseif 时空之钥[id].人族.青丘秘辛.进行.进程==6 then
    时空之钥[id].人族.青丘秘辛.进行.涂山雪=0
    local 任务id=id.."_2597_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
    地图=10046
    任务数据[任务id]={
      id=任务id,
      起始=os.time(),
      结束=7200,
      玩家id=id,
      队伍组={},
      名称="涂山雪",
      模型="进阶涂山雪",
      x=17,
      y=106,
      方向=0,
      副本id=id,
      地图编号=地图,
      地图名称=取地图名称(地图),
      类型=2597
    }
    地图处理类:添加单位(任务id)

  end
end

__GWdh111[2592]=function(连接id,数字id,序列,标识,地图)
  local 对话数据={}
  对话数据.模型=任务数据[标识].模型
  对话数据.名称=任务数据[标识].名称

  if 任务数据[标识].zhandou==nil then
    local 副本id=任务数据[标识].副本id
    if 玩家数据[数字id].队伍==0 then 常规提示(数字id,"#Y请组队完成！") return   end
    if (任务数据[玩家数据[数字id].角色:取任务(2591)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
    任务数据[标识].zhandou=true
    战斗准备类:创建战斗(数字id+0,180142,标识)
    玩家数据[数字id].地图单位=nil
    return
  else
    对话数据.对话="我正在战斗中，请勿打扰。"
  end
  return 对话数据
end
__GWdh111[2593]=function(连接id,数字id,序列,标识,地图)
  local 对话数据={}
  对话数据.模型=任务数据[标识].模型
  对话数据.名称=任务数据[标识].名称

  if 任务数据[标识].zhandou==nil then
    local 副本id=任务数据[标识].副本id
    if 玩家数据[数字id].队伍==0 then 常规提示(数字id,"#Y请组队完成！") return   end
    if (任务数据[玩家数据[数字id].角色:取任务(2591)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
    任务数据[标识].zhandou=true
    战斗准备类:创建战斗(数字id+0,180144,标识)
    玩家数据[数字id].地图单位=nil
    return
  else
    对话数据.对话="我正在战斗中，请勿打扰。"
  end
  return 对话数据
end
__GWdh111[2594]=function(连接id,数字id,序列,标识,地图)
  local 对话数据={}
  对话数据.模型=任务数据[标识].模型
  对话数据.名称=任务数据[标识].名称

  if 任务数据[标识].zhandou==nil then
    local 副本id=任务数据[标识].副本id
    if 玩家数据[数字id].队伍==0 then 常规提示(数字id,"#Y请组队完成！") return   end
    if (任务数据[玩家数据[数字id].角色:取任务(2591)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
    任务数据[标识].zhandou=true
    战斗准备类:创建战斗(数字id+0,180145,标识)
    玩家数据[数字id].地图单位=nil
    return
  else
    对话数据.对话="我正在战斗中，请勿打扰。"
  end
  return 对话数据
end
__GWdh111[2595]=function(连接id,数字id,序列,标识,地图)
  local 对话数据={}
  对话数据.模型=任务数据[标识].模型
  对话数据.名称=任务数据[标识].名称

  if 任务数据[标识].zhandou==nil then
    local 副本id=任务数据[标识].副本id
    if 玩家数据[数字id].队伍==0 then 常规提示(数字id,"#Y请组队完成！") return   end
    if (任务数据[玩家数据[数字id].角色:取任务(2591)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
    任务数据[标识].zhandou=true
    战斗准备类:创建战斗(数字id+0,180147,标识)
    玩家数据[数字id].地图单位=nil
    return
  else
    对话数据.对话="我正在战斗中，请勿打扰。"
  end
  return 对话数据
end
__GWdh111[2596]=function(连接id,数字id,序列,标识,地图)
  local 对话数据={}
  对话数据.模型=任务数据[标识].模型
  对话数据.名称=任务数据[标识].名称

  if 任务数据[标识].zhandou==nil then
    local 副本id=任务数据[标识].副本id
    if 玩家数据[数字id].队伍==0 then 常规提示(数字id,"#Y请组队完成！") return   end
    if (任务数据[玩家数据[数字id].角色:取任务(2591)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
    任务数据[标识].zhandou=true
    战斗准备类:创建战斗(数字id+0,180149,标识)
    玩家数据[数字id].地图单位=nil
    return
  else
    对话数据.对话="我正在战斗中，请勿打扰。"
  end
  return 对话数据
end
__GWdh111[2597]=function(连接id,数字id,序列,标识,地图)
  local 对话数据={}
  对话数据.模型=任务数据[标识].模型
  对话数据.名称=任务数据[标识].名称

  if 任务数据[标识].zhandou==nil then
    local 副本id=任务数据[标识].副本id
    if 玩家数据[数字id].队伍==0 then 常规提示(数字id,"#Y请组队完成！") return   end
    if (任务数据[玩家数据[数字id].角色:取任务(2591)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
    任务数据[标识].zhandou=true
    战斗准备类:创建战斗(数字id+0,180150,标识)
    玩家数据[数字id].地图单位=nil
    return
  else
    对话数据.对话="我正在战斗中，请勿打扰。"
  end
  return 对话数据
end
function 人族_青丘秘辛:结束人族青丘秘辛副本(任务id)
  local 副本id = 任务数据[任务id].副本id
  local 主任务id = 时空之钥[副本id].人族.青丘秘辛.进行.主任务id
  时空之钥[副本id].人族.青丘秘辛.进行=nil
  local id组 = 任务数据[主任务id].队伍组
  任务数据[主任务id]=nil
  for i=1,#id组 do
    if 玩家数据[id组[i]] then
      玩家数据[id组[i]].角色:取消任务(2591)
      玩家数据[id组[i]].角色:刷新任务跟踪()
      if 玩家数据[id组[i]].战斗 ~= 0 and ((战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==180142 or (战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==180143 or (战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==180144 or (战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==180145 or (战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==180146 or (战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==180147 or (战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==180148 or (战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==180149 or (战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==180150) then
        战斗准备类.战斗盒子[玩家数据[id组[i]].战斗]:结束战斗(0,0,1)
      end
    end
  end
  for i in pairs(任务数据) do
    if (任务数据[i].类型 >=2591 and 任务数据[i].类型 <=2597) and 任务数据[i].副本id == 副本id then
      if 任务数据[i].地图编号 and 任务数据[i].单位编号 then
        地图处理类:删除单位(任务数据[i].地图编号,任务数据[i].单位编号)
      end
      任务数据[i]=nil
    end
  end
end
function 人族青丘秘辛失败(任务id)
  if os.time()-任务数据[任务id].起始>=任务数据[任务id].结束 and 任务数据[任务id].结束 ~= 99999999 then
    if 任务数据[任务id].zhandou~=true then  --未进入战斗状态
      if  任务数据[任务id].类型== 2591 then
        for i=1,#任务数据[任务id].队伍组 do
          if 玩家数据[任务数据[任务id].队伍组[i]] ~= nil then
            玩家数据[任务数据[任务id].队伍组[i]].角色:取消任务(玩家数据[任务数据[任务id].队伍组[i]].角色:取任务(2591))
            刷新队伍任务追踪(任务数据[任务id].队伍组[i])
          end
        end
        任务数据[任务id]=nil
      else
        任务处理类:删除单位(任务id)
      end
    end
  end
end
function 人族_青丘秘辛:完成人族_青丘秘辛任务(id组,任务id,战斗类型)

  local 奖励
  if 任务数据[任务id] then
    local 副本id=任务数据[任务id].副本id
    local 进度刷新=false
    for i=1,#id组 do
      local id = id组[i]
      local 等级 = 玩家数据[id].角色.等级
      if 战斗类型==180143 then --
		  local 等级=玩家数据[id].角色.等级
      local 经验=等级*1200
      local 储备=等级*300+10000
      local 玩家境界 = 时空之钥[id组[1]].境界*0.5
    玩家数据[id].角色:添加经验(玩家境界*经验*HDPZ["人族_青丘秘辛"].经验,"人族_青丘秘辛",1)
    玩家数据[id].角色:添加银子(玩家境界*储备*HDPZ["人族_青丘秘辛"].银子,"人族_青丘秘辛",1)
    if 取随机数()<=HDPZ["人族_青丘秘辛"].爆率+(玩家境界*5) then

      local 链接 = {提示=format("#S(人族_青丘秘辛)#Y在青丘秘辛内表现卓越！#G/%s#Y获得了奖励",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
              local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["人族_青丘秘辛"].ITEM),"人族_青丘秘辛")
              if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
              else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
       end
    end
      elseif 战斗类型==180144 then --
      local 等级=玩家数据[id].角色.等级
      local 经验=等级*1200
      local 储备=等级*300+10000
      local 玩家境界 = 时空之钥[id组[1]].境界*0.5
    玩家数据[id].角色:添加经验(玩家境界*经验*HDPZ["人族_青丘秘辛"].经验,"人族_青丘秘辛",1)
    玩家数据[id].角色:添加银子(玩家境界*储备*HDPZ["人族_青丘秘辛"].银子,"人族_青丘秘辛",1)
    if 取随机数()<=HDPZ["人族_青丘秘辛"].爆率+(玩家境界*5) then

      local 链接 = {提示=format("#S(人族_青丘秘辛)#Y在青丘秘辛内表现卓越！#G/%s#Y获得了奖励",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
              local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["人族_青丘秘辛"].ITEM),"人族_青丘秘辛")
              if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
              else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
       end
    end
      elseif 战斗类型==180146 then --
      local 等级=玩家数据[id].角色.等级
      local 经验=等级*1200
      local 储备=等级*300+10000
      local 玩家境界 = 时空之钥[id组[1]].境界*0.5
    玩家数据[id].角色:添加经验(玩家境界*经验*HDPZ["人族_青丘秘辛"].经验,"人族_青丘秘辛",1)
    玩家数据[id].角色:添加银子(玩家境界*储备*HDPZ["人族_青丘秘辛"].银子,"人族_青丘秘辛",1)
    if 取随机数()<=HDPZ["人族_青丘秘辛"].爆率+(玩家境界*5) then

      local 链接 = {提示=format("#S(人族_青丘秘辛)#Y在青丘秘辛内表现卓越！#G/%s#Y获得了奖励",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
              local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["人族_青丘秘辛"].ITEM),"人族_青丘秘辛")
              if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
              else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
       end
    end
      elseif 战斗类型==180148 then --
      local 等级=玩家数据[id].角色.等级
      local 经验=等级*1200
      local 储备=等级*300+10000
      local 玩家境界 = 时空之钥[id组[1]].境界*0.5
    玩家数据[id].角色:添加经验(玩家境界*经验*HDPZ["人族_青丘秘辛"].经验,"人族_青丘秘辛",1)
    玩家数据[id].角色:添加银子(玩家境界*储备*HDPZ["人族_青丘秘辛"].银子,"人族_青丘秘辛",1)
    if 取随机数()<=HDPZ["人族_青丘秘辛"].爆率+(玩家境界*5) then

      local 链接 = {提示=format("#S(人族_青丘秘辛)#Y在青丘秘辛内表现卓越！#G/%s#Y获得了奖励",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
              local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["人族_青丘秘辛"].ITEM),"人族_青丘秘辛")
              if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
              else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
       end
    end
      elseif 战斗类型==180149 then --
      local 等级=玩家数据[id].角色.等级
      local 经验=等级*1200
      local 储备=等级*300+10000
      local 玩家境界 = 时空之钥[id组[1]].境界*0.5
    玩家数据[id].角色:添加经验(玩家境界*经验*HDPZ["人族_青丘秘辛"].经验,"人族_青丘秘辛",1)
    玩家数据[id].角色:添加银子(玩家境界*储备*HDPZ["人族_青丘秘辛"].银子,"人族_青丘秘辛",1)
    if 取随机数()<=HDPZ["人族_青丘秘辛"].爆率+(玩家境界*5) then

      local 链接 = {提示=format("#S(人族_青丘秘辛)#Y在青丘秘辛内表现卓越！#G/%s#Y获得了奖励",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
              local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["人族_青丘秘辛"].ITEM),"人族_青丘秘辛")
              if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
              else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
       end
    end
      elseif 战斗类型==180150 then --
      local 等级=玩家数据[id].角色.等级
      local 经验=等级*1200
      local 储备=等级*300+10000
      local 玩家境界 = 时空之钥[id组[1]].境界*0.5
      local 时空积分=qz(时空之钥[id组[1]].境界*10)
      玩家数据[id].角色:添加人族时空积分(时空积分)
    玩家数据[id].角色:添加经验(玩家境界*经验*HDPZ["人族_青丘秘辛"].经验,"人族_青丘秘辛",1)
    玩家数据[id].角色:添加银子(玩家境界*储备*HDPZ["人族_青丘秘辛"].银子,"人族_青丘秘辛",1)
    if 取随机数()<=HDPZ["人族_青丘秘辛"].爆率+(玩家境界*5) then

      local 链接 = {提示=format("#S(人族_青丘秘辛)#Y在青丘秘辛内表现卓越！#G/%s#Y获得了奖励",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
              local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["人族_青丘秘辛"].ITEM),"人族_青丘秘辛")
              if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
              else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
       end
    end
      end
    end
    if 战斗类型==180143 then
      时空之钥[副本id].人族.青丘秘辛.进行.小蜜蜂=时空之钥[副本id].人族.青丘秘辛.进行.小蜜蜂+1
      if 时空之钥[副本id].人族.青丘秘辛.进行.小蜜蜂 == 1 then
        时空之钥[副本id].人族.青丘秘辛.进行.进程=2
        self:设置人族青丘秘辛副本(副本id)
        进度刷新=true
        玩家数据[id组[1]].zhandou=0
      end
    elseif 战斗类型==180144 then
      时空之钥[副本id].人族.青丘秘辛.进行.兽变妖狐=时空之钥[副本id].人族.青丘秘辛.进行.兽变妖狐+1
      if 时空之钥[副本id].人族.青丘秘辛.进行.兽变妖狐 == 1 then
        时空之钥[副本id].人族.青丘秘辛.进行.进程=3
        self:设置人族青丘秘辛副本(副本id)
        进度刷新=true
        玩家数据[id组[1]].zhandou=0
      end
    elseif 战斗类型==180146 then
      时空之钥[副本id].人族.青丘秘辛.进行.入侵妖魔=时空之钥[副本id].人族.青丘秘辛.进行.入侵妖魔+1
      if 时空之钥[副本id].人族.青丘秘辛.进行.入侵妖魔 == 1 then
        时空之钥[副本id].人族.青丘秘辛.进行.进程=4
        self:设置人族青丘秘辛副本(副本id)
        进度刷新=true
        玩家数据[id组[1]].zhandou=0
      end
    elseif 战斗类型==180148 then
      时空之钥[副本id].人族.青丘秘辛.进行.兽变阿宝=时空之钥[副本id].人族.青丘秘辛.进行.兽变阿宝+1
      if 时空之钥[副本id].人族.青丘秘辛.进行.兽变阿宝 == 1 then
        时空之钥[副本id].人族.青丘秘辛.进行.进程=5
        self:设置人族青丘秘辛副本(副本id)
        进度刷新=true
        玩家数据[id组[1]].zhandou=0
      end
    elseif 战斗类型==180149 then
      时空之钥[副本id].人族.青丘秘辛.进行.静影沉璧=时空之钥[副本id].人族.青丘秘辛.进行.静影沉璧+1
      if 时空之钥[副本id].人族.青丘秘辛.进行.静影沉璧 == 1 then
        时空之钥[副本id].人族.青丘秘辛.进行.进程=6
        self:设置人族青丘秘辛副本(副本id)
        进度刷新=true
        玩家数据[id组[1]].zhandou=0
      end
    elseif 战斗类型==180150 then
      local id组 = 任务数据[时空之钥[副本id].人族.青丘秘辛.进行.主任务id].队伍组
      for i=1,#id组 do
        if 玩家数据[id组[i]] then
          玩家数据[id组[i]].zhandou=0
          地图处理类:跳转地图(id组[i],1001,358,35)
        end
      end
        if 玩家数据[id组[1]] then
          时空之钥[id组[1]].境界=时空之钥[id组[1]].境界+1
          玩家数据[id组[1]].道具:更改时空之钥(id组[1])
          常规提示(id组[1],"#Y/恭喜你们完成人族青丘秘辛副本")
          添加最后对话(id组[1],format("恭喜你成功通过秘境，秘境境界发生了变化，下次秘境难度上升！"))
        end
     self:结束人族青丘秘辛副本(任务id)
      return
    end
    local id组 = 任务数据[时空之钥[副本id].人族.青丘秘辛.进行.主任务id].队伍组
    for i=1,#id组 do
      if 玩家数据[id组[i]] then
        玩家数据[id组[i]].角色:刷新任务跟踪()
        if 进度刷新 then
          常规提示(id组[i],"#Y/您的副本进度已经更新")
        end
      end
    end
    if 任务数据[任务id] and 任务数据[任务id].地图编号 and 任务数据[任务id].单位编号 then
      地图处理类:删除单位(任务数据[任务id].地图编号,任务数据[任务id].单位编号)
    end
    任务数据[任务id]=nil
  end
end
function 人族_青丘秘辛:任务说明(玩家id,任务id)
  local 说明 = {}
  local 副本id=任务数据[任务id].副本id
    if 时空之钥[副本id]==nil then  ----------佬伍修改（修复种族秘境时空之钥）
    return
    end
  if 时空之钥[副本id].人族.青丘秘辛.进行==nil then
    说明={"人族·青丘秘辛","#L您的副本已经完成"}
  else
    local 进程=时空之钥[副本id].人族.青丘秘辛.进行.进程
    local 数量=时空之钥[副本id].人族.青丘秘辛.进行.数量
    local 序列=时空之钥[副本id].人族.青丘秘辛.进行.序列
    if 进程==1 then
        说明={"人族·青丘秘辛",format("#L击败".."#Y/qqq|小蜜蜂*10046*临时npc*70*186/小蜜蜂".."#L，#Y/%s#W/层境界。(第1场，共6场)(任务剩余时间#R/%s#W/分钟)。",时空之钥[副本id].境界,取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
    elseif 进程==2 then
        说明={"人族·青丘秘辛",format("#L击败".."#Y/qqq|兽变妖狐*10046*临时npc*41*157/兽变妖狐".."#L，#Y/%s#W/层境界。(第2场，共6场)(任务剩余时间#R/%s#W/分钟)。",时空之钥[副本id].境界,取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
    elseif 进程==3 then
        说明={"人族·青丘秘辛",format("#L击败".."#Y/qqq|入侵妖魔*10046*临时npc*79*153/入侵妖魔".."#L，#Y/%s#W/层境界。(第3场，共6场)(任务剩余时间#R/%s#W/分钟)。",时空之钥[副本id].境界,取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
    elseif 进程==4 then
        说明={"人族·青丘秘辛",format("#L击败".."#Y/qqq|兽变阿宝*10046*临时npc*100*128/兽变阿宝".."#L，#Y/%s#W/层境界。(第4场，共6场)(任务剩余时间#R/%s#W/分钟)。",时空之钥[副本id].境界,取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
    elseif 进程==5 then
        说明={"人族·青丘秘辛",format("#L击败".."#Y/qqq|静影沉璧*10046*临时npc*65*129/静影沉璧".."#L，#Y/%s#W/层境界。(第5场，共6场)(任务剩余时间#R/%s#W/分钟)。",时空之钥[副本id].境界,取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
    elseif 进程==6 then
        说明={"人族·青丘秘辛",format("#L击败".."#Y/qqq|涂山雪*10046*临时npc*17*106/涂山雪".."#L，#Y/%s#W/层境界。(第6场，共6场)(任务剩余时间#R/%s#W/分钟)。",时空之钥[副本id].境界,取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
    end
  end
  return 说明
end
return 人族_青丘秘辛