-- @Author: baidwwy
-- @Date:   2023-09-10 04:41:22
-- @Last 光唏蜀黍QQ:29582348
-- @Last Modified time: 2025-12-13 22:17:20
local 仙族_万雷神殿 = class()
function 仙族_万雷神殿:初始化()
	地图处理类.地图数据[10037]={npc={},单位={},传送圈={}}
	地图处理类.地图玩家[10037]={}
	地图处理类.地图坐标[10037]=地图处理类.地图坐标[1111]
	地图处理类.地图单位[10037]={}
	地图处理类.单位编号[10037]=1000
end
function 仙族_万雷神殿:取仙族_万雷神殿境界相同(id)
    local 玩家境界 = 时空之钥[id] and 时空之钥[id].境界
    if not 玩家境界 then
        添加最后对话(id, "你的境界数据尚未记录。")
        return false
    end
    if 玩家数据[id].队伍 ~= 0 then
        local 境界相同 = true
        for i = 1, #队伍数据[玩家数据[id].队伍].成员数据 do
            local lsid = 队伍数据[玩家数据[id].队伍].成员数据[i]
            if lsid ~= id then
                local 队员境界 = 时空之钥[lsid] and 时空之钥[lsid].境界
                if not 队员境界 then
                    添加最后对话(id, 玩家数据[lsid].角色.名称 .. "的境界数据尚未记录。")
                    境界相同 = false
                    break
                elseif 队员境界 ~= 玩家境界 then
                    添加最后对话(id, 玩家数据[lsid].角色.名称 .. "的境界与你不同。")
                    境界相同 = false
                    break
                end
            end
        end
        if 境界相同 then
            --添加最后对话(id, "你与队伍成员的境界相同。")
            return true
        else
            return false
        end
    else
        --添加最后对话(id, "你当前不在队伍中。")
        return false
    end
end
function 仙族_万雷神殿:开启仙族_万雷神殿副本(id)
  if 玩家数据[id].队伍==0 or 玩家数据[id].队长==false  then
    常规提示(id,"#Y/该任务必须组队完成且由队长领取")
    return
  elseif 取队伍人数(id)<1 then
    常规提示(id,"#Y此副本要求队伍人数不低于5人")
    return
  elseif  取等级要求(id,60)==false then
    常规提示(id,"#Y此副本要求角色等级不能低于60级")
    return
  -- elseif self:取仙族_万雷神殿境界相同(id)==false then
  --  -- 常规提示(id,玩家数据[id].角色.名称 .. "的境界与你不同。")
  --   return
  elseif 取队员任务存在(玩家数据[id].队伍,2549) then
    常规提示(id,"#Y/队伍中已有队员正在进行该副本任,无法领取新的副本")
    return
  end
  local 任务id=id.."_2549_"..os.time().."_"..随机序列.."_"..取随机数(1,999)
  时空之钥[id].仙族.万雷神殿.进行={进程=1,主任务id=任务id}
  self:设置仙族万雷神殿副本(id)
  任务数据[任务id]={
    id=任务id,
    起始=os.time(),
    结束=7200,
    玩家id={},
    队伍组={},
    副本id=id,
    类型=2549
  }
  local 队伍id=玩家数据[id].队伍
  for n=1,#队伍数据[队伍id].成员数据 do
    local 临时id=队伍数据[队伍id].成员数据[n]
      任务数据[任务id].队伍组[#任务数据[任务id].队伍组+1]=临时id
      玩家数据[临时id].角色:添加任务(任务id)
      任务处理类:副本传送(临时id,25)
      常规提示(临时id,"#Y你开启了仙族万雷神殿副本")
      常规提示(临时id,"#Y此乃天庭雷部，何人胆敢闯入，欲行大逆之举！")
  end
end
function 仙族_万雷神殿:设置仙族万雷神殿副本(id)
  local 地图=0
  local 随机名称={}
  local 随机模型={}
  if 时空之钥[id].仙族.万雷神殿.进行.进程==1 then
    时空之钥[id].仙族.万雷神殿.进行.殿前雷将=0
    local 任务id=id.."_2550_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
    地图=10037
    任务数据[任务id]={
      id=任务id,
      起始=os.time(),
      结束=7200,
      玩家id=id,
      队伍组={},
      名称="殿前雷将",
      模型="偃无师",
      角色=true,
      x=36,
      y=85,
      方向=5,
      副本id=id,
      地图编号=地图,
      地图名称=取地图名称(地图),
      类型=2550
    }
    地图处理类:添加单位(任务id)
 elseif 时空之钥[id].仙族.万雷神殿.进行.进程==2 then
    时空之钥[id].仙族.万雷神殿.进行.应龙=0
    local 任务id=id.."_2551_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
    地图=10037
    任务数据[任务id]={
      id=任务id,
      起始=os.time(),
      结束=7200,
      玩家id=id,
      队伍组={},
      名称="应龙",
      模型="虬龙",
      染色方案=0,
      染色组={[1]=1,[2]=0},
      x=59,
      y=95,
      方向=1,
      副本id=id,
      地图编号=地图,
      地图名称=取地图名称(地图),
      类型=2551
    }
    地图处理类:添加单位(任务id)
  elseif 时空之钥[id].仙族.万雷神殿.进行.进程==3 then
    时空之钥[id].仙族.万雷神殿.进行.雷火双姝=0
    local 任务id=id.."_2552_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
    地图=10037
    任务数据[任务id]={
      id=任务id,
      起始=os.time(),
      结束=7200,
      玩家id=id,
      队伍组={},
      名称="雷火双姝",
      模型="飞燕女",
      武器 ="赤焰双剑",
      武器等级 =60,
      x=35,
      y=105,
      方向=0,
      副本id=id,
      地图编号=地图,
      地图名称=取地图名称(地图),
      类型=2552
    }
    地图处理类:添加单位(任务id)
  elseif 时空之钥[id].仙族.万雷神殿.进行.进程==4 then
    时空之钥[id].仙族.万雷神殿.进行.狂雷风暴=0
    local 任务id=id.."_2553_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
    地图=10037
    任务数据[任务id]={
      id=任务id,
      起始=os.time(),
      结束=7200,
      玩家id=id,
      队伍组={},
      名称="狂雷风暴",
      模型="进阶风伯",
      染色方案=0,
      染色组={[1]=1,[2]=0},
      x=49,
      y=124,
      方向=1,
      副本id=id,
      地图编号=地图,
      地图名称=取地图名称(地图),
      类型=2553
    }
    地图处理类:添加单位(任务id)
  elseif 时空之钥[id].仙族.万雷神殿.进行.进程==5 then
    时空之钥[id].仙族.万雷神殿.进行.雷震子=0
    local 任务id=id.."_2554_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
    地图=10037
    任务数据[任务id]={
      id=任务id,
      起始=os.time(),
      结束=7200,
      玩家id=id,
      队伍组={},
      名称="雷震子",
      模型="进阶雷鸟人",
      染色方案=0,
      染色组={[1]=1,[2]=0},
      x=82,
      y=126,
      方向=0,
      副本id=id,
      地图编号=地图,
      地图名称=取地图名称(地图),
      类型=2554
    }
    地图处理类:添加单位(任务id)
  elseif 时空之钥[id].仙族.万雷神殿.进行.进程==6 then
    时空之钥[id].仙族.万雷神殿.进行.应元天尊=0
    local 任务id=id.."_2555_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
    地图=10037
    任务数据[任务id]={
      id=任务id,
      起始=os.time(),
      结束=7200,
      玩家id=id,
      队伍组={},
      名称="应元天尊",
      模型="逍遥生",
      武器 ="星瀚",
      武器等级 =160,
      x=47,
      y=152,
      方向=0,
      副本id=id,
      地图编号=地图,
      地图名称=取地图名称(地图),
      类型=2555
    }
    地图处理类:添加单位(任务id)

  end
end

__GWdh111[2550]=function(连接id,数字id,序列,标识,地图)
  local 对话数据={}
  对话数据.模型=任务数据[标识].模型
  对话数据.名称=任务数据[标识].名称

  if 任务数据[标识].zhandou==nil then
    local 副本id=任务数据[标识].副本id
    if 玩家数据[数字id].队伍==0 then 常规提示(数字id,"#Y请组队完成！") return   end
    if (任务数据[玩家数据[数字id].角色:取任务(2549)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
    任务数据[标识].zhandou=true
    战斗准备类:创建战斗(数字id+0,180068,标识)
    玩家数据[数字id].地图单位=nil
    return
  else
    对话数据.对话="我正在战斗中，请勿打扰。"
  end
  return 对话数据
end
__GWdh111[2551]=function(连接id,数字id,序列,标识,地图)
  local 对话数据={}
  对话数据.模型=任务数据[标识].模型
  对话数据.名称=任务数据[标识].名称

  if 任务数据[标识].zhandou==nil then
    local 副本id=任务数据[标识].副本id
    if 玩家数据[数字id].队伍==0 then 常规提示(数字id,"#Y请组队完成！") return   end
    if (任务数据[玩家数据[数字id].角色:取任务(2549)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
    任务数据[标识].zhandou=true
    战斗准备类:创建战斗(数字id+0,180071,标识)
    玩家数据[数字id].地图单位=nil
    return
  else
    对话数据.对话="我正在战斗中，请勿打扰。"
  end
  return 对话数据
end
__GWdh111[2552]=function(连接id,数字id,序列,标识,地图)
  local 对话数据={}
  对话数据.模型=任务数据[标识].模型
  对话数据.名称=任务数据[标识].名称

  if 任务数据[标识].zhandou==nil then
    local 副本id=任务数据[标识].副本id
    if 玩家数据[数字id].队伍==0 then 常规提示(数字id,"#Y请组队完成！") return   end
    if (任务数据[玩家数据[数字id].角色:取任务(2549)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
    任务数据[标识].zhandou=true
    战斗准备类:创建战斗(数字id+0,180072,标识)
    玩家数据[数字id].地图单位=nil
    return
  else
    对话数据.对话="我正在战斗中，请勿打扰。"
  end
  return 对话数据
end
__GWdh111[2553]=function(连接id,数字id,序列,标识,地图)
  local 对话数据={}
  对话数据.模型=任务数据[标识].模型
  对话数据.名称=任务数据[标识].名称

  if 任务数据[标识].zhandou==nil then
    local 副本id=任务数据[标识].副本id
    if 玩家数据[数字id].队伍==0 then 常规提示(数字id,"#Y请组队完成！") return   end
    if (任务数据[玩家数据[数字id].角色:取任务(2549)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
    任务数据[标识].zhandou=true
    战斗准备类:创建战斗(数字id+0,180074,标识)
    玩家数据[数字id].地图单位=nil
    return
  else
    对话数据.对话="我正在战斗中，请勿打扰。"
  end
  return 对话数据
end
__GWdh111[2554]=function(连接id,数字id,序列,标识,地图)
  local 对话数据={}
  对话数据.模型=任务数据[标识].模型
  对话数据.名称=任务数据[标识].名称

  if 任务数据[标识].zhandou==nil then
    local 副本id=任务数据[标识].副本id
    if 玩家数据[数字id].队伍==0 then 常规提示(数字id,"#Y请组队完成！") return   end
    if (任务数据[玩家数据[数字id].角色:取任务(2549)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
    任务数据[标识].zhandou=true
    战斗准备类:创建战斗(数字id+0,180076,标识)
    玩家数据[数字id].地图单位=nil
    return
  else
    对话数据.对话="我正在战斗中，请勿打扰。"
  end
  return 对话数据
end
__GWdh111[2555]=function(连接id,数字id,序列,标识,地图)
  local 对话数据={}
  对话数据.模型=任务数据[标识].模型
  对话数据.名称=任务数据[标识].名称

  if 任务数据[标识].zhandou==nil then
    local 副本id=任务数据[标识].副本id
    if 玩家数据[数字id].队伍==0 then 常规提示(数字id,"#Y请组队完成！") return   end
    if (任务数据[玩家数据[数字id].角色:取任务(2549)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
    任务数据[标识].zhandou=true
    战斗准备类:创建战斗(数字id+0,180077,标识)
    玩家数据[数字id].地图单位=nil
    return
  else
    对话数据.对话="我正在战斗中，请勿打扰。"
  end
  return 对话数据
end
function 仙族_万雷神殿:结束仙族万雷神殿副本(任务id)
  local 副本id = 任务数据[任务id].副本id
  local 主任务id = 时空之钥[副本id].仙族.万雷神殿.进行.主任务id
  时空之钥[副本id].仙族.万雷神殿.进行=nil
  local id组 = 任务数据[主任务id].队伍组
  任务数据[主任务id]=nil
  for i=1,#id组 do
    if 玩家数据[id组[i]] then
      玩家数据[id组[i]].角色:取消任务(2549)
      玩家数据[id组[i]].角色:刷新任务跟踪()
      if 玩家数据[id组[i]].战斗 ~= 0 and ((战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==180077  or (战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==180068 or (战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==180069 or (战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==180070 or (战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==180071 or (战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==180072 or (战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==180073 or (战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==180074 or (战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==180075 or (战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==180076) then
        战斗准备类.战斗盒子[玩家数据[id组[i]].战斗]:结束战斗(0,0,1)
      end
    end
  end
  for i in pairs(任务数据) do
    if (任务数据[i].类型 >=2549 and 任务数据[i].类型 <=2555) and 任务数据[i].副本id == 副本id then
      if 任务数据[i].地图编号 and 任务数据[i].单位编号 then
        地图处理类:删除单位(任务数据[i].地图编号,任务数据[i].单位编号)
      end
      任务数据[i]=nil
    end
  end
end
function 仙族万雷神殿失败(任务id)
  if os.time()-任务数据[任务id].起始>=任务数据[任务id].结束 and 任务数据[任务id].结束 ~= 99999999 then
    if 任务数据[任务id].zhandou~=true then  --未进入战斗状态
      if  任务数据[任务id].类型== 2549 then
        for i=1,#任务数据[任务id].队伍组 do
          if 玩家数据[任务数据[任务id].队伍组[i]] ~= nil then
            玩家数据[任务数据[任务id].队伍组[i]].角色:取消任务(玩家数据[任务数据[任务id].队伍组[i]].角色:取任务(2549))
            刷新队伍任务追踪(任务数据[任务id].队伍组[i])
          end
        end
        任务数据[任务id]=nil
      else
        任务处理类:删除单位(任务id)
      end
    end
  end
end



function 仙族_万雷神殿:完成仙族_万雷神殿任务(id组,任务id,战斗类型)

  local 奖励
  if 任务数据[任务id] then
    local 副本id=任务数据[任务id].副本id
    local 进度刷新=false
    for i=1,#id组 do
      local id = id组[i]
      local 等级 = 玩家数据[id].角色.等级
      if 战斗类型==180070 then --
		  local 等级=玩家数据[id].角色.等级
      local 经验=等级*1200
      local 储备=等级*300+10000
      local 玩家境界 = 时空之钥[id组[1]].境界*0.5
    玩家数据[id].角色:添加经验(玩家境界*经验*HDPZ["仙族_万雷神殿"].经验,"仙族_万雷神殿",1)
    玩家数据[id].角色:添加银子(玩家境界*储备*HDPZ["仙族_万雷神殿"].银子,"仙族_万雷神殿",1)
    if 取随机数()<=HDPZ["仙族_万雷神殿"].爆率+(玩家境界*5) then

      local 链接 = {提示=format("#S(仙族_万雷神殿)#Y在万雷神殿内表现卓越！#G/%s#Y获得了奖励",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
              local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["仙族_万雷神殿"].ITEM),"仙族_万雷神殿")
              if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
              else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
       end
    end
      elseif 战斗类型==180071 then --
      local 等级=玩家数据[id].角色.等级
      local 经验=等级*1200
      local 储备=等级*300+10000
      local 玩家境界 = 时空之钥[id组[1]].境界*0.5
    玩家数据[id].角色:添加经验(玩家境界*经验*HDPZ["仙族_万雷神殿"].经验,"仙族_万雷神殿",1)
    玩家数据[id].角色:添加银子(玩家境界*储备*HDPZ["仙族_万雷神殿"].银子,"仙族_万雷神殿",1)
    if 取随机数()<=HDPZ["仙族_万雷神殿"].爆率+(玩家境界*5) then

      local 链接 = {提示=format("#S(仙族_万雷神殿)#Y在万雷神殿内表现卓越！#G/%s#Y获得了奖励",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
              local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["仙族_万雷神殿"].ITEM),"仙族_万雷神殿")
              if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
              else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
       end
    end
      elseif 战斗类型==180073 then --
      local 等级=玩家数据[id].角色.等级
      local 经验=等级*1200
      local 储备=等级*300+10000
      local 玩家境界 = 时空之钥[id组[1]].境界*0.5
    玩家数据[id].角色:添加经验(玩家境界*经验*HDPZ["仙族_万雷神殿"].经验,"仙族_万雷神殿",1)
    玩家数据[id].角色:添加银子(玩家境界*储备*HDPZ["仙族_万雷神殿"].银子,"仙族_万雷神殿",1)
    if 取随机数()<=HDPZ["仙族_万雷神殿"].爆率+(玩家境界*5) then

      local 链接 = {提示=format("#S(仙族_万雷神殿)#Y在万雷神殿内表现卓越！#G/%s#Y获得了奖励",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
              local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["仙族_万雷神殿"].ITEM),"仙族_万雷神殿")
              if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
              else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
       end
    end
      elseif 战斗类型==180075 then --
      local 等级=玩家数据[id].角色.等级
      local 经验=等级*1200
      local 储备=等级*300+10000
      local 玩家境界 = 时空之钥[id组[1]].境界*0.5
    玩家数据[id].角色:添加经验(玩家境界*经验*HDPZ["仙族_万雷神殿"].经验,"仙族_万雷神殿",1)
    玩家数据[id].角色:添加银子(玩家境界*储备*HDPZ["仙族_万雷神殿"].银子,"仙族_万雷神殿",1)
    if 取随机数()<=HDPZ["仙族_万雷神殿"].爆率+(玩家境界*5) then

      local 链接 = {提示=format("#S(仙族_万雷神殿)#Y在万雷神殿内表现卓越！#G/%s#Y获得了奖励",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
              local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["仙族_万雷神殿"].ITEM),"仙族_万雷神殿")
              if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
              else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
       end
    end
      elseif 战斗类型==180076 then --
      local 等级=玩家数据[id].角色.等级
      local 经验=等级*1200
      local 储备=等级*300+10000
      local 玩家境界 = 时空之钥[id组[1]].境界*0.5
    玩家数据[id].角色:添加经验(玩家境界*经验*HDPZ["仙族_万雷神殿"].经验,"仙族_万雷神殿",1)
    玩家数据[id].角色:添加银子(玩家境界*储备*HDPZ["仙族_万雷神殿"].银子,"仙族_万雷神殿",1)
    if 取随机数()<=HDPZ["仙族_万雷神殿"].爆率+(玩家境界*5) then

      local 链接 = {提示=format("#S(仙族_万雷神殿)#Y在万雷神殿内表现卓越！#G/%s#Y获得了奖励",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
              local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["仙族_万雷神殿"].ITEM),"仙族_万雷神殿")
              if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
              else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
       end
    end
      elseif 战斗类型==180077 then --
      local 等级=玩家数据[id].角色.等级
      local 经验=等级*1200
      local 储备=等级*300+10000
      local 玩家境界 = 时空之钥[id组[1]].境界*0.5
      local 时空积分=qz(时空之钥[id组[1]].境界*10)
      玩家数据[id].角色:添加仙族时空积分(时空积分)
    玩家数据[id].角色:添加经验(玩家境界*经验*HDPZ["仙族_万雷神殿"].经验,"仙族_万雷神殿",1)
    玩家数据[id].角色:添加银子(玩家境界*储备*HDPZ["仙族_万雷神殿"].银子,"仙族_万雷神殿",1)
    if 取随机数()<=HDPZ["仙族_万雷神殿"].爆率+(玩家境界*5) then

      local 链接 = {提示=format("#S(仙族_万雷神殿)#Y在万雷神殿内表现卓越！#G/%s#Y获得了奖励",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
              local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["仙族_万雷神殿"].ITEM),"仙族_万雷神殿")
              if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
              else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
       end
    end
      end
    end



    if 战斗类型==180070 then
      时空之钥[副本id].仙族.万雷神殿.进行.殿前雷将=时空之钥[副本id].仙族.万雷神殿.进行.殿前雷将+1
      if 时空之钥[副本id].仙族.万雷神殿.进行.殿前雷将== 1 then
        时空之钥[副本id].仙族.万雷神殿.进行.进程=2
        self:设置仙族万雷神殿副本(副本id)
        进度刷新=true
        玩家数据[id组[1]].zhandou=0
      end
    elseif 战斗类型==180071 then
      时空之钥[副本id].仙族.万雷神殿.进行.应龙=时空之钥[副本id].仙族.万雷神殿.进行.应龙+1
      if 时空之钥[副本id].仙族.万雷神殿.进行.应龙 == 1 then
        时空之钥[副本id].仙族.万雷神殿.进行.进程=3
        self:设置仙族万雷神殿副本(副本id)
        进度刷新=true
        玩家数据[id组[1]].zhandou=0
      end
    elseif 战斗类型==180073 then
      时空之钥[副本id].仙族.万雷神殿.进行.雷火双姝=时空之钥[副本id].仙族.万雷神殿.进行.雷火双姝+1
      if 时空之钥[副本id].仙族.万雷神殿.进行.雷火双姝 == 1 then
        时空之钥[副本id].仙族.万雷神殿.进行.进程=4
        self:设置仙族万雷神殿副本(副本id)
        进度刷新=true
        玩家数据[id组[1]].zhandou=0
      end
    elseif 战斗类型==180075 then
      时空之钥[副本id].仙族.万雷神殿.进行.狂雷风暴=时空之钥[副本id].仙族.万雷神殿.进行.狂雷风暴+1
      if 时空之钥[副本id].仙族.万雷神殿.进行.狂雷风暴 == 1 then
        时空之钥[副本id].仙族.万雷神殿.进行.进程=5
        self:设置仙族万雷神殿副本(副本id)
        进度刷新=true
        玩家数据[id组[1]].zhandou=0
      end
    elseif 战斗类型==180076 then
      时空之钥[副本id].仙族.万雷神殿.进行.雷震子=时空之钥[副本id].仙族.万雷神殿.进行.雷震子+1
      if 时空之钥[副本id].仙族.万雷神殿.进行.雷震子 == 1 then
        时空之钥[副本id].仙族.万雷神殿.进行.进程=6
        self:设置仙族万雷神殿副本(副本id)
        进度刷新=true
        玩家数据[id组[1]].zhandou=0
      end
    elseif 战斗类型==180077 then
      local id组 = 任务数据[时空之钥[副本id].仙族.万雷神殿.进行.主任务id].队伍组
      for i=1,#id组 do
        if 玩家数据[id组[i]] then
          玩家数据[id组[i]].zhandou=0
          地图处理类:跳转地图(id组[i],1001,358,35)
        end
     end
        if 玩家数据[id组[1]] then
          时空之钥[id组[1]].境界=时空之钥[id组[1]].境界+1
          玩家数据[id组[1]].道具:更改时空之钥(id组[1])
          常规提示(id组[1],"#Y/恭喜你们完成仙族万雷神殿副本")
          添加最后对话(id组[1],format("恭喜你成功通过秘境，秘境境界发生了变化，下次秘境难度上升！"))
        end
     self:结束仙族万雷神殿副本(任务id)
      return
    end
    local id组 = 任务数据[时空之钥[副本id].仙族.万雷神殿.进行.主任务id].队伍组
    for i=1,#id组 do
      if 玩家数据[id组[i]] then
        玩家数据[id组[i]].角色:刷新任务跟踪()
        if 进度刷新 then
          常规提示(id组[i],"#Y/您的副本进度已经更新")
        end
      end
    end
    if 任务数据[任务id] and 任务数据[任务id].地图编号 and 任务数据[任务id].单位编号 then
      地图处理类:删除单位(任务数据[任务id].地图编号,任务数据[任务id].单位编号)
    end
    任务数据[任务id]=nil
  end
end
function 仙族_万雷神殿:任务说明(玩家id,任务id)
  local 说明 = {}
  local 副本id=任务数据[任务id].副本id
    if 时空之钥[副本id]==nil then  ----------佬伍修改（修复种族秘境时空之钥）
    return
    end
  if 时空之钥[副本id].仙族.万雷神殿.进行==nil then
    说明={"仙族·万雷神殿","#L您的副本已经完成"}
  else
    local 进程=时空之钥[副本id].仙族.万雷神殿.进行.进程
    local 数量=时空之钥[副本id].仙族.万雷神殿.进行.数量
    local 序列=时空之钥[副本id].仙族.万雷神殿.进行.序列
    if 进程==1 then
        说明={"仙族·万雷神殿",format("#L击败".."#Y/qqq|殿前雷将*10037*临时npc*36*85/殿前雷将".."#L，#Y/%s#W/层境界。(第1场，共6场)(任务剩余时间#R/%s#W/分钟)。",时空之钥[副本id].境界,取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
    elseif 进程==2 then
        说明={"仙族·万雷神殿",format("#L击败".."#Y/qqq|应龙*10037*临时npc*59*95/应龙".."#L，#Y/%s#W/层境界。(第2场，共6场)(任务剩余时间#R/%s#W/分钟)。",时空之钥[副本id].境界,取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
    elseif 进程==3 then
        说明={"仙族·万雷神殿",format("#L击败".."#Y/qqq|雷火双姝*10037*临时npc*30*105/雷火双姝".."#L，#Y/%s#W/层境界。(第3场，共6场)(任务剩余时间#R/%s#W/分钟)。",时空之钥[副本id].境界,取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
    elseif 进程==4 then
        说明={"仙族·万雷神殿",format("#L击败".."#Y/qqq|狂雷风暴*10037*临时npc*49*124/狂雷风暴".."#L，#Y/%s#W/层境界。(第4场，共6场)(任务剩余时间#R/%s#W/分钟)。",时空之钥[副本id].境界,取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
    elseif 进程==5 then
        说明={"仙族·万雷神殿",format("#L击败".."#Y/qqq|雷震子*10037*临时npc*82*126/雷震子".."#L，#Y/%s#W/层境界。(第5场，共6场)(任务剩余时间#R/%s#W/分钟)。",时空之钥[副本id].境界,取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
    elseif 进程==6 then
        说明={"仙族·万雷神殿",format("#L击败".."#Y/qqq|应元天尊*10037*临时npc*47*152/应元天尊".."#L，#Y/%s#W/层境界。(第6场，共6场)(任务剩余时间#R/%s#W/分钟)。",时空之钥[副本id].境界,取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
    end
  end
  return 说明
end
return 仙族_万雷神殿