-- @Author: baidwwy
-- @Date:   2023-09-10 04:41:22
-- @Last 光唏蜀黍QQ:29582348
-- @Last Modified time: 2025-12-13 22:17:53
local 仙族_大闹天宫 = class()
function 仙族_大闹天宫:初始化()
	地图处理类.地图数据[10043]={npc={},单位={},传送圈={}}
	地图处理类.地图玩家[10043]={}
	地图处理类.地图坐标[10043]=地图处理类.地图坐标[1116]
	地图处理类.地图单位[10043]={}
	地图处理类.单位编号[10043]=1000

  地图处理类.地图数据[10044]={npc={},单位={},传送圈={}}
  地图处理类.地图玩家[10044]={}
  地图处理类.地图坐标[10044]=地图处理类.地图坐标[1231]
  地图处理类.地图单位[10044]={}
  地图处理类.单位编号[10044]=1000

  地图处理类.地图数据[10045]={npc={},单位={},传送圈={}}
  地图处理类.地图玩家[10045]={}
  地图处理类.地图坐标[10045]=地图处理类.地图坐标[1111]
  地图处理类.地图单位[10045]={}
  地图处理类.单位编号[10045]=1000
end
function 仙族_大闹天宫:取仙族_大闹天宫境界相同(id)
    local 玩家境界 = 时空之钥[id] and 时空之钥[id].境界
    if not 玩家境界 then
        添加最后对话(id, "你的境界数据尚未记录。")
        return false
    end
    if 玩家数据[id].队伍 ~= 0 then
        local 境界相同 = true
        for i = 1, #队伍数据[玩家数据[id].队伍].成员数据 do
            local lsid = 队伍数据[玩家数据[id].队伍].成员数据[i]
            if lsid ~= id then
                local 队员境界 = 时空之钥[lsid] and 时空之钥[lsid].境界
                if not 队员境界 then
                    添加最后对话(id, 玩家数据[lsid].角色.名称 .. "的境界数据尚未记录。")
                    境界相同 = false
                    break
                elseif 队员境界 ~= 玩家境界 then
                    添加最后对话(id, 玩家数据[lsid].角色.名称 .. "的境界与你不同。")
                    境界相同 = false
                    break
                end
            end
        end
        if 境界相同 then
            --添加最后对话(id, "你与队伍成员的境界相同。")
            return true
        else
            return false
        end
    else
        --添加最后对话(id, "你当前不在队伍中。")
        return false
    end
end
function 仙族_大闹天宫:开启仙族_大闹天宫副本(id)
  if 玩家数据[id].队伍==0 or 玩家数据[id].队长==false  then
    常规提示(id,"#Y/该任务必须组队完成且由队长领取")
    return
  elseif 取队伍人数(id)<1 then
    常规提示(id,"#Y此副本要求队伍人数不低于5人")
    return
  elseif  取等级要求(id,60)==false then
    常规提示(id,"#Y此副本要求角色等级不能低于60级")
    return
  -- elseif self:取仙族_大闹天宫境界相同(id)==false then
  --  -- 常规提示(id,玩家数据[id].角色.名称 .. "的境界与你不同。")
  --   return
  elseif 取队员任务存在(玩家数据[id].队伍,2584) then
    常规提示(id,"#Y/队伍中已有队员正在进行该副本任,无法领取新的副本")
    return
  end
  local 任务id=id.."_2584_"..os.time().."_"..随机序列.."_"..取随机数(1,999)
  时空之钥[id].仙族.大闹天宫.进行={进程=1,主任务id=任务id}
  self:设置仙族大闹天宫副本(id)
  任务数据[任务id]={
    id=任务id,
    起始=os.time(),
    结束=7200,
    玩家id={},
    队伍组={},
    副本id=id,
    类型=2584
  }
  local 队伍id=玩家数据[id].队伍
  for n=1,#队伍数据[队伍id].成员数据 do
    local 临时id=队伍数据[队伍id].成员数据[n]
      任务数据[任务id].队伍组[#任务数据[任务id].队伍组+1]=临时id
      玩家数据[临时id].角色:添加任务(任务id)
      任务处理类:副本传送(临时id,31)
      常规提示(临时id,"#Y你开启了仙族大闹天宫副本")
  end
end
function 仙族_大闹天宫:设置仙族大闹天宫副本(id)
  local 地图=0
  local 随机名称={}
  local 随机模型={}
  if 时空之钥[id].仙族.大闹天宫.进行.进程==1 then
    时空之钥[id].仙族.大闹天宫.进行.守门虾兵=0
    local 任务id=id.."_2585_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
    地图=10043
    任务数据[任务id]={
      id=任务id,
      起始=os.time(),
      结束=7200,
      玩家id=id,
      队伍组={},
      名称="守门虾兵",
      模型="虾兵",
      x=31,
      y=101,
      方向=1,
      副本id=id,
      地图编号=地图,
      地图名称=取地图名称(地图),
      类型=2585
    }
    地图处理类:添加单位(任务id)
 elseif 时空之钥[id].仙族.大闹天宫.进行.进程==2 then
    时空之钥[id].仙族.大闹天宫.进行.龙王之子=0
    local 任务id=id.."_2586_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
    地图=10043
    任务数据[任务id]={
      id=任务id,
      起始=os.time(),
      结束=7200,
      玩家id=id,
      队伍组={},
      名称="龙王之子",
      模型="进阶虬龙",
      x=62,
      y=81,
      方向=1,
      副本id=id,
      地图编号=地图,
      地图名称=取地图名称(地图),
      类型=2586
    }
    地图处理类:添加单位(任务id)
  elseif 时空之钥[id].仙族.大闹天宫.进行.进程==3 then
    时空之钥[id].仙族.大闹天宫.进行.七衣仙女=0
    local 任务id=id.."_2587_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
    地图=10044
    任务数据[任务id]={
      id=任务id,
      起始=os.time(),
      结束=7200,
      玩家id=id,
      队伍组={},
      名称="七衣仙女",
      模型="进阶如意仙子",
      染色方案=64, --粉
      染色组={[1]=1,[2]=0},
      x=21,
      y=35,
      方向=3,
      副本id=id,
      地图编号=地图,
      地图名称=取地图名称(地图),
      类型=2587
    }
    地图处理类:添加单位(任务id)
  elseif 时空之钥[id].仙族.大闹天宫.进行.进程==4 then
    时空之钥[id].仙族.大闹天宫.进行.桃园力士=0
    local 任务id=id.."_2588_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
    地图=10044
    任务数据[任务id]={
      id=任务id,
      起始=os.time(),
      结束=7200,
      玩家id=id,
      队伍组={},
      名称="桃园力士",
      模型="山贼",
      变异=true,
      x=18,
      y=64,
      方向=3,
      副本id=id,
      地图编号=地图,
      地图名称=取地图名称(地图),
      类型=2588
    }
    地图处理类:添加单位(任务id)
  elseif 时空之钥[id].仙族.大闹天宫.进行.进程==5 then
    时空之钥[id].仙族.大闹天宫.进行.土地公公=0
    local 任务id=id.."_2589_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
    地图=10044
    任务数据[任务id]={
      id=任务id,
      起始=os.time(),
      结束=7200,
      玩家id=id,
      队伍组={},
      名称="土地公公",
      模型="火焰山土地",
      x=31,
      y=77,
      方向=3,
      副本id=id,
      地图编号=地图,
      地图名称=取地图名称(地图),
      类型=2589
    }
    地图处理类:添加单位(任务id)
  elseif 时空之钥[id].仙族.大闹天宫.进行.进程==6 then
    时空之钥[id].仙族.大闹天宫.进行.李靖=0
    local 任务id=id.."_2590_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
    地图=10045
    任务数据[任务id]={
      id=任务id,
      起始=os.time(),
      结束=7200,
      玩家id=id,
      队伍组={},
      名称="李靖",
      模型="李靖",
      x=196,
      y=133,
      方向=0,
      副本id=id,
      地图编号=地图,
      地图名称=取地图名称(地图),
      类型=2590
    }
    地图处理类:添加单位(任务id)

  end
end

__GWdh111[2585]=function(连接id,数字id,序列,标识,地图)
  local 对话数据={}
  对话数据.模型=任务数据[标识].模型
  对话数据.名称=任务数据[标识].名称

  if 任务数据[标识].zhandou==nil then
    local 副本id=任务数据[标识].副本id
    if 玩家数据[数字id].队伍==0 then 常规提示(数字id,"#Y请组队完成！") return   end
    if (任务数据[玩家数据[数字id].角色:取任务(2584)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
    任务数据[标识].zhandou=true
    战斗准备类:创建战斗(数字id+0,180133,标识)
    玩家数据[数字id].地图单位=nil
    return
  else
    对话数据.对话="我正在战斗中，请勿打扰。"
  end
  return 对话数据
end
__GWdh111[2586]=function(连接id,数字id,序列,标识,地图)
  local 对话数据={}
  对话数据.模型=任务数据[标识].模型
  对话数据.名称=任务数据[标识].名称

  if 任务数据[标识].zhandou==nil then
    local 副本id=任务数据[标识].副本id
    if 玩家数据[数字id].队伍==0 then 常规提示(数字id,"#Y请组队完成！") return   end
    if (任务数据[玩家数据[数字id].角色:取任务(2584)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
    任务数据[标识].zhandou=true
    战斗准备类:创建战斗(数字id+0,180135,标识)
    玩家数据[数字id].地图单位=nil
    return
  else
    对话数据.对话="我正在战斗中，请勿打扰。"
  end
  return 对话数据
end
__GWdh111[2587]=function(连接id,数字id,序列,标识,地图)
  local 对话数据={}
  对话数据.模型=任务数据[标识].模型
  对话数据.名称=任务数据[标识].名称

  if 任务数据[标识].zhandou==nil then
    local 副本id=任务数据[标识].副本id
    if 玩家数据[数字id].队伍==0 then 常规提示(数字id,"#Y请组队完成！") return   end
    if (任务数据[玩家数据[数字id].角色:取任务(2584)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
    任务数据[标识].zhandou=true
    战斗准备类:创建战斗(数字id+0,180136,标识)
    玩家数据[数字id].地图单位=nil
    return
  else
    对话数据.对话="我正在战斗中，请勿打扰。"
  end
  return 对话数据
end
__GWdh111[2588]=function(连接id,数字id,序列,标识,地图)
  local 对话数据={}
  对话数据.模型=任务数据[标识].模型
  对话数据.名称=任务数据[标识].名称

  if 任务数据[标识].zhandou==nil then
    local 副本id=任务数据[标识].副本id
    if 玩家数据[数字id].队伍==0 then 常规提示(数字id,"#Y请组队完成！") return   end
    if (任务数据[玩家数据[数字id].角色:取任务(2584)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
    任务数据[标识].zhandou=true
    战斗准备类:创建战斗(数字id+0,180138,标识)
    玩家数据[数字id].地图单位=nil
    return
  else
    对话数据.对话="我正在战斗中，请勿打扰。"
  end
  return 对话数据
end
__GWdh111[2589]=function(连接id,数字id,序列,标识,地图)
  local 对话数据={}
  对话数据.模型=任务数据[标识].模型
  对话数据.名称=任务数据[标识].名称

  if 任务数据[标识].zhandou==nil then
    local 副本id=任务数据[标识].副本id
    if 玩家数据[数字id].队伍==0 then 常规提示(数字id,"#Y请组队完成！") return   end
    if (任务数据[玩家数据[数字id].角色:取任务(2584)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
    任务数据[标识].zhandou=true
    战斗准备类:创建战斗(数字id+0,180140,标识)
    玩家数据[数字id].地图单位=nil
    return
  else
    对话数据.对话="我正在战斗中，请勿打扰。"
  end
  return 对话数据
end
__GWdh111[2590]=function(连接id,数字id,序列,标识,地图)
  local 对话数据={}
  对话数据.模型=任务数据[标识].模型
  对话数据.名称=任务数据[标识].名称

  if 任务数据[标识].zhandou==nil then
    local 副本id=任务数据[标识].副本id
    if 玩家数据[数字id].队伍==0 then 常规提示(数字id,"#Y请组队完成！") return   end
    if (任务数据[玩家数据[数字id].角色:取任务(2584)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
    任务数据[标识].zhandou=true
    战斗准备类:创建战斗(数字id+0,180141,标识)
    玩家数据[数字id].地图单位=nil
    return
  else
    对话数据.对话="我正在战斗中，请勿打扰。"
  end
  return 对话数据
end
function 仙族_大闹天宫:结束仙族大闹天宫副本(任务id)
  local 副本id = 任务数据[任务id].副本id
  local 主任务id = 时空之钥[副本id].仙族.大闹天宫.进行.主任务id
  时空之钥[副本id].仙族.大闹天宫.进行=nil
  local id组 = 任务数据[主任务id].队伍组
  任务数据[主任务id]=nil
  for i=1,#id组 do
    if 玩家数据[id组[i]] then
      玩家数据[id组[i]].角色:取消任务(2584)
      玩家数据[id组[i]].角色:刷新任务跟踪()
      if 玩家数据[id组[i]].战斗 ~= 0 and ((战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==180134 or (战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==180135 or (战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==180136 or (战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==180137 or (战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==180138 or (战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==180139 or (战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==180140 or (战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==180141 or (战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==180133) then
        战斗准备类.战斗盒子[玩家数据[id组[i]].战斗]:结束战斗(0,0,1)
      end
    end
  end
  for i in pairs(任务数据) do
    if (任务数据[i].类型 >=2584 and 任务数据[i].类型 <=2590) and 任务数据[i].副本id == 副本id then
      if 任务数据[i].地图编号 and 任务数据[i].单位编号 then
        地图处理类:删除单位(任务数据[i].地图编号,任务数据[i].单位编号)
      end
      任务数据[i]=nil
    end
  end
end
function 仙族大闹天宫失败(任务id)
  if os.time()-任务数据[任务id].起始>=任务数据[任务id].结束 and 任务数据[任务id].结束 ~= 99999999 then
    if 任务数据[任务id].zhandou~=true then  --未进入战斗状态
      if  任务数据[任务id].类型== 2584 then
        for i=1,#任务数据[任务id].队伍组 do
          if 玩家数据[任务数据[任务id].队伍组[i]] ~= nil then
            玩家数据[任务数据[任务id].队伍组[i]].角色:取消任务(玩家数据[任务数据[任务id].队伍组[i]].角色:取任务(2584))
            刷新队伍任务追踪(任务数据[任务id].队伍组[i])
          end
        end
        任务数据[任务id]=nil
      else
        任务处理类:删除单位(任务id)
      end
    end
  end
end
function 仙族_大闹天宫:完成仙族_大闹天宫任务(id组,任务id,战斗类型)

  local 奖励
  if 任务数据[任务id] then
    local 副本id=任务数据[任务id].副本id
    local 进度刷新=false
    for i=1,#id组 do
      local id = id组[i]
      local 等级 = 玩家数据[id].角色.等级
      if 战斗类型==180134 then --
		  local 等级=玩家数据[id].角色.等级
      local 经验=等级*1200
      local 储备=等级*300+10000
      local 玩家境界 = 时空之钥[id组[1]].境界*0.5
    玩家数据[id].角色:添加经验(玩家境界*经验*HDPZ["仙族_大闹天宫"].经验,"仙族_大闹天宫",1)
    玩家数据[id].角色:添加银子(玩家境界*储备*HDPZ["仙族_大闹天宫"].银子,"仙族_大闹天宫",1)
    if 取随机数()<=HDPZ["仙族_大闹天宫"].爆率+(玩家境界*5) then

      local 链接 = {提示=format("#S(仙族_大闹天宫)#Y在大闹天宫内表现卓越！#G/%s#Y获得了奖励",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
              local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["仙族_大闹天宫"].ITEM),"仙族_大闹天宫")
              if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
              else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
			 end
		end
      elseif 战斗类型==180135 then --
      local 等级=玩家数据[id].角色.等级
      local 经验=等级*1200
      local 储备=等级*300+10000
    local 玩家境界 = 时空之钥[id组[1]].境界*0.5
    玩家数据[id].角色:添加经验(玩家境界*经验*HDPZ["仙族_大闹天宫"].经验,"仙族_大闹天宫",1)
    玩家数据[id].角色:添加银子(玩家境界*储备*HDPZ["仙族_大闹天宫"].银子,"仙族_大闹天宫",1)
    if 取随机数()<=HDPZ["仙族_大闹天宫"].爆率+(玩家境界*5) then

      local 链接 = {提示=format("#S(仙族_大闹天宫)#Y在大闹天宫内表现卓越！#G/%s#Y获得了奖励",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
              local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["仙族_大闹天宫"].ITEM),"仙族_大闹天宫")
              if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
              else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
       end
    end
      elseif 战斗类型==180137 then --
      local 等级=玩家数据[id].角色.等级
      local 经验=等级*1200
      local 储备=等级*300+10000
   local 玩家境界 = 时空之钥[id组[1]].境界*0.5
    玩家数据[id].角色:添加经验(玩家境界*经验*HDPZ["仙族_大闹天宫"].经验,"仙族_大闹天宫",1)
    玩家数据[id].角色:添加银子(玩家境界*储备*HDPZ["仙族_大闹天宫"].银子,"仙族_大闹天宫",1)
    if 取随机数()<=HDPZ["仙族_大闹天宫"].爆率+(玩家境界*5) then

      local 链接 = {提示=format("#S(仙族_大闹天宫)#Y在大闹天宫内表现卓越！#G/%s#Y获得了奖励",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
              local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["仙族_大闹天宫"].ITEM),"仙族_大闹天宫")
              if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
              else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
       end
    end
      elseif 战斗类型==180139 then --
      local 等级=玩家数据[id].角色.等级
      local 经验=等级*1200
      local 储备=等级*300+10000
    local 玩家境界 = 时空之钥[id组[1]].境界*0.5
    玩家数据[id].角色:添加经验(玩家境界*经验*HDPZ["仙族_大闹天宫"].经验,"仙族_大闹天宫",1)
    玩家数据[id].角色:添加银子(玩家境界*储备*HDPZ["仙族_大闹天宫"].银子,"仙族_大闹天宫",1)
    if 取随机数()<=HDPZ["仙族_大闹天宫"].爆率+(玩家境界*5) then

      local 链接 = {提示=format("#S(仙族_大闹天宫)#Y在大闹天宫内表现卓越！#G/%s#Y获得了奖励",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
              local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["仙族_大闹天宫"].ITEM),"仙族_大闹天宫")
              if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
              else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
       end
    end
      elseif 战斗类型==180140 then --
      local 等级=玩家数据[id].角色.等级
      local 经验=等级*1200
      local 储备=等级*300+10000
    local 玩家境界 = 时空之钥[id组[1]].境界*0.5
    玩家数据[id].角色:添加经验(玩家境界*经验*HDPZ["仙族_大闹天宫"].经验,"仙族_大闹天宫",1)
    玩家数据[id].角色:添加银子(玩家境界*储备*HDPZ["仙族_大闹天宫"].银子,"仙族_大闹天宫",1)
    if 取随机数()<=HDPZ["仙族_大闹天宫"].爆率+(玩家境界*5) then

      local 链接 = {提示=format("#S(仙族_大闹天宫)#Y在大闹天宫内表现卓越！#G/%s#Y获得了奖励",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
              local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["仙族_大闹天宫"].ITEM),"仙族_大闹天宫")
              if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
              else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
       end
    end
      elseif 战斗类型==180141 then --
      local 等级=玩家数据[id].角色.等级
      local 经验=等级*1200
      local 储备=等级*300+10000
    local 玩家境界 = 时空之钥[id组[1]].境界*0.5
    local 时空积分=qz(时空之钥[id组[1]].境界*10)
      玩家数据[id].角色:添加仙族时空积分(时空积分)
    玩家数据[id].角色:添加经验(玩家境界*经验*HDPZ["仙族_大闹天宫"].经验,"仙族_大闹天宫",1)
    玩家数据[id].角色:添加银子(玩家境界*储备*HDPZ["仙族_大闹天宫"].银子,"仙族_大闹天宫",1)
    if 取随机数()<=HDPZ["仙族_大闹天宫"].爆率+(玩家境界*5) then

      local 链接 = {提示=format("#S(仙族_大闹天宫)#Y在大闹天宫内表现卓越！#G/%s#Y获得了奖励",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
              local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["仙族_大闹天宫"].ITEM),"仙族_大闹天宫")
              if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
              else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
       end
    end
      end
    end
    if 战斗类型==180134 then
      时空之钥[副本id].仙族.大闹天宫.进行.守门虾兵=时空之钥[副本id].仙族.大闹天宫.进行.守门虾兵+1
      if 时空之钥[副本id].仙族.大闹天宫.进行.守门虾兵 == 1 then
        时空之钥[副本id].仙族.大闹天宫.进行.进程=2
        self:设置仙族大闹天宫副本(副本id)
        进度刷新=true
        玩家数据[id组[1]].zhandou=0
      end
    elseif 战斗类型==180135 then
      时空之钥[副本id].仙族.大闹天宫.进行.龙王之子=时空之钥[副本id].仙族.大闹天宫.进行.龙王之子+1
      if 时空之钥[副本id].仙族.大闹天宫.进行.龙王之子 == 1 then
        时空之钥[副本id].仙族.大闹天宫.进行.进程=3
        self:设置仙族大闹天宫副本(副本id)
        进度刷新=true
        玩家数据[id组[1]].zhandou=0
        任务处理类:副本传送(id组[1],31)
      end
    elseif 战斗类型==180137 then
      时空之钥[副本id].仙族.大闹天宫.进行.七衣仙女=时空之钥[副本id].仙族.大闹天宫.进行.七衣仙女+1
      if 时空之钥[副本id].仙族.大闹天宫.进行.七衣仙女 == 1 then
        时空之钥[副本id].仙族.大闹天宫.进行.进程=4
        self:设置仙族大闹天宫副本(副本id)
        进度刷新=true
        玩家数据[id组[1]].zhandou=0
      end
    elseif 战斗类型==180139 then
      时空之钥[副本id].仙族.大闹天宫.进行.桃园力士=时空之钥[副本id].仙族.大闹天宫.进行.桃园力士+1
      if 时空之钥[副本id].仙族.大闹天宫.进行.桃园力士 == 1 then
        时空之钥[副本id].仙族.大闹天宫.进行.进程=5
        self:设置仙族大闹天宫副本(副本id)
        进度刷新=true
        玩家数据[id组[1]].zhandou=0
      end
    elseif 战斗类型==180140 then
      时空之钥[副本id].仙族.大闹天宫.进行.土地公公=时空之钥[副本id].仙族.大闹天宫.进行.土地公公+1
      if 时空之钥[副本id].仙族.大闹天宫.进行.土地公公 == 1 then
        时空之钥[副本id].仙族.大闹天宫.进行.进程=6
        self:设置仙族大闹天宫副本(副本id)
        进度刷新=true
        玩家数据[id组[1]].zhandou=0
        任务处理类:副本传送(id组[1],31)
      end
    elseif 战斗类型==180141 then
      local id组 = 任务数据[时空之钥[副本id].仙族.大闹天宫.进行.主任务id].队伍组
      for i=1,#id组 do
        if 玩家数据[id组[i]] then
          玩家数据[id组[i]].zhandou=0
          地图处理类:跳转地图(id组[i],1001,358,35)
        end
     end
        if 玩家数据[id组[1]] then
          时空之钥[id组[1]].境界=时空之钥[id组[1]].境界+1 ----------佬伍修改（修复种族秘境时空之钥）
          玩家数据[id组[1]].道具:更改时空之钥(id组[1])
          常规提示(id组[1],"#Y/恭喜你们完成仙族大闹天宫副本")
          添加最后对话(id组[1],format("恭喜你成功通过秘境，秘境境界发生了变化，下次秘境难度上升！"))
        end
     self:结束仙族大闹天宫副本(任务id)
      return
    end
    local id组 = 任务数据[时空之钥[副本id].仙族.大闹天宫.进行.主任务id].队伍组
    for i=1,#id组 do
      if 玩家数据[id组[i]] then
        玩家数据[id组[i]].角色:刷新任务跟踪()
        if 进度刷新 then
          常规提示(id组[i],"#Y/您的副本进度已经更新")
        end
      end
    end
    if 任务数据[任务id] and 任务数据[任务id].地图编号 and 任务数据[任务id].单位编号 then
      地图处理类:删除单位(任务数据[任务id].地图编号,任务数据[任务id].单位编号)
    end
    任务数据[任务id]=nil
  end
end
function 仙族_大闹天宫:任务说明(玩家id,任务id)
  local 说明 = {}
  local 副本id=任务数据[任务id].副本id
    if 时空之钥[副本id]==nil then  ----------佬伍修改（修复种族秘境时空之钥）
    return
    end
  if 时空之钥[副本id].仙族.大闹天宫.进行==nil then
    说明={"仙族·大闹天宫","#L您的副本已经完成"}
  else
    local 进程=时空之钥[副本id].仙族.大闹天宫.进行.进程
    local 数量=时空之钥[副本id].仙族.大闹天宫.进行.数量
    local 序列=时空之钥[副本id].仙族.大闹天宫.进行.序列
    if 进程==1 then
        说明={"仙族·大闹天宫",format("#L击败".."#Y/qqq|守门虾兵*10043*临时npc*31*101/守门虾兵".."#L，#Y/%s#W/层境界。(第1场，共6场)(任务剩余时间#R/%s#W/分钟)。",时空之钥[副本id].境界,取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
    elseif 进程==2 then
        说明={"仙族·大闹天宫",format("#L击败".."#Y/qqq|龙王之子*10043*临时npc*62*81/龙王之子".."#L，#Y/%s#W/层境界。(第2场，共6场)(任务剩余时间#R/%s#W/分钟)。",时空之钥[副本id].境界,取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
    elseif 进程==3 then
        说明={"仙族·大闹天宫",format("#L击败".."#Y/qqq|七衣仙女*10044*临时npc*21*35/七衣仙女".."#L，#Y/%s#W/层境界。(第3场，共6场)(任务剩余时间#R/%s#W/分钟)。",时空之钥[副本id].境界,取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
    elseif 进程==4 then
        说明={"仙族·大闹天宫",format("#L击败".."#Y/qqq|桃园力士*10044*临时npc*18*64/桃园力士鲤".."#L，#Y/%s#W/层境界。(第4场，共6场)(任务剩余时间#R/%s#W/分钟)。",时空之钥[副本id].境界,取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
    elseif 进程==5 then
        说明={"仙族·大闹天宫",format("#L击败".."#Y/qqq|土地公公*10044*临时npc*31*77/土地公公".."#L，#Y/%s#W/层境界。(第5场，共6场)(任务剩余时间#R/%s#W/分钟)。",时空之钥[副本id].境界,取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
    elseif 进程==6 then
        说明={"仙族·大闹天宫",format("#L击败".."#Y/qqq|李靖*10045*临时npc*196*133/李靖".."#L，#Y/%s#W/层境界。(第6场，共6场)(任务剩余时间#R/%s#W/分钟)。",时空之钥[副本id].境界,取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
    end
  end
  return 说明
end
return 仙族_大闹天宫