-- @Author: baidwwy
-- @Date:   2023-11-28 22:56:30
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2023-12-17 10:49:02
local 初识地宫 = class()
function 初识地宫:初始化()
	self.活动开关=false
	self.间隔=30
	地图处理类.地图数据[2004]={npc={},单位={},传送圈={}} --1
	地图处理类.地图玩家[2004]={}
	地图处理类.地图坐标[2004]=地图处理类.地图坐标[1004]
	地图处理类.地图单位[2004]={}
	地图处理类.单位编号[2004]=1000

	地图处理类.地图数据[2005]={npc={},单位={},传送圈={}} --2
	地图处理类.地图玩家[2005]={}
	地图处理类.地图坐标[2005]=地图处理类.地图坐标[1005]
	地图处理类.地图单位[2005]={}
	地图处理类.单位编号[2005]=1000

	地图处理类.地图数据[2006]={npc={},单位={},传送圈={}} --3
	地图处理类.地图玩家[2006]={}
	地图处理类.地图坐标[2006]=地图处理类.地图坐标[1006]
	地图处理类.地图单位[2006]={}
	地图处理类.单位编号[2006]=1000

	地图处理类.地图数据[2007]={npc={},单位={},传送圈={}} --4
	地图处理类.地图玩家[2007]={}
	地图处理类.地图坐标[2007]=地图处理类.地图坐标[1007]
	地图处理类.地图单位[2007]={}
	地图处理类.单位编号[2007]=1000

	地图处理类.地图数据[2008]={npc={},单位={},传送圈={}} --5
	地图处理类.地图玩家[2008]={}
	地图处理类.地图坐标[2008]=地图处理类.地图坐标[1008]
	地图处理类.地图单位[2008]={}
	地图处理类.单位编号[2008]=1000

	地图处理类.地图数据[2090]={npc={},单位={},传送圈={}} --6
	地图处理类.地图玩家[2090]={}
	地图处理类.地图坐标[2090]=地图处理类.地图坐标[1090]
	地图处理类.地图单位[2090]={}
	地图处理类.单位编号[2090]=1000

	地图处理类.地图数据[2009]={npc={},单位={},传送圈={}} --7
	地图处理类.地图玩家[2009]={}
	地图处理类.地图坐标[2009]=地图处理类.地图坐标[1009]
	地图处理类.地图单位[2009]={}
	地图处理类.单位编号[2009]=1000
end

-- function 初识地宫:活动定时器()
-- 	if self.活动开关 then
-- 		if self.计时==nil then
-- 		    self.计时=os.time()
-- 		end
-- 		if os.time() >= 600+self.计时 then
-- 			设置任务6677()
-- 		    self.计时=os.time()
-- 		end
-- 	end
-- end

function 初识地宫:刷新明雷()
	if self.活动开关 then
		设置任务6677()
	end
end

function 初识地宫:开启活动()
	self.活动开关=true
	self:添加NPC()
	发送公告("#G(初识地宫)#P已经开启，大家可以到长安城取雁塔地宫守卫（439，44）初识地宫任务了！")
	广播消息({内容=format("#G(初识地宫)#P已经开启，大家可以到长安城取雁塔地宫守卫（439，44）初识地宫任务了！"),频道="xt"})
end

function 初识地宫:结束任务()
	self.活动开关=false
	发送公告("#G(初识地宫)#P今日初识地宫活动已经结束！")
	广播消息({内容=format("#G(初识地宫)#P今日初识地宫活动已经结束！"),频道="xt"})
	for k,v in pairs(玩家数据) do
		if 玩家数据[k] and 玩家数据[k].角色 then
		    玩家数据[k].角色:取消任务(玩家数据[k].角色:取任务(6675))
		    任务数据[玩家数据[k].角色:取任务(6675)]=nil
		end
	end
end

function rwgx6675(任务id)
	if os.time()-任务数据[任务id].起始>=任务数据[任务id].结束 and 任务数据[任务id].结束 ~= 99999999 then -- 任务时间到期
		for k,v in pairs(玩家数据) do
			if 玩家数据[k] and 玩家数据[k].角色 then
			    玩家数据[k].角色:取消任务(玩家数据[k].角色:取任务(6675))
			    任务数据[任务id]=nil
			end
		end
	end
end

function rwgx6676(任务id)
	if os.time()-任务数据[任务id].起始>=任务数据[任务id].结束 and 任务数据[任务id].结束 ~= 99999999 then -- 任务时间到期
		if 任务数据[任务id].zhandou==nil  then
			地图处理类:删除单位(任务数据[任务id].地图编号,任务数据[任务id].单位编号)
			任务数据[任务id]=nil
		end
	end
end

function rwgx6677(任务id)
	if os.time()-任务数据[任务id].起始>=任务数据[任务id].结束 and 任务数据[任务id].结束 ~= 99999999 then -- 任务时间到期
		if 任务数据[任务id].zhandou==nil  then
			地图处理类:删除单位(任务数据[任务id].地图编号,任务数据[任务id].单位编号)
			任务数据[任务id]=nil
		end
	end
end

function 任务说明6675(玩家id,任务id)
	local 说明 = {}
	if 任务数据[任务id].进程==1 then
		说明={"初识地宫",format("#L/本场景的上一层#R入口#W在：(73，11)。（在这里可以通过击杀明雷怪来积攒一些你想要的#R临时属性符#W。）")}
	elseif 任务数据[任务id].进程==2 then
		说明={"初识地宫",format("#L/本场景的上一层#R入口#W在：(77，73)。（在这里可以通过击杀明雷怪来积攒一些你想要的#R宝宝装备、附魔宝珠#W。）")}
	elseif 任务数据[任务id].进程==3 then
		说明={"初识地宫",format("#L/本场景的上一层#R入口#W在：(74，7)。（在这里可以通过击杀明雷怪来积攒一些你想要的#R召唤兽内丹#W。）")}
	elseif 任务数据[任务id].进程==4 then
		说明={"初识地宫",format("#L/本场景的上一层#R入口#W在：(19，42)。（在这里可以通过击杀明雷怪来积攒一些你想要的#R易经丹#W。）")}
	elseif 任务数据[任务id].进程==5 then
		说明={"初识地宫",format("#L/本场景的上一层#R入口#W在：(69，43)。（在这里可以通过击杀明雷怪来积攒一些你想要的#R清灵净瓶#W。）")}
	elseif 任务数据[任务id].进程==6 then
		说明={"初识地宫",format("#L/本场景的上一层#R入口#W在：(73，59)。（在这里可以通过击杀明雷怪来积攒一些你想要的#R玉葫灵髓、水晶糕#W。）")}
	elseif 任务数据[任务id].进程==7 then
		说明={"初识地宫",format("#L/想必你已经做好了PK准备了吧？PK胜利会获得丰厚的奖励！")}
	end
	return 说明
end

__GWdh111[6676]=function(连接id,id,序列,标识,地图)
	local 对话数据={}
	对话数据.模型=任务数据[标识].模型
	对话数据.名称=任务数据[标识].名称

	if 任务数据[标识].名称=="泡泡" then
		对话数据.对话="没错，我就是泡泡#14"
		对话数据.选项={"杀泡泡？我最拿手了","算了我先去准备准备"}
	elseif 任务数据[标识].名称=="黑色迷雾" then
		对话数据.对话="黑色的雾气笼罩了整个通向上一层的入口，看来不破开它是无法过去了。"
		对话数据.选项={"破雾气？我最拿手了","黑色的看着有些瘆人啊"}
	elseif 任务数据[标识].名称=="狂暴迷雾" then
		对话数据.对话="狂暴的雾气笼罩了整个通向上一层的入口，看来不破开它是无法过去了。"
		对话数据.选项={"又来一个（战斗）","你要是不这么暴躁就好了"}
	elseif 任务数据[标识].名称=="商人的鬼魂" then
		对话数据.对话="嗬——嗬——串串场！"
		对话数据.选项={"你就是雾气的源头吗","有点吓人，我怕"}
	elseif 任务数据[标识].名称=="天哭星·刘达" then
		对话数据.对话="我乃#R天哭星#W之影，少侠可愿与我一战？我会手下留情的#88。"
		对话数据.选项={"我准备好了！","算了我先去准备准备"}
	elseif 任务数据[标识].名称=="摄魂追魄地劣星" then
		对话数据.对话="嘿嘿，要不要来切磋一把？要是能赢我，我就送你们一样宝贝。我会手下留情的#88。"
		对话数据.选项={"我准备好了！瘆","我们才不稀罕你宝贝呢，拜拜！"}
	end
	return 对话数据
end

__GWdh222[6676]=function (连接id,id,序号,内容)
	local 事件=内容[1]
	local 名称=内容[3]
	if 玩家数据[id].队伍==0 or 取队伍人数(id)<3 or 取队伍最低等级(玩家数据[id].队伍,30) then 添加最后对话(id,"初识地宫参与条件：≥30级，≥3人") return end
	local 任务id=玩家数据[id].角色:取任务(6675)

	if 事件=="杀泡泡？我最拿手了" then
		if 任务id~=0 and 任务数据[任务id].击杀.一层 then
		    地图处理类:跳转地图(id,2005,66,21)
		    return
		end
		战斗准备类:创建战斗(id+0,130030,玩家数据[id].地图单位.标识)
		return
	elseif 事件=="破雾气？我最拿手了" then
		if 任务id~=0 and 任务数据[任务id].击杀.二层 then
		    地图处理类:跳转地图(id,2006,66,21)
		    return
		end
		战斗准备类:创建战斗(id+0,130031,玩家数据[id].地图单位.标识)
		return
	elseif 事件=="又来一个（战斗）" then
		if 任务id~=0 and 任务数据[任务id].击杀.三层 then
		    地图处理类:跳转地图(id,2007,66,21)
		    return
		end
		战斗准备类:创建战斗(id+0,130032,玩家数据[id].地图单位.标识)
		return
	elseif 事件=="你就是雾气的源头吗" then
		if 任务id~=0 and 任务数据[任务id].击杀.四层 then
		    地图处理类:跳转地图(id,2008,66,21)
		    return
		end
		战斗准备类:创建战斗(id+0,130033,玩家数据[id].地图单位.标识)
		return
	elseif 事件=="我准备好了！" then
		if 任务id~=0 and 任务数据[任务id].击杀.五层 then
		    地图处理类:跳转地图(id,2090,66,21)
		    return
		end
		战斗准备类:创建战斗(id+0,130034,玩家数据[id].地图单位.标识)
		return
	elseif 事件=="我准备好了！瘆" then
		if 任务id~=0 and 任务数据[任务id].击杀.六层 then
		    地图处理类:跳转地图(id,2009,66,21)
		    return
		end
		战斗准备类:创建战斗(id+0,130035,玩家数据[id].地图单位.标识)
		return
	end
end

__NPCdh111[2009]=function(ID,编号,页数,已经在任务中,id)
	local wb = {}
	local xx = {}
	if 编号 == 2 then
		wb[1] = "我可是疗伤圣手，行医至此，正好帮这位英雄把把脉。(治疗一次需要3000两银子，并消耗10%的当前活力。)"
		local xx = {"我需要治疗。","我精神很好，不用治疗。"}
		return{"男人_酒店老板","超级治疗师",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 3  then
		wb[1] = "我大唐提倡的是尚武精神，如果你有什么疑问可以找我，如果你想离开，也可以来找我。"
		local xx = {"擂台药购买","我要去指定层数","我只是看看"}
		return{"男人_马副将","竞技馆主持人",wb[取随机数(1,#wb)],xx}
	end
	return
end

__NPCdh222[2009]=function (id,id,序号,内容)
	local 事件=内容[1]
	local 名称=内容[3]
	if 名称=="竞技馆主持人" then
		if 事件=="擂台药购买" then
			玩家数据[id].商品列表=商店处理类.商品列表[52]
			发送数据(id,9,{商品=商店处理类.商品列表[52],银子=玩家数据[id].角色.银子})
		end
	elseif 名称=="超级治疗师" then
		if 事件=="我需要治疗。" then
			if 玩家数据[id].角色.银子<500 then
				添加最后对话(id,"这位英雄好像忘记带钱包了。")
				return
			else
				玩家数据[id].角色:扣除银子(500,0,0,"酒店休息",1)
				玩家数据[id].角色.活力=math.floor(玩家数据[id].角色.活力*0.9)
				if 玩家数据[id].角色.活力<=0 then
					玩家数据[id].角色.活力=0
				end
				玩家数据[id].角色.气血=玩家数据[id].角色.最大气血
				玩家数据[id].角色.气血上限=玩家数据[id].角色.最大气血
				玩家数据[id].角色.魔法=玩家数据[id].角色.最大魔法
				体活刷新(id)
				发送数据(玩家数据[id].连接id,47,{玩家数据[id].角色:取气血数据()})
				发送数据(玩家数据[id].连接id,1501,{名称="超级治疗师",模型="男人_酒店老板",对话="收您500两银子，已经帮你恢复至最佳状态。欢迎下次再来。"})
				return
			end
		end
	elseif 事件=="我要去指定层数" then --没有判断队伍任务是否一致
		local 任务id=玩家数据[id].角色:取任务(6675)
		if 任务id==0 then
		    添加最后对话(id,"少侠当前没有挑战过任何层数哦")
		    return
		end
		local cs = 任务数据[任务id].进程
		local xx={}
		for i=1,cs do
			xx[#xx+1]=i.."层"
		end
		添加最后对话(id,"少侠当前挑战过的层数如下，需要我为你传送过去吗？",xx)
	elseif 事件=="1层" or 事件=="2层"or 事件=="3层"or 事件=="4层"or 事件=="5层"or 事件=="6层"or 事件=="7层" then
		if 事件=="1层" then
	    	地图处理类:跳转地图(id,2004,32,61)
	    elseif 事件=="2层" then
	    	地图处理类:跳转地图(id,2005,66,21)
	    elseif 事件=="3层" then
	    	地图处理类:跳转地图(id,2006,68,69)
	    elseif 事件=="4层" then
	    	地图处理类:跳转地图(id,2007,66,23)
	    elseif 事件=="5层" then
	    	地图处理类:跳转地图(id,2008,96,30)
	    elseif 事件=="6层" then
	    	地图处理类:跳转地图(id,2090,20,39)
	    elseif 事件=="7层" then
	    	地图处理类:跳转地图(id,2009,33,37)
	    end

	end
end

function 初识地宫:对话事件处理(id,名称,事件,类型)
	if 玩家数据[id].队伍==0 or 取队伍人数(id)<3 or 取队伍最低等级(玩家数据[id].队伍,30) then 添加最后对话(id,"初识地宫参与条件：≥30级，≥3人") return end
	if 事件=="送我进去" then
		if 玩家数据[id].角色.等级<50 then
		    添加最后对话(id,format("地宫对于"..玩家数据[id].角色.名称.."少侠来说还是过于危险了，还是好好磨练一番再来吧。（进入地宫需要等级大于等于50）"))
		else
			添加最后对话(id,format("当前不是活动时间"))
		end
	elseif 事件=="初识地宫" then
		添加最后对话(id,"前方就是大雁塔地宫，里面镇压着十万妖魔，此行凶险万分，是对少侠实力的一大考验。少侠当前地宫等级为#G初识地宫#W，请问是否需要参与此次地宫挑战？",{"我要参与","我再想想"})
	elseif 事件=="我要参与" then
		if self.活动开关 then
			self:任务刷新(id)
			local 任务id=玩家数据[id].角色:取任务(6675)
			self:跳转地图(id,任务数据[任务id].进程)
		else
		    添加最后对话(id,"活动尚未开始，莫急！")
		end
	elseif 事件=="我要去指定层数" then
		-- if 玩家数据[id].角色.等级<50 then
		--     添加最后对话(id,format("地宫对于"..玩家数据[id].角色.名称.."少侠来说还是过于危险了，还是好好磨练一番再来吧。（进入地宫需要等级大于等于50）"))
		-- else
		-- 	添加最后对话(id,format("当前不是活动时间"))
		-- end
		if self.活动开关 then
			local 任务id=玩家数据[id].角色:取任务(6675)
			if 任务id==0 then
			    添加最后对话(id,"少侠当前没有挑战过任何层数哦")
			    return
			end
			local cs = 任务数据[任务id].进程
			local xx={}
			for i=1,cs do
				xx[#xx+1]=i.."层"
			end
			添加最后对话(id,"少侠当前挑战过的层数如下，需要我为你传送过去吗？",xx)
		else
		    添加最后对话(id,"活动尚未开始，莫急！")
		end
	elseif 事件=="1层" or 事件=="2层"or 事件=="3层"or 事件=="4层"or 事件=="5层"or 事件=="6层"or 事件=="7层" then
		if 事件=="1层" then
	    	地图处理类:跳转地图(id,2004,32,61)
	    elseif 事件=="2层" then
	    	地图处理类:跳转地图(id,2005,66,21)
	    elseif 事件=="3层" then
	    	地图处理类:跳转地图(id,2006,68,69)
	    elseif 事件=="4层" then
	    	地图处理类:跳转地图(id,2007,66,23)
	    elseif 事件=="5层" then
	    	地图处理类:跳转地图(id,2008,96,30)
	    elseif 事件=="6层" then
	    	地图处理类:跳转地图(id,2090,20,39)
	    elseif 事件=="7层" then
	    	地图处理类:跳转地图(id,2009,33,37)
	    end
	elseif 事件=="取消任务" then
		玩家数据[id].角色:取消任务(玩家数据[id].角色:取任务(6675))
		添加最后对话(id,"已为你取消了任务！")
	-- elseif 事件=="积分兑换" then
	-- elseif 事件=="地宫近况" then
	-- elseif 事件=="查看图鉴" then
	end
end

function 初识地宫:添加NPC()
	local sx={
			{x=73,y=11,地图=2004,模型="泡泡",名称="泡泡"},
			{x=77,y=73,地图=2005,模型="蜃气妖",名称="黑色迷雾",炫彩模型="泡泡",炫彩颜色="黑色"},
			{x=74,y=7,地图=2006,模型="进阶蜃气妖",名称="狂暴迷雾",炫彩模型="泡泡",炫彩颜色="番茄红"},
			{x=104,y=26,地图=2007,模型="野鬼",名称="商人的鬼魂"},
			{x=19,y=42,地图=2008,模型="龙太子",名称="天哭星·刘达",武器等级=90,炫彩模型="龙太子",炫彩颜色=取炫彩染色(随机颜色[取随机数(1,#随机颜色)])},
			{x=69,y=43,地图=2090,模型="虎头怪",名称="摄魂追魄地劣星",武器等级=130,炫彩模型="虎头怪",炫彩颜色=取炫彩染色(随机颜色[取随机数(1,#随机颜色)])},}
	for i=1,6 do
		local 任务id=i..取随机数(1,5555).."_6676_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999)
		local xc=nil
		local xcz=nil
		local 武器=nil
		local 武器等级=nil
		if sx[i].炫彩模型 then
		    xc=取染色id(sx[i].炫彩模型)
			xcz=取炫彩染色(sx[i].炫彩颜色)
		end
		if sx[i].武器等级 then
		    武器=取角色等级武器(sx[i].模型,sx[i].武器等级)
			武器等级=sx[i].武器等级
		end
		随机序列=随机序列+1
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=7200,
			玩家id={},
			队伍组={},
			战斗显示=true,
			炫彩=xc,
			炫彩组=xcz,
			名称=sx[i].名称,
			模型=sx[i].模型,
			武器=武器,
			武器等级=武器等级,
			x=sx[i].x,
			y=sx[i].y,
			地图编号=sx[i].地图,
			类型=6676
		}
		地图处理类:添加单位(任务id)
	end
	设置任务6677()
end

-- function 设置任务667711(id)
--     local 地图范围={1020}
-- 	local x待发送数据 = {}
-- 	local 临时数量=取随机数(3,3)
-- 	local 地图=1020
-- 	x待发送数据[地图]={}
-- 	for n=1,临时数量 do
-- 		local 任务id=地图.."_6677_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_"..n
-- 		随机序列=随机序列+1
-- 		local xy=地图处理类.地图坐标[地图]:取随机点()
-- 		任务数据[任务id]={
-- 			id=任务id,
-- 			起始=os.time(),
-- 			结束=1299,
-- 			玩家id=0,
-- 			队伍组={},
-- 			名称="羊头怪",
-- 			模型="羊头怪",
-- 			等级=取随机数(1,140),
-- 			x=xy.x,
-- 			y=xy.y,
-- 			-- 事件="明雷",
-- 			-- 执行事件="明雷",
-- 			地图编号=地图,
-- 			地图名称=取地图名称(地图),
-- 			类型=6677
-- 		}
-- 		table.insert(x待发送数据[地图], 地图处理类:批量添加单位(任务id))--修改
-- 	end

-- 	for i=1,#地图范围 do--修改
-- 		local 地图编号=地图范围[i]
-- 		for n, v in pairs(地图处理类.地图玩家[地图编号]) do
-- 			if 地图处理类:取同一地图(地图编号,id,n,1)  then
-- 				发送数据(玩家数据[n].连接id,1021,x待发送数据[地图编号])
-- 			end
-- 		end
-- 	end
-- 	x待发送数据={}

-- 	----添加玩家任务

-- 	local 任务id=id.."_11111_"..os.time()
-- 	local 结束时间=50000
-- 	if 指定 then
-- 	    结束时间=指定
-- 	end
-- 	任务数据[任务id]={
-- 		id=任务id,
-- 		起始=os.time(),
-- 		结束=结束时间,
-- 		玩家id=id,
-- 		副本id=id,
-- 		队伍组={},
-- 		类型=11111
-- 	}
-- 	玩家数据[id].角色:添加任务(任务id)
-- 	发送数据(玩家数据[id].连接id,39)
-- end

function 设置任务6677()
    local 地图范围={2004,2005,2006,2007,2008,2090}
	local ems={{"羊头怪","赌徒","强盗","骷髅怪","蛤蟆精","狐狸精"},
				{"羊头怪","赌徒","强盗","骷髅怪","蛤蟆精","狐狸精"},
				{"羊头怪","花妖","骷髅怪","蛤蟆精","狐狸精"},
				{"羊头怪","花妖","骷髅怪","蛤蟆精","狐狸精"},
				{"羊头怪","花妖","骷髅怪","蛤蟆精","狐狸精"},
				{"羊头怪","花妖","大蝙蝠","蛤蟆精","狐狸精"}
			}
	local x待发送数据 = {}
	for i=1,#地图范围 do
		local 临时数量=取随机数(20,30)
		local 地图=地图范围[i]
		x待发送数据[地图]={}
		for n=1,临时数量 do
			local 任务id=地图.."_6677_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_"..n
			随机序列=随机序列+1
			local xy=地图处理类.地图坐标[地图]:取随机点()
			local 模型=ems[i][取随机数(1,#ems[i])]
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=299,
				玩家id=0,
				队伍组={},
				名称=模型,
				模型=模型,
				等级=取随机数(1,140),
				x=xy.x,
				y=xy.y,
				事件="明雷",
				执行事件="明雷",
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=6677
			}
			-- 地图处理类:添加单位(任务id)
			table.insert(x待发送数据[地图], 地图处理类:批量添加单位(任务id))--修改
		end
	end
	for i=1,#地图范围 do--修改
		local 地图编号=地图范围[i]
		for n, v in pairs(地图处理类.地图玩家[地图编号]) do
			if 地图处理类:取同一地图(地图编号,id,n,1)  then
				发送数据(玩家数据[n].连接id,1021,x待发送数据[地图编号])
			end
		end
	end
	x待发送数据={}

end

function 初识地宫:任务刷新(id)
	local 地图 =  玩家数据[id].角色.地图数据.编号
	local 队伍id = 玩家数据[id].队伍
	local 新任务=false
	if 队伍id~=0 then
		for n=1,#队伍数据[队伍id].成员数据 do
			local 成员id=队伍数据[队伍id].成员数据[n]
			local 任务id=玩家数据[成员id].角色:取任务(6675)
			if 任务数据[任务id]==nil then
				新任务=true
				任务id=成员id.."_6675_"..os.time().."_"..随机序列.."_"..取随机数(88,99999)
				随机序列=随机序列+1
				任务数据[任务id]={
					id=任务id,
					起始=os.time(),
					玩家id={},
					队伍组={},
					结束=10800,
					类型=6675,
					击杀={一层=false,二层=false,三层=false,四层=false,五层=false,六层=false,七层=false},
					当前级别 = 1
				}
			end
			if 地图==1001 or 地图==2004 then
				任务数据[任务id].进程 = 1
			elseif 地图==2005  then ----2
				任务数据[任务id].进程 = 2
				任务数据[任务id].击杀.一层=true
			elseif 地图==2006  then
				任务数据[任务id].进程 = 3
				任务数据[任务id].击杀.二层=true
			elseif 地图==2007  then
				任务数据[任务id].进程 = 4
				任务数据[任务id].击杀.三层=true
			elseif 地图==2008  then
				任务数据[任务id].进程 = 5
				任务数据[任务id].击杀.四层=true
			elseif 地图==2090  then
				任务数据[任务id].进程 = 6
				任务数据[任务id].击杀.五层=true
			elseif 地图==2009  then
				任务数据[任务id].进程 = 7
				任务数据[任务id].击杀.六层=true
			end
			if 新任务 then
			    玩家数据[成员id].角色:添加任务(任务id)
			else
				玩家数据[成员id].角色:刷新任务跟踪()
			end
		end
	end
end

function 初识地宫:跳转地图(id,层数)
    if 层数 == 1 then
    	地图处理类:跳转地图(id,2004,32,61)
    elseif 层数 == 2 then
    	地图处理类:跳转地图(id,2005,66,21)
    elseif 层数 == 3 then
    	地图处理类:跳转地图(id,2006,68,69)
    elseif 层数 == 4 then
    	地图处理类:跳转地图(id,2007,66,23)
    elseif 层数 == 5 then
    	地图处理类:跳转地图(id,2008,96,30)
    elseif 层数 == 6 then
    	地图处理类:跳转地图(id,2090,20,39)
    elseif 层数 == 7 then
    	地图处理类:跳转地图(id,2009,33,37)
    end
end

function 初识地宫:更改模型(id,模型)
	玩家数据[id].角色.变身数据=模型
	发送数据(玩家数据[id].连接id,37,玩家数据[id].角色.变身数据)
	设置任务1(id,1,玩家数据[id].角色.变身数据,1200)
	地图处理类:更改模型(id,玩家数据[id].角色.变身数据,1)
end

function 初识地宫:战斗胜利处理(id组,战斗类型)
	if 战斗类型==130030 then  --1层
		local mx = {"泡泡","巨蛙","大海龟","海毛虫","狸","狸","狸","狸","海星","强盗","山贼","赌徒","蛤蟆精"}
		local 模型 = mx[取随机数(1,13)]
	    for n=1,#id组 do
		    local id=id组[n]
		    玩家数据[id].zhandou=0
		    self:更改模型(id,模型)
		end
		地图处理类:跳转地图(id组[1],2005,66,21) --1
		self:任务刷新(id组[1])
	elseif 战斗类型==130031 then  --2层
		for n=1,#id组 do
		    local id=id组[n]
		    玩家数据[id].zhandou=0
		end
		地图处理类:跳转地图(id组[1],2006,68,69) --3
		self:任务刷新(id组[1])
	elseif 战斗类型==130032 then  --3层
		for n=1,#id组 do
		    local id=id组[n]
		    玩家数据[id].zhandou=0
		end
		地图处理类:跳转地图(id组[1],2007,66,23) --3
		self:任务刷新(id组[1])
	elseif 战斗类型==130033 then  --4层
		for n=1,#id组 do
		    local id=id组[n]
		    玩家数据[id].zhandou=0
		end
		地图处理类:跳转地图(id组[1],2008,96,30) --3
		self:任务刷新(id组[1])
	elseif 战斗类型==130034 then  --5层
		for n=1,#id组 do
		    local id=id组[n]
		    玩家数据[id].zhandou=0
		end
		地图处理类:跳转地图(id组[1],2090,20,39) --3
		self:任务刷新(id组[1])
	elseif 战斗类型==130035 then  --6层
		for n=1,#id组 do
		    local id=id组[n]
		    玩家数据[id].zhandou=0
		end
		地图处理类:跳转地图(id组[1],2009,33,37) --3
		self:任务刷新(id组[1])
	end
end
function 胜利MOB_200001(胜利id,战斗数据,id组)
	if 玩家数据[胜利id] and 玩家数据[胜利id].角色 and 玩家数据[胜利id].角色.地图数据.编号==2009 then
	     for n=1,#id组 do
		    local id=id组[n]
		    -- local 任务id=玩家数据[id].角色:取任务(6675)
		    玩家数据[id].zhandou=0
		    玩家数据[id].道具:给予道具(id,"神兜兜",取随机数(1,5))
		    玩家数据[id].道具:给予道具(id,"附魔宝珠",90)
		    玩家数据[id].角色:添加经验(qz(100000),"初识地宫")
		end
	end
end
function 初识地宫:明雷奖励(id)
	local 地图 = 玩家数据[id].角色.地图数据.编号
	if 地图==2004 then --1
	    local mc = {"嗜血","轻如鸿毛","拈花妙指","穿云破空","盘丝舞","一气化三清","浩然正气","龙附","神兵护法","魔王护持","莲华妙法","尸气漫天","元阳护体","担山赶月","神木呓语"}
		local jn = mc[取随机数(1,#mc)]
		local 等级 = 60
		local 分类 = 取强化符分类(jn)
		local 强化符 = 物品类()
		强化符:置对象("强化符")
		local 临时道具 = 复制物品(强化符)
		local 道具编号 = 玩家数据[id].道具:取新编号()
		临时道具.技能 = jn
		临时道具.等级 = 等级
		临时道具.分类 = 分类
		玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,临时道具)
	elseif 地图==2005 then --2
        装备处理类:野外掉落宝宝装备(id,35)
	elseif 地图==2006 then --3
		if 取随机数()<=10 then
		    玩家数据[id].道具:给予道具(id,"高级召唤兽内丹",nil,取内丹("高级"),"初识地宫")
		else
			玩家数据[id].道具:给予道具(id,"召唤兽内丹",nil,取内丹("低级"),"初识地宫")
		end
		if 取随机数()<=20 then
		    玩家数据[id].道具:给予道具(id,"附魔宝珠",90)
		end
	elseif 地图==2007 then --4
		玩家数据[id].道具:给予道具(id,"易经丹",1)
	elseif 地图==2008 then --5
		玩家数据[id].道具:给予道具(id,"清灵净瓶",1)
	elseif 地图==2090 then --6
		玩家数据[id].道具:给予道具(id,"玉葫灵髓",1)
		if 取随机数()<=5 then
		    玩家数据[id].道具:给予道具(id,"水晶糕",1)
		end
	end
end




return 初识地宫