-- @Author: baidwwy
-- @Date:   2023-11-29 13:28:22
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2025-11-21 13:58:05
-- @Author: baidwwy
-- @Date:   2023-11-05 14:08:51
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2023-12-15 23:22:57
local 中秋任务 = class()
function 中秋任务:取中秋逐月次数限制(id,次数)
local 队伍id=玩家数据[id].队伍
  for n=1,#队伍数据[队伍id].成员数据 do
    local 临时id=队伍数据[队伍id].成员数据[n]
    local cyid=队伍数据[队伍id].成员数据[n]
      if 活动次数数据.中秋任务.完成[临时id]== nil then
        活动次数数据.中秋任务.完成[临时id]=0
      end
      if 活动次数数据.中秋任务.完成[临时id]>=1 then
        常规提示(id,"#Y"..玩家数据[临时id].角色.名称.."本日中秋次数已达上限")
        return true
      else
        活动次数数据.中秋任务.完成[临时id]=活动次数数据.中秋任务.完成[临时id]+1
      end
  end
  return false
  end
function 中秋任务:添加中秋任务(id)
  if 玩家数据[id].角色.等级<20 then
    添加最后对话(id,"只有等级达到20级的玩家才可以领取本任务。")
    return
  elseif not Q_中秋开关 then 添加最后对话(id,"中秋活动尚未开启,敬请期待。")
    return
  elseif 玩家数据[id].角色:取任务(55) ~= 0 then
    添加最后对话(id,"你已经接取过该任务了,抓紧去完成吧。")
    return
  end
  local 任务id=id.."_55_"..os.time()
  local 结束时间=0
  任务数据[任务id]={
    id=任务id,
    起始=os.time(),
    结束=结束时间,
    玩家id=id,
    队伍组={},
    名称=1,
    模型=1,
    地图编号=1001,
    地图名称=1,
    积分=0,
    次数=1,
    类型=55
  }
  玩家数据[id].角色:添加任务(任务id)
  self:设置中秋任务(id,任务id)
end

function 中秋任务:设置中秋任务(id,任务id)
  local 类型=取随机数(1,10)
  if 类型<=5 then
    类型=1
  else
    类型=2
  end
  local 序列=取随机数(1,#Q_随机人物)
  local 地图=Q_随机人物[序列].地图
  local 名称=Q_随机人物[序列].人物[取随机数(1,#Q_随机人物[序列].人物)]
  任务数据[任务id].地图编号=地图
  任务数据[任务id].地图名称=取地图名称(地图)
  任务数据[任务id].名称=名称
  任务数据[任务id].分类=类型
  添加最后对话(id,format("中秋佳节倍思亲,为%s的%s送上佳节祝福吧！",任务数据[任务id].地图名称,任务数据[任务id].名称))
  玩家数据[id].角色:刷新任务跟踪()
end

function 中秋任务:开启中秋任务()
   for n=1,#Q_中秋逐月数据 do
    local 任务id="10000_56_"..os.time()..n
    local 地图=Q_中秋逐月数据[n][1]
    local xy={x=Q_中秋逐月数据[n][2],y=Q_中秋逐月数据[n][3]}
    local 名称=Q_中秋逐月数据[n][4]
    local 结束时间=0
    任务数据[任务id]={
      id=任务id,
      起始=os.time(),
      结束=结束时间,
      名称=名称,
      方向=Q_中秋逐月数据[n][5],
      模型="兔子怪",
      变异=true,
      x=xy.x,
      y=xy.y,
      地图编号=地图,
      地图名称=取地图名称(地图),
      序号=n,
      类型=56
    }
    地图处理类:添加单位(任务id)
    -- 发送公告({内容="#G/中秋活动已经开启，各位玩家可以前往长安城#R/婵娟使者#G/处开启中秋活动#32",频道="xt"})
  end
  中秋逐月数据={}
end
function 中秋任务:怪物对话内容(id,类型,标识,地图)
  local 对话数据={}
  对话数据.模型=任务数据[标识].模型
  对话数据.名称=任务数据[标识].名称
  if 玩家数据[id].角色:取任务(56) ~= 0 and 任务数据[玩家数据[id].角色:取任务(56)].进程 == 任务数据[标识].序号 then
    对话数据.对话="你准备好接受我的考验了么！#24"
    对话数据.选项={"准备好了","我再考虑考虑"}
  else
    对话数据.对话="迎来了中秋的笑脸,迎来了中秋的喜悦!愿你在这双重喜庆的包围下永远幸福、快乐!!"
  end
  return 对话数据
end

function 中秋任务:对话事件处理(id,名称,事件,类型)

  if 事件=="准备好了" then
    if 玩家数据[id].角色:取任务(56) ~= 0 then
      if 任务数据[玩家数据[id].地图单位.标识] == nil then return  end
      if 玩家数据[id].队伍 == 0 then 添加最后对话(id,"此活动可以组队完成,请最少5人组队参加") return  end
      if 取队伍人数(id)<1 then 添加最后对话(id,"此活动最少要有1人") return  end
      if 取等级要求(id,50)==false then 添加最后对话(id,"参与此任务需要全队等级达到50级") return  end
      if not 取队员任务一致(id,56) then  return end
      战斗准备类:创建战斗(id+0,100062,玩家数据[id].角色:取任务(56))
      玩家数据[id].地图单位=nil
    else
      添加最后对话(数字id,"你没有这样的任务")
    end
  end
end
function 中秋任务:设置中秋逐月任务(id)
  -- if not Q_中秋开关 then 添加最后对话(id,"中秋活动尚未开启,敬请期待~。") return end
  if 玩家数据[id].队伍 == 0 then 添加最后对话(id,"此活动可以组队完成,请最少5人组队参加") return  end
  if 取等级要求(id,50)==false then 添加最后对话(id,"参与此任务需要全队等级达到50级") return  end
  if self:取中秋逐月次数限制(id,2) then return end
  if 取队员任务存在(玩家数据[id].队伍,56) then 添加最后对话(id,"队伍中已有队员领取过此任务了") return  end
  local 任务id=id.."_56_"..os.time()
  local 结束时间=0
  任务数据[任务id]={
    id=任务id,
    起始=os.time(),
    结束=结束时间,
    玩家id=id,
    队伍组={},
    进程=1,
    类型=56
  }
  for i=1,#队伍数据[玩家数据[id].队伍].成员数据 do
    local lsid = 队伍数据[玩家数据[id].队伍].成员数据[i]
    if 中秋逐月数据[lsid] then
      中秋逐月数据[lsid] = 中秋逐月数据[lsid] + 1
    else
      中秋逐月数据[lsid] = 1
    end
    任务数据[任务id].队伍组[#任务数据[任务id].队伍组+1]=lsid
    玩家数据[lsid].角色:添加任务(任务id)
    发送数据(玩家数据[lsid].连接id,39)
    常规提示(lsid,"#Y/你参加了中秋逐月活动")
  end
  self:开启中秋任务()
end
function 中秋任务:战斗胜利处理(id组,任务id,战斗类型)
  if 任务数据[任务id] then
      for n=1,#id组 do
      local id=id组[n]
      local 等级=玩家数据[id].角色.等级
      local 经验=等级*1200
      local 储备=等级*300+10000
    玩家数据[id].角色:添加经验(经验*HDPZ["中秋逐月"].经验,"中秋逐月",1)
    玩家数据[id].角色:添加银子(储备*HDPZ["中秋逐月"].银子,"中秋逐月",1)
    玩家数据[id].角色:添加除妖军功(1)
    if 取随机数()<=HDPZ["中秋逐月"].爆率 then
      local 链接 = {提示=format("#S(中秋逐月)#Y参加中秋逐月活动时表现卓越！#G/%s#Y获得了婵娟的奖励",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
              local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["中秋逐月"].ITEM),"中秋逐月")
              if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
              else
                          玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
          end
       end
      玩家数据[id].角色.中秋积分 = 玩家数据[id].角色.中秋积分 + 3
      常规提示(id,"#Y/你获得了3点中秋积分！")
    end
    if 任务数据[任务id].进程 >= 20 then
      for i=1,#任务数据[任务id].队伍组 do
        local lsid = 任务数据[任务id].队伍组[i]
       if 玩家数据[lsid] then
          玩家数据[lsid].角色:取消任务(任务id)
          玩家数据[lsid].角色:刷新任务跟踪()
          玩家数据[lsid].道具:给予道具(lsid,"月饼",1)
          常规提示(id,"#Y/恭喜你完成了本轮逐月活动,额外获得“月饼”一个！")
          广播消息({内容=string.format("#S/(中秋活动)#R/%s#Y/完成了中秋逐月活动，表现卓越，获得#Y/婵娟#W/赠与的#G/%s#Y/".."#"..取随机数(1,110),玩家数据[lsid].角色.名称,"月饼"),频道="hd"})
        end
      end
      任务数据[任务id]=nil
    else
      任务数据[任务id].进程 = 任务数据[任务id].进程 + 1
      for i=1,#任务数据[任务id].队伍组 do
        local lsid = 任务数据[任务id].队伍组[i]
        if 玩家数据[lsid] then
          玩家数据[lsid].角色:刷新任务跟踪()
        end
      end
      添加最后对话(id组[1],string.format("请继续前往#Y/%s(%s,%s)#W/处的#G/%s#Y接受考验!",取地图名称(Q_中秋逐月数据[任务数据[任务id].进程][1]),Q_中秋逐月数据[任务数据[任务id].进程][2],Q_中秋逐月数据[任务数据[任务id].进程][3],Q_中秋逐月数据[任务数据[任务id].进程][4]))
    end
  end
end
function 中秋任务:完成中秋单人任务(id,任务id)
  if 任务数据[任务id] then
  --  local 奖励=奖励加载("中秋单人")
    local 等级=玩家数据[id].角色.等级
    local 额外加成=1+任务数据[任务id].次数*0.1
   -- local 名称组 = 奖励处理(id,奖励,等级,"中秋单人",额外加成)
     local 经验=qz(等级*8000*额外加成)
     local 银子=qz(等级*150*额外加成)
     玩家数据[id].角色:添加经验(经验,"中秋逐月")
     玩家数据[id].角色:添加银子(银子,"中秋逐月",1)
     if 玩家数据[id].角色.参战信息~=nil then
        玩家数据[id].召唤兽:获得经验(玩家数据[id].角色.参战宝宝.认证码,qz(经验*0.15),id,"中秋逐月")
      end
       local 获得物品={}
       for i=1,#自定义数据.中秋活动 do
           if 取随机数()<=自定义数据.中秋活动[i].概率 then
              获得物品[#获得物品+1]=自定义数据.中秋活动[i]
           end
       end
       获得物品=删除重复(获得物品)
       if 获得物品~=nil then
          local 取编号=取随机数(1,#获得物品)
          if 获得物品[取编号]~=nil and 获得物品[取编号].名称~=nil and 获得物品[取编号].数量~=nil then
             玩家数据[id].道具:自定义给予道具(id,获得物品[取编号].名称,获得物品[取编号].数量,获得物品[取编号].参数)
             广播消息({内容=format("#S/(中秋活动)#R/%s#Y/参加中秋逐月活动时表现卓越，获得#Y/婵娟#W/赠与的#G/%s#Y/",玩家数据[id].角色.名称,获得物品[取编号].名称),频道="xt"})
          end
       end
    local 积分 = 1
    if 任务数据[任务id].次数==6 or 任务数据[任务id].次数==7 then
      积分 = 1
    elseif 任务数据[任务id].次数==8 then
      积分 = 2
    elseif 任务数据[任务id].次数==9 or 任务数据[任务id].次数==10 then
      积分 = 3
    end
    玩家数据[id].角色.中秋积分 = 玩家数据[id].角色.中秋积分 + 积分
    if 任务数据[任务id].次数 >= 10 then
      任务数据[任务id].次数 = 0
    end
    任务数据[任务id].次数 = 任务数据[任务id].次数 + 1
    常规提示(id,"#Y/你获得了"..积分.."点中秋积分")
    self:设置中秋任务(id,任务id)
  end
end
function 中秋任务:任务说明(玩家id,任务id)
  local 说明 = {}
    说明={"中秋逐月活动",format("#W/你正在参加中秋逐月活动，请前往#Y/%s(%s,%s)#W处参加#G/%s#W的考验！",取地图名称(Q_中秋逐月数据[任务数据[任务id].进程][1]),Q_中秋逐月数据[任务数据[任务id].进程][2],Q_中秋逐月数据[任务数据[任务id].进程][3],Q_中秋逐月数据[任务数据[任务id].进程][4]),"可获得经验、银子、月饼奖励"}
    return 说明
end
return 中秋任务
