-- @Author: baidwwy
-- @Date:   2023-11-06 16:27:39
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2026-05-18 20:36:06
-- @Author: baidwwy
-- @Date:   2023-11-06 16:27:39
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2023-11-07 08:42:25

local 五行年兽 = class()
function 五行年兽:五行年兽任务(id,类型)

  if 玩家数据[id].角色:取任务(58) ~= 0 then
    添加最后对话(id,"少侠身上已经有此类任务，请先完成任务再来！")
    return
  elseif 玩家数据[id].队伍 == 0 then
    常规提示(id,"#Y/本任务至少需要1人组队完成")
    return
  elseif 取队伍人数(id)<1 then
    常规提示(id,"#Y/本任务至少需要2人组队完成")
    return
  elseif 取队员任务存在(玩家数据[id].队伍,58) then
    常规提示(id,"#Y/队伍中已有队员领取过此任务了")
    return
  elseif 五行年兽限制[id] then
    常规提示(id,"#Y/你今日已经参与过此活动了")
    return
  end
  local 队伍id=玩家数据[id].队伍
  for n=2,#队伍数据[队伍id].成员数据 do
    local 临时id=队伍数据[队伍id].成员数据[n]
    if  五行年兽限制[临时id] then
      常规提示(id,"#Y/"..玩家数据[临时id].角色.名称.."今日已经参与过此任务了")
      return
    end
  end
  local 序列=取随机数(1,#Q_随机人物)
  local 地图=Q_随机人物[序列].地图
  local 名称=Q_随机人物[序列].人物[取随机数(1,#Q_随机人物[序列].人物)]
  local 任务id=id.."_58_"..随机序列..os.time()
  任务数据[任务id]={
    id=任务id,
    起始=os.time(),
    结束=9999999,
    玩家id=id,
    队伍组={},
    难度=类型,
    环数=1,
    --关键字="完成五行年兽战斗任务",
    门派师傅=玩家数据[id].最后对话.名称,
    地图编号=地图,
    名称=名称,
    进程=1,
    类型=58,
    积分=0,
  }
  self:五行年兽任务物品(id,任务id)
  local 队伍id=玩家数据[id].队伍
  for n=1,#队伍数据[队伍id].成员数据 do
    local 临时id=队伍数据[队伍id].成员数据[n]
    五行年兽限制[临时id]=true
    任务数据[任务id].队伍组[#任务数据[任务id].队伍组+1]=临时id
    玩家数据[临时id].角色:添加任务(任务id)
  end
  常规提示(id,"#Y/你领取了五行年兽环式任务！")
end


function 五行年兽:五行年兽任务物品(id,任务id)
  local 序列=取随机数(1,#Q_随机人物)
  local 地图=Q_随机人物[序列].地图
  local 名称=Q_随机人物[序列].人物[取随机数(1,#Q_随机人物[序列].人物)]
  任务数据[任务id].地图编号=地图
  任务数据[任务id].地图名称=取地图名称(地图)
  任务数据[任务id].名称=名称
  任务数据[任务id].分类=1
  local 随机参数 = 取随机数(1,75)
  local 物品名称
  local 参数
  local 等级
  if 随机参数 <= 15 then
  物品名称 = 取强化石()
    -- 参数=取低级要诀()
    elseif 随机参数 <= 20 then
    物品名称 = "神兜兜"
  elseif 随机参数 <= 30 then
    local 药品名称={"豆斋果","翡翠豆腐","臭豆腐","佛跳墙","长寿面","醉生梦死","九转回魂丹","蛇胆酒","佛光舍利子","金香玉","小还丹","蛇蝎美人","风水混元丹","千年保心丹","定神香","五龙丹","十香返生丸"}
    物品名称 = 药品名称[取随机数(1,#药品名称)]
  -- elseif 随机参数 <= 35 then
  --   物品名称 = 取宝石()
  --   等级 = 取随机数(1,1)
  -- elseif 随机参数 <= 45 then
  --   物品名称 = 取宝石()
    -- 等级 = 取随机数(1,1)

  -- elseif 随机参数 <= 60 then
  --   物品名称 = "鬼谷子"
  --   local 阵法名称={"风扬阵","虎翼阵","天覆阵","云垂阵","鸟翔阵","地载阵","龙飞阵","蛇蟠阵","鹰啸阵","雷绝阵",}
  --   参数 = 阵法名称[取随机数(1,#阵法名称)]
  elseif 随机参数 <= 75 then
    物品名称 = 取强化石()
  -- elseif 随机参数 <= 90 then
  --     物品名称 = 取宝石()
  --   等级 = 取随机数(1,1)
  -- elseif 随机参数 <= 95 then
  --   if 取随机数() <= 50 then
  --     物品名称 = "制造指南书"
  --     参数=制造指南书数据[取随机数(1,#制造指南书数据)]
  --   else
  --     物品名称 = "百炼精铁"
  --   end
  --   等级 = 取随机数(6,9)*10
  -- else
  --   if 取随机数() <= 50 then
  --     物品名称 = "灵饰指南书"
  --     local 临时范围 = {"手镯","佩饰","戒指","耳饰"}
  --     参数=临时范围[取随机数(1,#临时范围)]
  --   else
  --     物品名称 = "元灵晶石"
  --   end
  --   等级 = math.floor(取随机数(6,8)/2)*2*10
  end
  任务数据[任务id].物品=物品名称
  任务数据[任务id].参数=参数
  任务数据[任务id].等级=等级
  if 任务数据[任务id].等级 then
    if 任务数据[任务id].参数 then
      添加最后对话(id,format("新年伊始,听闻%s的%s正在寻找#R/%s级%s(%s)#W/抓紧前往寻找把！",任务数据[任务id].地图名称,任务数据[任务id].名称,任务数据[任务id].等级,任务数据[任务id].物品,任务数据[任务id].参数))
    else
      添加最后对话(id,format("新年伊始,听闻%s的%s正在寻找#R/%s级%s#W/抓紧前往寻找把！",任务数据[任务id].地图名称,任务数据[任务id].名称,任务数据[任务id].等级,任务数据[任务id].物品))
    end
  else
    if 任务数据[任务id].参数 then
      添加最后对话(id,format("新年伊始,听闻%s的%s正在寻找#R/%s(%s)#W/抓紧前往寻找把！",任务数据[任务id].地图名称,任务数据[任务id].名称,任务数据[任务id].物品,任务数据[任务id].参数))
    else
      添加最后对话(id,format("新年伊始,听闻%s的%s正在寻找#R/%s#W/抓紧前往寻找把！",任务数据[任务id].地图名称,任务数据[任务id].名称,任务数据[任务id].物品))
    end
  end
  刷新队伍任务追踪(id)
end

function 五行年兽:完成五行年兽任务(id,任务id,难度)
  任务数据[任务id].进程 = 任务数据[任务id].进程 + 1
  任务数据[任务id].积分 = 任务数据[任务id].积分 + 1
  任务数据[任务id].物品=nil
  任务数据[任务id].参数=nil
  任务数据[任务id].等级=nil
  if 任务数据[任务id].进程/3 == math.floor(任务数据[任务id].进程/3) then
    self:五行年兽杀怪(id,任务id)
  else
    self:五行年兽任务物品(id,任务id)
  end
end

function 五行年兽:五行年兽杀怪(id,任务id)
  -- local 挑战顺序 = {{"金属性年兽",1092},{"木属性年兽",1501},{"水属性年兽",1070},{"火属性年兽",1001},{"土属性年兽",1174},{"雷属性年兽",1111},}
  local 挑战顺序 = {{"咸鱼补梦使",1092},{"桃气炼丹师",1501},{"笑面讨债鬼",1070},{"秃头魔导师",1092},{"叽呱冒险家",1111},}
  local 顺序 =  任务数据[任务id].进程/3
  任务数据[任务id].分类=2
  任务数据[任务id].地图编号=挑战顺序[顺序][2]
  任务数据[任务id].地图名称=取地图名称(挑战顺序[顺序][2])
  任务数据[任务id].名称=挑战顺序[顺序][1]
  刷新队伍任务追踪(id)
end

function 五行年兽:完成五行年兽战斗任务(id组,任务id,战斗类型)
  if 战斗类型 == 150073 or 战斗类型 == 150074 then
    return
  end
  if 任务数据[任务id] then
    local 积分 = 1
    if 战斗类型 == 150072 then
      if 难度 == "困难难度" then
        积分 = 2
      elseif 难度 == "英雄难度" then
        积分 = 3
      end
      积分 = 积分 + 任务数据[任务id].进程/3
    elseif 战斗类型 == 150075 then
      积分 = 10
    elseif 战斗类型 == 150175 then
      积分 = 20
    elseif 战斗类型 == 150275 then
      积分 = 30
    end
    任务数据[任务id].积分 = 任务数据[任务id].积分 + 积分


      for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(170,1280)+500000
        local 银子=平均等级*5000
        玩家数据[id].角色:添加经验(经验,"嘉年华",1)
        玩家数据[id].角色:添加银子(qz(银子),"嘉年华",1)
        玩家数据[id].角色:添加嘉年华积分(积分)
      -- 常规提示(id,"#Y/恭喜你完成了本环嘉年华任务,你获得了"..积分.."点嘉年华积分！")
          local 链接 = {提示=format("#S(嘉年华)#R/%s#Y经过一番激烈的战斗，最终完成了#R嘉年华任务#Y，#Y因获得了丰厚奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
          local 奖励参数=取随机数(1,100)
           if 奖励参数<=3 then
          local 名称="高级魔兽要诀"
          玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
          elseif 奖励参数<=5 then
          local 名称="高级召唤兽内丹"
          玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
            elseif 奖励参数<=7 then
          local 名称="摇钱树苗"
          玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
    elseif 奖励参数<=9 then
    local 名称="超级金柳露"
    玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
    elseif 奖励参数<=11 then
    local 名称="彩果"
    玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
        elseif 奖励参数<=13 then
          local 名称="修炼果"
          玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
    elseif 奖励参数<=14 then
    local 名称="五宝盒"
    玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
     elseif 奖励参数<=15 then
    local     名称="符石卷轴"
         玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
        elseif 奖励参数<=16 then
          local 名称=取强化石()
           玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,3),nil,链接)
         --   elseif 奖励参数<=17 then
         --  local 名称="上古锻造图策"
         -- 玩家数据[id].道具:给予超链接道具(id,名称,取随机数(7,9),nil,链接)
        elseif 奖励参数<=18 then
          local 名称="星辉石"
          玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
        --  elseif 奖励参数<=19 then
--          local 名称="金柳露"
        --  玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
         --   elseif 奖励参数<=20 then
         --  local 名称="宝宝书铁"
         -- 玩家数据[id].道具:给予超链接道具(id,名称,取随机数(7,9),nil,链接)
          elseif 奖励参数<=25 then
          local 名称="青花瓷锦衣·碎片"
          玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,3),nil,链接)
        elseif 奖励参数<=35 then
          local 名称="九转金丹"
          玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
        elseif 奖励参数<=36 then
          local 名称="高级召唤兽内丹"
          玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
        elseif 奖励参数<=37 then
          local 名称=取宝石()
          玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,3),nil,链接)
        elseif 奖励参数<=45 then
          local 名称="魔兽要诀"
          玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
        elseif 奖励参数<=46 then
          local 名称="召唤兽内丹"
          玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
    elseif 奖励参数<=47 then
    local 名称="金柳露"
    玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
    elseif 奖励参数<=48 then
          local 名称="特殊兽诀·碎片"
          玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
     elseif 奖励参数<=49 then
     local 名称="怪物卡片"
    玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,8),nil,链接)
    elseif 奖励参数<=50 then
    local 名称="净瓶玉露"
    玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
    elseif 奖励参数<=51 then
    local 名称="神兜兜"
    玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,3),nil,链接)
    elseif 奖励参数<=52 then
    local 名称="高级魔兽要诀"
    玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)



       end
    end

    if 任务数据[任务id].进程 < 15 then
      任务数据[任务id].进程 = 任务数据[任务id].进程 + 1
      任务数据[任务id].物品=nil
      任务数据[任务id].参数=nil
      任务数据[任务id].等级=nil
      self:五行年兽任务物品(id组[1],任务id)
    else
      for i=1,#id组 do
        local id = id组[i]
        -- 玩家数据[id].角色:添加银子(5000000,"五行年兽",1)
        添加活跃(id,20)
        常规提示(id,"#Y/恭喜你完成了本轮五行年兽任务！")
        玩家数据[id].角色:取消任务(任务id)
        刷新队伍任务追踪(id)
      end
      任务数据[任务id]=nil
    end
  end
end
return 五行年兽