剑会天下开关=false
剑会天下单人匹配开关 = false
剑会天下三人匹配开关 = false
剑会天下五人匹配开关 = false
剑会天下单人匹配={}
剑会天下三人匹配={}
剑会天下五人匹配={}
剑会天下次数统计={}
剑会匹配=os.time()
剑会记录={}
if f函数.文件是否存在([[sql/剑会天下.txt]])==false then
  剑会天下={}
  写出文件([[sql/剑会天下.txt]],table.tostring(剑会天下))
else
  剑会天下=table.loadstring(读入文件([[sql/剑会天下.txt]]))
end

local 剑会单人活动时间=QJHDSJ["剑会单人"]
local 剑会三人活动时间=QJHDSJ["剑会三人"]
local 剑会五人活动时间=QJHDSJ["剑会五人"]
function 剑会活动定时器()
    if not 剑会天下开关 then
        if 剑会单人活动时间.日期=="每天" then
            if 剑会单人活动时间.时==服务端参数.小时+0 and 剑会单人活动时间.分==服务端参数.分钟+0 and 剑会单人活动时间.秒<=服务端参数.秒+0  then
                任务处理类.开启剑会天下("单人")
            end
        elseif 剑会单人活动时间.大写日期 == "每月" then
            local currentDate = tonumber(os.date("*t"))
            if currentDate == 1 then
                if 剑会单人活动时间.时==服务端参数.小时+0 and 剑会单人活动时间.分==服务端参数.分钟+0 and 剑会单人活动时间.秒<=服务端参数.秒+0 then
                    任务处理类.开启剑会天下("单人")
                end
            end
        elseif 剑会单人活动时间.大写日期 == "半月" then
            local currentDate = tonumber(os.date("*t"))
            if currentDate == 1 or currentDate == 15 then
                if 剑会单人活动时间.时==服务端参数.小时+0 and 剑会单人活动时间.分==服务端参数.分钟+0 and 剑会单人活动时间.秒<=服务端参数.秒+0 then
                    任务处理类.开启剑会天下("单人")
                end
            end
        else
            local zhouji=tonumber(os.date("%w", os.time()))
            if zhouji == tonumber(剑会单人活动时间.日期) then
                if 剑会单人活动时间.时==服务端参数.小时+0 and 剑会单人活动时间.分==服务端参数.分钟+0 and 剑会单人活动时间.秒<=服务端参数.秒+0  then
                    任务处理类.开启剑会天下("单人")
                end
            elseif 剑会单人活动时间.日期=="周135" and (zhouji==1 or zhouji==3 or zhouji==5) then
                if 剑会单人活动时间.时==服务端参数.小时+0 and 剑会单人活动时间.分==服务端参数.分钟+0 and 剑会单人活动时间.秒<=服务端参数.秒+0  then
                    任务处理类.开启剑会天下("单人")
                end
            elseif 剑会单人活动时间.日期=="周246" and (zhouji==2 or zhouji==4 or zhouji==6) then
                if 剑会单人活动时间.时==服务端参数.小时+0 and 剑会单人活动时间.分==服务端参数.分钟+0 and 剑会单人活动时间.秒<=服务端参数.秒+0  then
                    任务处理类.开启剑会天下("单人")
                end
            end
        end

        if 剑会三人活动时间.日期=="每天" then
            if 剑会三人活动时间.时==服务端参数.小时+0 and 剑会三人活动时间.分==服务端参数.分钟+0 and 剑会三人活动时间.秒<=服务端参数.秒+0  then
                任务处理类.开启剑会天下("三人")
            end
        elseif 剑会三人活动时间.大写日期 == "每月" then
            local currentDate = tonumber(os.date("*t"))
            if currentDate == 1 then
                if 剑会三人活动时间.时==服务端参数.小时+0 and 剑会三人活动时间.分==服务端参数.分钟+0 and 剑会三人活动时间.秒<=服务端参数.秒+0 then
                    任务处理类.开启剑会天下("三人")
                end
            end
        elseif 剑会三人活动时间.大写日期 == "半月" then
            local currentDate = tonumber(os.date("*t"))
            if currentDate == 1 or currentDate == 15 then
                if 剑会三人活动时间.时==服务端参数.小时+0 and 剑会三人活动时间.分==服务端参数.分钟+0 and 剑会三人活动时间.秒<=服务端参数.秒+0 then
                    任务处理类.开启剑会天下("三人")
                end
            end
        else
            local zhouji=tonumber(os.date("%w", os.time()))
            if zhouji == tonumber(剑会三人活动时间.日期) then
                if 剑会三人活动时间.时==服务端参数.小时+0 and 剑会三人活动时间.分==服务端参数.分钟+0 and 剑会三人活动时间.秒<=服务端参数.秒+0  then
                    任务处理类.开启剑会天下("三人")
                end
            elseif 剑会三人活动时间.日期=="周135" and (zhouji==1 or zhouji==3 or zhouji==5) then
                if 剑会三人活动时间.时==服务端参数.小时+0 and 剑会三人活动时间.分==服务端参数.分钟+0 and 剑会三人活动时间.秒<=服务端参数.秒+0  then
                    任务处理类.开启剑会天下("三人")
                end
            elseif 剑会三人活动时间.日期=="周246" and (zhouji==2 or zhouji==4 or zhouji==6) then
                if 剑会三人活动时间.时==服务端参数.小时+0 and 剑会三人活动时间.分==服务端参数.分钟+0 and 剑会三人活动时间.秒<=服务端参数.秒+0  then
                    任务处理类.开启剑会天下("三人")
                end
            end
        end

        if 剑会五人活动时间.日期=="每天" then
            if 剑会五人活动时间.时==服务端参数.小时+0 and 剑会五人活动时间.分==服务端参数.分钟+0 and 剑会五人活动时间.秒<=服务端参数.秒+0  then
                任务处理类.开启剑会天下("五人")
            end
        elseif 剑会五人活动时间.大写日期 == "每月" then
            local currentDate = tonumber(os.date("*t"))
            if currentDate == 1 then
                if 剑会五人活动时间.时==服务端参数.小时+0 and 剑会五人活动时间.分==服务端参数.分钟+0 and 剑会五人活动时间.秒<=服务端参数.秒+0 then
                    任务处理类.开启剑会天下("五人")
                end
            end
        elseif 剑会五人活动时间.大写日期 == "半月" then
            local currentDate = tonumber(os.date("*t"))
            if currentDate == 1 or currentDate == 15 then
                if 剑会五人活动时间.时==服务端参数.小时+0 and 剑会五人活动时间.分==服务端参数.分钟+0 and 剑会五人活动时间.秒<=服务端参数.秒+0 then
                    任务处理类.开启剑会天下("五人")
                end
            end
        else
            local zhouji=tonumber(os.date("%w", os.time()))
            if zhouji == tonumber(剑会五人活动时间.日期) then
                if 剑会五人活动时间.时==服务端参数.小时+0 and 剑会五人活动时间.分==服务端参数.分钟+0 and 剑会五人活动时间.秒<=服务端参数.秒+0  then
                    任务处理类.开启剑会天下("五人")
                end
            elseif 剑会五人活动时间.日期=="周135" and (zhouji==1 or zhouji==3 or zhouji==5) then
                if 剑会五人活动时间.时==服务端参数.小时+0 and 剑会五人活动时间.分==服务端参数.分钟+0 and 剑会五人活动时间.秒<=服务端参数.秒+0  then
                    任务处理类.开启剑会天下("五人")
                end
            elseif 剑会五人活动时间.日期=="周246" and (zhouji==2 or zhouji==4 or zhouji==6) then
                if 剑会五人活动时间.时==服务端参数.小时+0 and 剑会五人活动时间.分==服务端参数.分钟+0 and 剑会五人活动时间.秒<=服务端参数.秒+0  then
                    任务处理类.开启剑会天下("五人")
                end
            end
        end
    elseif 剑会天下开始时间 then
        if 剑会天下开始时间 - os.time() <= 0 then
            剑会天下开始时间 = nil
            任务处理类.关闭剑会天下()
        end
    end
end

function 取剑会天下数据(id)
  if 剑会天下[id]==nil then
    剑会天下[id]={当前积分=1200,连胜=0,名称=玩家数据[id].角色.名称,等级=玩家数据[id].角色.等级,id=id,门派=玩家数据[id].角色.门派}
  end
end

function 取可佩带武器名称(模型,等级)
  local n={}
  local 子类 = 角色武器类型[模型]
  -- print(模型)
  --table.print(子类)
  local 佩戴 = 子类[取随机数(1,#子类)]
  local 序列 = 0
  if 等级<=99 then
    序列=9
  elseif 等级<=109 then
    序列=11
  elseif 等级<=119 then
    序列=12
  elseif 等级<=129 then
    序列=13
  elseif 等级<=139 then
    序列=14
  elseif 等级<=149 then
    序列=15
  elseif 等级<=159 then
    序列=16
  else
    序列=17
  end
  n[1] = {"红缨枪","曲尖枪","锯齿矛","乌金三叉戟","火焰枪","墨杆金钩","玄铁矛","金蛇信","丈八点钢矛","暗夜","梨花","梨花","刑天之逆","五虎断魂","飞龙在天","天龙破城","弑皇"}
  n[2] = {"青铜斧","开山斧","双面斧","双弦钺","精钢禅钺","黄金钺","乌金鬼头镰","狂魔镰","恶龙之齿","破魄","肃魂","无敌","五丁开山","元神禁锢","护法灭魔","碧血干戚","裂天"}
  n[3] = {"青铜短剑","铁齿剑","吴越剑","青锋剑","龙泉剑","黄金剑","游龙剑","北斗七星剑","碧玉剑","鱼肠","倚天","湛卢","魏武青虹","灵犀神剑","四法青云","霜冷九州","擒龙"}
  n[4] = {"双短剑","镔铁双剑","龙凤双剑","竹节双剑","狼牙双剑","鱼骨双剑","赤焰双剑","墨玉双剑","梅花双剑","阴阳","月光双剑","灵蛇","金龙双剪","连理双树","祖龙对剑","紫电青霜","浮犀"}
  n[5] = {"五色缎带","幻彩银纱","金丝彩带","无极丝","天蚕丝带","云龙绸带","七彩罗刹","缚神绫","九天仙绫","彩虹","流云","碧波","秋水落霞","晃金仙绳","此最相思","揽月摘星","九霄"}
  n[6] = {"铁爪","天狼爪","幽冥鬼爪","青龙牙","勾魂爪","玄冰刺","青刚刺","华光刺","龙鳞刺","撕天","毒牙","胭脂","九阴勾魂","雪蚕之刺","贵霜之牙","忘川三途","离钩"}
  n[7] = {"折扇","铁骨扇","精钢扇","铁面扇","百折扇","劈水扇","神火扇","阴风扇","风云雷电","太极","玉龙","秋风","画龙点睛","秋水人家","逍遥江湖","浩气长舒","星瀚"}
  n[8] = {"细木棒","金丝魔棒","玉如意","点金棒","云龙棒","幽路引魂","满天星","水晶棒","日月光华","沧海","红莲","盘龙","降魔玉杵","青藤玉树","墨玉骷髅","丝萝乔木","醍醐"}
  n[9] = {"松木锤","镔铁锤","八棱金瓜","狼牙锤","烈焰锤","破甲战锤","震天锤","巨灵神锤","天崩地裂","八卦","鬼牙","雷神","混元金锤","九瓣莲花","鬼王蚀日","狂澜碎岳","碎寂"}
  n[10] = {"牛皮鞭","牛筋鞭","乌龙鞭","钢结鞭","蛇骨鞭","玉竹金铃","青藤柳叶鞭","雷鸣嗜血鞭","混元金钩","龙筋","百花","吹雪","游龙惊鸿","仙人指路","血之刺藤","牧云清歌","霜陨"}
  n[11] = {"黄铜圈","精钢日月圈","离情环","金刺轮","风火圈","赤炎环","蛇形月","子母双月","斜月狼牙","如意","乾坤","月光双环","别情离恨","金玉双环","九天金线","无关风月","朝夕"}
  n[12] = {"柳叶刀","苗刀","夜魔弯刀","金背大砍刀","雁翅刀","破天宝刀","狼牙刀","龙鳞宝刀","黑炎魔刀","冷月","屠龙","血刃","偃月青龙","晓风残月","斩妖泣血","业火三灾","鸣鸿"}
  n[13] = {"曲柳杖","红木杖","白椴杖","墨铁拐","玄铁牛角杖","鹰眼法杖","腾云杖","引魂杖","碧玺杖","业焰","玉辉","鹿鸣","庄周梦蝶","凤翼流珠","雪蟒霜寒","碧海潮生","弦月"}
  n[14] = {"硬木弓","铁胆弓","紫檀弓","宝雕长弓","錾金宝弓","玉腰弯弓","连珠神弓","游鱼戏珠","灵犀望月","非攻","幽篁","百鬼","冥火薄天","龙鸣寒水","太极流光","九霄风雷","若木"}
  n[15] = {"琉璃珠","水晶珠","珍宝珠","翡翠珠","莲华珠","夜灵珠","如意宝珠","沧海明珠","无量玉璧","离火","飞星","月华","回风舞雪","紫金葫芦","裂云啸日","云雷万里","赤明"}
  n[16] = {"钝铁重剑","桃印铁刃","赭石巨剑","壁玉长铗","青铜古剑","金错巨刃","惊涛雪","醉浮生","沉戟天戊","鸦九","昆吾","弦歌","墨骨枯麟","腾蛇郁刃","秋水澄流","百辟镇魂","长息"}
  n[17] = {"油纸伞","红罗伞","紫竹伞","锦绣椎","幽兰帐","琳琅盖","孔雀羽","金刚伞","落梅伞","鬼骨","云梦","枕霞","碧火琉璃","雪羽穿云","月影星痕","浮生归梦","晴雪"}
  n[18] = {"素纸灯","竹骨灯","红灯笼","鲤鱼灯","芙蓉花灯","如意宫灯","玲珑盏","玉兔盏","冰心盏","蟠龙","云鹤","风荷","金风玉露","凰火燎原","月露清愁","夭桃秾李","荒尘"}
  return {n[佩戴][序列],(序列-1)*10}
end

function 取随机中文姓名(num)
  local 字库 = "闻霁充娅思邸硕司马凝远哀元绿端元瑶褚曜灿堂涵忍摘大郝奥翦含莲罗小瑜查冷雪乐正玉琲田正平钟之玉赵斯令狐昆明檄春燕范振海夙元龙赫嘉玉子车舒兰蛮谧登谷雪夔毅秋锁鸿媳赖温瑜折靖之集晓曼甲文思妫巧凡酒擅邗雁卉帛小蕊左春兰节书双应卿陶骏中望舒驹建修禚又儿似修远百令雪占嘉悦谢刚毅银青梦苏波涛鲍慕诗敖弘伟贯语儿姬寄波澄正信蒉鹤梦琦银河鞠春祁秋翠开智渊东郭雅素闵妮子辟雨雪勾红螺张廖元勋隐弘量晋紫雪洛冰慎贤淑嬴天音续之桃唐涵意招正平归梦云束新苗喜逸明史语林后同光青安青接凝芙洋庄雅位英范危芳茵及谷槐郗访曼逯雨珍信昊苍慕驰月诸白萱臧彤彤畅阳曦仉傲雪守易云运思彤漆雕韫玉空歌闪梦菡赫连翰采督代珊姓蕾宝洛妃建诗霜米海菡颛孙瀚昂贲仕壬雅云禽文康后漾漾藩驰丽卿瑜江欣悦杞傲冬阿含之卢雅丹悟远碧如波糜雨信南家欣窦冬卉贝启颜水子美辉高兴喻荷紫黎和通辛问萍纳本眭晗日滕月天赏鹏涛历乃丰家伍心曾沙摩凌兰熊昭昭出文景康卫睢痴凝闾清润修骊英莫向晨愧采萱九驰不听然稽安珊库燕妮伯巧夏营欢问音愚晶灵亓官馨欣竹晓蕾拓跋琨瑜盖问萍阎捷揭元槐纵兴运斐闲丽舜赐迟欣崇书萱宗政夜蓉丁易梦宇梦香郁静柏戏飞薇裔音韵云彩萱牵芊候一嘉求慕悦贰馨香伊白云淳于春英亢三载半兰能清逸蒲千亦检夜梅李寄瑶余盼翠张简琨燕佩杉端木诗珊万心菱台浩宕恽平婉终阳阳岳藏栾鸿飞巴云飞狂新梅郏凌兰衷平母子芸卜静舷萨任真太史天薇蹉宛妙房飞文宋乐游边佩蓟天罡纳喇和裕贵立人呼延素昕薛明熙考飒理丹烟封静慧线叡费慕山谷蔓官梦华谌初夏成芦冠英韶饶颖初枚浩波全从筠风闲公新蕾春山兰拱晨欣宇文思萱鹿寒天邢清涵牧心语双寒介平心抄幼荷图门沛首堂却强严景澄绍曦之纪德昌剧沛容和新筠奕白卉翠问兰校以丹禹骏英强靓影沙银弭海颖告博简段干庄葛雨真支怜双褒静枫巫慕思屠建柏汝燕珺缪斯雅松秋英刚星河勤昆峰宛宜阮凡雁楼和洽卯友安善宏阔裘鸿彩柳乐章华倩秀说暮芸长秋玉师飞兰蔺以彤宿曼寒凭雨伯山幼仪钞怀玉汉华晖幸宏大广洋洋树隽美进乐容芒倚本天巧隽文光完颜亦凝乔冷萱用晴虹温芦雪夏侯飞昂书映秋马佳云逸英听芹辜厚荆书艺亓若淑芮惠然羊英苌明珠穰西生雨石但梓璐岑睿范完湘所代梅清翰学答陶秘以彤融菡梅蒋曼凡帖雅彤向绮梅恭昶良语燕豆涤咎凝罕幼柏聊敏达愈曼岚波晴照那拉翠芙桥映冬倪柔妙夏空牢元绿蒯春晓皮迎丝拜烨华红吉玉马惠君敛半香那含巧陀嘉祥骑访文禾润魏向秋桑驰海卯阳旭邬凌春福听安连醉波原浩然扶施诗邵靖颜寻双车子蕙垄醉巧第悟蓬白曼律楚庞颖秀势文惠仝安宜谈晶滢满梦竹瞿丝劳乐然元浩气有浩淼司徒嘉致玉颖颖竭袖公冶兰英让森丽蹇清淑泉思美佴昊东潘鹏池宓霞雰浦桂芝同斯伯种向晨厚娜周舟邛采绿前香桃祢春梳溥云亭绪水彤兆阳蓉秦腾逸舒魄羽家美令和硕永慕蕊由亦梅仇依辰柏甜恬仲孙俊捷功映秋笪昕昕麦平萱化清绮酆易容尹姗寿山芙段证百里浩岚碧鲁清怡仁俊爽花香莲太叔欣悦冉山蝶呼晗玥少骊蓉司嘉议轩援又青宾若骞鄂永贞邰新知谷梁又槐公西学义业绿蕊肥荌牛含香仪智勇尤噬汪伟志甫紫云奚觅风于家美栗庆音童半雪野翰藻丑礼骞路半青肇同方漆暖梦世幼枫峪景龙硕寄松弥丹萱箕岚风谯志行朱玉树费莫阳晖象翠茵东方震繁梓云公良凌蝶綦凡灵资夏旋潜高义冀香旋伺醉柳祈海白焉文斌俎赞乌雅丽华植乐双犹诗桃乌孙弘壮勇婷婷力三姗夷阳舒大凌春毓敏智普巍然包文昌希之仆鸿运宣用才唁红泥俨虞璞性元正甄水风卑耘豪蔡清雅尉初雪曲琛雍经业高知荀涵涤吉通随思远苗凝海诺纯战承安夹谷霞梳左丘南琴称之卉瑞古代唱月兴香岚佼兴德茹昊硕杨谷之侯沛槐况瑜英军丹寒蓉希慕慕容涵蕾貊凯唱养福濯茂学郦彰明朗丽刘阳火骆轩秀智春柏石浩广泰嘉平虢芝兰鄢秋寒市饮月镇寒梦易鹏飞鲜安楚易真卫瑛瑶齐博涛函秀竹茂楠楠謇济彤玛丽屈丹山顿复孟又菡利廷剑作人度暄莹危元嘉庚雅琴之虹彩门念双虎朝池灵珊望和同延映寒廖博瀚娄钰诸葛茂唁布幻天文晓枫笃凝珍东门兴昌闳虹颖奈碧春俟楠乙音华达灵安威夏月公羊羡寻才捷棺玉轩蒙溪隋琪睿柯宜然以惜芹刀晴曦汗健尉迟雅琴皇甲钱豫暴雨莲时秋露北访冬速盼易樊思怡缑哲思斛熙星伦建武鸿达宦惜香寇代巧上官半凡竺赫尔夜雪改清懿通从凝源雨琴焦晴波析芳茵穆梳美麴依白郁旻骞巩宁税谷槐祝鸿卓始淳静井映雪籍辰皓钮白梅保若芳睦初蝶昔虹雨章佳浚乐嘉熙佘令锋肖运洁励阳曜京英豪郸元甲吴雅美于夏菡詹依秋阴绍辉雪春雪管骊霞闫晖素婉静奇笛韵僪问柳捷瑛承英才刁采白郑惜玉城澍钭若翠买任习春翠椅灵雨施叶春侨采苟绿海耿萄萄毕秋华檀程单于凌丝犁新儿璩嘉树鲁建安区巧荷老颜骏初倩鱼南琴惠蕴和枝丽泽士运菱佛靖儿欧梦露祖晶滢盈修文扬玲逄伦六湘君顾博雅塔尚庹尔阳昌水之摇碧琴莘浩涆伟佁然微生玥逮愉东望雅沃爵殳欣悦陆半脱向卉在驰媛丙莱言思义侍涵蕾朴宇邴慧颖敬迎南冯兴盛丹秋仰寅果迎曼次芃孙明凝多月灵廉怿昂丹彤公孙问凝霜为郎翊君紫冷之歧彤可念烟千依云索友灵庾瑜然漫友安镜涵菱蔚怜烟申高峰丛庄静实问薇薄简藏梅梅范姜锐意蓝豪纤情文森易天寄灵雀和昶刑洋公叔慈农嘉良靳向南嘉艳蕊疏玑单雪羽哈高格字静安嵇凯旋都苑项映寒乾芳荃牟云水矫昊宇渠奕俞水洪腾骏澹台书兰巫马南晴潭陶然行俊艾匡雅韵淦志明琴元青家甘盍念珍孝弘大雷丰茂亥绮烟益河灵真胤运司寇梦桃宁茵禄萦党明德荤羡丽敏怿梅思美聂德运局涵韵宫柔蔓游乐邝怀梦干鸣革德华黄从蕾戴卓然曹昊天腾经零惜儿湛骊颖香含云阳子帆胡吉星藤晓曼国德厉丝柳别俊晤皋荷止曼蔓卷骄无念梦环嘉珍钟离飞语晁安萱仵平绿声宏硕麻初彤戢清漪寸方凤素昕吕华翰频琴贾凌覃采梦苑雅逸操又夏浑柔惠章运诚诗文君乌以蕊礼鸿才慈听枫错惜狄溥心韶博裕独湛芳戊曜曦柔存郯迎真居扬僧羲过琛丽锐惠心须卿月堵曼衍展香萱其和悌昝修雅班和雅冒诗蕊崔雅素仍采南旗曼冬墨毅梅磨雯华圣冬梅潭觅露纵智系玉瑾尾修永相半双典琅翁韵萧和悌兰妙芙赤勇毅何浩慨杜胤富察丽文王谷菱示坚壁赛醉柳梁丘阳兰依安翔允曼寒沉秀雅邓端敏么梓馨浮安易龚芸若彭雄掌秀媚己伶俐请南霜暨芝戚飞光第五凝莲步夏瑶星元基郜傲之祭瑞芝储海超抗畅然念慧秀钊香梅忻笛濮阳春华练毅文户和美铣小夏粟晓曼栋听枫壤驷访文毋舒兰隆迎丝是南露留严和林紫雪权涵煦戎智敏涂若云方尔柳季以柳逢凝安侍阳煦夕涵育将芳馨乘友槐白雪曼袁半芹茅夜玉经禹巢春柔邶逸思厍鸿哲晏灵卉莱广符天蓝宜永嘉绳昕解弼宏宜修龙文德吾秀美卞振国戈冰冰谬梓露信凝绿赧晓山南门浦泽孛鸿祯裴心语陈证琪类昊然朋尾府运珹帅寻云道虹影贸驰逸程幻巧学醉柳秋觅柔针启寒秋珊怀玉龙闽星爵塞艳卉殷曼容甘紫萱尚新美淡秀妮席飞双斯丽窃碧灵衣灵波潮冰真丘春海汤语彤从谷翠叶素欣光晴曦伏湉湉印从霜傅彩严许迎天佟佳壮羿海凡徐语蓉偶乐松越凌晓柴妙晴衡中旁学民古芳商芸芸阙沛白锺离从蓉盘婉柔欧阳晨辰杭初之平云蔚飞雅静濮云金乐巧冷春雪宰永宁靖光耀迮昭君爱若雁卓高达乜语梦闭小翠休娟严合全夫怡悦万俟书琴德欣然贺念云苍笑柳粘证蝶长孙半兰姜天和鄞孤萍简晋鹏铁毅远董沛凝司空清韵贡志文来暄和桓凡桃宗梦寒悉丽梳阚弘济叔自霍怀曼汲平卉撒白秋旅依琴仙依心翟乐天宰父幼荷郭国源常浦泽翁语弓红叶委依云梁新雅张筠溪安嘉祯苦子珍闾丘俊美沐幼霜义子骞皇甫谷玉遇儿五又松南宫涵映孔平卉锺昊空计翰飞申屠阔定白凝谏允晨凌田絮沛白员雅柔訾慕凝表元凯巨书萱机景明桐醉蝶艾锐锋关渺仲子萱丹正卿奉浩思任暄闻人曼梅蒿皓月景芮丽富宜庄艳芳务蕙兰法景明扈紫丝玄宛曼鲜于岑巧善和滑安和铎珠轩海同韩飞雪召宇烟昊天桂绮晴容惜灵年芬芬邱芳蔼徭佳惠西门思莹佟白翠姚远骞旷天骄毛青友芝宇坚建元板松月泣乐蕊羊舌新洁圭湘云弘以蕊受霞文回兴贤忻证烟寒辰龙错远悦郏怜雪本羡丽巫俊民虢辰钊陶绮波危兴请从鹏云书湘云师朗权华美侯翠梅謇惠君濮采萱繁素昕公西暮芸令紫南欧阳悦媛皇甫珍丽段干冠宇僧梳全苗边萦心揭翰采辛嘉禾睦碧螺阿静粟凡白梁光熙昂玄静钮小蕊锺离易绿碧向槐抗宏壮戊依白羽小蕾莘宏博单迎南逄高兴古新林战灵槐萨曦悟梓珊孛晓星请宛卓芊芊中宜嘉字蓓蕾喻清芬焦书云劳彤犁英睿光暖聂以蕊钟离芸芸锐凌香真寒梅郁龙皇香天乌雅烨磊郜阳司空翠岚九山菡皮静秀嵇昭懿薛雨泽伍瑞渊单于梦露纪润亓绮玉区经亘甫冷萱藏妙晴练志学宗萄貊伟兆罗绿凝秘康成左丘婉丽邝小星乜乐安谷梁梦桐覃春柏恽耘涛傅贤淑伺光辉谈星驰载易巧理陶宁革涵涵在梓萱伊奇文独寒香合静婉苦安国枚涵阳越含说艳丽阮月悦函安娜郸飞跃赫连俊雅诗婉静善运凯应惜筠环君浩翠白竹矫文昌窃冬梅丹思雅武菡操毅君富润丽姜清婉斛雅容仰琬义弘光詹志行庾方方晁英华班雅韵慕鸿祯干若纳宏峻铎湛英铣雅宁褒浦和乔毅秋东方香洁喜怡和于千山养雅容车珠玉荆证若茹胜撒晨轩富察静雅东郭刚毅解夏寒袁芙受承安禾盼丹孝凡儿鄂冰安蹉秉漆雕香波宇文楚天长星强毅灵须秋芸通宛丝蒯顺慈同若英戎成侍山槐郭雅惠夕怀山封谷尤山雁示俊力阴暄美桥元菱斯鸿信瞿沛雯拓跋采枫翦雪兰庄雅舷都毅安潭秀雅类淑华蛮冰表晓彤似香卉节丽华汪问风燕苑杰法鸿远苟天韵纵高朗罕云溪机梦琪倪思义帛诗翠伦迎夏丁巧云宇文曜晏天真甘高原代绮云圣以晴沉绿兰巢桂华第运鹏贝智辰垄思博空振锐顾月杉玉骊萍陀昭祝灵松威韶翁静枫楚秀颖家婷美辟和煦奚广君毛莞然宗政笑严阎向雪姚雍雅哈尔阳申语蕊尉冰双佴新翰钞问梅厍依柔委和正多堂庚又柔纤绿竹元蔓儿资妙音亓官静芙尚运珹钭证文随宏义白浩阔犹安安邛宏爽施尔槐驹姗姗贺代梅逮浩然栗景彰仙和悦峪雅艳支语丝波绿蕊候国兴章钧接凌青上官雅艳祭依美云严严伟新月贸凡灵酒霈周夏柳笪妙芙叔鸿云以乐家玄春华刀梓柔昔毅梅象寒烟念冷荷端华晖郁泽雨蓟阳兰百里以晴路宜欣闳蕴秀公冶昌勋甄兴德曹采文暨小春严本林曲静锁冷雪硕和洽司徒白秋桑巧春董元忠巴和玉乙远航前含秀竭雄禚醉芙涂艳芳唐夏柳金如曼青年茅翠阳虎微澜范姜雅达卿清怡彤心香闾尔柳京素昕邓丹丹敏天青励星华巧悦爱壤驷流如慎安祯端木凝芙薄齐心蓝念文士灵慧延鸿晖宏韵磬雪丽芳堵馨欣麻智敏北蔼贾乐成嘉玲珑廖曼珠种文敏毕诗珊石慕卉江山蝶仲绮玉旁安荷佟佳金玉让慧婕旷谷兰松悦宜考幼怡卢扬滕佩杉军觅双藤正平侨晴岚刚平良危凝静孙宏阔戚魁将沛凝郑良骏始今敖雅安宿恬畅潜初雪是陶然晋瑶岑睢静竹衷寒梅银琪告景福宣若云化曼冬惠曼婉眭亦褚毅南稽夏瑶呼延姣严张简新知温水丹植永昌红毅彤闵灵波公宏貌向平宁隽代双赛筱贲星文花念念摘景明钟子珍仝谷蕊寿雨琴捷起壬昊昊东门山雁赤沛春储腾骏枝慧月毓觅晴哀宁徐梦之湛苒苒卫慧牛迎南亥忻欢熊英叡过优悠问允建乐圣郎安娜万俟飞翔买秀隽梁丘振宇徭云飞有荷珠速浚伯冰海愚慧君英静竹俞幻玉琦米冀元行访烟凤阳夏泥寄柔敬凝竹王博擅公叔兰英赏婉娜闾丘星火藩初柳佘靖巧庞靖易辉元冬充晓莉老流乌皓轩刘雅辰城韵诗鄞学名才绿旋频代秋树巧夏卯宇臧奇伟弘阳炎畅书文改危杨夜蓉沙念桃厚灵溪令狐双玉修琰淳于毅霜户中闽溶溶赵浦势小蕊鲍香雪佟南琴芮玉成凭浩渺姬桂诸葛如馨澹台正德尹笑容冉才俊尔梓敏辜臻五穰仵夜梅逯冰凡高锦欣盘君丽典懿勤云逸僪莹洁耿鹤骞况华池杞哲圣赖欣畅利博学张晶滢程冬灵池志泽汤绮南刑白安竹听安丙盼旋门怿逢迎梅信悠素鲜雁露杜项明展元旋麦水荷吴元彤塔高貌掌沛白万幼旋实丽文长孙其雨板涵韵亢飇丑利谢瀚海鄢毅成林楠普芳茵剧心宜声伟唁溥洁玉析宵雨吾高旻华之桃梅岑招寅骏靖衍易向卉司寇悦项莺莺务赞莱梓琬腾向阳贰姿夷旭炎鲜于齐濯蕴涵常寄春蒙淳美岳梦寒蒲志用蒿春翠迮秀穆听所舞苍初阳用清润管赫别小凝力晖扈义桂半梅赧蕴和烟天骄后雅蕊春芮佳伏和悌文南栾映雪仁凌春清青柏疏清俊麴傲薇帖慕山融玉泉祈思语旗令羽冷文滨茂泰华桐逸秀盛朔谯烨烨厉和平巩阳禽飞柏连胤文许觅丹夔芳洲保梅风位红雪泣凡桃召惜珊宋晨辰裴傲云谏伟祺祢英卫祁飞捷脱佳文奇青香尾白山暴晤市翰飞缑浩广容证雪休承教登松南门博雅求思菱段唁杉妫听筠宦彤霞方思烟卞掣楼慕蕊邱明旭么依白国宛秋赫恩霈淦子楠阙秀越那拉清华乐正寻梅粘光启聊依琴艾意智允欣美饶心箕清馨庹含桃奉宏恺律翰初田田陈雁风检子石微生致远叶又绿零羽霜古兰贯证文绪锦诗翟平凡季永思羿慈心凌曼彤印歌阑寇钰洪慕凝阳紫文年易梦南馨香守弘新崔隽洁鞠全巫马诗柳张廖皓月费乐邦次萍韵答梦秋达娟闻人嘉佑香毅秋棺幻玉谷忻慕匡茜双琴雪邶雪儿己茗弓昊磊苗书雁智听南呼阳飇敛恨桃焉谷槐蔺静云戏惜珊綦绮美系博文漫雅韶第五沛凝剑冰枫望语雪佼夏雪隐访波依清漪乌孙怀魏永丰肖展景古香斐壤巨煜游烨然丘迎彤党璞称宕舒问凝殷凡灵虞玲折蒙黎斯乔秦季雅完晓习绮兰功向秋朱鹤源娜娜束端敏马鹏举相华灿澄柔丽屠秀媛不丁进吟柔阳朔宰父可可舜雪曼邗尔阳司天工洛智宇碧鲁昕昕盍景龙堂子民步宣朗冠家骏占刚捷莫尔蓉章佳桃雨席琪睿羊睿好隋千叶汝莹华浑雅逸曾化籍馨兰闭问萍甲英朗柳奇水镜晨萱母谧辰友莺语李振博韶丹蝶祖雪卉史白云谬之岑舒昌紫萱笃元容蓬恨真羊舌暄莹浦竹雨荀胤水兴邦竺绮琴由志诚盖白飞惜寒俎天玉康欢欣来元武狂冬灵大新文桓芸若扶纳禹亦竹夹谷野雪任羲鱼毅雪朋蕴美台甘潘雅丹遇宏放太史晴波朴飞掣钊俊智仇晓凡符蔚然吕谨度卿云卜依凝益绿柏闫玉书星笑南韩冰洁圭采萱商芳蕤龙雅丽宓鸿运海静枫柯正文宁游彭书白漆代桃布建白檄维诸欣愉糜朋兴苑丽君历材于韶华檀茵却秋寒禄温文明洛灵拜寒凝完颜沙羽言怡畅房作幸建木介鸿振礼鸿朗希采梦汗恬时芳荃曲尔蝶卑荡蔡清逸鲁雅彤邢俊茂肇晓闻一嘉雀溥心宰健和忻然窦依薇兆芳茵靳兴贤愈冬萱卷念巧翁雅宁迟雅逸针卿月颛孙曜坤局春岚仍飞飙闪品诺清绮泉皓廉才英摇新美乐幼珊咎玉树勾坚白霍驰海包水冬之松崇清涵坚茹云豆觅珍骆巍然戈谷芹居秀兰郗盼晴汲半蕾良以宫暄文戴司辰弥可佳陆绿夏郦启绍畴璩冷松夏侯高岑承坚诚世坚秉绳妙芙蹇正思司马元良悉媛汉之卉欧唁君絮从筠柏绮彤官清淑沃凝心塞鹤梦酆书兰邴琨瑜栋飞双秋英华南宫心菱蒋之槐蒉清卓嬴昊天衡惜筠贵良奥其雪羽风方雅永怜烟线虹星缪格格邵念巧宾气生涵柳磨嘉良抄青梦殳晏然首梅花定怡然续聪慧山骊茹侍灵波纵善静镇尔风锺修洁阚代灵米伶伶安人公良畅畅公羊秀越千琳冒书兰丛半兰芒沛柔仪凝芙计芳林苏正平贡央田鸿博集博无雨歧涵忍仉危井鸿煊关歌阑爱晶辉何舒畅钱永新宜茂才索月渠依萱怀文止高驰盈澍雷霞梳墨学林森思云胡梦蕊刁驰颖愧飞翰百曼衍琴建柏葛晶辉骑云岚寻飞羽野蒙雨顿清淑铁玉韵督蝶梦颜弘济德恨之运天睿开仙仪姓芮帅子真滑毅南留高明范君昊信银柳仆元枫六昂杰龚颖馨出君雅乾逸丽经秋双弭莉莉戢玮琪勇一南图门静槐平若骞旅慕雁偶珠佩果冰之郯依珊夏自珍裘慧语宛飞薇能辰危苌甜恬简菀西门向晨衣和硕佛雪松童良翰长静柏尉迟友易归超子车朝雨邰夏兰恭代蓝回雁菱娄听云牵晗摩婵娟及鹏鲸齐语柔道毅然原卓逸鹿言文广吹屈歆然紫端邬平灵素霞月雍小珍穰怜晴兴素欣员仪文"
  local 字数 = string.len(字库)/2
  local 昵称 = ""
  for i=1,num do
    local 随机文字 = math.random(2,字数)*2
    昵称=昵称..string.sub(字库,随机文字-1,随机文字)
  end
  return 昵称
end

function 任务处理类.开启剑会天下(类型)
    剑会天下开关 = true
    剑会天下开始时间 = os.time() + 7200
    if 类型 == "单人" then--"#Y
        剑会天下单人匹配开关 = true
    elseif 类型 == "三人" then--"#Y
        剑会天下三人匹配开关 = true
    elseif 类型 == "五人" then--"#Y
        剑会天下五人匹配开关 = true
    end
    广播消息({内容="#Y剑会天下"..类型.."活动已经开启#24,#Y/参加的玩家可以参加PK战斗了！",频道="xt"})
    -- 广播消息({内容="#Y剑会天下活动已经开启#24,#Y/参加的玩家可以参加PK战斗了！",频道="xt"})

end

function 任务处理类.关闭剑会天下()
    剑会天下开关 = false
    剑会天下单人匹配开关 = false
    剑会天下三人匹配开关 = false
    剑会天下五人匹配开关 = false
    for n,v in pairs(剑会天下单人匹配) do
        if 玩家数据[v.id]~=nil then
            发送数据(玩家数据[v.id].连接id,138.1)
            常规提示(v.id,"#Y/剑会天下活动已经结束了！")
        end
    end
    剑会天下单人匹配={}
    for n,v in pairs(剑会天下三人匹配) do
        if 玩家数据[v.id].队伍~=0 then
            for i=1,#队伍数据[玩家数据[v.id].队伍].成员数据 do
                if 玩家数据[队伍数据[玩家数据[v.id].队伍].成员数据[i]]~=nil then
                    发送数据(玩家数据[队伍数据[玩家数据[v.id].队伍].成员数据[i]].连接id,138.1)
                    常规提示(队伍数据[玩家数据[v.id].队伍].成员数据[i],"#Y/剑会天下活动已经结束了！")
                end
            end
        end
    end
    剑会天下三人匹配={}
      for n,v in pairs(剑会天下五人匹配) do
        if 玩家数据[v.id].队伍~=0 then
            for i=1,#队伍数据[玩家数据[v.id].队伍].成员数据 do
                if 玩家数据[队伍数据[玩家数据[v.id].队伍].成员数据[i]]~=nil then
                    发送数据(玩家数据[队伍数据[玩家数据[v.id].队伍].成员数据[i]].连接id,138.1)
                    常规提示(队伍数据[玩家数据[v.id].队伍].成员数据[i],"#Y/剑会天下活动已经结束了！")
                end
            end
        end
    end
    剑会天下五人匹配={}
    广播消息({内容="#Y剑会天下活动结束啦#24,#Y/无法在进行匹配战斗了哦!",频道="xt"})
end

function 任务处理类.剑会天下积分差异(胜利id,失败id)
    --计算分差值按照每相差100分 做递增递减
    local 胜利组平均分 = 0
    local 失败组平均分 = 0
    local 胜利基础分 = 40
    local 失败基础分 = 12
    local 分差值 = 0
    if 胜利id~=0 then
        if 玩家数据[胜利id].队伍~=0 then
            local 队伍id=玩家数据[胜利id].队伍
            for n=1,#队伍数据[队伍id].成员数据 do
                local 队员id=队伍数据[队伍id].成员数据[n]
                胜利组平均分 = 胜利组平均分 + 剑会天下[队员id].当前积分
            end
            胜利组平均分 = math.floor(胜利组平均分 / #队伍数据[队伍id].成员数据)
        else
            胜利组平均分 = 剑会天下[胜利id].当前积分
        end
    end
    if 失败id and 失败id~=0 then
        if 玩家数据[失败id].队伍~=0 then
            local 队伍id=玩家数据[失败id].队伍
            for n=1,#队伍数据[队伍id].成员数据 do
                local 队员id=队伍数据[队伍id].成员数据[n]
                失败组平均分 = 失败组平均分 + 剑会天下[队员id].当前积分
            end
            失败组平均分 = math.floor(失败组平均分 / #队伍数据[队伍id].成员数据)
        else
            失败组平均分=剑会天下[失败id].当前积分
        end
    end
    if 胜利id == 0 then
        胜利组平均分 = 失败组平均分
    end
    if 失败id == nil or 失败id == 0 then
        失败组平均分 = 胜利组平均分
    end
    分差值 = 胜利组平均分 - 失败组平均分
    if 分差值<0 then  --低分打赢高分的情况下
        if math.abs(分差值) >100 then
            local 增加值 = math.floor(math.abs(分差值)/100) * 2
            if 增加值 >= 10 then
                增加值 = 10
            end
            胜利基础分 = 胜利基础分 + 增加值
            失败基础分 = 失败基础分 + 增加值
        end
    else  --高分打赢低分的情况下
        if math.abs(分差值) >100 then
            local 增加值 = math.floor(math.abs(分差值)/100) * 2
            if 增加值 >= 10 then
                增加值 = 10
            end
            胜利基础分 = 胜利基础分 - 增加值
            失败基础分 = 失败基础分 - 增加值
        end
    end
    return {胜利基础分,失败基础分}
end

function 任务处理类.剑会天下奖励结算(id,类型)
    if 剑会天下次数统计[id] == nil then
        剑会天下次数统计[id] = {次数=0,首胜=false}
    end
    if 剑会天下次数统计[id].次数 <= 2 then
        剑会天下次数统计[id].次数 = 剑会天下次数统计[id].次数 + 1
        --根据ID发放奖励
    end
    if 剑会天下次数统计[id].首胜 == false then
        剑会天下次数统计[id].首胜 = true
        --每天首胜发放奖励
    end
    --连胜增加积分
    if 类型 then
        战斗奖励:其他奖励(id,类型)
    end
    if 剑会天下[id].连胜 == 3 then
        广播消息({内容=format("#S(剑会天下)#Y/恭喜 #R/%s #Y在活动中连胜三场！",玩家数据[id].角色.名称),频道="xt"})
    elseif 剑会天下[id].连胜 == 6 then
        广播消息({内容=format("#S(剑会天下)#Y/恭喜 #R/%s #Y在活动中连胜六场！",玩家数据[id].角色.名称),频道="xt"})
    elseif 剑会天下[id].连胜 == 9 then
        剑会天下[id].连胜=0
        广播消息({内容=format("#S(剑会天下)#Y/恭喜 #R/%s #Y在活动中连胜九场！",玩家数据[id].角色.名称),频道="xt"})
    end
end


function 任务处理类.剑会天下结算处理假人(胜利id,失败id)
    local 分差值 = 任务处理类.剑会天下积分差异(胜利id,失败id)
    if 胜利id~=0 and 剑会天下[胜利id]~=nil then
        if 玩家数据[胜利id].队伍~=0 then
            local 队伍id=玩家数据[胜利id].队伍
            for n=1,#队伍数据[队伍id].成员数据 do
                local 队员id=队伍数据[队伍id].成员数据[n]
                剑会天下[队员id].连胜=剑会天下[队员id].连胜+1
                剑会天下[队员id].当前积分=剑会天下[队员id].当前积分+分差值[1]
                local 临时数据 = 剑会天下[队员id]
                发送数据(玩家数据[队员id].连接id,135,临时数据)
                任务处理类.剑会天下奖励结算(队员id,"假人胜")
            end
        else
            剑会天下[胜利id].连胜=剑会天下[胜利id].连胜+1
            剑会天下[胜利id].当前积分=剑会天下[胜利id].当前积分+分差值[1]
            local 临时数据 = 剑会天下[胜利id]
            发送数据(玩家数据[胜利id].连接id,135,临时数据)
            任务处理类.剑会天下奖励结算(胜利id,"假人胜")
        end
    end
    if 失败id~=0 and 剑会天下[失败id]~=nil then
        if 玩家数据[失败id].队伍~=0 then
            local 队伍id=玩家数据[失败id].队伍
            for n=1,#队伍数据[队伍id].成员数据 do
                local 队员id=队伍数据[队伍id].成员数据[n]
                剑会天下[队员id].连胜=0
                local 临时数据 = 剑会天下[队员id]
                发送数据(玩家数据[队员id].连接id,135,临时数据)
                任务处理类.剑会天下奖励结算(队员id,"假人负")
                常规提示(队员id,"#Y/你输了")
            end
        else
            剑会天下[失败id].连胜=0
            local 临时数据 = 剑会天下[失败id]
            发送数据(玩家数据[失败id].连接id,135,临时数据)
            任务处理类.剑会天下奖励结算(失败id,"假人负")
            常规提示(失败id,"#Y/你输了")
        end
    end
end


function 任务处理类.剑会天下结算处理单人(胜利id,失败id)
    local 分差值 = 任务处理类.剑会天下积分差异(胜利id,失败id)
    if 胜利id~=0 and 剑会天下[胜利id]~=nil then
            剑会天下[胜利id].连胜=剑会天下[胜利id].连胜+1
            剑会天下[胜利id].当前积分=剑会天下[胜利id].当前积分+分差值[1]
            local 临时数据 = 剑会天下[胜利id]
            发送数据(玩家数据[胜利id].连接id,135,临时数据)
            任务处理类.剑会天下奖励结算(胜利id,"单人胜")
    end
    --失败方 结算奖励
    if 失败id~=0 and 剑会天下[失败id]~=nil then
            剑会天下[失败id].连胜=0
            local 临时数据 = 剑会天下[失败id]
            发送数据(玩家数据[失败id].连接id,135,临时数据)
            任务处理类.剑会天下奖励结算(失败id,"单人负")
            常规提示(失败id,"#Y/你输了")
    end
end

function 任务处理类.剑会天下结算处理三人(胜利id,失败id)
    local 分差值 = 任务处理类.剑会天下积分差异(胜利id,失败id)
    if 胜利id~=0 and 剑会天下[胜利id]~=nil then
        if 玩家数据[胜利id].队伍~=0 then
            local 队伍id=玩家数据[胜利id].队伍
            for n=1,#队伍数据[队伍id].成员数据 do
                local 队员id=队伍数据[队伍id].成员数据[n]
                剑会天下[队员id].连胜=剑会天下[队员id].连胜+1
                剑会天下[队员id].当前积分=剑会天下[队员id].当前积分+分差值[1]
                local 临时数据 = 剑会天下[队员id]
                发送数据(玩家数据[队员id].连接id,135,临时数据)
                任务处理类.剑会天下奖励结算(队员id,"三人胜")
            end
        else
            剑会天下[胜利id].连胜=剑会天下[胜利id].连胜+1
            剑会天下[胜利id].当前积分=剑会天下[胜利id].当前积分+分差值[1]
            local 临时数据 = 剑会天下[胜利id]
            发送数据(玩家数据[胜利id].连接id,135,临时数据)
            任务处理类.剑会天下奖励结算(胜利id,"三人胜")
        end
    end
    --失败方 结算奖励
    if 失败id~=0 and 剑会天下[失败id]~=nil then
        if 玩家数据[失败id].队伍~=0 then
            local 队伍id=玩家数据[失败id].队伍
            for n=1,#队伍数据[队伍id].成员数据 do
                local 队员id=队伍数据[队伍id].成员数据[n]
                剑会天下[队员id].连胜=0
                local 临时数据 = 剑会天下[队员id]
                发送数据(玩家数据[队员id].连接id,135,临时数据)
                任务处理类.剑会天下奖励结算(队员id,"三人负")
                常规提示(队员id,"#Y/你输了")
            end
        else
            剑会天下[失败id].连胜=0
            local 临时数据 = 剑会天下[失败id]
            发送数据(玩家数据[失败id].连接id,135,临时数据)
            任务处理类.剑会天下奖励结算(失败id,"三人负")
            常规提示(失败id,"#Y/你输了")
        end
    end
end

function 任务处理类.剑会天下结算处理五人(胜利id,失败id)
    local 分差值 = 任务处理类.剑会天下积分差异(胜利id,失败id)
    if 胜利id~=0 and 剑会天下[胜利id]~=nil then
        if 玩家数据[胜利id].队伍~=0 then
            local 队伍id=玩家数据[胜利id].队伍
            for n=1,#队伍数据[队伍id].成员数据 do
                local 队员id=队伍数据[队伍id].成员数据[n]
                剑会天下[队员id].连胜=剑会天下[队员id].连胜+1
                剑会天下[队员id].当前积分=剑会天下[队员id].当前积分+分差值[1]
                local 临时数据 = 剑会天下[队员id]
                发送数据(玩家数据[队员id].连接id,135,临时数据)
                任务处理类.剑会天下奖励结算(队员id,"五人胜")
            end
        else
            剑会天下[胜利id].连胜=剑会天下[胜利id].连胜+1
            剑会天下[胜利id].当前积分=剑会天下[胜利id].当前积分+分差值[1]
            local 临时数据 = 剑会天下[胜利id]
            发送数据(玩家数据[胜利id].连接id,135,临时数据)
            任务处理类.剑会天下奖励结算(胜利id,"五人胜")
        end
    end
    --失败方 结算奖励
    if 失败id~=0 and 剑会天下[失败id]~=nil then
        if 玩家数据[失败id].队伍~=0 then
            local 队伍id=玩家数据[失败id].队伍
            for n=1,#队伍数据[队伍id].成员数据 do
                local 队员id=队伍数据[队伍id].成员数据[n]
                剑会天下[队员id].连胜=0
                local 临时数据 = 剑会天下[队员id]
                发送数据(玩家数据[队员id].连接id,135,临时数据)
                任务处理类.剑会天下奖励结算(队员id,"五人负")
                常规提示(队员id,"#Y/你输了")
            end
        else
            剑会天下[失败id].连胜=0
            local 临时数据 = 剑会天下[失败id]
            发送数据(玩家数据[失败id].连接id,135,临时数据)
            任务处理类.剑会天下奖励结算(失败id,"五人负")
            常规提示(失败id,"#Y/你输了")
        end
    end
end