local 地煞星 = class()
function 地煞星:初始化()
	self.随机名称 = {"地阴星","地壮星","地数星","地耗星","地健星","地刑星","地狗星","地劣星","地恶星","地角星","地平星","地魂星","地囚星","地藏星",
		"地魔星","地空星","地伏星","地全星","地理星","地隐星","地羁星","地异星","地乐星","地捷星","地速星","地镇星","地文星","地正星","地辟星","地阖星",
		"地强星","地暗星","地佐星","地会星","地辅星","地兽星","地灵星","地佑星","地彗星","地微星","地暴星","地猖星","地狂星","地默星","地猛星","地奇星",
		"地英星","地威星","地煞星","地魁星","地勇星","地杰星","地雄星",
	 }
	 self.锦衣={"浮生绡·点黛","青花瓷","浮生","青花瓷月白","龙行玉泽","萌龙咆哮","青花瓷月黑","灼灼韶华","齐天大圣月白","齐天大圣月黑"}

	 self.星魂={"泽被星魂","隐忍星魂","结义星魂","磨砺星魂","平和星魂","仁人星魂","霸道星魂","王者星魂"}

-- 1、泽被星魂（第一周）：第二回合开始，每回合随机使一个输出小怪变为变异造型，变异造型的怪伤害结果加倍，持续一回合，如果变异时怪被击杀，则会一直保留变异状态到结束

-- 2、隐忍星魂（第二周）：平时不会行动，当挑战方出现人物血量低于15%时，则会在回合结束时对他进行斩杀

-- 3、结义星魂（第三周）：每回合结束时会随机物理攻击（死掉怪物/2的整数部分）个单位

-- 4、磨砺星魂（第四周）：第回合结束时会对全体目标随机使用一种4系法术：水漫-加5%气血魔法和当前八分之一的愤怒；落岩-降低全体相当于10%魔法上限的魔法；雷击-降低全队当前愤怒的四分之一；烈火-造成相当于全体10%气血上限的伤害

-- 5、平和星魂（第五周）：偶数回合结束时，会随机日月乾坤一个人物单位，无法使用法宝跟道具

-- 6、仁人星魂（第二四五周）：回合结束时，对随机人物单位造成物理伤害*1800的伤害结果

-- 7、霸道星魂（第一三五周）：第一回合结束后，会使用无间地狱，双方伤害增加，同时如果挑战方人物倒地，会附带2回合大死亡

-- 8、王者星魂（每一周刷一个，每月第5个周二开始是王者周）：每回合结束时会加强怪物7%的伤害结果，15回合伤害翻倍
end

function 地煞星:活动定时器()
	if 服务端参数.分钟+0==0 and 服务端参数.秒+0==2 then
		-- for i=1,3 do
		self:刷新资源()
		print("地煞星刷新了")

		-- end
	end
end

function 地煞星:刷新资源()
	 	local 任务id
		local 地图
		local xy
		local 战斗名称
		local 名称
		local 武器等级
		local 模型
	 	local mp
 		local 地图范围={1506,1091,1193,1514,1231,1142,1198,1139,1131,1512,1140,1513,1146,1228,1201,1203,1207,1229,1233,1232,1580,1250,1249}
		local dtmc=""
	 	local dttab={}
		for i=1,12 do
		local sj=取随机数(1,#地图范围)
		dttab[i]=地图范围[sj]
		if i==12 then
			 dtmc=dtmc..取地图名称(地图范围[sj])
		else
			dtmc=dtmc..取地图名称(地图范围[sj]).."、"
		end
		table.remove(地图范围,sj)
	 	end
	 local gwmc = {"初出茅庐","初出茅庐","小有所成","小有所成","伏虎斩妖","伏虎斩妖","御风神行","御风神行"}
	 for i=1,2 do --1星4只 2星3只 3星2只，四星2只
		for n=1,3 do
			任务id=取唯一任务(206)
			地图=dttab[n]
			xy=地图处理类.地图坐标[地图]:取随机点()
			战斗名称 = self.随机名称[取随机数(1,#self.随机名称)]
			名称 = gwmc[n]..战斗名称
			武器等级 = 90
			模型 = Qu随机角色[取随机数(1,#Qu随机角色)]
			mp =Qu角色属性[模型].门派[取随机数(1,#Qu角色属性[模型].门派)]
			local nandu = 1
			if n==3 then
				 nandu=2
			end
			if n==1  then
				称谓="★"
			elseif n==3    then
				称谓="★★"
			-- elseif n==5     then
			-- 	称谓="★★★"
			-- elseif n==7     then
			-- 	称谓="★★★★"

			end

			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3000,
				玩家id=0,
				称谓=称谓,
				名称=名称,
				战斗名称=战斗名称,
				模型=模型,
				门派=mp,
				难度=nandu,
				武器=取角色等级武器(模型,武器等级),
				武器等级=武器等级,
				等级=等级,
				x=xy.x,
				y=xy.y,
				销毁=true,
				-- 炫彩=取染色id(模型),
				-- 炫彩组=取炫彩染色(随机颜色[取随机数(1,#随机颜色)]),
				染色方案=取染色id(模型),
				染色组={[1]=取随机数(1,9),[2]=取随机数(1,9),[3]=取随机数(1,9)},
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=206
			}
			地图处理类:添加单位(任务id)
		end
	 end


	 for n=4,8 do --2-4星  2星3只 其他2只
		任务id=取唯一任务(206)
		地图=dttab[n]
		xy=地图处理类.地图坐标[地图]:取随机点()
		战斗名称 = self.随机名称[取随机数(1,#self.随机名称)]
		名称 = gwmc[n]..战斗名称
		武器等级 = 120
		模型 = Qu随机角色[取随机数(1,#Qu随机角色)]
		mp =Qu角色属性[模型].门派[取随机数(1,#Qu角色属性[模型].门派)]
		local nandu = 2
		if n==5 or n==6 then
			 nandu=3
		 elseif n==7 or n==8 then
			 nandu=4
		end
		if n==5     then
				称谓="★★★"
			elseif n==7     then
				称谓="★★★★"

			end

		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3000,
			玩家id=0,
			称谓=称谓,
			名称=名称,
			战斗名称=战斗名称,
			模型=模型,
			门派=mp,
			难度=nandu,
			武器=取角色等级武器(模型,武器等级),
			武器等级=武器等级,
			等级=等级,
			x=xy.x,
			y=xy.y,
			销毁=true,
			-- 炫彩=取染色id(模型),
			-- 炫彩组=取炫彩染色(随机颜色[取随机数(1,#随机颜色)]),
			染色方案=取染色id(模型),
			染色组={[1]=取随机数(1,9),[2]=取随机数(1,9),[3]=取随机数(1,9)},
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=206
		}
		地图处理类:添加单位(任务id)
		end
                        --------------5星
		任务id=取唯一任务(206)
		地图=dttab[9]
		xy=地图处理类.地图坐标[地图]:取随机点()
		战斗名称 = self.随机名称[取随机数(1,#self.随机名称)]
		名称 = "履水吐焰"..战斗名称
		武器等级 = 120
		模型 = Qu随机角色[取随机数(1,#Qu随机角色)]
		mp =Qu角色属性[模型].门派[取随机数(1,#Qu角色属性[模型].门派)]

		任务数据[任务id]={
		id=任务id,
		起始=os.time(),
		结束=3000,
		玩家id=0,
		名称=名称,
		战斗名称=战斗名称,
		模型=模型,
		称谓="★★★★★",
		门派=mp,
		武器=取角色等级武器(模型,武器等级),
		武器等级=武器等级,
		等级=等级,
		难度=5,
		销毁=true,
		-- 炫彩=取染色id(模型),
		-- 炫彩组=取炫彩染色(随机颜色[取随机数(1,#随机颜色)]),
		染色方案=取染色id(模型),
		染色组={[1]=取随机数(1,9),[2]=取随机数(1,9),[3]=取随机数(1,9)},
		x=xy.x,
		y=xy.y,
		-- 锦衣=self.锦衣[取随机数(1,#self.锦衣)],
		地图编号=地图,
		地图名称=取地图名称(地图),
		类型=206
		}
		地图处理类:添加单位(任务id)
		--------------6星
		任务id=取唯一任务(206)
		地图=dttab[10]
		xy=地图处理类.地图坐标[地图]:取随机点()
		战斗名称 = self.随机名称[取随机数(1,#self.随机名称)]
		名称 = "摄魂追魄"..战斗名称
		武器等级 = 150
		模型 = Qu随机角色[取随机数(1,#Qu随机角色)]
		mp =Qu角色属性[模型].门派[取随机数(1,#Qu角色属性[模型].门派)]

		任务数据[任务id]={
		id=任务id,
		起始=os.time(),
		结束=3000,
		玩家id=0,
		名称=名称,
		战斗名称=战斗名称,
		模型=模型,
		门派=mp,
		称谓="★★★★★★",
		武器=取角色等级武器(模型,武器等级),
		武器等级=武器等级,
		等级=等级,
		难度=6,
		销毁=true,
		x=xy.x,
		y=xy.y,
		锦衣=self.锦衣[取随机数(1,#self.锦衣)],
		地图编号=地图,
		地图名称=取地图名称(地图),
		类型=206
		}
		地图处理类:添加单位(任务id)

		--------------7星
		任务id=取唯一任务(206)
		地图=dttab[11]
		xy=地图处理类.地图坐标[地图]:取随机点()
		战斗名称 = self.随机名称[取随机数(1,#self.随机名称)]
		名称 = "翻江搅海"..战斗名称
		武器等级 = 160
		模型 = Qu随机角色[取随机数(1,#Qu随机角色)]
		mp =Qu角色属性[模型].门派[取随机数(1,#Qu角色属性[模型].门派)]

		任务数据[任务id]={
		id=任务id,
		起始=os.time(),
		结束=3000,
		玩家id=0,
		名称=名称,
		战斗名称=战斗名称,
		模型=模型,
		门派=mp,
		称谓="★★★★★★★",
		武器=取角色等级武器(模型,武器等级),
		武器等级=武器等级,
		等级=等级,
		难度=7,
		销毁=true,
		x=xy.x,
		y=xy.y,
		锦衣=self.锦衣[取随机数(1,#self.锦衣)],
		地图编号=地图,
		地图名称=取地图名称(地图),
		类型=206
		}
		地图处理类:添加单位(任务id)

		广播消息({内容=format("#P(地煞星)#W神秘的#R地煞星#W带着天界宝物降临在了#Y%s#W一带，只有智勇双全的强者才有机缘获得宝物，少侠敢来挑战么？#80",dtmc),频道="xt"})
end

function 地煞星:怪物对话内容(id,序列,标识,地图)
	local 对话数据={}
	对话数据.模型=任务数据[标识].模型
	对话数据.名称=任务数据[标识].名称
	if 任务数据[标识].zhandou==nil then
		对话数据.对话="嘿嘿，要不要来切磋一把？要是能赢我，我就送你们一样宝贝。"
		对话数据.选项={"我准备好了！","我们才不稀罕你宝贝呢，拜拜！"}
	else
		对话数据.对话="我正在战斗中，请勿打扰。"
	end
	----------------
	 if 判断限制次数(id,"地煞星") then----限制刷怪
	 	对话数据.对话="玩家"..判断限制次数(id,"地煞星").."今日已经超过次数了"
	 	对话数据.选项=nil
	 end
	 -----------------------------
	return 对话数据
end


function 地煞星:对话事件处理(id,名称,事件,类型,rwid)
	if 任务数据[rwid].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
	if 取队伍人数(id)<5 and 调试模式==false then 常规提示(id,"#Y挑战地煞星最少必须由五人进行") return  end
	if 取等级要求(id,60)==false and 调试模式==false then 常规提示(id,"#Y/队伍中有成员等级不符合要求") return  end
	if 事件=="我准备好了！"   then
		if 任务数据[rwid].难度>=2 then
			 local 队伍id=玩家数据[id].队伍
			 if 玩家数据[id].队伍==0 then
				添加最后对话(id,"请组队挑战") return end
			for n=1,#队伍数据[队伍id].成员数据 do
				local cyid=队伍数据[队伍id].成员数据[n]
				if 玩家数据[cyid].角色.初出茅庐地煞星==nil then
					添加最后对话(id,"队伍中"..玩家数据[cyid].角色.名称.."需要挑战过“初出茅庐地煞星”才能和我切磋哦。")
					 return
				end
			end
		end
		if 任务数据[rwid].难度 == 6 then
			战斗准备类:创建战斗(id,111126,rwid)
			  任务数据[rwid].zhandou=true
		elseif 任务数据[rwid].难度 == 7 then
			战斗准备类:创建战斗(id,111125.1,rwid)
			  任务数据[rwid].zhandou=true
		 else
			战斗准备类:创建战斗(id,111125,rwid)
			  任务数据[rwid].zhandou=true
		end
	end
end



function 地煞星:战斗胜利处理(id组,战斗类型,任务id)
	local id=id组[1]
	if 任务数据[任务id]==nil then
		return
	end
	local 难度=任务数据[任务id].难度
	添加完成次数(id,"地煞星")  -----限制刷怪

	for n=1,#id组 do
		local cyid=id组[n]
		local 等级=玩家数据[cyid].角色.等级
		local dxmc = "地煞：星级"..难度
		local jlxs
		       if 等级 <= 69   then jlxs = 1
		elseif 等级 <= 89   then jlxs = 1.1
		elseif 等级 <= 109 then jlxs = 1.2
		elseif 等级 <= 129 then jlxs = 1.3
		elseif 等级 <= 155 then jlxs = 1.4
		elseif 等级 <= 175 then jlxs = 1.5
		end
		local 地煞分 = 难度*10
		local 经验=等级*jlxs*2000+难度*100000
		local 银子=等级*jlxs*1500+难度*20000
		local 仙玉 = 取随机数(5,10)*难度+50
		local 活跃=2*难度
                          玩家数据[id].角色:添加仙玉(仙玉,"地煞星",1)
		玩家数据[cyid].角色:添加地煞积分(地煞分)
		玩家数据[cyid].角色:添加经验(经验*HDPZ[dxmc].经验,"地煞星",1)
		玩家数据[cyid].角色:添加银子(qz(银子*HDPZ[dxmc].银子),"地煞星",1)
		添加活跃(cyid,活跃)
        		更新玩家每日(cyid,"日常任务","地煞星")
		if 难度==1 then
			 玩家数据[cyid].角色.初出茅庐地煞星=true
		elseif 难度==2 then
			-- 成就数据[cyid]:判断进度(cyid,"首杀通关","两星地煞")
		elseif 难度==3 then
			-- 成就数据[cyid]:判断进度(cyid,"首杀通关","三星地煞")
		elseif 难度==4 then
			-- 成就数据[cyid]:判断进度(cyid,"首杀通关","四星地煞")
		elseif 难度==5 then
			-- 成就数据[cyid]:判断进度(cyid,"首杀通关","五星地煞")
		elseif 难度==6 then
			-- 成就数据[cyid]:判断进度(cyid,"首杀通关","六星地煞")
		end

		if 取随机数()<=HDPZ[dxmc].爆率 then
			local 链接 = {提示=format("#S(地煞星)#Y/%s对#G%s#Y的武艺深表佩服，特送上一个珍藏很久的",任务数据[任务id].名称,玩家数据[cyid].角色.名称),频道="xt",结尾="#80"}
			local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ[dxmc].ITEM),dxmc)
			if 数量== 9999 then --环
				玩家数据[cyid].道具:给予道具(cyid,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
			else
				玩家数据[cyid].道具:给予超链接道具(cyid,名称,数量,参数,链接)
			end
		end
	local 任务id=取唯一任务(206)
	发送数据(玩家数据[cyid].连接id,1501,{名称="",模型="",对话= "恭喜少侠 挑战成功！"})
	end
	地图处理类:删除单位(任务数据[任务id].地图编号,任务数据[任务id].单位编号)
	任务数据[任务id]=nil
end

return 地煞星
