-- @Author: baidwwy
-- @Date:   2024-01-07 10:41:18
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-01-11 14:02:52
local 坐骑任务 = class()
function 坐骑任务:开启坐骑任务(id)
  if 玩家数据[id].角色:取任务(307)~=0 then
    常规提示(id,"#Y/你当前已经获得坐骑任务了，快去完成吧！")
    return
  end
  local 坐骑费用 = 3000000
  if 取银子(id) < 坐骑费用 then
      常规提示(id,"#Y/你的银两不够接取任务哦")
      return
  end
  if 玩家数据[id].角色.等级<39 then
      常规提示(id,"#Y/等级小于39无法开启")
      return
  end
  玩家数据[id].角色:扣除银子(坐骑费用,"坐骑费用",1)
  local 任务id=取唯一任务(307)
  local 结束时间=99999999
  任务数据[任务id]={
    id=任务id,
    起始=os.time(),
    结束=结束时间,
    玩家id=id,
    气血=气血,
    是存档=true,
    魔法=魔法,
    烹饪=0,
    法宝=0,
    药品=0,
    分类=1,
    队伍组={},
    类型=307
  }
  玩家数据[id].角色:添加任务(任务id)
  发送数据(玩家数据[id].连接id,39)
  发送数据(玩家数据[id].连接id,1501,{名称="百兽王",模型="大大王",对话=format("快去找长寿村的太白金星咨询下吧！"),选项={"我这就去"}})
end

function 坐骑任务:完成坐骑任务(任务id,id,公共)
    if 任务数据[任务id]==nil then
        return
    end
    if 公共 then
        玩家数据[id].角色.种族坐骑=true
        玩家数据[id].角色:增加种族坐骑(id)
    else
        玩家数据[id].角色.种族坐骑=true
        玩家数据[id].角色:增加种族随机坐骑(id)
    end
    任务数据[任务id]=nil
    玩家数据[id].角色:取消任务(任务id)
    玩家数据[id].角色:刷新任务跟踪()
    常规提示()
end

function 任务说明307(玩家id,任务id)
    if 任务数据[任务id].分类==1 then
        说明={"坐骑剧情任务","快去找#Y长寿村#S的#R太白金星#S咨询下吧！"}
    elseif 任务数据[任务id].分类==2 then
        说明={"坐骑剧情任务",format("帮#Y/qqq|太白金星*长寿村*npc查询/太白金星#S找到#R/%s",任务数据[任务id].烹饪)}
    elseif 任务数据[任务id].分类==3 then
        说明={"坐骑剧情任务","#Y天宫#S的#R/qqq|千里眼*天宫*npc查询/千里眼#S能眼观天下，他也许知道天马的消息！"}
    elseif 任务数据[任务id].分类==4 then
        说明={"坐骑剧情任务","帮#R千里眼#S把书信送到#R/qqq|大力神灵*天宫*npc查询/大力神灵#S处(#R需战斗#S)"}
    elseif 任务数据[任务id].分类==5 then
        说明={"坐骑剧情任务","看看#R/qqq|千里眼*天宫*npc查询/千里眼#S是不是查探到什么了"}
    elseif 任务数据[任务id].分类==6 then
        说明={"坐骑剧情任务","找朱紫国#R/qqq|土地公公*朱紫国*npc查询/土地公公#S看看有没有发现"}
    elseif 任务数据[任务id].分类==7 then
        说明={"坐骑剧情任务","找到朱紫国皇宫附近的#R/qqq|妖魔亲信*朱紫国*npc查询/妖魔亲信#S(#R需战斗#S)"}
    elseif 任务数据[任务id].分类==8 then
        说明={"坐骑剧情任务","找到#R#R/qqq|蜃妖元神*钟乳石窟*npc查询/蜃妖元神#S(#R需战斗#S)"}
    elseif 任务数据[任务id].分类==9 then
        说明={"坐骑剧情任务","去找找#R/qqq|太白金星*长寿村*npc查询/太白金星#S看看什么情况。"}
    elseif 任务数据[任务id].分类==10 then
        说明={"坐骑剧情任务","天下间的动物何去何从都逃不过#Y狮驼岭#S的#R/qqq|大大王*狮王洞*npc查询/大大王#S的眼睛，去调查一番。"}
    elseif 任务数据[任务id].分类==11 then
        说明={"坐骑剧情任务",format("帮#Y/qqq|大大王*狮王洞*npc查询/大大王#S找到#R/%s",任务数据[任务id].药品)}
    elseif 任务数据[任务id].分类==12 then
        说明={"坐骑剧情任务","马儿在#Y建业#S一带遗失，#R/qqq|周猎户*建邺民居*npc查询/周猎户#S十分可疑，前去调查。"}
    elseif 任务数据[任务id].分类==13 then
        说明={"坐骑剧情任务","终于找到了马儿，可以去找#R/qqq|百兽王*仙缘洞天*npc查询/百兽王#S复命了。"}
    end
    return 说明
end

return 坐骑任务