local 寻梦追忆 = class()

if f函数.文件是否存在([[活动时间/寻梦追忆.txt]])==false then
 寻梦追忆活动时间={日期="全天",时=0,分=0,秒=0} -- 设置时间
  写出文件([[活动时间/寻梦追忆.txt]],table.tostring(寻梦追忆活动时间))
 else
  寻梦追忆活动时间=table.loadstring(读入文件([[活动时间/寻梦追忆.txt]]))
end

function 寻梦追忆:初始化()
	self["活动开关"] = false
	self["数据"] = {}
	self["NPC"] = {
		{
			y = 101,
			["地图"] = 1091,
			["模型"] = "飞燕女",
			["名称"] = "小雁子",
			["方向"] = 1,
			x = 71
		},
		{
			y = 102,
			["地图"] = 1506,
			["模型"] = "强盗",
			["名称"] = "海盗头子",
			["方向"] = 1,
			x = 21
		},
		{
			y = 175,
			["地图"] = 1001,
			["模型"] = "英女侠",
			["名称"] = "沈剑如",
			["方向"] = 1,
			x = 124
		},
		{
			y = 175,
			["地图"] = 1001,
			["模型"] = "剑侠客",
			["名称"] = "神秘人",
			["方向"] = 1,
			x = 529
		},
		{
			y = 175,
			["地图"] = 1001,
			["模型"] = "剑侠客",
			["名称"] = "小侠客",
			["方向"] = 0,
			x = 127
		},
		{
			y = 60,
			["地图"] = 1041,
			["模型"] = "幽灵",
			["名称"] = "梦妖",
			["方向"] = 0,
			x = 72
		},
		{
			y = 99,
			["地图"] = 1226,
			["模型"] = "夜罗刹",
			["名称"] = "梦寐",
			["方向"] = 0,
			x = 38
		},
		{
			y = 63,
			["地图"] = 1208,
			["模型"] = "炎魔神",
			["名称"] = "梦魔",
			["方向"] = 0,
			x = 92
		},
		{
			y = 35,
			["地图"] = 1174,
			["模型"] = "九头精怪",
			["名称"] = "梦魇",
			["方向"] = 0,
			x = 151
		}
	}
	self["活动时间"] = QJHDSJ["寻梦追忆"]
end

-- function 寻梦追忆:活动定时器()
-- 	if self["活动开关"] then
-- 		if self["开启Time"] - os["time"]() < 0 then
-- 			self:关闭活动()
-- 		end
-- 	elseif not self["活动开关"] and 刷新时间类:时辰已到("寻梦追忆") then
-- 		self:开启活动()
-- 	end
-- end

function 寻梦追忆:活动定时器()
	if 寻梦追忆活动时间.日期=="全天" then
		if 服务端参数.秒=="00" and 服务端参数.小时=="00" and 服务端参数.分钟=="00"then
			self.数据={}
		end
		if not self.活动开关 then
			self:开启活动()
		end
	else
		if 寻梦追忆活动时间.日期=="每天" then
			if 寻梦追忆活动时间.时==服务端参数.小时+0 and 寻梦追忆活动时间.分==服务端参数.分钟+0 and 寻梦追忆活动时间.秒<=服务端参数.秒+0 then
				self:开启活动()
			end
		else
			local zhouji=tonumber(os.date("%w", os.time()))
			if zhouji==寻梦追忆活动时间.日期 then
				if 寻梦追忆活动时间.时==服务端参数.小时+0 and 寻梦追忆活动时间.分==服务端参数.分钟+0 and 寻梦追忆活动时间.秒<=服务端参数.秒+0 then
					self:开启活动()
				end
			elseif 寻梦追忆活动时间.日期=="周1350" and (zhouji==1 or zhouji==3 or zhouji==5 or zhouji==0 ) then
				if 寻梦追忆活动时间.时==服务端参数.小时+0 and 寻梦追忆活动时间.分==服务端参数.分钟+0 and 寻梦追忆活动时间.秒<=服务端参数.秒+0  then
					self:开启活动()
				end
			elseif 寻梦追忆活动时间.日期=="周246" and (zhouji==2 or zhouji==4 or zhouji==6) then
				if 寻梦追忆活动时间.时==服务端参数.小时+0 and 寻梦追忆活动时间.分==服务端参数.分钟+0 and 寻梦追忆活动时间.秒<=服务端参数.秒+0  then
					self:开启活动()
				end
			end
		end
	end
end
function 寻梦追忆:开启活动()
	self["开启Time"] = os["time"]() + 5400
	for n = 1, 9 do
		local 任务id = 取唯一任务(1167.1)
		任务数据[任务id] = {
			["类型"] = 1167.1,
			["结束"] = 9999999999999999999,
			["任务显示"] = true,
			["销毁"] = true,
			id = 任务id,
			["起始"] = os["time"](),
			["名称"] = self["NPC"][n]["名称"],
			["模型"] = self["NPC"][n]["模型"],
			x = self["NPC"][n]["x"],
			y = self["NPC"][n]["y"],
			["方向"] = self["NPC"][n]["方向"],
			["地图编号"] = self["NPC"][n]["地图"],
			["序列"] = n,
			["地图名称"] = 取地图名称(self["NPC"][n]["地图"])
		}

		地图处理类:添加单位(任务id)
	end

	广播消息({
		["频道"] = "xt",
		["内容"] = "#P/(寻梦追忆)#Y寻梦追忆活动已经开启，各位玩家可以前往#P幻梦仙子(西梁女国,85,62)#Y处领取任务吧#32"
	})
	发送公告("#P/(寻梦追忆)#Y寻梦追忆活动已经开启，各位玩家可以前往#P幻梦仙子(西梁女国85,62)#Y处领取任务吧")

	self["活动开关"] = true
end

function 寻梦追忆:关闭活动(id)
	self["数据"] = {}
	self["活动开关"] = false
	self["开启Time"] = nil

	发送公告("#R(寻梦追忆)#W寻梦追忆活动已结束，已处战斗中的玩家在战斗结束后依然可以获得奖励。感谢大家的参与！")
	广播消息({
		["频道"] = "hd",
		["内容"] = format("#R(寻梦追忆)#W寻梦追忆活动已结束，已处战斗中的玩家在战斗结束后依然可以获得奖励。感谢大家的参与！")
	})
end

function 寻梦追忆:新增任务(id)
	if self["数据"][id] == nil then
		self["数据"][id] = {
			["取消"] = 0,
			["环数"] = 1,
			["次数"] = 1
		}
	else
		self["数据"][id]["次数"] = 1
	end

	local FL = 1
	local 任务id, ZU = 取唯一任务(1167, id)
	任务数据[任务id] = {
		["类型"] = 1167,
		["结束"] = 2400,
		["销毁"] = true,
		["领取人id"] = id,
		id = 任务id,
		["玩家id"] = id,
		DWZ = ZU,
		["起始"] = os["time"](),
		["队伍组"] = {},
		["分类"] = FL,
		["名称"] = self["NPC"][FL]["名称"]
	}
	local 队伍id = 玩家数据[id]["队伍"]

	for n = 1, #队伍数据[队伍id]["成员数据"] do
		local cyid = 队伍数据[队伍id]["成员数据"][n]

		if self["数据"][cyid] == nil then
			self["数据"][cyid] = {
				["取消"] = 0,
				["环数"] = 1,
				["次数"] = 1
			}
		else
			self["数据"][cyid]["次数"] = 1
		end

		发送数据(玩家数据[cyid]["连接id"], 1501, {
			["名称"] = "幻梦仙子",
			["模型"] = "普陀_接引仙女",
			["对话"] = format("寻梦追忆，如梦似幻。速去前往长寿郊外寻找线索。")
		})
		玩家数据[cyid]["角色"]:添加任务(任务id)
	end
end

function 寻梦追忆:任务说明(玩家id, 任务id)
	local 说明 = {}

	if not self["活动开关"] then
		说明 = {
			"寻梦追忆",
			format("活动已经结束。")
		}

		return 说明
	end

	local 环数 = self["数据"][玩家id]["环数"]
	local 次数 = self["数据"][玩家id]["次数"]

	if 次数 == 1 then
		说明 = {
			"寻梦追忆",
			format("寻梦追忆，如梦似幻。速去前往长寿郊外（71.101）寻找线索" .. "#R/qqq|小雁子*1091*临时npc*%s*%s/小雁子" .. "#W！剩余时间" .. 取分(任务数据[任务id]["结束"] - (os["time"]() - 任务数据[任务id]["起始"])) .. "分钟。当前第%s轮第%s环。", 71, 101, 环数, 次数)
		}
	elseif 次数 == 2 then
		说明 = {
			"寻梦追忆",
			format("寻梦追忆，如梦似幻。速去前往东海湾（21.102）寻找线索" .. "#R/qqq|海盗头子*1506*临时npc*%s*%s/海盗头子" .. "#W！剩余时间" .. 取分(任务数据[任务id]["结束"] - (os["time"]() - 任务数据[任务id]["起始"])) .. "分钟。当前第%s轮第%s环。", 21, 102, 环数, 次数)
		}
	elseif 次数 == 3 then
		说明 = {
			"寻梦追忆",
			format("寻梦追忆，如梦似幻。速去前往长安城（124 175 ）寻找线索" .. "#R/qqq|沈剑如*1001*临时npc*%s*%s/沈剑如" .. "#W！剩余时间" .. 取分(任务数据[任务id]["结束"] - (os["time"]() - 任务数据[任务id]["起始"])) .. "分钟。当前第%s轮第%s环。", 124, 175, 环数, 次数)
		}
	elseif 次数 == 4 then
		说明 = {
			"寻梦追忆",
			format("寻梦追忆，如梦似幻。速去前往长安城（529 175）寻找线索" .. "#R/qqq|神秘人*1001*临时npc*%s*%s/神秘人" .. "#W！剩余时间" .. 取分(任务数据[任务id]["结束"] - (os["time"]() - 任务数据[任务id]["起始"])) .. "分钟。当前第%s轮第%s环。", 529, 175, 环数, 次数)
		}
	elseif 次数 == 5 then
		说明 = {
			"寻梦追忆",
			format("寻梦追忆，如梦似幻。速去前往长安城（127 175）寻找线索" .. "#R/qqq|小侠客*1001*临时npc*%s*%s/小侠客" .. "#W！剩余时间" .. 取分(任务数据[任务id]["结束"] - (os["time"]() - 任务数据[任务id]["起始"])) .. "分钟。当前第%s轮第%s环。", 127, 175, 环数, 次数)
		}
	elseif 次数 == 6 then
		说明 = {
			"寻梦追忆",
			format("寻梦追忆，如梦似幻。速去前往子母河底（ 72 60 ）寻找线索" .. "#R/qqq|梦妖*1041*临时npc*%s*%s/梦妖" .. "#W！剩余时间" .. 取分(任务数据[任务id]["结束"] - (os["time"]() - 任务数据[任务id]["起始"])) .. "分钟。当前第%s轮第%s环。", 72, 60, 环数, 次数)
		}
	elseif 次数 == 7 then
		说明 = {
			"寻梦追忆",
			format("寻梦追忆，如梦似幻。速去前往宝象国（38 99）寻找线索" .. "#R/qqq|梦寐*1226*临时npc*%s*%s/梦寐" .. "#W！剩余时间" .. 取分(任务数据[任务id]["结束"] - (os["time"]() - 任务数据[任务id]["起始"])) .. "分钟。当前第%s轮第%s环。", 38, 99, 环数, 次数)
		}
	elseif 次数 == 8 then
		说明 = {
			"寻梦追忆",
			format("寻梦追忆，如梦似幻。速去前往朱紫国（92 63）寻找线索" .. "#R/qqq|梦魔*1208*临时npc*%s*%s/梦魔" .. "#W！剩余时间" .. 取分(任务数据[任务id]["结束"] - (os["time"]() - 任务数据[任务id]["起始"])) .. "分钟。当前第%s轮第%s环。", 92, 63, 环数, 次数)
		}
	elseif 次数 == 9 then
		说明 = {
			"寻梦追忆",
			format("寻梦追忆，如梦似幻。速去前往北俱芦洲（151 35）寻找线索" .. "#R/qqq|梦魇*1174*临时npc*%s*%s/梦魇" .. "#W！剩余时间" .. 取分(任务数据[任务id]["结束"] - (os["time"]() - 任务数据[任务id]["起始"])) .. "分钟。当前第%s轮第%s环。", 151, 35, 环数, 次数)
		}
	end

	return 说明
end

function 寻梦追忆:对话事件处理(id, 名称, 事件)
	if 事件 == "请吩咐" then
		if not self["活动开关"] then
			添加最后对话(id, "欢迎参加寻梦追忆活动，活动每周举行一次。你是否已经叫齐伙伴准备挑战了？当前不是活动时间，请关注群通知。")
			return
		elseif (玩家数据[id]["队伍"] == 0 or 取队伍人数(id) < 5 or 取队伍最低等级(玩家数据[id]["队伍"], 60)) then
			添加最后对话(id, "寻梦追忆参与条件：≥60级，≥5人")

			return
		elseif 玩家数据[id]["队长"] == false then
			添加最后对话(id, "这种重要的事情还是让队长来吧！")

			return

		end
  		if self:取寻梦追忆次数限制(id,2) then return end

		local go = true
		local 队伍id = 玩家数据[id]["队伍"]

		for n = 1, #队伍数据[队伍id]["成员数据"] do
			local cyid = 队伍数据[队伍id]["成员数据"][n]

			if self["数据"][cyid] and os["time"]() < self["数据"][cyid]["取消"] then
				添加最后对话(id, 玩家数据[cyid]["角色"]["名称"] .. "在五分钟内取消过任务，需等待五分钟后才可以继续任务哦。")

				if cyid ~= id then
					添加最后对话(cyid, "取消任务后，需等待5分钟后才可以继续领取。")
				end

				return
			end

			if 玩家数据[cyid]["角色"]:取任务(1167) ~= 0 then
				常规提示(cyid, "你已经有了一个这样的任务了！")

				if cyid ~= id then
					添加最后对话(id, 玩家数据[cyid]["角色"]["名称"] .. "已经领取过任务了")
				end

				go = false

				break
			end
		end

		if go then
			self:新增任务(id)
		end
	elseif 事件 == "我想取消任务" then
		local 任务id = 玩家数据[id]["角色"]:取任务(1167)

		if 任务id ~= 0 then
			玩家数据[id]["角色"]:取消任务(任务id)

			if self["活动开关"] then
				if self["数据"][id] == nil then
					self["数据"][id] = {
						["取消"] = 0,
						["环数"] = 1,
						["次数"] = 0
					}
				end

				self["数据"][id]["取消"] = os["time"]() + 300
			end

			添加最后对话(id, "已成功取消，并清空任务次数。5分钟可再次领取。")
		else
			添加最后对话(id, "你没有这样的任务哦。")
		end
	end
end

function 寻梦追忆:取寻梦追忆次数限制(id,次数)
local 队伍id=玩家数据[id].队伍
  for n=1,#队伍数据[队伍id].成员数据 do
    local 临时id=队伍数据[队伍id].成员数据[n]
    local cyid=队伍数据[队伍id].成员数据[n]
      if 活动次数数据.寻梦追忆.完成[临时id]== nil then
        活动次数数据.寻梦追忆.完成[临时id]=0
      end
      if 活动次数数据.寻梦追忆.完成[临时id]>=次数 then
        常规提示(id,"#Y"..玩家数据[临时id].角色.名称.."本日寻梦追忆次数已达上限")
        return true
      else
        活动次数数据.寻梦追忆.完成[临时id]=活动次数数据.寻梦追忆.完成[临时id]+1
      end
  end
  return false
  end


__GWdh111[1167.1] = function (连接id, id, 序列, 标识, 地图)
	local 对话数据 = {
		["模型"] = 任务数据[标识]["模型"],
		["名称"] = 任务数据[标识]["名称"],
		["对话"] = "我劝你不要多管闲事！",
		["选项"] = {
			"寻梦追忆，如梦似幻",
			"路过。"
		}
	}

	return 对话数据
end

__GWdh222[1167.1] = function (连接id, id, 序号, 内容)
	local 事件 = 内容[1]
	local 名称 = 内容[3]

	if 事件 == "寻梦追忆，如梦似幻" then
		if 玩家数据[id]["队伍"] == 0 or 取队伍人数(id) < 5 or 取队伍最低等级(玩家数据[id]["队伍"], 60) then
			添加最后对话(id, "寻梦追忆参与条件：≥60级，≥5人")

			return
		end

		local 任务id = 玩家数据[id]["角色"]:取任务(1167)

		if 任务id ~= 0 then
			if 任务数据[任务id]["名称"] == 名称 then
				if 名称 == "小雁子" then
					战斗准备类:创建战斗(id + 0, 160041, 玩家数据[id]["地图单位"]["标识"])
				elseif 名称 == "海盗头子" then
					战斗准备类:创建战斗(id + 0, 160042, 玩家数据[id]["地图单位"]["标识"])
				elseif 名称 == "沈剑如" then
					战斗准备类:创建战斗(id + 0, 160043, 玩家数据[id]["地图单位"]["标识"])
				elseif 名称 == "神秘人" then
					战斗准备类:创建战斗(id + 0, 160044, 玩家数据[id]["地图单位"]["标识"])
				elseif 名称 == "小侠客" then
					战斗准备类:创建战斗(id + 0, 160045, 玩家数据[id]["地图单位"]["标识"])
				elseif 名称 == "梦妖" then
					战斗准备类:创建战斗(id + 0, 160046, 玩家数据[id]["地图单位"]["标识"])
				elseif 名称 == "梦寐" then
					战斗准备类:创建战斗(id + 0, 160047, 玩家数据[id]["地图单位"]["标识"])
				elseif 名称 == "梦魔" then
					战斗准备类:创建战斗(id + 0, 160048, 玩家数据[id]["地图单位"]["标识"])
				elseif 名称 == "梦魇" then
					战斗准备类:创建战斗(id + 0, 160049, 玩家数据[id]["地图单位"]["标识"])
				end
			else
				添加最后对话(id, "小侠客，你当前应该挑战的是" .. 任务数据[任务id]["名称"] .. "才对哦。")
			end
		else
			添加最后对话(id, "小侠客，想挑战我吗？不过得先去找幻梦仙子(西梁女国85,62)领取寻梦追忆任务才可以哦。")
		end
	end
end

function 寻梦追忆:刷新任务(id, FL)
	local 任务id = 玩家数据[id]["角色"]:取任务(1167)

	if 任务id ~= 0 then
		if FL == 1 then
			发送数据(玩家数据[id]["连接id"], 1501, {
				["名称"] = "幻梦仙子",
				["模型"] = "普陀_接引仙女",
				["对话"] = format("岁月流转，多少人遗忘了自己的梦想，又有多少人还因为梦想而仍在努力，少侠若是有心，能否帮小仙几个小忙?")
			})
		elseif FL == 2 then
			发送数据(玩家数据[id]["连接id"], 1501, {
				["名称"] = "海盗头子",
				["模型"] = "强盗",
				["对话"] = format("岁月流转，多少人遗忘了自己的梦想，又有多少人还因为梦想而仍在努力，少侠若是有心，能否帮小仙几个小忙?")
			})
		elseif FL == 3 then
			发送数据(玩家数据[id]["连接id"], 1501, {
				["名称"] = "沈剑如",
				["模型"] = "英女侠",
				["对话"] = format("岁月流转，多少人遗忘了自己的梦想，又有多少人还因为梦想而仍在努力，少侠若是有心，能否帮小仙几个小忙?")
			})
		elseif FL == 4 then
			发送数据(玩家数据[id]["连接id"], 1501, {
				["名称"] = "神秘人",
				["模型"] = "剑侠客",
				["对话"] = format("岁月流转，多少人遗忘了自己的梦想，又有多少人还因为梦想而仍在努力，少侠若是有心，能否帮小仙几个小忙?")
			})
		elseif FL == 5 then
			发送数据(玩家数据[id]["连接id"], 1501, {
				["名称"] = "小侠客",
				["模型"] = "剑侠客",
				["对话"] = format("岁月流转，多少人遗忘了自己的梦想，又有多少人还因为梦想而仍在努力，少侠若是有心，能否帮小仙几个小忙?")
			})
		elseif FL == 6 then
			发送数据(玩家数据[id]["连接id"], 1501, {
				["名称"] = "梦妖",
				["模型"] = "幽灵",
				["对话"] = format("岁月流转，多少人遗忘了自己的梦想，又有多少人还因为梦想而仍在努力，少侠若是有心，能否帮小仙几个小忙?")
			})
		elseif FL == 7 then
			发送数据(玩家数据[id]["连接id"], 1501, {
				["名称"] = "梦寐",
				["模型"] = "夜罗刹",
				["对话"] = format("岁月流转，多少人遗忘了自己的梦想，又有多少人还因为梦想而仍在努力，少侠若是有心，能否帮小仙几个小忙?")
			})
		elseif FL == 8 then
			发送数据(玩家数据[id]["连接id"], 1501, {
				["名称"] = "梦魔",
				["模型"] = "炎魔神",
				["对话"] = format("岁月流转，多少人遗忘了自己的梦想，又有多少人还因为梦想而仍在努力，少侠若是有心，能否帮小仙几个小忙?")
			})
		elseif FL == 9 then
			发送数据(玩家数据[id]["连接id"], 1501, {
				["名称"] = "梦魇",
				["模型"] = "九头精怪",
				["对话"] = format("岁月流转，多少人遗忘了自己的梦想，又有多少人还因为梦想而仍在努力，少侠若是有心，能否帮小仙几个小忙?")
			})
		end

		任务数据[任务id]["名称"] = self["NPC"][FL]["名称"]
		任务数据[任务id]["起始"] = os["time"]()

		玩家数据[id]["角色"]:刷新任务跟踪()
	end
end

function 寻梦追忆:增加任务次数(id)
	if self["活动开关"] then
		if self["数据"][id] == nil then
			self["数据"][id] = {
				["取消"] = 0,
				["环数"] = 1,
				["次数"] = 0
			}
		end

		self["数据"][id]["次数"] = self["数据"][id]["次数"] + 1
	end
end

function 寻梦追忆:战斗胜利处理(id组, 战斗类型)
	local id = id组[1]

	self:增加任务次数(id)

	for n = 1, #id组 do
		local cyid = id组[n]

		if self["活动开关"] and self["数据"][cyid] then
			self["数据"][cyid]["次数"] = self["数据"][id]["次数"]

			if self["数据"][cyid]["次数"] > 9 then
				local 链接 = {
					["频道"] = "hd",
					["结尾"] = "#W以资鼓励！",
					["提示"] = format("#P(寻梦追忆)#G/%s#W完成了又一轮寻梦追忆挑战，特赠送", 玩家数据[cyid]["角色"]["名称"])
				}

				玩家数据[cyid]["道具"]:给予超链接道具(cyid, "上古灵符", 1, nil, 链接)

				self["数据"][cyid]["环数"] = self["数据"][cyid]["环数"] + 1

				玩家数据[cyid]["角色"]:取消任务(玩家数据[cyid]["角色"]:取任务(1167))
				发送数据(玩家数据[cyid]["连接id"], 1501, {
					["名称"] = "幻梦仙子",
					["模型"] = "普陀_接引仙女",
					["对话"] = format("果然身手不错！此番寻梦追忆挑战你已经全部完成，回去找到幻梦仙子（西梁女国，85，62）继续新的活动吧！#81")
				})
			else
				self:刷新任务(cyid, self["数据"][cyid]["次数"])
			end


			self:设置奖励(cyid)
		end
	end
end

function 寻梦追忆:设置奖励(cyid)
	local 等级 = 玩家数据[cyid]["角色"]["等级"]
	local 经验 = 等级 * 取随机数(950, 1050) + 100000
	local 银子 = 等级 * 170 + 2000 + 30000
	玩家数据[cyid]["角色"]:添加经验(经验 * HDPZ["寻梦追忆"]["经验"], "寻梦追忆")
	玩家数据[cyid]["角色"]:添加银子(银子 * HDPZ["寻梦追忆"]["银子"], "寻梦追忆", 1)
    	玩家数据[cyid].角色:添加除妖军功(1)

	if 取随机数()<=HDPZ["寻梦追忆"].爆率 then
		local 链接 = {提示=format("#P(寻梦追忆)#Y幻梦仙子对#G/%s#Y的表现尤为赞赏，特赠送",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y一个！" .. "#" .. 取随机数(1, 110)}
						local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["寻梦追忆"].ITEM),"寻梦追忆")
						if 数量== 9999 then --环
							玩家数据[cyid].道具:给予道具(cyid,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
						else
									玩家数据[cyid].道具:给予超链接道具(cyid,名称,数量,参数,链接)
						end
			end
end
return 寻梦追忆
