-- @Author: baidwwy
-- @Date:   2023-11-28 22:56:30
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2023-12-03 10:17:21
local 投放怪 = class()


function 投放怪:初始化()
	self.活动时间=QJHDSJ["定时刷怪"]
end
function 投放怪:活动定时器()
	for k,v in pairs(self.活动时间) do
		if v.时==0 then
			if v.分==服务端参数.分钟+0 and v.秒==服务端参数.秒+0 then --默认每小时开放
				self[k]()
			end
		else
			if v.时==服务端参数.小时+0 and v.分==服务端参数.分钟+0 and v.秒==服务端参数.秒+0 then --特定的小时开放
				self[k]()
			end
		end
	end
end

function 投放怪:怪物对话内容(id,类型,标识,地图)
    local 对话数据={}
	对话数据.模型=任务数据[标识].模型
	对话数据.名称=任务数据[标识].名称
	if 任务数据[标识].zhandou~=nil then
		对话数据.对话="我正在战斗中，请勿打扰。"
		return 对话数据
	end
	if 类型==1171 then--巡山小妖
		if 任务数据[标识].名称=="奔波儿灞" or 任务数据[标识].名称=="灞波儿奔" then
			对话数据.对话="我叫"..任务数据[标识].名称.."。是乱石山碧波潭万圣龙王手下的蛤蟆精。我家万圣公主招得一个驸马唤叫做九头精怪，神通广大。#28"
			对话数据.选项={"让我来看看你是什么小妖精","哎呀，肚子疼，先上个茅房"}
		elseif 任务数据[标识].名称=="精细鬼" or 任务数据[标识].名称=="伶俐虫" then
			对话数据.对话="我身上可有一宝贝，大王让我用来收服孙悟空用的，可别让我逮到唐僧他们几个#18"
			对话数据.选项={"让我来看看你是什么小妖精","哎呀，肚子疼，先上个茅房"}
		elseif 任务数据[标识].名称=="小钻风" then
			对话数据.对话="大王叫我来巡山，小心提防那孙悟空，伊儿哟来伊儿伊儿哟#42"
			对话数据.选项={"让我来看看你是什么小妖精","哎呀，肚子疼，先上个茅房"}
		elseif 任务数据[标识].名称=="有来有去" or 任务数据[标识].名称=="有去无回" then
			对话数据.对话="我乃麒麟山獬豸洞赛太岁的心腹小校#2"
			对话数据.选项={"让我来看看你是什么小妖精","哎呀，肚子疼，先上个茅房"}
		elseif 任务数据[标识].名称=="刁钻古怪" or 任务数据[标识].名称=="古怪刁钻" then
			对话数据.对话="我等奉黄狮精之命拿二十两银子去买猪羊，我家大王的爷爷可是九头元圣#24"
			对话数据.选项={"让我来看看你是什么小妖精","哎呀，肚子疼，先上个茅房"}
		else
			对话数据.对话="我大王神通广大，本事高强，一口曾吞了十万天兵。"
			对话数据.选项={"让我来看看你是什么小妖精","哎呀，肚子疼，先上个茅房"}
		end
	elseif 类型==1173 then--白骨精
		对话数据.对话="啊？竟然找上门来了，没吃到唐僧肉反而来了一群细皮嫩肉的！少侠，我实在饿得厉害，你看不如这样，我看你细皮嫩肉的，不如就给我做点心吧！"
		对话数据.选项={"妖怪！看打！","我找错人了"}
	elseif 类型==1174 then--狮驼国
		if 任务数据[标识].名称=="金翅大鹏雕分身" then
			对话数据.对话="如来佛祖居然也得叫我一声娘舅#28"
			对话数据.选项={"妖怪！看打！","我找错人了"}
		else
			对话数据.对话="你这等雄纠纠的，嚷上我门，莫不是要打么？有风方起浪，无潮水自平。你不惹我，我好寻你？"
			对话数据.选项={"妖怪！看打！","我找错人了"}
		end
	elseif 类型==1175 then --真假美猴王
		if 任务数据[标识].名称~="是俺老孙" then
			对话数据.对话="真亦假来假亦真，如若能取得真经，又为何要分个真假呢？"
			对话数据.选项={"既然如此执迷不悟，我只好打死你了","我再想想"}
		else
			对话数据.对话="既然分不清真与假，那就和我打一场，真假自然明了！"
			对话数据.选项={"为求真相只有与你一战了","哎呀，肚子疼，先上个茅房"}
		end
	end
	return 对话数据
end

function 投放怪:对话事件处理(id,名称,事件,类型)
	if 类型==1171 then--巡山小妖
		if 事件=="让我来看看你是什么小妖精" then
			if 名称=="小钻风" or 名称=="有来有去" or 名称=="有去无回" or 名称=="刁钻古怪" or 名称=="古怪刁钻" then
				战斗准备类:创建战斗(id+0,130066,玩家数据[id].地图单位.标识)
				任务数据[玩家数据[id].地图单位.标识].zhandou=true
			elseif 名称=="奔波儿灞" or 名称=="灞波儿奔" then
				战斗准备类:创建战斗(id+0,130067,玩家数据[id].地图单位.标识)
				任务数据[玩家数据[id].地图单位.标识].zhandou=true
			else
				战斗准备类:创建战斗(id+0,130068,玩家数据[id].地图单位.标识)
				任务数据[玩家数据[id].地图单位.标识].zhandou=true
			end
		end
	elseif 类型==1173 then--白骨精
		if 事件=="妖怪！看打！" then
			战斗准备类:创建战斗(id+0,130072,玩家数据[id].地图单位.标识)
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
		end
	elseif 类型==1174 then--狮驼国
		if 事件=="妖怪！看打！" then
			if 名称=="青毛狮子分身" then
				战斗准备类:创建战斗(id+0,130073,玩家数据[id].地图单位.标识)
				任务数据[玩家数据[id].地图单位.标识].zhandou=true
			elseif 名称=="白象精分身" then
				战斗准备类:创建战斗(id+0,130074,玩家数据[id].地图单位.标识)
				任务数据[玩家数据[id].地图单位.标识].zhandou=true
			elseif 名称=="金翅大鹏雕分身" then
				战斗准备类:创建战斗(id+0,130075,玩家数据[id].地图单位.标识)
				任务数据[玩家数据[id].地图单位.标识].zhandou=true
			end
		end
	elseif 类型==1175 then--真假美猴王
		if 事件=="既然如此执迷不悟，我只好打死你了" then
			if 名称=="冒牌小白龙" then
				战斗准备类:创建战斗(id+0,130076,玩家数据[id].地图单位.标识)
				任务数据[玩家数据[id].地图单位.标识].zhandou=true
			elseif 名称=="冒牌沙僧" then
				战斗准备类:创建战斗(id+0,130077,玩家数据[id].地图单位.标识)
				任务数据[玩家数据[id].地图单位.标识].zhandou=true
			elseif 名称=="冒牌猪八戒" then
				战斗准备类:创建战斗(id+0,130078,玩家数据[id].地图单位.标识)
				任务数据[玩家数据[id].地图单位.标识].zhandou=true
			elseif 名称=="冒牌大圣" then
				战斗准备类:创建战斗(id+0,130079,玩家数据[id].地图单位.标识)
				任务数据[玩家数据[id].地图单位.标识].zhandou=true
			elseif 名称=="冒牌唐僧" then
				战斗准备类:创建战斗(id+0,130080,玩家数据[id].地图单位.标识)
				任务数据[玩家数据[id].地图单位.标识].zhandou=true
			elseif 名称=="六耳猕猴" then
				战斗准备类:创建战斗(id+0,130081,玩家数据[id].地图单位.标识)
				任务数据[玩家数据[id].地图单位.标识].zhandou=true
			end
		elseif 事件=="为求真相只有与你一战了" then
			战斗准备类:创建战斗(id+0,130082,玩家数据[id].地图单位.标识)
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
	    end
	end
end

function 投放怪:巡山小妖()
  local 怪物名称 = {"奔波儿灞","灞波儿奔","精细鬼","伶俐虫","小钻风","有来有去","有去无回","刁钻古怪","古怪刁钻","云里雾","雾里云","急先锋"}
  local 怪物造型 = {"蛤蟆精","蛤蟆精","马面","海毛虫","犀牛将军兽形","狼","狼","树怪","树怪","兔子怪","兔子怪","鼠先锋"}
  for n=1,3 do
    for i=1,12 do
      local xy=地图处理类.地图坐标[1876]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1171"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=1800,
        玩家id=id,
        队伍组={},
        名称=怪物名称[i],
        模型=怪物造型[i],
        行走开关=true,
        x=xy.x,
        y=xy.y,
        地图编号=1876,
        战斗显示=true,
        地图名称=取地图名称(1876),
        销毁=true,
        类型=1171,
      }
      地图处理类:添加单位(任务id)
    end
  end
  广播消息({内容=format("#P(取经之路-巡山小妖)#Y南岭山#W里出现了一群巡山小妖，嚷嚷着要活捉唐僧！".."#"..取随机数(1,110)),频道="xt"})
end

function 投放怪:三打白骨精()
	for i=1,6 do
		local 地图1=1229
		local xy=地图处理类.地图坐标[地图1]:取随机点()
		local 任务id=取随机数(1,99).."1173"..os.time().."_"..随机序列.."_"..取随机数(99,99)
		随机序列=随机序列+1
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=1500,
			玩家id=id,
			队伍组={},
			名称="白骨精",
			模型="进阶蝎子精",
			行走开关=true,
			x=xy.x,
			y=xy.y,
			战斗显示=true,
			地图编号=地图1,
			地图名称=取地图名称(地图1),
			类型=1173,
			销毁=true,
			难度=5,
			-- 称谓="★★★★★",
		}
		地图处理类:添加单位(任务id)
	end

  广播消息({内容=format("#P(取经之路-三打白骨精)#W唐僧师徒四人在西行的路上，白骨精趁虚而入，为夺唐僧而在#Y波月洞#W巧设圈套！".."#"..取随机数(1,110)),频道="xt"})
end

function 投放怪:狮驼国()
  local 怪物名称 = {"青毛狮子分身","白象精分身","金翅大鹏雕分身"}
  local 怪物造型 = {"大大王","新二大王","三大王"}
  local 地图=1131
  for i=1,2 do
    for k=1,3 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1174"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=1500,
        玩家id=id,
        队伍组={},
        名称=怪物名称[k],
        模型=怪物造型[k],
        行走开关=true,
        x=xy.x,
        y=xy.y,
        战斗显示=true,
        地图编号=地图,
        地图名称=取地图名称(地图),
        销毁=true,
        类型=1174,
        难度=6
      }
      地图处理类:添加单位(任务id)
    end
  end
  广播消息({内容=format("#P(取经之路-狮驼国)#W唐僧师徒四人行至#Y狮驼国#W，发现此地骷髅若岭，骸骨如林。尸山血海，恐怖之至。看样子是免不了一场苦战了！".."#"..取随机数(1,110)),频道="xt"})
end

function 投放怪:真假美猴王()
  local 怪物名称 = {"冒牌小白龙","冒牌沙僧","冒牌猪八戒","冒牌大圣","冒牌唐僧","六耳猕猴","是俺老孙"} --7 真假大圣 谛听
  local 怪物造型 = {"男人_小白龙","沙和尚","新猪八戒","孙悟空","雨师","超级六耳猕猴","新孙悟空"}
  local 地图范围={1116,1126,1092,1501,1208,1091,1514}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,1 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1175"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=1500,
        玩家id=id,
        队伍组={},
        名称=怪物名称[i],
        模型=怪物造型[i],
        行走开关=true,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1175,
        销毁=true,
        -- 难度=i
      }
      -- for n=1,i do
      --   任务数据[任务id].称谓 = 任务数据[任务id].称谓.."★"
      -- end
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(取经之路-真假美猴王)#Y%s、%s、%s、%s、%s、%s、%s#W竟然出现了唐僧、猪八戒、沙悟净、小白龙、孙悟空这些个冒牌替身，叫嚣着要自己去取了西经。为了避免为祸人间，少侠们速速前去辨明真伪！".."#"..取随机数(1,110),刷新地图[1],刷新地图[2],刷新地图[3],刷新地图[4],刷新地图[5],刷新地图[6],刷新地图[7]),频道="xt"})
end

function 投放怪:战斗胜利处理(id组,战斗类型,任务id)
	if 任务数据[任务id]==nil then
		return
	end
	地图处理类:删除单位(任务数据[任务id].地图编号,任务数据[任务id].单位编号)
	任务数据[任务id]=nil
end

return 投放怪