local 法宝任务 = class()
function 法宝任务:初始化()
end

local function 取门派法宝(门派)
  if 门派 == "方寸山" then
    return "天师符"
  elseif 门派 == "女儿村" then
    return "织女扇"
  elseif 门派 == "天宫" then
    return "雷兽"
  elseif 门派 == "盘丝洞" then
    return "迷魂灯"
  elseif 门派 == "五庄观" then
    return "定风珠"
  elseif 门派 == "大唐官府" then
    return "七杀"
  elseif 门派 == "化生寺" then
    return "罗汉珠"
  elseif 门派 == "龙宫" then
    return "分水"
  elseif 门派 == "魔王寨" then
    return "赤焰"
  elseif 门派 == "普陀山" then
    return "金刚杵"
  elseif 门派 == "狮驼岭" then
    return "兽王令"
  elseif 门派 == "阴曹地府" then
    return "摄魂"

  elseif 门派 == "凌波城" then
    return "天煞"
  elseif 门派 == "五庄观" then
    return "定风珠"
  elseif 门派 == "神木林" then
    return "月影"
  elseif 门派 == "花果山" then
    return "琉璃灯"
  end
end

local function 取三级额外物品(名称,id)
  if 名称 == "救命毫毛" or 名称 == "曼陀罗" or 名称 == "伏魔天书" or 名称 == "忘情" or 名称 == "奇门五行令" or 名称 == "干将莫邪" or 名称 == "慈悲" or 名称 == "镇海珠" or 名称 == "五火神焰印" or 名称 == "普渡" or 名称 == "兽失心钹" or 名称 == "九幽" then
    return 取门派法宝(玩家数据[id].角色.门派)
  else
    local 法宝类型 = {"碧玉葫芦","飞剑","拭剑石","金甲仙衣","缚妖索","金钱镖","惊魂铃","嗜血幡","风袋","清心咒","九黎战鼓","盘龙壁","神行飞剑","汇灵盏"}
    return 法宝类型[取随机数(1,#法宝类型)]
  end
end

function 法宝任务:法宝任务(id,法宝,等级)
  local 任务id=id.."_38_"..os.time()
  任务数据[任务id]={
    id=任务id,
    起始=os.time(),
    结束=0,
    法宝名称=法宝,
    玩家id=id,
    队伍组={},
    是存档=true,
    法宝材料={},
    类型=38
  }
  if 等级>=2 then
    任务数据[任务id].额外物品={"九眼天珠"}
    if 等级>=3 then
      任务数据[任务id].额外物品[#任务数据[任务id].额外物品+1] = 取三级额外物品(法宝,id)
    end
  end
  local 总任务id = 任务id
  玩家数据[id].角色:添加任务(任务id)
  local 序列=取随机数(1,#Q_随机人物)
  local 地图=Q_随机人物[序列].地图
  local 名称=Q_随机人物[序列].人物[取随机数(1,#Q_随机人物[序列].人物)]
  local 材料={"天蚕丝","玄龟板","金凤羽","麒麟血","补天石"} --,"千年阴沉木"
  local sj = 取随机数(1,#材料)
  local 材料名称 = 材料[sj]
  table.remove(材料,sj)
  local 任务id=id.."_39_"..os.time()
  任务数据[任务id]={
    id=任务id,
    起始=os.time(),
    结束=0,
    法宝名称=法宝,
    玩家id=id,
    地图编号=地图,
    地图名称=取地图名称(地图),
    是存档=true,
    名称=名称,
    材料名称=材料名称,
    队伍组={},
    类型=39
  }
  if 取随机数() <= 50 then
    local 临时限制=取随机数(5,8)
    local 打造物品=绑定等级物品()
    local 物品名称=打造物品[取随机数(1,23)][临时限制+1]
    if type(物品名称)=="table" then
      物品名称=物品名称[取随机数(1,#物品名称)]
    end
    任务数据[任务id].物品= 物品名称
  else
    local 物品 = {"金刚石","定魂珠","夜光珠","避水珠","龙鳞","高级魔兽要诀"}
    任务数据[任务id].物品=物品[取随机数(1,#物品)]
  end
  玩家数据[id].角色:添加任务(任务id)
  任务数据[总任务id].法宝材料[#任务数据[总任务id].法宝材料+1] = 任务数据[任务id].材料名称

  local 序列=取随机数(1,#Q_随机人物)
  local 地图=Q_随机人物[序列].地图
  local 名称=Q_随机人物[序列].人物[取随机数(1,#Q_随机人物[序列].人物)]
  local sj = 取随机数(1,#材料)
  local 材料名称 = 材料[sj]
  local 任务id=id.."_40_"..os.time()
  任务数据[任务id]={
      id=任务id,
      起始=os.time(),
      结束=0,
      法宝名称=法宝,
      玩家id=id,
      地图编号=地图,
      是存档=true,
      材料名称=材料名称,
      地图名称=取地图名称(地图),
      名称=名称,
      队伍组={},
      类型=40
  }
  if 取随机数() <= 50 then
    local 临时限制=取随机数(5,8)
    local 打造物品=绑定等级物品()
    local 物品名称=打造物品[取随机数(1,23)][临时限制+1]
    if type(物品名称)=="table" then
      物品名称=物品名称[取随机数(1,#物品名称)]
    end
    任务数据[任务id].物品= 物品名称
  else
    local 物品 = {"金刚石","定魂珠","夜光珠","避水珠","龙鳞","高级魔兽要诀"}
    任务数据[任务id].物品=物品[取随机数(1,#物品)]
  end
  玩家数据[id].角色:添加任务(任务id)
  任务数据[总任务id].法宝材料[#任务数据[总任务id].法宝材料+1] = 任务数据[任务id].材料名称
end

function 法宝任务:完成法宝任务(id,任务id)
  if 任务数据[任务id]==nil then
    常规提示(id,"#Y/你没有这样的任务")
    return
  end
  玩家数据[id].道具:给予道具(id,任务数据[任务id].材料名称,1,"不存共享")
  常规提示(id,"#Y/你获得了"..任务数据[任务id].材料名称)
  添加最后对话(id,"看你人还不错，这件宝贝就送给你吧！")
  玩家数据[id].角色:取消任务(任务id)
  任务数据[任务id]=nil
end


function 法宝任务:法宝内丹任务(id)
  if 玩家数据[id].角色:取任务(41) ~= 0 then
    常规提示(id,"#Y/你已经领取过此任务了")
    return
  elseif 玩家数据[id].角色.等级 < 60 then
    常规提示(id,"#Y/完成此任务必须达到60级")
    return
  end
  local 任务id=id.."_41_"..os.time().."_"..随机序列.."_"..取随机数(1,999)
  local 地图范围={1501,1193,1506,1110,1514,1091,1174,1173}
  local 地图=地图范围[取随机数(1,#地图范围)]
  local 随机参数=取随机数()
  local 模型=取随机怪(65,155)[2]
  local 名称 = "千年老妖"
  local xy=地图处理类.地图坐标[地图]:取随机点()
  任务数据[任务id]={
    id=任务id,
    起始=os.time(),
    结束=3600,
    玩家id={},
    队伍组={},
    名称=名称,
    模型=模型,
    x=xy.x,
    y=xy.y,
    地图编号=地图,
    地图名称=取地图名称(地图),
    类型=41
  }
  地图处理类:添加单位(任务id)
  玩家数据[id].角色:添加任务(任务id)
  添加最后对话(id,format("听说#Y/%s#W/正在#G/%s(%s,%s)#W/处作恶，你速速前往斩杀取回其内丹。",任务数据[任务id].名称,任务数据[任务id].地图名称,任务数据[任务id].x,任务数据[任务id].y))
end


__GWdh111[41] = function (连接id,数字id,序列,标识,地图)
  local 对话数据={}
  对话数据.模型=任务数据[标识].模型
  对话数据.名称=任务数据[标识].名称
  if 任务数据[标识].战斗==nil then
    if 玩家数据[数字id].角色:取任务(41)==标识 then
      对话数据.对话="想取我内丹，那要看你有没有这本事！"
      对话数据.选项={"看招","让我再想一想"}
    else
      对话数据.对话="我好像不认识你吧？？？"
    end
  end
  return 对话数据
end

__GWdh222[41] = function  (连接id,数字id,序号,内容)
  local 事件=内容[1]
  local 名称=内容[3]
  if 事件=="看招" then
    if 任务数据[玩家数据[数字id].地图单位.标识] == nil then return  end
    if 任务数据[玩家数据[数字id].地图单位.标识].战斗~=nil then 常规提示(数字id,"#Y/对方正在战斗中") return  end
    战斗准备类:创建战斗(数字id+0,191004,玩家数据[数字id].地图单位.标识)
    任务数据[玩家数据[数字id].地图单位.标识].战斗=true
    玩家数据[数字id].地图单位=nil
    return
  end
end

function 法宝任务:完成法宝内丹(id组,任务id)
  local id = id组[1]
  if 任务数据[任务id]==nil then
    常规提示(id,"#Y/你没有这样的任务")
    return
  end
  玩家数据[id].道具:给予道具(id,"内丹",1,nil,"不存共享")
  常规提示(id,"#Y/你获得了内丹")
  玩家数据[id].角色:取消任务(任务id)
  地图处理类:删除单位(任务数据[任务id].地图编号,任务数据[任务id].单位编号)
  任务数据[任务id]=nil
  local 任务id = 玩家数据[id].角色:取任务(38)
  if 任务数据[任务id] then
    任务数据[任务id].内丹完成=true
  end
end

function 任务说明38(玩家id,任务id)
  if 任务数据[任务id].额外物品 then
    local 物品 = ""
    for i=1,#任务数据[任务id].额外物品 do
      if i ~= #任务数据[任务id].额外物品 then
        物品 = 物品 .. 任务数据[任务id].额外物品[i] .. "、"
      else
        物品 = 物品 .. 任务数据[任务id].额外物品[i]
      end
    end
    return {"法宝任务",format("找齐材料后找#R/天宫#W/的#R/qqq|金童子*兜率宫*npc查询/金童子#W/合成法宝#R/%s#W/吧(你还需要提前准备好#R/%s#W/以备不时之需！)",任务数据[任务id].法宝名称,物品),"完成可获得指定法宝"}
  else
    return {"法宝任务",format("找齐材料后找#Y/天宫#W/的#R/qqq|金童子*兜率宫*npc查询/金童子#W/合成法宝#R/%s#W/吧",任务数据[任务id].法宝名称),"完成可获得指定法宝"}
  end
end

function 任务说明39(玩家id,任务id)
  return {"法宝材料",format("向#Y/%s#W/的#R/qqq|%s*%s*npc查询/%s#W/讨要一块#R/%s#W/,同时帮他找到#R/qqq|%s*物品查询*/%s",任务数据[任务id].地图名称,任务数据[任务id].名称,任务数据[任务id].地图名称,任务数据[任务id].名称,任务数据[任务id].材料名称,任务数据[任务id].物品,任务数据[任务id].物品),"完成可获得指定法宝"}
end

function 任务说明40(玩家id,任务id)
  return {"法宝材料",format("向#Y/%s#W/的#R/qqq|%s*%s*npc查询/%s#W/讨要一块#R/%s#W/,同时帮他找到#R/qqq|%s*物品查询*/%s",任务数据[任务id].地图名称,任务数据[任务id].名称,任务数据[任务id].地图名称,任务数据[任务id].名称,任务数据[任务id].材料名称,任务数据[任务id].物品,任务数据[任务id].物品),"完成可获得指定法宝"}
end

function 任务说明41(玩家id,任务id)
  return {"内丹任务",format("速速前往#Y/%s#R/qqq|%s*%s*临时npc*%s*%s/%s#W/斩杀#G/%s#W/并取回其#R/内丹#W/",任务数据[任务id].地图名称,任务数据[任务id].名称,任务数据[任务id].地图编号,任务数据[任务id].x,任务数据[任务id].y,任务数据[任务id].名称,任务数据[任务id].名称),"完成获得内丹"}
end

return 法宝任务