-- @Author: baidwwy
-- @Date:   2025-04-08 18:32:39
-- @Last Modified by:   tangguo
-- @Last Modified time: 2026-04-03 20:44:51

local 简单_决战大雁塔 = class()
local qz=math.floor
function 简单_决战大雁塔:初始化()

end


function 简单_决战大雁塔:系统胜利处理(胜利组,失败组)
	for n=1,#胜利组 do
    local id=胜利组[n]
    local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
		local 决战进阶 = 30
		local 决战积分 = 10
    local 经验=平均等级*取随机数(2200,2300)
    local 银子=平均等级*160+24000
    玩家数据[id].角色:添加经验(经验*HDPZ["决战大雁塔"].经验,"决战大雁塔",1)
    玩家数据[id].角色:添加银子(qz(银子*HDPZ["决战大雁塔"].银子),"决战大雁塔",1)
    玩家数据[id].角色:添加储备(qz(银子*0.2*HDPZ["决战大雁塔"].银子),"决战大雁塔",1)
    if 取随机数()<=HDPZ["决战大雁塔"].爆率 then
        local 链接 = {提示=format("#S(决战大雁塔守护者)#R/%s#Y经过一番激烈的战斗，最终战胜了#R守护者#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
        local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["决战大雁塔"].ITEM),"决战大雁塔")
        if 数量== 9999 then --环
            玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
        else
            玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
        end
    end
    if 玩家数据[id].角色.决战积分==nil then
			玩家数据[id].角色.决战积分=0
		end
		if 玩家数据[id].角色.决战积分 < 决战进阶 then
	    玩家数据[id].角色.决战积分=玩家数据[id].角色.决战积分+决战积分
		  常规提示(id,"#Y/恭喜你战胜了(守护神)获得了"..决战积分.."点决战积分")
		else
			local 升降地图={[10041]=1,[10051]=2,[10061]=3,[10071]=4,[10081]=5,[10901]=6,[10091]=7}
		  local 升降地图1={[1]=10041,[2]=10051,[3]=10061,[4]=10071,[5]=10081,[6]=10901,[7]=10091}
			local 胜利编号 = 升降地图[玩家数据[id].角色.地图数据.编号] +1
			if 胜利编号> 7 then
				胜利编号=7
			end
			玩家数据[id].zhandou=0
			地图处理类:跳转地图(id,升降地图1[胜利编号],32,36)
		  玩家数据[id].角色.决战积分=玩家数据[id].角色.决战积分-决战进阶
		  常规提示(id,"#Y/恭喜你进阶至"..胜利编号.."层，扣除了"..决战进阶.."决战积分")
		end
	end
end

function 简单_决战大雁塔:PK胜利处理(胜利组,失败组)
	if 胜利组 and 胜利组[1] and 失败组 and 失败组[1] then
		for n=1,#胜利组 do
	    local 胜利id=胜利组[n]
	    local 平均等级 = 取队伍平均等级(玩家数据[胜利id].队伍,胜利id)
	    local 升降地图={[10041]=1,[10051]=2,[10061]=3,[10071]=4,[10081]=5,[10901]=6,[10091]=7}
	    local 升降地图1={[1]=10041,[2]=10051,[3]=10061,[4]=10071,[5]=10081,[6]=10901,[7]=10091}
	    local 胜利编号= 升降地图[玩家数据[胜利组[1]].角色.地图数据.编号] +1
	    local 经验=平均等级*取随机数(2200,2300)
	    local 银子=平均等级*160+24000
	    local 决战积分=15
	    if 玩家数据[胜利id].角色.决战积分==nil then
				玩家数据[胜利id].角色.决战积分=0
			end
			玩家数据[胜利id].角色.决战积分=玩家数据[胜利id].角色.决战积分+决战积分
		  常规提示(胜利id,"#Y/恭喜你战胜了"..玩家数据[失败组[1]].角色.名称.."获得了"..决战积分.."点决战积分")
	    玩家数据[胜利id].角色:添加经验(经验*HDPZ["决战大雁塔"].经验,"决战大雁塔",1)
	    玩家数据[胜利id].角色:添加银子(qz(银子*HDPZ["决战大雁塔"].银子),"决战大雁塔",1)
	    玩家数据[胜利id].角色:添加储备(qz(银子*0.2*HDPZ["决战大雁塔"].银子),"决战大雁塔",1)
	    if 取随机数()<=HDPZ["决战大雁塔"].爆率 then
	        local 链接 = {提示=format("#S(决战大雁塔)#R/%s#Y经过一番激烈的战斗，最终战胜了#R/%s#Y的队伍，#Y因此获得了唐王奖励的#G/",玩家数据[胜利id].角色.名称,玩家数据[失败组[1]].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
	        local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["决战大雁塔"].ITEM),"决战大雁塔")
	        if 数量== 9999 then --环
	            玩家数据[胜利id].道具:给予道具(胜利id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
	        else
	            玩家数据[胜利id].道具:给予超链接道具(胜利id,名称,数量,参数,链接)
	        end
	    end
			if 胜利编号> 7 then
				胜利编号=7
			end
	    玩家数据[胜利id].zhandou=0
	    地图处理类:跳转地图(胜利id,升降地图1[胜利编号],32,36)
		  常规提示(胜利id,"#Y/恭喜你进阶至"..胜利编号.."层")
	  end
	  for n=1,#失败组 do
	    local 失败id=失败组[n]
	    local 决战积分=15
	    local 平均等级 = 取队伍平均等级(玩家数据[失败id].队伍,失败id)
	    local 升降地图={[10041]=1,[10051]=2,[10061]=3,[10071]=4,[10081]=5,[10901]=6,[10091]=7}
	    local 升降地图1={[1]=10041,[2]=10051,[3]=10061,[4]=10071,[5]=10081,[6]=10901,[7]=10091}
	    local 失败编号= 升降地图[玩家数据[失败id].角色.地图数据.编号] -1
	    local 经验=平均等级*取随机数(220,230)
	    local 银子=平均等级*160
	    if 玩家数据[失败id].角色.决战积分==nil then
				玩家数据[失败id].角色.决战积分=0
			end
			玩家数据[失败id].角色.决战积分=玩家数据[失败id].角色.决战积分-决战积分
		  常规提示(失败id,"#Y/您战败了给了"..玩家数据[胜利组[1]].角色.名称.."扣除"..决战积分.."点决战积分")
	    玩家数据[失败id].角色:添加经验(经验*HDPZ["决战大雁塔"].经验,"决战大雁塔",1)
	    玩家数据[失败id].角色:添加银子(qz(银子*HDPZ["决战大雁塔"].银子),"决战大雁塔",1)
	    玩家数据[失败id].角色:添加储备(qz(银子*0.2*HDPZ["决战大雁塔"].银子),"决战大雁塔",1)
	    if 取随机数()<=HDPZ["决战大雁塔"].爆率 then
	        local 链接 = {提示=format("#S(决战大雁塔)#R/%s#Y经过一番激烈的战斗，最终战败了#R/%s#Y的队伍，#Y因此获得了唐王奖励的#G/",玩家数据[失败id].角色.名称,玩家数据[胜利组[1]].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
	        local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["决战大雁塔"].ITEM),"决战大雁塔")
	        if 数量== 9999 then --环
	            玩家数据[失败id].道具:给予道具(失败id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
	        else
	            玩家数据[失败id].道具:给予超链接道具(失败id,名称,数量,参数,链接)
	        end
	    end
	    if 失败编号<1 then
				失败编号=1
			end
	    玩家数据[失败id].zhandou=0
			地图处理类:跳转地图(失败id,升降地图1[失败编号],32,36)
			常规提示(失败id,"#Y/再接再厉您已掉到"..失败编号.."层")
	  end
	end
end
function 简单_决战大雁塔:发起PK(id,内容,序号)
	local 对手id=内容.序列
	if 玩家数据[id].队伍 ~= 0 and 玩家数据[id].队长==false then
		常规提示(id,"#Y/只有队长才能触发战斗！")
		return
	end
	--if 决战大雁塔五人 then
   --        	        for i = 1,#队伍数据[玩家数据[id].队伍].成员数据 do
   --        	        	local cyid = 队伍数据[玩家数据[id].队伍].成员数据[i]
	  --                   if not  五人大雁塔[cyid] then
			-- 常规提示(id,"#Y/检测到队伍拥有非参战成员，已自动离开")
   --                                    地图处理类:跳转地图(id, 1001, 420, 77)
			-- return
	  --                   end
                --    end
            if 决战大雁塔三人 then
                    if 玩家数据[id].队伍==0 then
                                      地图处理类:跳转地图(id, 1001, 420, 77)
			常规提示(id,"#Y/非5人队伍，已移出地图")
                    		return
                    end
   --        	        for i = 1,#队伍数据[玩家数据[id].队伍].成员数据 do
   --        	        	local cyid = 队伍数据[玩家数据[id].队伍].成员数据[i]
	  --                   if not  三人大雁塔[cyid] then
			-- 常规提示(id,"#Y/检测到队伍拥有非参战成员，已自动离开")
   --                                    地图处理类:跳转地图(玩家数据[对手id].队伍, 1001, 420, 77)
			-- return
	  --                   end
                    end
                    if  取队伍人数(id)~=5 then
                                      地图处理类:跳转地图(id, 1001, 420, 77)
			常规提示(id,"#Y/请确定队伍中有且仅有5位参战玩家")
                    	return
                    end
                    if 玩家数据[对手id].队伍==0 then
                                      地图处理类:跳转地图(对手id, 1001, 420, 77)
			常规提示(id,"#Y/对手非5人队伍，已将该玩家移出地图")
                    		return
                    end
                    if  取队伍人数(对手id)~=5 then
                                      地图处理类:跳转地图(玩家数据[对手id].队伍, 1001, 420, 77)
			常规提示(id,"#Y/对手非5人队伍，已将该玩家移出地图")
                    	return
                    end

	   --        	        for i = 1,#队伍数据[玩家数据[对手id].队伍].成员数据 do
	   --        	        	local cyid = 队伍数据[玩家数据[对手id].队伍].成员数据[i]
		  --                   if not  三人大雁塔[cyid] then
				-- 常规提示(id,"#Y/检测到队伍拥有非参战成员，已自动离开")
	   --                                    地图处理类:跳转地图(玩家数据[对手id].队伍, 1001, 420, 77)
				-- return
		  --                   end
	   --                  end
          --  end
	if 玩家数据[对手id].队伍~=0 and not 玩家数据[对手id].队长  then
	战斗准备类:创建玩家战斗(id, 200007, 玩家数据[对手id].队伍, 地图)
	else
	战斗准备类:创建玩家战斗(id, 200007, 对手id, 地图)
	end
end


function 简单_决战大雁塔:活动定时器(id)

	if 决战大雁塔五人 or 决战大雁塔三人 then
		if 20==服务端参数.小时+0 and 01==服务端参数.分钟+0 and 10==服务端参数.秒+0  then
			if 决战大雁塔三人 then
				self:给予三人地图奖励()
				self:雁塔系统怪物()
				自写活动:一层守护神()
				自写活动:二层守护神()
				自写活动:三层守护神()
				自写活动:四层守护神()
				自写活动:五层守护神()
				自写活动:六层守护神()
				自写活动:七层守护神()
			end
		elseif  20==服务端参数.小时+0 and 05==服务端参数.分钟+0 and 10==服务端参数.秒+0  then
			if 决战大雁塔三人 then
				self:给予三人地图奖励()
			end
		elseif  20==服务端参数.小时+0 and 10==服务端参数.分钟+0 and 10==服务端参数.秒+0  then
			if 决战大雁塔三人 then
				self:给予三人地图奖励()
				自写活动:一层守护神()
				自写活动:二层守护神()
				自写活动:三层守护神()
				自写活动:四层守护神()
				自写活动:五层守护神()
				自写活动:六层守护神()
				自写活动:七层守护神()
			end
		elseif  20==服务端参数.小时+0 and 15==服务端参数.分钟+0 and 10==服务端参数.秒+0  then
			if 决战大雁塔三人 then
				self:给予三人地图奖励()
			end
		elseif  20==服务端参数.小时+0 and 20==服务端参数.分钟+0 and 10==服务端参数.秒+0  then
			if 决战大雁塔三人 then
				self:给予三人地图奖励()
				自写活动:一层守护神()
				自写活动:二层守护神()
				自写活动:三层守护神()
				自写活动:四层守护神()
				自写活动:五层守护神()
				自写活动:六层守护神()
				自写活动:七层守护神()
			end
		elseif  20==服务端参数.小时+0 and 25==服务端参数.分钟+0 and 10==服务端参数.秒+0  then
			if 决战大雁塔三人 then
				self:给予三人地图奖励()
				self:雁塔系统怪物()
			end
		elseif  20==服务端参数.小时+0 and 30==服务端参数.分钟+0 and 10==服务端参数.秒+0  then
			if 决战大雁塔三人 then
				self:给予三人地图奖励()
				自写活动:一层守护神()
				自写活动:二层守护神()
				自写活动:三层守护神()
				自写活动:四层守护神()
				自写活动:五层守护神()
				自写活动:六层守护神()
				自写活动:七层守护神()
			end
		elseif  20==服务端参数.小时+0 and 35==服务端参数.分钟+0 and 10==服务端参数.秒+0  then
			if 决战大雁塔三人 then
				self:给予三人地图奖励()
			end
		elseif  20==服务端参数.小时+0 and 40==服务端参数.分钟+0 and 10==服务端参数.秒+0  then
			if 决战大雁塔三人 then
				self:给予三人地图奖励()
				自写活动:一层守护神()
				自写活动:二层守护神()
				自写活动:三层守护神()
				自写活动:四层守护神()
				自写活动:五层守护神()
				自写活动:六层守护神()
				自写活动:七层守护神()
			end
		elseif  20==服务端参数.小时+0 and 45==服务端参数.分钟+0 and 10==服务端参数.秒+0  then
			if 决战大雁塔三人 then
				self:给予三人地图奖励()
				self:雁塔系统怪物()
			end
		elseif  20==服务端参数.小时+0 and 50==服务端参数.分钟+0 and 10==服务端参数.秒+0  then
			if 决战大雁塔三人 then
				self:给予三人地图奖励()
				自写活动:一层守护神()
				自写活动:二层守护神()
				自写活动:三层守护神()
				自写活动:四层守护神()
				自写活动:五层守护神()
				自写活动:六层守护神()
				自写活动:七层守护神()
			end
		elseif  20==服务端参数.小时+0 and 55==服务端参数.分钟+0 and 10==服务端参数.秒+0  then
			if 决战大雁塔三人 then
				self:给予三人地图奖励()
				self:雁塔系统怪物()
			end
		elseif  20==服务端参数.小时+0 and 59==服务端参数.分钟+0 and 10==服务端参数.秒+0  then
			if 决战大雁塔三人 then
				self:给予三人地图奖励()
				自写活动:一层守护神()
				自写活动:二层守护神()
				自写活动:三层守护神()
				自写活动:四层守护神()
				自写活动:五层守护神()
				自写活动:六层守护神()
				自写活动:七层守护神()
			end
			决战大雁塔五人=false
			决战大雁塔三人=false
		end
	end
end

function 取随机中文姓名(num)
  local 字库 = "闻霁充娅思邸硕司马凝远哀元绿端元瑶褚曜灿堂涵忍摘大郝奥翦含莲罗小瑜查冷雪乐正玉琲田正平钟之玉赵斯令狐昆明檄春燕范振海夙元龙赫嘉玉子车舒兰蛮谧登谷雪夔毅秋锁鸿媳赖温瑜折靖之集晓曼甲文思妫巧凡酒擅邗雁卉帛小蕊左春兰节书双应卿陶骏中望舒驹建修禚又儿似修远百令雪占嘉悦谢刚毅银青梦苏波涛鲍慕诗敖弘伟贯语儿姬寄波澄正信蒉鹤梦琦银河鞠春祁秋翠开智渊东郭雅素闵妮子辟雨雪勾红螺张廖元勋隐弘量晋紫雪洛冰慎贤淑嬴天音续之桃唐涵意招正平归梦云束新苗喜逸明史语林后同光青安青接凝芙洋庄雅位英范危芳茵及谷槐郗访曼逯雨珍信昊苍慕驰月诸白萱臧彤彤畅阳曦仉傲雪守易云运思彤漆雕韫玉空歌闪梦菡赫连翰采督代珊姓蕾宝洛妃建诗霜米海菡颛孙瀚昂贲仕壬雅云禽文康后漾漾藩驰丽卿瑜江欣悦杞傲冬阿含之卢雅丹悟远碧如波糜雨信南家欣窦冬卉贝启颜水子美辉高兴喻荷紫黎和通辛问萍纳本眭晗日滕月天赏鹏涛历乃丰家伍心曾沙摩凌兰熊昭昭出文景康卫睢痴凝闾清润修骊英莫向晨愧采萱九驰不听然稽安珊库燕妮伯巧夏营欢问音愚晶灵亓官馨欣竹晓蕾拓跋琨瑜盖问萍阎捷揭元槐纵兴运斐闲丽舜赐迟欣崇书萱宗政夜蓉丁易梦宇梦香郁静柏戏飞薇裔音韵云彩萱牵芊候一嘉求慕悦贰馨香伊白云淳于春英亢三载半兰能清逸蒲千亦检夜梅李寄瑶余盼翠张简琨燕佩杉端木诗珊万心菱台浩宕恽平婉终阳阳岳藏栾鸿飞巴云飞狂新梅郏凌兰衷平母子芸卜静舷萨任真太史天薇蹉宛妙房飞文宋乐游边佩蓟天罡纳喇和裕贵立人呼延素昕薛明熙考飒理丹烟封静慧线叡费慕山谷蔓官梦华谌初夏成芦冠英韶饶颖初枚浩波全从筠风闲公新蕾春山兰拱晨欣宇文思萱鹿寒天邢清涵牧心语双寒介平心抄幼荷图门沛首堂却强严景澄绍曦之纪德昌剧沛容和新筠奕白卉翠问兰校以丹禹骏英强靓影沙银弭海颖告博简段干庄葛雨真支怜双褒静枫巫慕思屠建柏汝燕珺缪斯雅松秋英刚星河勤昆峰宛宜阮凡雁楼和洽卯友安善宏阔裘鸿彩柳乐章华倩秀说暮芸长秋玉师飞兰蔺以彤宿曼寒凭雨伯山幼仪钞怀玉汉华晖幸宏大广洋洋树隽美进乐容芒倚本天巧隽文光完颜亦凝乔冷萱用晴虹温芦雪夏侯飞昂书映秋马佳云逸英听芹辜厚荆书艺亓若淑芮惠然羊英苌明珠穰西生雨石但梓璐岑睿范完湘所代梅清翰学答陶秘以彤融菡梅蒋曼凡帖雅彤向绮梅恭昶良语燕豆涤咎凝罕幼柏聊敏达愈曼岚波晴照那拉翠芙桥映冬倪柔妙夏空牢元绿蒯春晓皮迎丝拜烨华红吉玉马惠君敛半香那含巧陀嘉祥骑访文禾润魏向秋桑驰海卯阳旭邬凌春福听安连醉波原浩然扶施诗邵靖颜寻双车子蕙垄醉巧第悟蓬白曼律楚庞颖秀势文惠仝安宜谈晶滢满梦竹瞿丝劳乐然元浩气有浩淼司徒嘉致玉颖颖竭袖公冶兰英让森丽蹇清淑泉思美佴昊东潘鹏池宓霞雰浦桂芝同斯伯种向晨厚娜周舟邛采绿前香桃祢春梳溥云亭绪水彤兆阳蓉秦腾逸舒魄羽家美令和硕永慕蕊由亦梅仇依辰柏甜恬仲孙俊捷功映秋笪昕昕麦平萱化清绮酆易容尹姗寿山芙段证百里浩岚碧鲁清怡仁俊爽花香莲太叔欣悦冉山蝶呼晗玥少骊蓉司嘉议轩援又青宾若骞鄂永贞邰新知谷梁又槐公西学义业绿蕊肥荌牛含香仪智勇尤噬汪伟志甫紫云奚觅风于家美栗庆音童半雪野翰藻丑礼骞路半青肇同方漆暖梦世幼枫峪景龙硕寄松弥丹萱箕岚风谯志行朱玉树费莫阳晖象翠茵东方震繁梓云公良凌蝶綦凡灵资夏旋潜高义冀香旋伺醉柳祈海白焉文斌俎赞乌雅丽华植乐双犹诗桃乌孙弘壮勇婷婷力三姗夷阳舒大凌春毓敏智普巍然包文昌希之仆鸿运宣用才唁红泥俨虞璞性元正甄水风卑耘豪蔡清雅尉初雪曲琛雍经业高知荀涵涤吉通随思远苗凝海诺纯战承安夹谷霞梳左丘南琴称之卉瑞古代唱月兴香岚佼兴德茹昊硕杨谷之侯沛槐况瑜英军丹寒蓉希慕慕容涵蕾貊凯唱养福濯茂学郦彰明朗丽刘阳火骆轩秀智春柏石浩广泰嘉平虢芝兰鄢秋寒市饮月镇寒梦易鹏飞鲜安楚易真卫瑛瑶齐博涛函秀竹茂楠楠謇济彤玛丽屈丹山顿复孟又菡利廷剑作人度暄莹危元嘉庚雅琴之虹彩门念双虎朝池灵珊望和同延映寒廖博瀚娄钰诸葛茂唁布幻天文晓枫笃凝珍东门兴昌闳虹颖奈碧春俟楠乙音华达灵安威夏月公羊羡寻才捷棺玉轩蒙溪隋琪睿柯宜然以惜芹刀晴曦汗健尉迟雅琴皇甲钱豫暴雨莲时秋露北访冬速盼易樊思怡缑哲思斛熙星伦建武鸿达宦惜香寇代巧上官半凡竺赫尔夜雪改清懿通从凝源雨琴焦晴波析芳茵穆梳美麴依白郁旻骞巩宁税谷槐祝鸿卓始淳静井映雪籍辰皓钮白梅保若芳睦初蝶昔虹雨章佳浚乐嘉熙佘令锋肖运洁励阳曜京英豪郸元甲吴雅美于夏菡詹依秋阴绍辉雪春雪管骊霞闫晖素婉静奇笛韵僪问柳捷瑛承英才刁采白郑惜玉城澍钭若翠买任习春翠椅灵雨施叶春侨采苟绿海耿萄萄毕秋华檀程单于凌丝犁新儿璩嘉树鲁建安区巧荷老颜骏初倩鱼南琴惠蕴和枝丽泽士运菱佛靖儿欧梦露祖晶滢盈修文扬玲逄伦六湘君顾博雅塔尚庹尔阳昌水之摇碧琴莘浩涆伟佁然微生玥逮愉东望雅沃爵殳欣悦陆半脱向卉在驰媛丙莱言思义侍涵蕾朴宇邴慧颖敬迎南冯兴盛丹秋仰寅果迎曼次芃孙明凝多月灵廉怿昂丹彤公孙问凝霜为郎翊君紫冷之歧彤可念烟千依云索友灵庾瑜然漫友安镜涵菱蔚怜烟申高峰丛庄静实问薇薄简藏梅梅范姜锐意蓝豪纤情文森易天寄灵雀和昶刑洋公叔慈农嘉良靳向南嘉艳蕊疏玑单雪羽哈高格字静安嵇凯旋都苑项映寒乾芳荃牟云水矫昊宇渠奕俞水洪腾骏澹台书兰巫马南晴潭陶然行俊艾匡雅韵淦志明琴元青家甘盍念珍孝弘大雷丰茂亥绮烟益河灵真胤运司寇梦桃宁茵禄萦党明德荤羡丽敏怿梅思美聂德运局涵韵宫柔蔓游乐邝怀梦干鸣革德华黄从蕾戴卓然曹昊天腾经零惜儿湛骊颖香含云阳子帆胡吉星藤晓曼国德厉丝柳别俊晤皋荷止曼蔓卷骄无念梦环嘉珍钟离飞语晁安萱仵平绿声宏硕麻初彤戢清漪寸方凤素昕吕华翰频琴贾凌覃采梦苑雅逸操又夏浑柔惠章运诚诗文君乌以蕊礼鸿才慈听枫错惜狄溥心韶博裕独湛芳戊曜曦柔存郯迎真居扬僧羲过琛丽锐惠心须卿月堵曼衍展香萱其和悌昝修雅班和雅冒诗蕊崔雅素仍采南旗曼冬墨毅梅磨雯华圣冬梅潭觅露纵智系玉瑾尾修永相半双典琅翁韵萧和悌兰妙芙赤勇毅何浩慨杜胤富察丽文王谷菱示坚壁赛醉柳梁丘阳兰依安翔允曼寒沉秀雅邓端敏么梓馨浮安易龚芸若彭雄掌秀媚己伶俐请南霜暨芝戚飞光第五凝莲步夏瑶星元基郜傲之祭瑞芝储海超抗畅然念慧秀钊香梅忻笛濮阳春华练毅文户和美铣小夏粟晓曼栋听枫壤驷访文毋舒兰隆迎丝是南露留严和林紫雪权涵煦戎智敏涂若云方尔柳季以柳逢凝安侍阳煦夕涵育将芳馨乘友槐白雪曼袁半芹茅夜玉经禹巢春柔邶逸思厍鸿哲晏灵卉莱广符天蓝宜永嘉绳昕解弼宏宜修龙文德吾秀美卞振国戈冰冰谬梓露信凝绿赧晓山南门浦泽孛鸿祯裴心语陈证琪类昊然朋尾府运珹帅寻云道虹影贸驰逸程幻巧学醉柳秋觅柔针启寒秋珊怀玉龙闽星爵塞艳卉殷曼容甘紫萱尚新美淡秀妮席飞双斯丽窃碧灵衣灵波潮冰真丘春海汤语彤从谷翠叶素欣光晴曦伏湉湉印从霜傅彩严许迎天佟佳壮羿海凡徐语蓉偶乐松越凌晓柴妙晴衡中旁学民古芳商芸芸阙沛白锺离从蓉盘婉柔欧阳晨辰杭初之平云蔚飞雅静濮云金乐巧冷春雪宰永宁靖光耀迮昭君爱若雁卓高达乜语梦闭小翠休娟严合全夫怡悦万俟书琴德欣然贺念云苍笑柳粘证蝶长孙半兰姜天和鄞孤萍简晋鹏铁毅远董沛凝司空清韵贡志文来暄和桓凡桃宗梦寒悉丽梳阚弘济叔自霍怀曼汲平卉撒白秋旅依琴仙依心翟乐天宰父幼荷郭国源常浦泽翁语弓红叶委依云梁新雅张筠溪安嘉祯苦子珍闾丘俊美沐幼霜义子骞皇甫谷玉遇儿五又松南宫涵映孔平卉锺昊空计翰飞申屠阔定白凝谏允晨凌田絮沛白员雅柔訾慕凝表元凯巨书萱机景明桐醉蝶艾锐锋关渺仲子萱丹正卿奉浩思任暄闻人曼梅蒿皓月景芮丽富宜庄艳芳务蕙兰法景明扈紫丝玄宛曼鲜于岑巧善和滑安和铎珠轩海同韩飞雪召宇烟昊天桂绮晴容惜灵年芬芬邱芳蔼徭佳惠西门思莹佟白翠姚远骞旷天骄毛青友芝宇坚建元板松月泣乐蕊羊舌新洁圭湘云弘以蕊受霞文回兴贤忻证烟寒辰龙错远悦郏怜雪本羡丽巫俊民虢辰钊陶绮波危兴请从鹏云书湘云师朗权华美侯翠梅謇惠君濮采萱繁素昕公西暮芸令紫南欧阳悦媛皇甫珍丽段干冠宇僧梳全苗边萦心揭翰采辛嘉禾睦碧螺阿静粟凡白梁光熙昂玄静钮小蕊锺离易绿碧向槐抗宏壮戊依白羽小蕾莘宏博单迎南逄高兴古新林战灵槐萨曦悟梓珊孛晓星请宛卓芊芊中宜嘉字蓓蕾喻清芬焦书云劳彤犁英睿光暖聂以蕊钟离芸芸锐凌香真寒梅郁龙皇香天乌雅烨磊郜阳司空翠岚九山菡皮静秀嵇昭懿薛雨泽伍瑞渊单于梦露纪润亓绮玉区经亘甫冷萱藏妙晴练志学宗萄貊伟兆罗绿凝秘康成左丘婉丽邝小星乜乐安谷梁梦桐覃春柏恽耘涛傅贤淑伺光辉谈星驰载易巧理陶宁革涵涵在梓萱伊奇文独寒香合静婉苦安国枚涵阳越含说艳丽阮月悦函安娜郸飞跃赫连俊雅诗婉静善运凯应惜筠环君浩翠白竹矫文昌窃冬梅丹思雅武菡操毅君富润丽姜清婉斛雅容仰琬义弘光詹志行庾方方晁英华班雅韵慕鸿祯干若纳宏峻铎湛英铣雅宁褒浦和乔毅秋东方香洁喜怡和于千山养雅容车珠玉荆证若茹胜撒晨轩富察静雅东郭刚毅解夏寒袁芙受承安禾盼丹孝凡儿鄂冰安蹉秉漆雕香波宇文楚天长星强毅灵须秋芸通宛丝蒯顺慈同若英戎成侍山槐郭雅惠夕怀山封谷尤山雁示俊力阴暄美桥元菱斯鸿信瞿沛雯拓跋采枫翦雪兰庄雅舷都毅安潭秀雅类淑华蛮冰表晓彤似香卉节丽华汪问风燕苑杰法鸿远苟天韵纵高朗罕云溪机梦琪倪思义帛诗翠伦迎夏丁巧云宇文曜晏天真甘高原代绮云圣以晴沉绿兰巢桂华第运鹏贝智辰垄思博空振锐顾月杉玉骊萍陀昭祝灵松威韶翁静枫楚秀颖家婷美辟和煦奚广君毛莞然宗政笑严阎向雪姚雍雅哈尔阳申语蕊尉冰双佴新翰钞问梅厍依柔委和正多堂庚又柔纤绿竹元蔓儿资妙音亓官静芙尚运珹钭证文随宏义白浩阔犹安安邛宏爽施尔槐驹姗姗贺代梅逮浩然栗景彰仙和悦峪雅艳支语丝波绿蕊候国兴章钧接凌青上官雅艳祭依美云严严伟新月贸凡灵酒霈周夏柳笪妙芙叔鸿云以乐家玄春华刀梓柔昔毅梅象寒烟念冷荷端华晖郁泽雨蓟阳兰百里以晴路宜欣闳蕴秀公冶昌勋甄兴德曹采文暨小春严本林曲静锁冷雪硕和洽司徒白秋桑巧春董元忠巴和玉乙远航前含秀竭雄禚醉芙涂艳芳唐夏柳金如曼青年茅翠阳虎微澜范姜雅达卿清怡彤心香闾尔柳京素昕邓丹丹敏天青励星华巧悦爱壤驷流如慎安祯端木凝芙薄齐心蓝念文士灵慧延鸿晖宏韵磬雪丽芳堵馨欣麻智敏北蔼贾乐成嘉玲珑廖曼珠种文敏毕诗珊石慕卉江山蝶仲绮玉旁安荷佟佳金玉让慧婕旷谷兰松悦宜考幼怡卢扬滕佩杉军觅双藤正平侨晴岚刚平良危凝静孙宏阔戚魁将沛凝郑良骏始今敖雅安宿恬畅潜初雪是陶然晋瑶岑睢静竹衷寒梅银琪告景福宣若云化曼冬惠曼婉眭亦褚毅南稽夏瑶呼延姣严张简新知温水丹植永昌红毅彤闵灵波公宏貌向平宁隽代双赛筱贲星文花念念摘景明钟子珍仝谷蕊寿雨琴捷起壬昊昊东门山雁赤沛春储腾骏枝慧月毓觅晴哀宁徐梦之湛苒苒卫慧牛迎南亥忻欢熊英叡过优悠问允建乐圣郎安娜万俟飞翔买秀隽梁丘振宇徭云飞有荷珠速浚伯冰海愚慧君英静竹俞幻玉琦米冀元行访烟凤阳夏泥寄柔敬凝竹王博擅公叔兰英赏婉娜闾丘星火藩初柳佘靖巧庞靖易辉元冬充晓莉老流乌皓轩刘雅辰城韵诗鄞学名才绿旋频代秋树巧夏卯宇臧奇伟弘阳炎畅书文改危杨夜蓉沙念桃厚灵溪令狐双玉修琰淳于毅霜户中闽溶溶赵浦势小蕊鲍香雪佟南琴芮玉成凭浩渺姬桂诸葛如馨澹台正德尹笑容冉才俊尔梓敏辜臻五穰仵夜梅逯冰凡高锦欣盘君丽典懿勤云逸僪莹洁耿鹤骞况华池杞哲圣赖欣畅利博学张晶滢程冬灵池志泽汤绮南刑白安竹听安丙盼旋门怿逢迎梅信悠素鲜雁露杜项明展元旋麦水荷吴元彤塔高貌掌沛白万幼旋实丽文长孙其雨板涵韵亢飇丑利谢瀚海鄢毅成林楠普芳茵剧心宜声伟唁溥洁玉析宵雨吾高旻华之桃梅岑招寅骏靖衍易向卉司寇悦项莺莺务赞莱梓琬腾向阳贰姿夷旭炎鲜于齐濯蕴涵常寄春蒙淳美岳梦寒蒲志用蒿春翠迮秀穆听所舞苍初阳用清润管赫别小凝力晖扈义桂半梅赧蕴和烟天骄后雅蕊春芮佳伏和悌文南栾映雪仁凌春清青柏疏清俊麴傲薇帖慕山融玉泉祈思语旗令羽冷文滨茂泰华桐逸秀盛朔谯烨烨厉和平巩阳禽飞柏连胤文许觅丹夔芳洲保梅风位红雪泣凡桃召惜珊宋晨辰裴傲云谏伟祺祢英卫祁飞捷脱佳文奇青香尾白山暴晤市翰飞缑浩广容证雪休承教登松南门博雅求思菱段唁杉妫听筠宦彤霞方思烟卞掣楼慕蕊邱明旭么依白国宛秋赫恩霈淦子楠阙秀越那拉清华乐正寻梅粘光启聊依琴艾意智允欣美饶心箕清馨庹含桃奉宏恺律翰初田田陈雁风检子石微生致远叶又绿零羽霜古兰贯证文绪锦诗翟平凡季永思羿慈心凌曼彤印歌阑寇钰洪慕凝阳紫文年易梦南馨香守弘新崔隽洁鞠全巫马诗柳张廖皓月费乐邦次萍韵答梦秋达娟闻人嘉佑香毅秋棺幻玉谷忻慕匡茜双琴雪邶雪儿己茗弓昊磊苗书雁智听南呼阳飇敛恨桃焉谷槐蔺静云戏惜珊綦绮美系博文漫雅韶第五沛凝剑冰枫望语雪佼夏雪隐访波依清漪乌孙怀魏永丰肖展景古香斐壤巨煜游烨然丘迎彤党璞称宕舒问凝殷凡灵虞玲折蒙黎斯乔秦季雅完晓习绮兰功向秋朱鹤源娜娜束端敏马鹏举相华灿澄柔丽屠秀媛不丁进吟柔阳朔宰父可可舜雪曼邗尔阳司天工洛智宇碧鲁昕昕盍景龙堂子民步宣朗冠家骏占刚捷莫尔蓉章佳桃雨席琪睿羊睿好隋千叶汝莹华浑雅逸曾化籍馨兰闭问萍甲英朗柳奇水镜晨萱母谧辰友莺语李振博韶丹蝶祖雪卉史白云谬之岑舒昌紫萱笃元容蓬恨真羊舌暄莹浦竹雨荀胤水兴邦竺绮琴由志诚盖白飞惜寒俎天玉康欢欣来元武狂冬灵大新文桓芸若扶纳禹亦竹夹谷野雪任羲鱼毅雪朋蕴美台甘潘雅丹遇宏放太史晴波朴飞掣钊俊智仇晓凡符蔚然吕谨度卿云卜依凝益绿柏闫玉书星笑南韩冰洁圭采萱商芳蕤龙雅丽宓鸿运海静枫柯正文宁游彭书白漆代桃布建白檄维诸欣愉糜朋兴苑丽君历材于韶华檀茵却秋寒禄温文明洛灵拜寒凝完颜沙羽言怡畅房作幸建木介鸿振礼鸿朗希采梦汗恬时芳荃曲尔蝶卑荡蔡清逸鲁雅彤邢俊茂肇晓闻一嘉雀溥心宰健和忻然窦依薇兆芳茵靳兴贤愈冬萱卷念巧翁雅宁迟雅逸针卿月颛孙曜坤局春岚仍飞飙闪品诺清绮泉皓廉才英摇新美乐幼珊咎玉树勾坚白霍驰海包水冬之松崇清涵坚茹云豆觅珍骆巍然戈谷芹居秀兰郗盼晴汲半蕾良以宫暄文戴司辰弥可佳陆绿夏郦启绍畴璩冷松夏侯高岑承坚诚世坚秉绳妙芙蹇正思司马元良悉媛汉之卉欧唁君絮从筠柏绮彤官清淑沃凝心塞鹤梦酆书兰邴琨瑜栋飞双秋英华南宫心菱蒋之槐蒉清卓嬴昊天衡惜筠贵良奥其雪羽风方雅永怜烟线虹星缪格格邵念巧宾气生涵柳磨嘉良抄青梦殳晏然首梅花定怡然续聪慧山骊茹侍灵波纵善静镇尔风锺修洁阚代灵米伶伶安人公良畅畅公羊秀越千琳冒书兰丛半兰芒沛柔仪凝芙计芳林苏正平贡央田鸿博集博无雨歧涵忍仉危井鸿煊关歌阑爱晶辉何舒畅钱永新宜茂才索月渠依萱怀文止高驰盈澍雷霞梳墨学林森思云胡梦蕊刁驰颖愧飞翰百曼衍琴建柏葛晶辉骑云岚寻飞羽野蒙雨顿清淑铁玉韵督蝶梦颜弘济德恨之运天睿开仙仪姓芮帅子真滑毅南留高明范君昊信银柳仆元枫六昂杰龚颖馨出君雅乾逸丽经秋双弭莉莉戢玮琪勇一南图门静槐平若骞旅慕雁偶珠佩果冰之郯依珊夏自珍裘慧语宛飞薇能辰危苌甜恬简菀西门向晨衣和硕佛雪松童良翰长静柏尉迟友易归超子车朝雨邰夏兰恭代蓝回雁菱娄听云牵晗摩婵娟及鹏鲸齐语柔道毅然原卓逸鹿言文广吹屈歆然紫端邬平灵素霞月雍小珍穰怜晴兴素欣员仪文"
  local 字数 = string.len(字库)/2
  local 昵称 = ""
  for i=1,num do
    local 随机文字 = math.random(2,字数)*2
    昵称=昵称..string.sub(字库,随机文字-1,随机文字)
  end
  return 昵称
end

function 简单_决战大雁塔:雁塔系统怪物()
	--  local 怪物造型 = {"精灵女皇","镇妖塔守卫","武神坛使者","女帝","金龙使者","孔雀女皇","暗黑剑圣","斩妖","灵蝶仙子","风琴神女","之祠","龙鲤仙子","刀圣","琵琶神女","天界守卫","瑶池仙女","赤焰战神","宝塔天王","西域女王","冰轮丸","八卦阵灵"}
   	 local 地图范围={10041,10051,10061,10071,10081,10901}
  	 for n = 1,#地图范围 do
		    for i=1,1 do
		      local xy=地图处理类.地图坐标[地图范围[n]]:取随机点()
		      local 任务id="_"..i.."_"..取随机数(1,99).."10041"..os.time().."_"..随机序列.."_"..取随机数(99,99)
		      随机序列=随机序列+1
		      模型= Qu随机角色[取随机数(1,#Qu随机角色)]
		      mp =Qu角色属性[模型].门派[取随机数(1,#Qu角色属性[模型].门派)]
		      任务数据[任务id]={
		        id=任务id,
		        起始=os.time(),
		        结束=1500,
		        玩家id=id,
		        队伍组={},
		        名称=取随机中文姓名(取随机数(2,5)),
		        称谓=n.."层守护者",
		        模型="巨灵神",
		        --模型=怪物造型[取随机数(1,#怪物造型)],
		        行走开关=true,
		        x=xy.x,
		        y=xy.y,
		        武器=取角色等级武器(模型,150),
		        武器等级=150,
		        等级=150,
		        --炫彩=取染色id(模型),
		        --炫彩组=取炫彩染色(随机颜色[取随机数(1,#随机颜色)]),
		        地图编号=地图范围[n],
		        战斗显示=true,
		        地图名称=取地图名称(地图范围[n]),
		        销毁=true,
		        类型=1349+n,
		      }
		      地图处理类:添加单位(任务id)
		    end
	end
 end

function 简单_决战大雁塔:怪物对话内容(id,类型,标识,地图)
   	 local 对话数据={}
	对话数据.模型=任务数据[标识].模型
	对话数据.名称=任务数据[标识].名称
	if 任务数据[标识].zhandou~=nil then
		对话数据.对话="我正在战斗中，请勿打扰。"
		return 对话数据
	end
	if 类型==1350 then--
	对话数据.对话="何方神圣，竟敢擅创大雁塔！此地律法深严，岂是尔等可随意进来的"
	对话数据.选项={"我想继续往上走","哎呀，肚子疼，先上个茅房"}
	elseif 类型==1351 then--
	对话数据.对话="何方神圣，竟敢擅创大雁塔！此地律法深严，岂是尔等可随意进来的"
	对话数据.选项={"我想继续往上走","哎呀，肚子疼，先上个茅房"}
	elseif 类型==1352 then--
	对话数据.对话="何方神圣，竟敢擅创大雁塔！此地律法深严，岂是尔等可随意进来的"
	对话数据.选项={"我想继续往上走","哎呀，肚子疼，先上个茅房"}
	elseif 类型==1353 then--
	对话数据.对话="何方神圣，竟敢擅创大雁塔！此地律法深严，岂是尔等可随意进来的"
	对话数据.选项={"我想继续往上走","哎呀，肚子疼，先上个茅房"}
	elseif 类型==1354 then--
	对话数据.对话="何方神圣，竟敢擅创大雁塔！此地律法深严，岂是尔等可随意进来的"
	对话数据.选项={"我想继续往上走","哎呀，肚子疼，先上个茅房"}
	elseif 类型==1355 then--
	对话数据.对话="何方神圣，竟敢擅创大雁塔！此地律法深严，岂是尔等可随意进来的"
	对话数据.选项={"我想继续往上走","哎呀，肚子疼，先上个茅房"}
	end
	return 对话数据
end
function 简单_决战大雁塔:对话事件处理(id,名称,事件,类型)
	if 玩家数据[id].队伍==0  then return 	常规提示(id,"#Y/非5人队伍，无法进行挑战") end
	if  取队伍人数(id)~=5   then return 	常规提示(id,"#Y/非5人队伍，无法进行挑战") end
	if 事件=="我想继续往上走" then
		self:大雁塔挑战(id,1+((类型-1350)*0.5))
	end
end


function 简单_决战大雁塔:大雁塔挑战(id,难度系数)
	 local 队伍id=玩家数据[id].队伍

	 local 雁塔假人属性 = {}
    		 for n=1,#队伍数据[队伍id].成员数据 do
		              local 队员id=队伍数据[队伍id].成员数据[n]
		              if 玩家数据[队员id]~=nil then
		                local 武器伤害 = 0
		                if 玩家数据[队员id].角色.装备[3]~=nil and 玩家数据[队员id].道具.数据[玩家数据[队员id].角色.装备[3]] then
		                  local 临时武器=table.loadstring(table.tostring(玩家数据[队员id].道具.数据[玩家数据[队员id].角色.装备[3]]))
		                  if not 临时武器.命中 then 临时武器.命中=1 end
		                  武器伤害=qz(临时武器.伤害+临时武器.命中*0.3)
		                end
		                雁塔假人属性[#雁塔假人属性+1]={
		                  名称=取随机中文姓名(取随机数(2,5)),
		                  模型=玩家数据[队员id].角色.模型,
		                  等级=玩家数据[队员id].角色.等级,
		                  气血=12000*难度系数,
		                  魔法=2000*难度系数,
		                  伤害=3600*难度系数,
		                  法伤=2000*难度系数,
		                  速度=1200*难度系数,
		                  防御=2000*难度系数,
		                  法防=2000*难度系数,
		                  治疗能力=800*难度系数,
		                  固定伤害=800*难度系数,
		                  攻击修炼=玩家数据[队员id].角色.修炼.攻击修炼[1],
		                  法术修炼=玩家数据[队员id].角色.修炼.法术修炼[1],
		                  防御修炼=玩家数据[队员id].角色.修炼.防御修炼[1],
		                  抗法修炼=玩家数据[队员id].角色.修炼.抗法修炼[1],
		                  角色=true,
		                  门派=玩家数据[队员id].角色.门派,
		                  五维属性={体质=玩家数据[队员id].角色.体质,魔力=玩家数据[队员id].角色.魔力,力量=玩家数据[队员id].角色.力量,耐力=玩家数据[队员id].角色.耐力,敏捷=玩家数据[队员id].角色.敏捷},
		                  武器伤害=武器伤害,
		                  位置=n,
		                }


		             if not 判断是否为空表(玩家数据[队员id].角色.参战宝宝) then
		                  雁塔假人属性[#雁塔假人属性+1]={
		                    名称=玩家数据[队员id].角色.参战宝宝.模型,
		                    模型=玩家数据[队员id].角色.参战宝宝.模型,
		                    等级=玩家数据[队员id].角色.参战宝宝.等级,
		                             气血=12000*难度系数,
			                  魔法=2000*难度系数,
			                  伤害=3600*难度系数,
			                  法伤=2000*难度系数,
			                  速度=1200*难度系数,
			                  防御=2000*难度系数,
			                  法防=2000*难度系数,
		                    攻击修炼=玩家数据[队员id].角色.bb修炼.攻击控制力[1],
		                    法术修炼=玩家数据[队员id].角色.bb修炼.法术控制力[1],
		                    防御修炼=玩家数据[队员id].角色.bb修炼.防御控制力[1],
		                    抗法修炼=玩家数据[队员id].角色.bb修炼.抗法控制力[1],
		                    技能=玩家数据[队员id].角色.参战宝宝.技能,
		                    参战等级=玩家数据[队员id].角色.参战宝宝.参战等级,
		                    五维属性={体质=玩家数据[队员id].角色.参战宝宝.体质,魔力=玩家数据[队员id].角色.参战宝宝.魔力,力量=玩家数据[队员id].角色.参战宝宝.力量,耐力=玩家数据[队员id].角色.参战宝宝.耐力,敏捷=玩家数据[队员id].角色.参战宝宝.敏捷},
		                    位置=n+5
		                  }
		             end

	         	       		for k,v in pairs(玩家数据[id].召唤兽.数据) do
	         	       			if v.参战名称==玩家数据[队员id].角色.名称 and v.参战id==队员id then
				                  雁塔假人属性[#雁塔假人属性+1]={
				                    名称=v.模型,
				                    模型=v.模型,
				                    等级=v.等级,
				                   气血=12000*难度系数,
				                  魔法=2000*难度系数,
				                  伤害=3600*难度系数,
				                  法伤=2000*难度系数,
				                  速度=1200*难度系数,
				                  防御=2000*难度系数,
				                  法防=2000*难度系数,
				                    攻击修炼=玩家数据[队员id].角色.bb修炼.攻击控制力[1],
				                    法术修炼=玩家数据[队员id].角色.bb修炼.法术控制力[1],
				                    防御修炼=玩家数据[队员id].角色.bb修炼.防御控制力[1],
				                    抗法修炼=玩家数据[队员id].角色.bb修炼.抗法控制力[1],
				                    技能=v.技能,
				                    参战等级=v.参战等级,
				                    五维属性={体质=v.体质,魔力=v.魔力,力量=v.力量,耐力=v.耐力,敏捷=v.敏捷},
				                    位置=n+5
				                  }
				              end
				end

		end
	end
	战斗准备类:创建战斗(id,154000,0,nil,雁塔假人属性)
end
function 简单_决战大雁塔:给予三人地图奖励()
	广播消息({内容="#G【决战大雁塔】#R本轮奖励已经发放，奖励将于每5分钟发放一次！！",频道="xt"})
	for n, v in pairs(地图处理类.地图玩家[10041]) do
		if  玩家数据[n]~=nil  then
			if 决战大雁塔三人 and 玩家数据[n].队伍~=0 and   取队伍人数(n)==5 and 玩家数据[n].队长 then
				玩家数据[n].角色:添加经验(5000000,"决战大雁塔",1)
				玩家数据[n].角色:添加储备(1000000,"决战大雁塔",1)

				玩家数据[n].角色:添加仙玉(10,"决战大雁塔",1)
				--添加仙玉(n,玩家数据[id].账号,10, "大雁塔一层奖励")
				--玩家数据[n].角色:添加特殊积分(1,"决战大雁塔",1)
			else
				 if 玩家数据[n].队伍~=0  and 玩家数据[n].队长  and   取队伍人数(n)~=5 then
		                                      地图处理类:跳转地图(玩家数据[n].队伍, 1001, 420, 77)
					常规提示(n,"#Y/非5人队伍，已移出地图")
				elseif 玩家数据[n].队伍==0  then
		                                      地图处理类:跳转地图(n, 1001, 420, 77)
					常规提示(n,"#Y/非5人队伍，已移出地图")
				end
			end
		end
	end
	if 地图处理类:取地图人数(10051) <= 35 then
		for n, v in pairs(地图处理类.地图玩家[10051]) do
			if  玩家数据[n]~=nil  then
				if 决战大雁塔三人 and 玩家数据[n].队伍~=0 and   取队伍人数(n)==5 and 玩家数据[n].队长 then
					local 经验= math.floor(200000000/地图处理类:取地图人数(10051))
					local 银子= math.floor(50000000/地图处理类:取地图人数(10051))
					local 仙玉= math.floor(500/地图处理类:取地图人数(10051))
					local 积分= math.floor(50/地图处理类:取地图人数(10051))
					玩家数据[n].角色:添加经验(经验,"决战大雁塔",1)
					玩家数据[n].角色:添加银子(银子,"决战大雁塔",1)
					玩家数据[n].角色:添加仙玉(仙玉,"决战大雁塔",1)
					--添加仙玉(n,玩家数据[id].账号,仙玉, "大雁塔一层奖励")
					 --玩家数据[n].角色:添加仙玉(仙玉,"决战大雁塔",1)
					--玩家数据[n].角色:添加特殊积分(积分,"决战大雁塔",1)
				else
	                                       if 玩家数据[n].队伍~=0  and 玩家数据[n].队长  and   取队伍人数(n)~=5 then
		                                      地图处理类:跳转地图(玩家数据[n].队伍, 1001, 420, 77)
					常规提示(n,"#Y/非5人队伍，已移出地图")
				elseif 玩家数据[n].队伍==0  then
		                                      地图处理类:跳转地图(n, 1001, 420, 77)
					常规提示(n,"#Y/非5人队伍，已移出地图")
				end
				end
			end
		end
	else
	广播消息({内容="#G【决战大雁塔二层】#R因本轮二层人数超过30人，二层奖励无法进行发放！！",频道="xt"})
	end
	if 地图处理类:取地图人数(10061) <= 30 then
		for n, v in pairs(地图处理类.地图玩家[10061]) do
			if  玩家数据[n]~=nil  then
				if 决战大雁塔三人 and 玩家数据[n].队伍~=0 and   取队伍人数(n)==5 and 玩家数据[n].队长 then
					local 经验= math.floor(200000000/地图处理类:取地图人数(10061))
					local 银子= math.floor(50000000/地图处理类:取地图人数(10061))
					local 仙玉= math.floor(800/地图处理类:取地图人数(10061))
					local 积分= math.floor(60/地图处理类:取地图人数(10061))
					玩家数据[n].角色:添加经验(经验,"决战大雁塔",1)
					玩家数据[n].角色:添加银子(银子,"决战大雁塔",1)
					玩家数据[n].角色:添加仙玉(仙玉,"决战大雁塔",1)
					--添加仙玉(n,玩家数据[id].账号,仙玉, "大雁塔一层奖励")
					 --玩家数据[n].角色:添加仙玉(仙玉,"决战大雁塔",1)
					--玩家数据[n].角色:添加特殊积分(积分,"决战大雁塔",1)
				else
		                                    if 玩家数据[n].队伍~=0 and 玩家数据[n].队长   and   取队伍人数(n)~=5 then
		                                      地图处理类:跳转地图(玩家数据[n].队伍, 1001, 420, 77)
					常规提示(n,"#Y/非5人队伍，已移出地图")
				elseif 玩家数据[n].队伍==0  then
			                                      地图处理类:跳转地图(n, 1001, 420, 77)
						常规提示(n,"#Y/非5人队伍，已移出地图")
					end
				end
			end
		end
	else
	广播消息({内容="#G【决战大雁塔三层】#R因本轮三层人数超过30人，本层奖励无法进行发放！！",频道="xt"})
	end
	if 地图处理类:取地图人数(10071) <=25 then
		for n, v in pairs(地图处理类.地图玩家[10071]) do
			if  玩家数据[n]~=nil  then
				if 决战大雁塔三人 and 玩家数据[n].队伍~=0 and   取队伍人数(n)==5 and 玩家数据[n].队长 then
					local 经验= math.floor(200000000/地图处理类:取地图人数(10071))
					local 银子= math.floor(80000000/地图处理类:取地图人数(10071))
					local 仙玉= math.floor(1000/地图处理类:取地图人数(10071))
					local 积分= math.floor(60/地图处理类:取地图人数(10071))
					玩家数据[n].角色:添加经验(经验,"决战大雁塔",1)
					玩家数据[n].角色:添加银子(银子,"决战大雁塔",1)
					玩家数据[n].角色:添加仙玉(仙玉,"决战大雁塔",1)
					--添加仙玉(n,玩家数据[id].账号,仙玉, "大雁塔一层奖励")
					-- 玩家数据[n].角色:添加仙玉(仙玉*2,"决战大雁塔",1)
					--玩家数据[n].角色:添加特殊积分(积分,"决战大雁塔",1)
				else
	                                       if 玩家数据[n].队伍~=0   and 玩家数据[n].队长 and   取队伍人数(n)~=5 then
		                                      地图处理类:跳转地图(玩家数据[n].队伍, 1001, 420, 77)
					常规提示(n,"#Y/非5人队伍，已移出地图")
				elseif 玩家数据[n].队伍==0  then
		                                      地图处理类:跳转地图(n, 1001, 420, 77)
					常规提示(n,"#Y/非5人队伍，已移出地图")
				end
				end
			end
		end
	else
	广播消息({内容="#G【决战大雁塔四层】#R因本轮四层人数超过25人，本层奖励无法进行发放！！",频道="xt"})
	end
	if 地图处理类:取地图人数(10081) <= 20 then
		for n, v in pairs(地图处理类.地图玩家[10081]) do
			if  玩家数据[n]~=nil  then
				if 决战大雁塔三人 and 玩家数据[n].队伍~=0 and   取队伍人数(n)==5 and 玩家数据[n].队长 then
					local 经验= math.floor(300000000/地图处理类:取地图人数(10081))
					local 银子= math.floor(100000000/地图处理类:取地图人数(10081))
					local 仙玉= math.floor(1500/地图处理类:取地图人数(10081))
					local 积分= math.floor(60/地图处理类:取地图人数(10081))
					玩家数据[n].角色:添加经验(经验,"决战大雁塔",1)
					玩家数据[n].角色:添加银子(银子,"决战大雁塔",1)
					玩家数据[n].角色:添加仙玉(仙玉,"决战大雁塔",1)
					--添加仙玉(n,玩家数据[id].账号,仙玉, "大雁塔一层奖励")
					-- 玩家数据[n].角色:添加仙玉(仙玉*2,"决战大雁塔",1)
					--玩家数据[n].角色:添加特殊积分(积分,"决战大雁塔",1)
				else
	                                       if 玩家数据[n].队伍~=0  and 玩家数据[n].队长  and   取队伍人数(n)~=5 then
		                                      地图处理类:跳转地图(玩家数据[n].队伍, 1001, 420, 77)
					常规提示(n,"#Y/非5人队伍，已移出地图")
				elseif 玩家数据[n].队伍==0  then
		                                      地图处理类:跳转地图(n, 1001, 420, 77)
					常规提示(n,"#Y/非5人队伍，已移出地图")
				end
				end
			end
		end
	else
	广播消息({内容="#G【决战大雁塔五层】#R因本轮五层人数超过20人，本层奖励无法进行发放！！",频道="xt"})
	end
	if 地图处理类:取地图人数(10901) <= 15 then
		for n, v in pairs(地图处理类.地图玩家[10901]) do
			if  玩家数据[n]~=nil  then
				if 决战大雁塔三人 and 玩家数据[n].队伍~=0 and   取队伍人数(n)==5 and 玩家数据[n].队长 then
					local 经验= math.floor(400000000/地图处理类:取地图人数(10901))
					local 银子= math.floor(150000000/地图处理类:取地图人数(10901))
					local 仙玉= math.floor(1500/地图处理类:取地图人数(10901))
					local 积分= math.floor(60/地图处理类:取地图人数(10901))
					玩家数据[n].角色:添加经验(经验,"决战大雁塔",1)
					玩家数据[n].角色:添加银子(银子,"决战大雁塔",1)
					玩家数据[n].角色:添加仙玉(仙玉,"决战大雁塔",1)
					--添加仙玉(n,玩家数据[id].账号,仙玉, "大雁塔一层奖励")
					-- 玩家数据[n].角色:添加仙玉(仙玉*2,"决战大雁塔",1)
					--玩家数据[n].角色:添加特殊积分(积分,"决战大雁塔",1)
				else
	                                       if 玩家数据[n].队伍~=0   and 玩家数据[n].队长 and   取队伍人数(n)~=5 then
		                                      地图处理类:跳转地图(玩家数据[n].队伍, 1001, 420, 77)
					常规提示(n,"#Y/非5人队伍，已移出地图")
				elseif 玩家数据[n].队伍==0  then
		                                      地图处理类:跳转地图(n, 1001, 420, 77)
					常规提示(n,"#Y/非5人队伍，已移出地图")
				end
				end
			end
		end
	else
	广播消息({内容="#G【决战大雁塔六层】#R因本轮六层人数超过15人，本层奖励无法进行发放！！",频道="xt"})
	end
	if 地图处理类:取地图人数(10091) <= 10 then
		for n, v in pairs(地图处理类.地图玩家[10091]) do
			if  玩家数据[n]~=nil  then
				if 决战大雁塔三人 and 玩家数据[n].队伍~=0 and   取队伍人数(n)==5 and 玩家数据[n].队长 then
					local 经验= math.floor(500000000/地图处理类:取地图人数(10091))
					local 银子= math.floor(200000000/地图处理类:取地图人数(10091))
					local 仙玉= math.floor(2000/地图处理类:取地图人数(10091))
					local 积分= math.floor(80/地图处理类:取地图人数(10091))
					玩家数据[n].角色:添加经验(经验,"决战大雁塔",1)
					玩家数据[n].角色:添加银子(银子,"决战大雁塔",1)
					玩家数据[n].角色:添加仙玉(仙玉,"决战大雁塔",1)
					--添加仙玉(n,玩家数据[id].账号,仙玉, "大雁塔一层奖励")
					-- 玩家数据[n].角色:添加仙玉(仙玉*2,"决战大雁塔",1)
					--玩家数据[n].角色:添加特殊积分(积分,"决战大雁塔",1)
				else
		                                       if 玩家数据[n].队伍~=0  and 玩家数据[n].队长  and   取队伍人数(n)~=5 then
			                                      地图处理类:跳转地图(玩家数据[n].队伍, 1001, 420, 77)
						常规提示(n,"#Y/非5人队伍，已移出地图")
					elseif 玩家数据[n].队伍==0  then
			                                      地图处理类:跳转地图(n, 1001, 420, 77)
						常规提示(n,"#Y/非5人队伍，已移出地图")
					end
				end
			end
		end
	else
	广播消息({内容="#G【决战大雁塔七层】#R因本轮七层人数超过10人，本层奖励无法进行发放！！",频道="xt"})
	end
end
return 简单_决战大雁塔