-- @Author: baidwwy
-- @Date:   2023-10-25 19:03:14
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2026-06-08 17:27:28
local 自写活动 = class()

function 自写活动:初始化()
  self.活动时间=QJHDSJ["定时刷怪"]
end
function 自写活动:活动定时器()
  for k,v in pairs(self.活动时间) do
    if v.时==0 then
      if v.分==服务端参数.分钟+0 and v.秒==服务端参数.秒+0 then --默认每小时开放
        self[k]()
      end
    else
      if v.时==服务端参数.小时+0 and v.分==服务端参数.分钟+0 and v.秒==服务端参数.秒+0 then --特定的小时开放
        self[k]()
      end
    end
  end
end

function 自写活动:怪物对话内容(id,类型,标识,地图)
    local 对话数据={}
    对话数据.模型=任务数据[标识].模型
    对话数据.名称=任务数据[标识].名称
    if 任务数据[标识].zhandou~=nil then
        对话数据.对话="我正在战斗中，请勿打扰。"
        return 对话数据
    end
    if 类型==1176 then--下凡的灵猴
     if 任务数据[标识].名称=="下凡的灵猴"  then
            对话数据.对话="这里可是好地方哇,以后我就长居凡界了。#24"
            对话数据.选项={"我来瞧瞧你的啥","哎呀，肚子疼，先上个茅房"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
      if 判断限制次数(id,"下凡的灵猴") then----限制刷怪
    对话数据.对话="玩家"..判断限制次数(id,"下凡的灵猴").."今日已经超过次数了"
    对话数据.选项=nil
   end
    elseif 类型==1177 then--三界财神爷
     if 任务数据[标识].名称=="三界财神爷"  then
            对话数据.对话="我躲吖躲...咿...少侠是怎么找到我的？"
            对话数据.选项={"宝物给我拿过来","哎呀，肚子疼，先上个茅房"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
       if 判断限制次数(id,"三界财神爷") then----限制刷怪
    对话数据.对话="玩家"..判断限制次数(id,"三界财神爷").."今日已经超过次数了"
    对话数据.选项=nil
   end
    elseif 类型==1178 then--十二生肖
     if 任务数据[标识].名称=="十二生肖"  then
            对话数据.对话="龙行飘忽，所谓神龙见首不见尾，龙脉之地也是神秘万分，少侠可愿前取寻找龙脉所在？"
            对话数据.选项={"1★","2★","3★","4★","5★"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
       if 判断限制次数(id,"十二生肖") then----限制刷怪
    对话数据.对话="玩家"..判断限制次数(id,"十二生肖").."今日已经超过次数了"
    对话数据.选项=nil
   end
    elseif 类型==1179 then--50级世界BOSS
     if 任务数据[标识].名称=="远古妖魔头目"  then
            对话数据.对话="龙行飘忽，所谓神龙见首不见尾，龙脉之地也是神秘万分，少侠可愿前取寻找龙脉所在？"
            对话数据.选项={"让我来收服你","哎呀，肚子疼，先上个茅房"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
       if 判断限制次数(id,"远古妖魔头目") then----限制刷怪
    对话数据.对话="玩家"..判断限制次数(id,"远古妖魔头目").."今日已经超过次数了"
    对话数据.选项=nil
   end
    elseif 类型==1180 then--100级世界BOSS
     if 任务数据[标识].名称=="远古妖魔领主"  then
            对话数据.对话="龙行飘忽，所谓神龙见首不见尾，龙脉之地也是神秘万分，少侠可愿前取寻找龙脉所在？"
            对话数据.选项={"让我来收服你","哎呀，肚子疼，先上个茅房"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
       if 判断限制次数(id,"远古妖魔领主") then----限制刷怪
    对话数据.对话="玩家"..判断限制次数(id,"远古妖魔领主").."今日已经超过次数了"
    对话数据.选项=nil
   end
    elseif 类型==1181 then--150级世界BOSS
     if 任务数据[标识].名称=="远古妖魔尊主"  then
            对话数据.对话="龙行飘忽，所谓神龙见首不见尾，龙脉之地也是神秘万分，少侠可愿前取寻找龙脉所在？"
            对话数据.选项={"让我来收服你","哎呀，肚子疼，先上个茅房"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
        if 判断限制次数(id,"远古妖魔尊主") then----限制刷怪
    对话数据.对话="玩家"..判断限制次数(id,"远古妖魔尊主").."今日已经超过次数了"
    对话数据.选项=nil
   end
     elseif 类型==1182 then--150级世界BOSS
     if 任务数据[标识].名称=="远古妖魔尊主"  then
            对话数据.对话="龙行飘忽，所谓神龙见首不见尾，龙脉之地也是神秘万分，少侠可愿前取寻找龙脉所在？"
            对话数据.选项={"让我来收服你","哎呀，肚子疼，先上个茅房"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end

     elseif 类型==1183 then--150级世界BOSS
     if 任务数据[标识].名称=="远古妖魔尊主"  then
            对话数据.对话="龙行飘忽，所谓神龙见首不见尾，龙脉之地也是神秘万分，少侠可愿前取寻找龙脉所在？"
            对话数据.选项={"让我来收服你","哎呀，肚子疼，先上个茅房"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
     elseif 类型==1184 then--夏日炎炎
     if 任务数据[标识].名称=="夏日炎炎"  then
            对话数据.对话="这里可是好地方哇,以后我就长居凡界了。#24"
            对话数据.选项={"让我来收服你","哎呀，肚子疼，先上个茅房"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
        if 判断限制次数(id,"夏日炎炎") then----限制刷怪
    对话数据.对话="玩家"..判断限制次数(id,"夏日炎炎").."今日已经超过次数了"
    对话数据.选项=nil
   end
     elseif 类型==1185 then--魂殿使者
     if 任务数据[标识].名称=="魂殿使者"  then
            对话数据.对话="这里可是好地方哇,以后我就长居凡界了。#24"
            对话数据.选项={"让我来收服你","哎呀，肚子疼，先上个茅房"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
       if 判断限制次数(id,"魂殿使者") then----限制刷怪
      对话数据.对话="玩家"..判断限制次数(id,"魂殿使者").."今日已经超过次数了"
      对话数据.选项=nil
     end
     elseif 类型==1186 then--魂殿殿主
     if 任务数据[标识].名称=="魂殿殿主"  then
            对话数据.对话="这里可是好地方哇,以后我就长居凡界了。#24"
            对话数据.选项={"让我来收服你","哎呀，肚子疼，先上个茅房"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
      if 判断限制次数(id,"魂殿殿主") then----限制刷怪
    对话数据.对话="玩家"..判断限制次数(id,"魂殿殿主").."今日已经超过次数了"
    对话数据.选项=nil
   end
     elseif 类型==1187 then--知了先锋
     if 任务数据[标识].名称=="知了先锋"  then
            对话数据.对话="这里可是好地方哇,以后我就长居凡界了。#24"
            对话数据.选项={"让我来收服你","哎呀，肚子疼，先上个茅房"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
      if 判断限制次数(id,"知了先锋") then----限制刷怪
    对话数据.对话="玩家"..判断限制次数(id,"知了先锋").."今日已经超过次数了"
    对话数据.选项=nil
   end
     elseif 类型==1188 then--知了小王
     if 任务数据[标识].名称=="知了小王"  then
            对话数据.对话="这里可是好地方哇,以后我就长居凡界了。#24"
            对话数据.选项={"让我来收服你","哎呀，肚子疼，先上个茅房"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
      if 判断限制次数(id,"知了小王") then----限制刷怪
    对话数据.对话="玩家"..判断限制次数(id,"知了小王").."今日已经超过次数了"
    对话数据.选项=nil
   end
     elseif 类型==1189 then--知了大王
     if 任务数据[标识].名称=="知了大王"  then
            对话数据.对话="这里可是好地方哇,以后我就长居凡界了。#24"
            对话数据.选项={"让我来收服你","哎呀，肚子疼，先上个茅房"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
      if 判断限制次数(id,"知了大王") then----限制刷怪
    对话数据.对话="玩家"..判断限制次数(id,"知了大王").."今日已经超过次数了"
    对话数据.选项=nil
   end
     elseif 类型==1190 then--知了统领
     if 任务数据[标识].名称=="知了统领"  then
            对话数据.对话="这里可是好地方哇,以后我就长居凡界了。#24"
            对话数据.选项={"让我来收服你","哎呀，肚子疼，先上个茅房"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
      if 判断限制次数(id,"知了统领") then----限制刷怪
    对话数据.对话="玩家"..判断限制次数(id,"知了统领").."今日已经超过次数了"
    对话数据.选项=nil
   end
     elseif 类型==1191 then--千年知了王
     if 任务数据[标识].名称=="千年知了王"  then
            对话数据.对话="这里可是好地方哇,以后我就长居凡界了。#24"
            对话数据.选项={"让我来收服你","哎呀，肚子疼，先上个茅房"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
      if 判断限制次数(id,"千年知了王") then----限制刷怪
    对话数据.对话="玩家"..判断限制次数(id,"千年知了王").."今日已经超过次数了"
    对话数据.选项=nil
   end
     elseif 类型==1192 then--决战大雁塔一层
     if 任务数据[标识].名称=="一层守护神"  then
            对话数据.对话="这里可是好地方哇,以后我就长居凡界了。#24"
            对话数据.选项={"让我来收服你","哎呀，肚子疼，先上个茅房"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
     elseif 类型==1193 then--决战大雁塔二层
     if 任务数据[标识].名称=="二层守护神"  then
            对话数据.对话="这里可是好地方哇,以后我就长居凡界了。#24"
            对话数据.选项={"让我来收服你","哎呀，肚子疼，先上个茅房"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
     elseif 类型==1194 then--决战大雁塔三层
     if 任务数据[标识].名称=="三层守护神"  then
            对话数据.对话="这里可是好地方哇,以后我就长居凡界了。#24"
            对话数据.选项={"让我来收服你","哎呀，肚子疼，先上个茅房"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
     elseif 类型==1195 then--决战大雁塔四层
     if 任务数据[标识].名称=="四层守护神"  then
            对话数据.对话="这里可是好地方哇,以后我就长居凡界了。#24"
            对话数据.选项={"让我来收服你","哎呀，肚子疼，先上个茅房"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
     elseif 类型==1196 then--决战大雁塔五层
     if 任务数据[标识].名称=="五层守护神"  then
            对话数据.对话="这里可是好地方哇,以后我就长居凡界了。#24"
            对话数据.选项={"让我来收服你","哎呀，肚子疼，先上个茅房"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
     elseif 类型==1197 then--决战大雁塔六层
     if 任务数据[标识].名称=="六层守护神"  then
            对话数据.对话="这里可是好地方哇,以后我就长居凡界了。#24"
            对话数据.选项={"让我来收服你","哎呀，肚子疼，先上个茅房"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
     elseif 类型==1198 then--决战大雁塔七层
     if 任务数据[标识].名称=="七层守护神"  then
            对话数据.对话="这里可是好地方哇,以后我就长居凡界了。#24"
            对话数据.选项={"让我来收服你","哎呀，肚子疼，先上个茅房"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end

      elseif 类型==1199 then--斥候海妖
     if 任务数据[标识].名称=="斥候海妖"  then
            对话数据.对话="海是静的，仿佛明镜一般，倒映着蓝天白玉，几只悠闲的海鸥飞跃其间，更是给无垠的大海增添了几分神秘的色彩。"
            对话数据.选项={"赶跑斥候海妖","打扰了打扰了"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
       elseif 类型==1200 then--盘龙岛
        对话数据.对话="小子找死#24"
        对话数据.选项={"妖怪！看打！","哎呀，肚子疼，先上个茅房"}

      ---------------------------
     elseif 类型==1500 then--琴声悠悠
     if 任务数据[标识].名称=="琴声悠悠"  then
            对话数据.对话="这里可是好地方哇,以后我就长居凡界了。#24"
            对话数据.选项={"让我来收服你","哎呀，肚子疼，先上个茅房"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
      if 判断限制次数(id,"琴声悠悠") then----限制刷怪
    对话数据.对话="玩家"..判断限制次数(id,"琴声悠悠").."今日已经超过次数了"
    对话数据.选项=nil
   end
     elseif 类型==1501 then--新春快乐
     if 任务数据[标识].名称=="新春快乐"  then
            对话数据.对话="这里可是好地方哇,以后我就长居凡界了。#24"
            对话数据.选项={"让我来收服你","哎呀，肚子疼，先上个茅房"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
      if 判断限制次数(id,"新春快乐") then----限制刷怪
    对话数据.对话="玩家"..判断限制次数(id,"新春快乐").."今日已经超过次数了"
    对话数据.选项=nil
   end
     elseif 类型==1502 then--中秋快乐
     if 任务数据[标识].名称=="中秋快乐"  then
            对话数据.对话="这里可是好地方哇,以后我就长居凡界了。#24"
            对话数据.选项={"让我来收服你","哎呀，肚子疼，先上个茅房"}
      else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
              if 判断限制次数(id,"中秋快乐") then----限制刷怪
               对话数据.对话="玩家"..判断限制次数(id,"中秋快乐").."今日已经超过次数了"
              对话数据.选项=nil
              end
     elseif 类型==1503 then--龙神
     if 任务数据[标识].名称=="龙神"  then
            对话数据.对话="这里可是好地方哇,以后我就长居凡界了。#24"
            对话数据.选项={"让我来收服你","哎呀，肚子疼，先上个茅房"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
       if 判断限制次数(id,"龙神") then----限制刷怪
    对话数据.对话="玩家"..判断限制次数(id,"龙神").."今日已经超过次数了"
    对话数据.选项=nil
   end
     elseif 类型==1504 then--仙气十足
     if 任务数据[标识].名称=="仙气十足"  then
            对话数据.对话="这里可是好地方哇,以后我就长居凡界了。#24"
            对话数据.选项={"让我来收服你","哎呀，肚子疼，先上个茅房"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
      if 判断限制次数(id,"仙气十足") then----限制刷怪
    对话数据.对话="玩家"..判断限制次数(id,"仙气十足").."今日已经超过次数了"
    对话数据.选项=nil
   end
   --   elseif 类型==1505 then--武神坛服战8强
   --   if 任务数据[标识].名称=="武神坛服战8强"  then
   --          对话数据.对话="这里可是好地方哇,以后我就长居凡界了。#24"
   --          对话数据.选项={"让我来收服你","哎呀，肚子疼，先上个茅房"}
   --      else
   --       对话数据.对话="我正在战斗中，请勿打扰。"
   --    end
   --     if 判断限制次数(id,"武神坛服战8强") then----限制刷怪
   --  对话数据.对话="玩家"..判断限制次数(id,"武神坛服战8强").."今日已经超过次数了"
   --  对话数据.选项=nil
   -- end
   --   elseif 类型==1506 then--武神坛服战4强
   --   if 任务数据[标识].名称=="武神坛服战4强"  then
   --          对话数据.对话="这里可是好地方哇,以后我就长居凡界了。#24"
   --          对话数据.选项={"让我来收服你","哎呀，肚子疼，先上个茅房"}
   --      else
   --       对话数据.对话="我正在战斗中，请勿打扰。"
   --    end
   --    if 判断限制次数(id,"武神坛服战4强") then----限制刷怪
   --  对话数据.对话="玩家"..判断限制次数(id,"武神坛服战4强").."今日已经超过次数了"
   --  对话数据.选项=nil
   -- end
   --   elseif 类型==1507 then--武神坛服战季军
   --   if 任务数据[标识].名称=="武神坛服战季军"  then
   --          对话数据.对话="这里可是好地方哇,以后我就长居凡界了。#24"
   --          对话数据.选项={"让我来收服你","哎呀，肚子疼，先上个茅房"}
   --      else
   --       对话数据.对话="我正在战斗中，请勿打扰。"
   --    end
   --     if 判断限制次数(id,"武神坛服战季军") then----限制刷怪
   --  对话数据.对话="玩家"..判断限制次数(id,"武神坛服战季军").."今日已经超过次数了"
   --  对话数据.选项=nil
   -- end
   --   elseif 类型==1508 then--武神坛服战亚军
   --   if 任务数据[标识].名称=="武神坛服战亚军"  then
   --          对话数据.对话="这里可是好地方哇,以后我就长居凡界了。#24"
   --          对话数据.选项={"让我来收服你","哎呀，肚子疼，先上个茅房"}
   --      else
   --       对话数据.对话="我正在战斗中，请勿打扰。"
   --    end
   --     if 判断限制次数(id,"武神坛服战亚军") then----限制刷怪
   --  对话数据.对话="玩家"..判断限制次数(id,"武神坛服战亚军").."今日已经超过次数了"
   --  对话数据.选项=nil
   -- end
   --   elseif 类型==1509 then--武神坛服战冠军
   --   if 任务数据[标识].名称=="武神坛服战冠军"  then
   --          对话数据.对话="这里可是好地方哇,以后我就长居凡界了。#24"
   --          对话数据.选项={"让我来收服你","哎呀，肚子疼，先上个茅房"}
   --      else
   --       对话数据.对话="我正在战斗中，请勿打扰。"
   --    end
   --     if 判断限制次数(id,"武神坛服战冠军") then----限制刷怪
   --  对话数据.对话="玩家"..判断限制次数(id,"武神坛服战冠军").."今日已经超过次数了"
   --  对话数据.选项=nil
   -- end
     elseif 类型==1510 then--客服小二
     if 任务数据[标识].名称=="客服小二"  then
            对话数据.对话="这里可是好地方哇,以后我就长居凡界了。#24"
            对话数据.选项={"让我来收服你","哎呀，肚子疼，先上个茅房"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
      if 判断限制次数(id,"客服小二") then----限制刷怪
    对话数据.对话="玩家"..判断限制次数(id,"客服小二").."今日已经超过次数了"
    对话数据.选项=nil
   end
 --------------------------------------------------------------------------------------------
 elseif 类型==1515 then--捣乱年兽
     if 任务数据[标识].名称=="捣乱年兽"  then
            对话数据.对话="终于可以出来透透气了，美味的食物，我来了。#24"
            对话数据.选项={"小小年兽","告辞"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
      if 判断限制次数(id,"捣乱年兽") then----限制刷怪
    对话数据.对话="玩家"..判断限制次数(id,"捣乱年兽").."今日已经超过次数了"
    对话数据.选项=nil
   end

 elseif 类型==1516 then--贺新年
     if 任务数据[标识].名称=="贺新年"  then
            对话数据.对话="2026新年快乐，祝你马年大吉，万事如意！#24"
            对话数据.选项={"新年快乐","告辞"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
      if 判断限制次数(id,"贺新年") then----限制刷怪
    对话数据.对话="玩家"..判断限制次数(id,"贺新年").."今日已经超过次数了"
    对话数据.选项=nil
   end

elseif 类型==1517 then--万象福
     if 任务数据[标识].名称=="万象福"  then
            对话数据.对话="有能力你就来抓我啊......哈哈哈？#24"
            对话数据.选项={"我看你是找打","告辞"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
      if 判断限制次数(id,"万象福") then----限制刷怪
    对话数据.对话="玩家"..判断限制次数(id,"万象福").."今日已经超过次数了"
    对话数据.选项=nil
   end

elseif 类型==1518 then--糖果派对
     if 任务数据[标识].名称=="糖果派对"  then
            对话数据.对话="发糖喽，来一场糖果狂欢吧！#24"
            对话数据.选项={"争抢糖果","告辞"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
      if 判断限制次数(id,"糖果派对") then----限制刷怪
    对话数据.对话="玩家"..判断限制次数(id,"糖果派对").."今日已经超过次数了"
    对话数据.选项=nil
   end

elseif 类型==1521 then--六欲心魔
     if 任务数据[标识].名称=="六欲心魔"  then
            对话数据.对话="呵...又来个送死的？#24"
            对话数据.选项={"魔头纳命来","告辞"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
      if 判断限制次数(id,"六欲心魔") then----限制刷怪
    对话数据.对话="玩家"..判断限制次数(id,"六欲心魔").."今日已经超过次数了"
    对话数据.选项=nil
   end

elseif 类型==1520 then--恭喜发财
     if 任务数据[标识].名称=="恭喜发财"  then
            对话数据.对话="财神到，财神到，祝大家一路发发发！#24"
            对话数据.选项={"迎财神","告辞"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
      if 判断限制次数(id,"恭喜发财") then----限制刷怪
    对话数据.对话="玩家"..判断限制次数(id,"恭喜发财").."今日已经超过次数了"
    对话数据.选项=nil
   end

elseif 类型==1522 then--魔化师傅
     if 任务数据[标识].名称=="魔化师傅"  then
            对话数据.对话="乖徒儿，为师如今方知，所谓正道，不过是缚心的枷锁！#24"
            对话数据.选项={"师傅回头是岸啊","告辞"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
      if 判断限制次数(id,"魔化师傅") then----限制刷怪
    对话数据.对话="玩家"..判断限制次数(id,"魔化师傅").."今日已经超过次数了"
    对话数据.选项=nil
   end

elseif 类型==1523 then--四圣青龙
     if 任务数据[标识].名称=="四圣青龙"  then
            对话数据.对话="我乃上古神兽四圣之一的青龙，你还敢想要我的东西？#24"
            对话数据.选项={"把东西交给我","告辞"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
      if 判断限制次数(id,"四圣青龙") then----限制刷怪
    对话数据.对话="玩家"..判断限制次数(id,"四圣青龙").."今日已经超过次数了"
    对话数据.选项=nil
   end

elseif 类型==1524 then--四圣白虎
     if 任务数据[标识].名称=="四圣白虎"  then
            对话数据.对话="我乃上古神兽四圣之一的白虎，你还敢想要我的东西？#24"
            对话数据.选项={"把东西交给我","告辞"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
      if 判断限制次数(id,"四圣白虎") then----限制刷怪
    对话数据.对话="玩家"..判断限制次数(id,"四圣白虎").."今日已经超过次数了"
    对话数据.选项=nil
   end

elseif 类型==1525 then--四圣朱雀
     if 任务数据[标识].名称=="四圣朱雀"  then
            对话数据.对话="我乃上古神兽四圣之一的朱雀，你还敢想要我的东西？#24"
            对话数据.选项={"把东西交给我","告辞"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
      if 判断限制次数(id,"四圣朱雀") then----限制刷怪
    对话数据.对话="玩家"..判断限制次数(id,"四圣朱雀").."今日已经超过次数了"
    对话数据.选项=nil
   end

elseif 类型==1526 then--四圣玄武
     if 任务数据[标识].名称=="四圣玄武"  then
            对话数据.对话="我乃上古神兽四圣之一的玄武，你还敢想要我的东西？#24"
            对话数据.选项={"把东西交给我","告辞"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
      if 判断限制次数(id,"四圣玄武") then----限制刷怪
    对话数据.对话="玩家"..判断限制次数(id,"四圣玄武").."今日已经超过次数了"
    对话数据.选项=nil
   end

elseif 类型==1527 then--知了王
     if 任务数据[标识].名称=="知了王"  then
            对话数据.对话="看本大王敲破你们的脑袋！#24"
            对话数据.选项={"知了还这么嚣张","告辞"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
      if 判断限制次数(id,"知了王") then----限制刷怪
    对话数据.对话="玩家"..判断限制次数(id,"知了王").."今日已经超过次数了"
    对话数据.选项=nil
   end

elseif 类型==1528 then--巡山小妖
     if 任务数据[标识].名称=="巡山小妖"  then
            对话数据.对话="让我来看看你是什么小妖精。#24"
            对话数据.选项={"妖怪看打","告辞"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
      if 判断限制次数(id,"巡山小妖") then----限制刷怪
    对话数据.对话="玩家"..判断限制次数(id,"巡山小妖").."今日已经超过次数了"
    对话数据.选项=nil
   end

elseif 类型==1529 then--白骨精
     if 任务数据[标识].名称=="白骨精"  then
            对话数据.对话="啊？竟然找上门来了，没吃到唐僧肉反而来了一群细皮嫩肉的！少侠不如就给我做点心吧！#24"
            对话数据.选项={"妖怪看打","告辞"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
      if 判断限制次数(id,"白骨精") then----限制刷怪
    对话数据.对话="玩家"..判断限制次数(id,"白骨精").."今日已经超过次数了"
    对话数据.选项=nil
   end

elseif 类型==1530 then--狮驼国
     if 任务数据[标识].名称=="狮驼国"  then
            对话数据.对话="如来佛祖居然也得叫我一声娘舅！#24"
            对话数据.选项={"妖怪看打","告辞"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
      if 判断限制次数(id,"狮驼国") then----限制刷怪
    对话数据.对话="玩家"..判断限制次数(id,"狮驼国").."今日已经超过次数了"
    对话数据.选项=nil
   end

elseif 类型==1531 then--美猴王
     if 任务数据[标识].名称=="美猴王"  then
            对话数据.对话="真亦假来假亦真，如若能取得真经，又为何要分个真假呢？#24"
            对话数据.选项={"只能一战了","告辞"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
      if 判断限制次数(id,"美猴王") then----限制刷怪
    对话数据.对话="玩家"..判断限制次数(id,"美猴王").."今日已经超过次数了"
    对话数据.选项=nil
   end

elseif 类型==1532 then--武神坛服战
     if 任务数据[标识].名称=="武神坛服战"  then
            对话数据.对话="武神坛之巅，唯我独尊！挑战者，你的名字，将刻在我的战碑之下！"
            对话数据.选项={"八强","四强","季军","亚军","冠军"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
       if 判断限制次数(id,"武神坛服战") then----限制刷怪
    对话数据.对话="玩家"..判断限制次数(id,"武神坛服战").."今日已经超过次数了"
    对话数据.选项=nil
   end

elseif 类型==1533 then--醉凡尘
     if 任务数据[标识].名称=="醉凡尘"  then
            对话数据.对话="三千浮屠，六千烦恼，且看我，醉的它平生自在逍遥，少侠可与我痛饮一番？#24"
            对话数据.选项={"乐意至极","告辞"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
       if 判断限制次数(id,"醉凡尘") then----限制刷怪
    对话数据.对话="玩家"..判断限制次数(id,"醉凡尘").."今日已经超过次数了"
    对话数据.选项=nil
   end

elseif 类型==1534 then--仙魔灵墟
     if 任务数据[标识].名称=="仙魔灵墟"  then
            对话数据.对话="仙骨为刃，魔血作引，尔等凡人，可堪一战？！#24"
            对话数据.选项={"废话少说","告辞"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
       if 判断限制次数(id,"仙魔灵墟") then----限制刷怪
    对话数据.对话="玩家"..判断限制次数(id,"仙魔灵墟").."今日已经超过次数了"
    对话数据.选项=nil
   end

elseif 类型==1535 then--云生梦泽
     if 任务数据[标识].名称=="云生梦泽"  then
            对话数据.对话="春和景明祥瑞漫天，万物复苏气象更新！#24"
            对话数据.选项={"春光明媚","告辞"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
       if 判断限制次数(id,"云生梦泽") then----限制刷怪
    对话数据.对话="玩家"..判断限制次数(id,"云生梦泽").."今日已经超过次数了"
    对话数据.选项=nil
   end

elseif 类型==1187.1 then
     if 任务数据[标识].名称=="沸涌炎海巡守" or 任务数据[标识].名称== "沸涌炎海帝子" or 任务数据[标识].名称=="沸涌炎海统御"  then
            对话数据.对话="如果恐惧能被掩藏，那你，又在怕什么？"
            对话数据.选项={"把东西交给我","我只是路过的"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
 -------------------------------------------钢铁炼境的信标-----
    elseif 类型==1187.2 then
     if 任务数据[标识].名称=="钢铁炼境巡守" or 任务数据[标识].名称== "钢铁炼境帝子" or 任务数据[标识].名称=="钢铁炼境统御"  then
            对话数据.对话="如果恐惧能被掩藏，那你，又在怕什么？"
            对话数据.选项={"把东西交给我","我只是路过的"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
      --------------------------------------雷鸣废土的信标-----------
    elseif 类型==1187.3 then
     if 任务数据[标识].名称=="雷鸣废土巡守" or 任务数据[标识].名称== "雷鸣废土帝子" or 任务数据[标识].名称=="雷鸣废土统御"  then
            对话数据.对话="如果恐惧能被掩藏，那你，又在怕什么？"
            对话数据.选项={"把东西交给我","我只是路过的"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
      --------------------------------------幽夜暗域的信标-----------
    elseif 类型==1187.4 then
     if 任务数据[标识].名称=="幽夜暗域巡守" or 任务数据[标识].名称== "幽夜暗域帝子" or 任务数据[标识].名称=="幽夜暗域统御"  then
            对话数据.对话="如果恐惧能被掩藏，那你，又在怕什么？"
            对话数据.选项={"把东西交给我","我只是路过的"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
      --------------------------------------混乱终末的信标-----------
    elseif 类型==1187.5 then
     if 任务数据[标识].名称=="混乱终末巡守" or 任务数据[标识].名称== "混乱终末帝子" or 任务数据[标识].名称=="混乱终末统御"  then
            对话数据.对话="如果恐惧能被掩藏，那你，又在怕什么？"
            对话数据.选项={"把东西交给我","我只是路过的"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
      --------------------------------------伟大虚空的信标-----------
    elseif 类型==1187.6 then
     if 任务数据[标识].名称=="伟大虚空巡守" or 任务数据[标识].名称== "伟大虚空帝子" or 任务数据[标识].名称=="伟大虚空统御"  then
            对话数据.对话="如果恐惧能被掩藏，那你，又在怕什么？"
            对话数据.选项={"把东西交给我","我只是路过的"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
      --------------------------------------巅峰领域的信标-----------
    elseif 类型==1187.7 then
     if 任务数据[标识].名称=="巅峰领域巡守" or 任务数据[标识].名称== "巅峰领域帝子" or 任务数据[标识].名称=="巅峰领域统御"  then
            对话数据.对话="如果恐惧能被掩藏，那你，又在怕什么？"
            对话数据.选项={"把东西交给我","我只是路过的"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
-----------------------------------------


end
    return 对话数据
end
function 自写活动:对话事件处理(id,名称,事件,类型)
   if 类型==1176 then
        if 事件=="我来瞧瞧你的啥" then
            战斗准备类:创建战斗(id+0,155559,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
   elseif 类型==1177 then
        if 事件=="宝物给我拿过来" then
            战斗准备类:创建战斗(id+0,155560,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
   elseif 类型==1178 then--十二生肖
        if 事件=="1★" then
           if 取队伍人数(id)<3 and 调试模式==false then 常规提示(id,"#Y挑战最少必须由3人进行") return  end
            if 取等级要求(id,69)==false and 调试模式==false then 常规提示(id,"#Y/队伍中有成员等级不符合要求") return  end
            战斗准备类:创建战斗(id+0,155561,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
          elseif 事件=="2★" then
           if 取队伍人数(id)<3 and 调试模式==false then 常规提示(id,"#Y挑战最少必须由3人进行") return  end
            if 取等级要求(id,69)==false and 调试模式==false then 常规提示(id,"#Y/队伍中有成员等级不符合要求") return  end
            战斗准备类:创建战斗(id+0,155561.1,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
           elseif 事件=="3★" then
           if 取队伍人数(id)<3 and 调试模式==false then 常规提示(id,"#Y挑战最少必须由3人进行") return  end
            if 取等级要求(id,69)==false and 调试模式==false then 常规提示(id,"#Y/队伍中有成员等级不符合要求") return  end
            战斗准备类:创建战斗(id+0,155561.2,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
           elseif 事件=="4★" then
           if 取队伍人数(id)<3 and 调试模式==false then 常规提示(id,"#Y挑战最少必须由3人进行") return  end
            if 取等级要求(id,69)==false and 调试模式==false then 常规提示(id,"#Y/队伍中有成员等级不符合要求") return  end
            战斗准备类:创建战斗(id+0,155561.3,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
           elseif 事件=="5★" then
           if 取队伍人数(id)<3 and 调试模式==false then 常规提示(id,"#Y挑战最少必须由3人进行") return  end
            if 取等级要求(id,69)==false and 调试模式==false then 常规提示(id,"#Y/队伍中有成员等级不符合要求") return  end
            战斗准备类:创建战斗(id+0,155561.4,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true

        end
   elseif 类型==1179 then--50级世界BOSS
        if 事件=="让我来收服你" then
            战斗准备类:创建战斗(id+0,155562,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
   elseif 类型==1180 then--100级世界BOSS
        if 事件=="让我来收服你" then
            战斗准备类:创建战斗(id+0,155563,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
   elseif 类型==1181 then--150级世界BOSS
        if 事件=="让我来收服你" then
            战斗准备类:创建战斗(id+0,155564,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
   elseif 类型==1182 then--魔丸
        if 事件=="让我来收服你" then
            战斗准备类:创建战斗(id+0,155565,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
   elseif 类型==1183 then --红丸
        if 事件=="让我来收服你" then
            战斗准备类:创建战斗(id+0,155566,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
   elseif 类型==1184 then --夏日炎炎
        if 事件=="让我来收服你" then
            战斗准备类:创建战斗(id+0,160001,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
   elseif 类型==1185 then --魂殿使者
        if 事件=="让我来收服你" then
            战斗准备类:创建战斗(id+0,160002,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
   elseif 类型==1186 then --魂殿殿主
        if 事件=="让我来收服你" then
            战斗准备类:创建战斗(id+0,160003,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end

   elseif 类型==1187 then --知了先锋
        if 事件=="让我来收服你" then
            战斗准备类:创建战斗(id+0,160004,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
   elseif 类型==1188 then --知了小王
        if 事件=="让我来收服你" then
            战斗准备类:创建战斗(id+0,160005,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
   elseif 类型==1189 then --知了大王
        if 事件=="让我来收服你" then
            战斗准备类:创建战斗(id+0,160006,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
   elseif 类型==1190 then --知了统领
        if 事件=="让我来收服你" then
            战斗准备类:创建战斗(id+0,160007,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
   elseif 类型==1191 then --千年知了王
        if 事件=="让我来收服你" then
            战斗准备类:创建战斗(id+0,160008,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end

   elseif 类型==1192 then --大雁塔一层
        if 事件=="让我来收服你" then
            战斗准备类:创建战斗(id+0,160009,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
   elseif 类型==1193 then --大雁塔二层
        if 事件=="让我来收服你" then
            战斗准备类:创建战斗(id+0,160010,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
   elseif 类型==1194 then --大雁塔三层
        if 事件=="让我来收服你" then
            战斗准备类:创建战斗(id+0,160011,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
   elseif 类型==1195 then --大雁塔四层
        if 事件=="让我来收服你" then
            战斗准备类:创建战斗(id+0,160012,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
   elseif 类型==1196 then --大雁塔五层
        if 事件=="让我来收服你" then
            战斗准备类:创建战斗(id+0,160013,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
   elseif 类型==1197 then --大雁塔六层
        if 事件=="让我来收服你" then
            战斗准备类:创建战斗(id+0,160014,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
   elseif 类型==1198 then --大雁塔七层
        if 事件=="让我来收服你" then
            战斗准备类:创建战斗(id+0,160015,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end

    elseif 类型==1199 then
        if 事件=="赶跑斥候海妖" then
            战斗准备类:创建战斗(id+0,120068,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
   elseif 类型==1200 then--盘龙岛小怪
      if 事件=="妖怪！看打！" then
        战斗准备类:创建战斗(id+0,150100,玩家数据[id].地图单位.标识)
        任务数据[玩家数据[id].地图单位.标识].zhandou=true
      end

   elseif 类型==1500 then --琴声悠悠
        if 事件=="让我来收服你" then
            战斗准备类:创建战斗(id+0,160016,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
   elseif 类型==1501 then --新春快乐
        if 事件=="让我来收服你" then
            战斗准备类:创建战斗(id+0,160017,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
   elseif 类型==1502 then --中秋
        if 事件=="让我来收服你" then
            战斗准备类:创建战斗(id+0,160018,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
   elseif 类型==1503 then --龙神
        if 事件=="让我来收服你" then
            战斗准备类:创建战斗(id+0,160019,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
   elseif 类型==1504 then --仙气
        if 事件=="让我来收服你" then
            战斗准备类:创建战斗(id+0,160020,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
   -- elseif 类型==1505 then --武神坛服战8强
   --      if 事件=="让我来收服你" then
   --          战斗准备类:创建战斗(id+0,160021,玩家数据[id].地图单位.标识)
   --          任务数据[玩家数据[id].地图单位.标识].zhandou=true
   --      end
   -- elseif 类型==1506 then --武神坛服战4强
   --      if 事件=="让我来收服你" then
   --          战斗准备类:创建战斗(id+0,160022,玩家数据[id].地图单位.标识)
   --          任务数据[玩家数据[id].地图单位.标识].zhandou=true
   --      end
   -- elseif 类型==1507 then --武神坛服战季军
   --      if 事件=="让我来收服你" then
   --          战斗准备类:创建战斗(id+0,160023,玩家数据[id].地图单位.标识)
   --          任务数据[玩家数据[id].地图单位.标识].zhandou=true
   --      end
   -- elseif 类型==1508 then --武神坛服战亚军
   --      if 事件=="让我来收服你" then
   --          战斗准备类:创建战斗(id+0,160024,玩家数据[id].地图单位.标识)
   --          任务数据[玩家数据[id].地图单位.标识].zhandou=true
   --      end
   -- elseif 类型==1509 then --武神坛服战冠军
   --      if 事件=="让我来收服你" then
   --          战斗准备类:创建战斗(id+0,160025,玩家数据[id].地图单位.标识)
   --          任务数据[玩家数据[id].地图单位.标识].zhandou=true
   --      end
   elseif 类型==1510 then --客服小二
        if 事件=="让我来收服你" then
            战斗准备类:创建战斗(id+0,160026,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
    ----------------------------------
    elseif 类型==1515 then --捣乱年兽
        if 事件=="小小年兽" then
            战斗准备类:创建战斗(id+0,160030,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
     elseif 类型==1516 then --贺新年
        if 事件=="新年快乐" then
            战斗准备类:创建战斗(id+0,160031,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
      elseif 类型==1517 then --万象福
        if 事件=="我看你是找打" then
            战斗准备类:创建战斗(id+0,160032,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
      elseif 类型==1518 then --糖果派对
        if 事件=="争抢糖果" then
            战斗准备类:创建战斗(id+0,160033,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
      elseif 类型==1521 then --六欲心魔
        if 事件=="魔头纳命来" then
            战斗准备类:创建战斗(id+0,160034,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
      elseif 类型==1520 then --恭喜发财
        if 事件=="迎财神" then
            战斗准备类:创建战斗(id+0,160035,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
      elseif 类型==1522 then --魔化师傅
        if 事件=="师傅回头是岸啊" then
            战斗准备类:创建战斗(id+0,160036,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
      elseif 类型==1523 then --四圣青龙
        if 事件=="把东西交给我" then
            战斗准备类:创建战斗(id+0,160037,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
      elseif 类型==1524 then --四圣白虎
        if 事件=="把东西交给我" then
            战斗准备类:创建战斗(id+0,160038,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
      elseif 类型==1525 then --四圣朱雀
        if 事件=="把东西交给我" then
            战斗准备类:创建战斗(id+0,160039,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
      elseif 类型==1526 then --四圣玄武
        if 事件=="把东西交给我" then
            战斗准备类:创建战斗(id+0,160040,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
      elseif 类型==1527 then --知了王
        if 事件=="知了还这么嚣张" then
            战斗准备类:创建战斗(id+0,160050,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
      elseif 类型==1528 then --巡山小妖
        if 事件=="妖怪看打" then
            战斗准备类:创建战斗(id+0,160051,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
      elseif 类型==1529 then --白骨精
        if 事件=="妖怪看打" then
            战斗准备类:创建战斗(id+0,160052,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
      elseif 类型==1530 then --狮驼国
        if 事件=="妖怪看打" then
            战斗准备类:创建战斗(id+0,160053,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
      elseif 类型==1531 then --美猴王
        if 事件=="只能一战了" then
            战斗准备类:创建战斗(id+0,160054,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end

        elseif 类型==1532 then--武神坛服战
        if 事件=="八强" then
           if 取队伍人数(id)<3 and 调试模式==false then 常规提示(id,"#Y挑战最少必须由3人进行") return  end
            if 取等级要求(id,69)==false and 调试模式==false then 常规提示(id,"#Y/队伍中有成员等级不符合要求") return  end
            战斗准备类:创建战斗(id+0,160071,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
          elseif 事件=="四强" then
           if 取队伍人数(id)<3 and 调试模式==false then 常规提示(id,"#Y挑战最少必须由3人进行") return  end
            if 取等级要求(id,69)==false and 调试模式==false then 常规提示(id,"#Y/队伍中有成员等级不符合要求") return  end
            战斗准备类:创建战斗(id+0,160071.1,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
           elseif 事件=="季军" then
           if 取队伍人数(id)<3 and 调试模式==false then 常规提示(id,"#Y挑战最少必须由3人进行") return  end
            if 取等级要求(id,69)==false and 调试模式==false then 常规提示(id,"#Y/队伍中有成员等级不符合要求") return  end
            战斗准备类:创建战斗(id+0,160071.2,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
           elseif 事件=="亚军" then
           if 取队伍人数(id)<3 and 调试模式==false then 常规提示(id,"#Y挑战最少必须由3人进行") return  end
            if 取等级要求(id,69)==false and 调试模式==false then 常规提示(id,"#Y/队伍中有成员等级不符合要求") return  end
            战斗准备类:创建战斗(id+0,160071.3,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
           elseif 事件=="冠军" then
           if 取队伍人数(id)<3 and 调试模式==false then 常规提示(id,"#Y挑战最少必须由3人进行") return  end
            if 取等级要求(id,69)==false and 调试模式==false then 常规提示(id,"#Y/队伍中有成员等级不符合要求") return  end
            战斗准备类:创建战斗(id+0,160071.4,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end

        elseif 类型==1533 then --醉凡尘
        if 事件=="乐意至极" then
            战斗准备类:创建战斗(id+0,160072,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end

        elseif 类型==1534 then --仙魔灵墟
        if 事件=="废话少说" then
            战斗准备类:创建战斗(id+0,160073,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end

        elseif 类型==1535 then --云生梦泽
        if 事件=="春光明媚" then
            战斗准备类:创建战斗(id+0,160074,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end

        ---------------------------沸涌炎海的信标---------------------
    elseif 类型==1187.1 then
        if 事件=="把东西交给我" then
            战斗准备类:创建战斗(id+0,155564.1,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
        ---------------------------钢铁炼境的信标----------------------
    elseif 类型==1187.2 then
        if 事件=="把东西交给我" then--------
            战斗准备类:创建战斗(id+0,155564.2,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
        ---------------------------雷鸣废土的信标----------------------
    elseif 类型==1187.3 then
        if 事件=="把东西交给我" then-------
            战斗准备类:创建战斗(id+0,155564.3,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
        ---------------------------幽夜暗域的信标----------------------
    elseif 类型==1187.4 then
        if 事件=="把东西交给我" then--------
            战斗准备类:创建战斗(id+0,155564.4,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
        ---------------------------混乱终末的信标----------------------
    elseif 类型==1187.5 then
        if 事件=="把东西交给我" then--------
            战斗准备类:创建战斗(id+0,155564.5,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
        ---------------------------伟大虚空的信标----------------------
    elseif 类型==1187.6 then
        if 事件=="把东西交给我" then--------
            战斗准备类:创建战斗(id+0,155564.6,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
        ---------------------------巅峰领域的信标----------------------
    elseif 类型==1187.7 then
        if 事件=="把东西交给我" then--------
            战斗准备类:创建战斗(id+0,155564.7,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end


    end
end
-----------------------------------------------------------------------------------------------------------------
function 自写活动:捣乱年兽()
--  local 怪物名称 = {"捣乱年兽"}
--  local 生肖模型 = {"古代瑞兽"}
  local 地图范围={1501,1193}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,20 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1515"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3300,
        玩家id=id,
        队伍组={},
        名称="捣乱年兽",
        模型="古代瑞兽",
        称谓="★★",
        行走开关=true,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1515,
        销毁=true,
        -- 难度=i
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(捣乱年兽)#W/年兽现在正在#G%s、%s#W处，请各位少侠们，前去赶跑他们。#G(难度2)".."#"..取随机数(1,110),刷新地图[1],刷新地图[2]),频道="xt"})
end

function 自写活动:贺新年()
--  local 怪物名称 = {"贺新年"}
--  local 生肖模型 = {"进阶超级神马"}
  local 地图范围={1216}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,20 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1516"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3300,
        玩家id=id,
        队伍组={},
        名称="贺新年",
        模型="进阶超级神马",
        称谓="★★★",
        行走开关=true,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1516,
        销毁=true,
        -- 难度=i
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(新春快乐)#W/新春使者现在正在#G%s#W处，请各位少侠们，前去赶跑他们。#G(难度3)".."#"..取随机数(1,110),刷新地图[1],刷新地图[2]),频道="xt"})
end

function 自写活动:万象福()
--  local 怪物名称 = {"贺新年"}
--  local 生肖模型 = {"进阶超级神虎"}
  local 地图范围={1193}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,20 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1517"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3300,
        玩家id=id,
        队伍组={},
        名称="万象福",
        模型="进阶超级神虎",
        称谓="★★★",
        行走开关=true,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1517,
        销毁=true,
        -- 难度=i
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(万象福)#W/万象福娃现在正在#G%s#W处，请各位少侠们，前去赶跑他们。#G(难度3)".."#"..取随机数(1,110),刷新地图[1],刷新地图[2]),频道="xt"})
end

function 自写活动:糖果派对()
  local 怪物名称 = {"糖果派对","糖果派对","糖果派对","糖果派对","糖果派对","糖果派对","糖果派对","糖果派对"}
  local 怪物造型 = {"泡泡灵仙·剑侠客","泡泡灵仙·神天兵","泡泡灵仙·羽灵神","泡泡灵仙·龙太子","泡泡灵仙·杀破狼","泡泡灵仙·巫蛮儿","泡泡灵仙·飞燕女","泡泡灵仙·骨精灵"}
  local 地图范围={1110,1174}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,20 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1518"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3300,
        玩家id=id,
        队伍组={},
        名称=怪物名称[i],
        模型=怪物造型[取随机数(1,#怪物造型)],
        称谓="★★★★★",
        行走开关=true,
        饰品显示=true,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1518,
        销毁=true,
        -- 难度=i
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(糖果派对)#W/糖果仙灵们正在派送糖果，现在正在#G%s、%s#W处，请各位少侠们，前去抢糖果。#G(难度5)".."#"..取随机数(1,110),刷新地图[1],刷新地图[2]),频道="xt"})
end

function 自写活动:六欲心魔()
  local 怪物名称 = {"六欲心魔","六欲心魔"}
  local 怪物造型 = {"蜃气妖","蜃气妖"}
  local 地图范围={1210,1205}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,20 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1521"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3300,
        玩家id=id,
        队伍组={},
        名称=怪物名称[i],
        模型=怪物造型[取随机数(1,#怪物造型)],
        称谓="★★★★★",
        行走开关=true,
        饰品显示=true,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1521,
        销毁=true,
        -- 难度=i
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(六欲心魔)#W/七情六欲之魔现在正在#G%s、%s#W处，请各位少侠们前去挑战。#G(难度5)".."#"..取随机数(1,110),刷新地图[1],刷新地图[2]),频道="xt"})
end

function 自写活动:恭喜发财()
  local 怪物名称 = {"恭喜发财","恭喜发财"}
  local 怪物造型 = {"财神","财神"}
  local 地图范围={5006}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,20 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1520"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3300,
        玩家id=id,
        队伍组={},
        名称=怪物名称[i],
        模型=怪物造型[取随机数(1,#怪物造型)],
        称谓="★★★★★",
        行走开关=true,
        饰品显示=true,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1520,
        销毁=true,
        -- 难度=i
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(恭喜发财)#W/财神带着大量天财地宝，现在正在#G%s#W处，请各位少侠们前去挑战。#G(难度5)".."#"..取随机数(1,110),刷新地图[1],刷新地图[2]),频道="xt"})
end

function 自写活动:魔化师傅()
  local 怪物名称 = {"魔化师傅","魔化师傅"}
  local 生肖模型 = {"程咬金","菩提祖师","白晶晶","李靖","孙婆婆","地藏王","观音姐姐","巫奎虎","地涌夫人","二郎神","空度禅师","镇元子","大大王","东海龙王","新孙悟空"}
  local 地图范围={1208,1226}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,20 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1522"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3300,
        玩家id=id,
        队伍组={},
        名称=怪物名称[i],
        模型=生肖模型[取随机数(1,#生肖模型)],
        称谓="★★★★★★",
        行走开关=true,
        饰品显示=true,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1522,
        销毁=true,
        -- 难度=i
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(魔化师傅)#W/魔化师傅带着大量天财地宝，现在正在#G%s、%s#W处，请各位少侠们前去挑战。#G(难度6)".."#"..取随机数(1,110),刷新地图[1],刷新地图[2]),频道="xt"})
end

function 自写活动:四圣青龙()
  local 怪物名称 = {"四圣青龙"}
  local 生肖模型 = {"蛟龙"}
  local 地图范围={1116}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,20 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1523"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3300,
        玩家id=id,
        队伍组={},
        名称=怪物名称[i],
        模型=生肖模型[取随机数(1,#生肖模型)],
        染色方案=90,
        染色组={[1]=1,[2]=1},
        称谓="★★★★★★",
        行走开关=true,
        饰品显示=true,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1523,
        销毁=true,
        -- 难度=i
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(四圣青龙)#W/四圣青龙带着大量天财地宝，现在正在#G%s#W处，请各位少侠们前去挑战。#G(难度6)".."#"..取随机数(1,110),刷新地图[1],刷新地图[2]),频道="xt"})
end

function 自写活动:四圣白虎()
  local 怪物名称 = {"四圣白虎"}
  local 生肖模型 = {"进阶噬天虎"}
  local 地图范围={1232}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,20 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1524"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3300,
        玩家id=id,
        队伍组={},
        名称=怪物名称[i],
        模型=生肖模型[取随机数(1,#生肖模型)],
        染色方案=2065,
        染色组={[1]=1,[2]=0},
        称谓="★★★★★★",
        行走开关=true,
        饰品显示=true,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1524,
        销毁=true,
        -- 难度=i
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(四圣白虎)#W/四圣白虎带着大量天财地宝，现在正在#G%s#W处，请各位少侠们前去挑战。#G(难度6)".."#"..取随机数(1,110),刷新地图[1],刷新地图[2]),频道="xt"})
end

function 自写活动:四圣朱雀()
  local 怪物名称 = {"四圣朱雀"}
  local 生肖模型 = {"凤凰"}
  local 地图范围={1040}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,20 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1525"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3300,
        玩家id=id,
        队伍组={},
        名称=怪物名称[i],
        模型=生肖模型[取随机数(1,#生肖模型)],
        染色方案=2051,
        染色组={[1]=1,[2]=0},
        称谓="★★★★★★",
        行走开关=true,
        饰品显示=true,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1525,
        销毁=true,
        -- 难度=i
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(四圣朱雀)#W/四圣朱雀带着大量天财地宝，现在正在#G%s#W处，请各位少侠们前去挑战。#G(难度6)".."#"..取随机数(1,110),刷新地图[1],刷新地图[2]),频道="xt"})
end

function 自写活动:四圣玄武()
  local 怪物名称 = {"四圣玄武"}
  local 生肖模型 = {"龙龟"}
  local 地图范围={1208}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,20 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1526"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3300,
        玩家id=id,
        队伍组={},
        名称=怪物名称[i],
        模型=生肖模型[取随机数(1,#生肖模型)],
        染色方案=112,
        染色组={[1]=0,[2]=1},
        称谓="★★★★★★",
        行走开关=true,
        饰品显示=true,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1526,
        销毁=true,
        -- 难度=i
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(四圣玄武)#W/四圣玄武带着大量天财地宝，现在正在#G%s#W处，请各位少侠们前去挑战。#G(难度6)".."#"..取随机数(1,110),刷新地图[1],刷新地图[2]),频道="xt"})
end

function 自写活动:知了王()
  local 怪物名称 = {"知了王"}
  local 生肖模型 = {"知了王"}
  local 地图范围={1501}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,20 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1527"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3300,
        玩家id=id,
        队伍组={},
        名称=怪物名称[i],
        模型=生肖模型[取随机数(1,#生肖模型)],
        称谓="★★★★★",
        行走开关=true,
        饰品显示=true,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1527,
        销毁=true,
        -- 难度=i
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(知了王)#W/知了王带着大量天财地宝，现在正在#G%s#W处，请各位少侠们前去挑战。#G(难度5)".."#"..取随机数(1,110),刷新地图[1],刷新地图[2]),频道="xt"})
end

function 自写活动:巡山小妖()
  local 怪物名称 = {"巡山小妖"}
  local 生肖模型 = {"蛤蟆精","蜘蛛精","老虎","雷鸟人","大蝙蝠","野猪","雷鸟人","骷髅怪","小龙女","虾兵","蟹将","鬼蛙","龟丞相","金乌火虫","黑熊","黑熊精"}
  local 地图范围={1876}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,20 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1528"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3300,
        玩家id=id,
        队伍组={},
        名称=怪物名称[i],
        模型=生肖模型[取随机数(1,#生肖模型)],
        称谓="★★",
        行走开关=true,
        饰品显示=true,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1528,
        销毁=true,
        -- 难度=i
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(巡山小妖)#Y南岭山#W(可由江南野外传送)里出现了一群巡山小妖，嚷嚷着要活捉唐僧！#G(难度2)".."#"..取随机数(1,110),刷新地图[1],刷新地图[2]),频道="xt"})
end

function 自写活动:白骨精()
  local 地图范围={1513}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,20 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1529"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3300,
        玩家id=id,
        队伍组={},
        名称="白骨精",
        模型="进阶蝎子精",
        称谓="★★★★",
        行走开关=true,
        饰品显示=true,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1529,
        销毁=true,
        -- 难度=i
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(白骨精)#W唐僧师徒四人在西行的路上，白骨精趁虚而入，为夺唐僧而在#Y盘丝岭#W巧设圈套！#G(难度4)".."#"..取随机数(1,110),刷新地图[1],刷新地图[2]),频道="xt"})
end

function 自写活动:狮驼国()
  local 怪物名称 = {"狮驼国"}
  local 怪物造型 = {"大大王","二大王","三大王"}
  local 地图范围={1131}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,20 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1530"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3300,
        玩家id=id,
        队伍组={},
        名称=怪物名称[取随机数(1,#怪物名称)],
        模型=怪物造型[取随机数(1,#怪物造型)],
        称谓="★★★★",
        行走开关=true,
        饰品显示=true,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1530,
        销毁=true,
        -- 难度=i
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(狮驼国)#W#W唐僧师徒四人行至#G狮驼国#W，发现此地骷髅若岭，骸骨如林。尸山血海，恐怖之至。看样子是免不了一场苦战了！#G(难度4)".."#"..取随机数(1,110),刷新地图[1],刷新地图[2]),频道="xt"})
end

function 自写活动:美猴王()
  local 怪物名称 = {"美猴王"}
  local 怪物造型 = {"孙悟空"}
  local 地图范围={1201}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,20 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1531"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3300,
        玩家id=id,
        队伍组={},
        名称=怪物名称[取随机数(1,#怪物名称)],
        模型=怪物造型[取随机数(1,#怪物造型)],
        称谓="★★★★",
        行走开关=true,
        饰品显示=true,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1531,
        销毁=true,
        -- 难度=i
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(美猴王)#Y%s#W竟然出现了唐僧、猪八戒、沙悟净、小白龙、孙悟空这些个冒牌替身，叫嚣着要自己去取了西经。为了避免为祸人间，少侠们速速前去辨明真伪！#G(难度4)".."#"..取随机数(1,110),刷新地图[1],刷新地图[2]),频道="xt"})
end
----------------------------------------------------------------------------------------------------------------
function 自写活动:盘龙岛小怪()
  local 地图范围={2574}
  local 随机地图=地图范围[取随机数(1,#地图范围)]  -- 随机选择其中一个地图
  local 刷新地图名称=取地图名称(随机地图)
  local 怪物名称 = {"巫翅雕","黑鳞蟒","须弥虫","裂风兽","幻焰妖","青棘鸟","玄镜妖","曼珠沙华","巨犀兽","金睛猿"}
  local 怪物造型 = {"雷鸟人","千年蛇魅","金乌月光虫","金翼","云游火","执音","镜妖","曼珠沙华","犀牛将军人形","进阶巨力神猿"}

  for k=1,30 do
    local xy=地图处理类.地图坐标[随机地图]:取随机点()
    local 任务id="_"..k.."_"..取随机数(1,99).."1200"..os.time().."_"..随机序列.."_"..取随机数(99,99)
    随机序列=随机序列+1
    任务数据[任务id]={
      id=任务id,
      起始=os.time(),
      结束=3000,
      玩家id=id,
      队伍组={},
      名称=怪物名称[取随机数(1,#怪物名称)],
      模型=怪物造型[取随机数(1,#怪物造型)],
      行走开关=true,
      x=xy.x,
      y=xy.y,
      地图编号=随机地图,
      战斗显示=true,
      地图名称=刷新地图名称,
      类型=1200,
      销毁=true,
    }
    地图处理类:添加单位(任务id)
  end
  广播消息({内容=format("#P(盘龙岛)#Y怒蛟#W发怒！".."#"..取随机数(1,110)),频道="xt"})
end

function 自写活动:斥候海妖()
  local 怪物名称 = {"斥候海妖","斥候海妖"}
  local 怪物造型 = {"碧水夜叉"}
  local 地图范围={11181,11191,11201,11211,15321}
  local 刷新地图={}
  local 已刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[取随机数(1,#地图范围)]
    local 地图名=取地图名称(地图)
    if not 已刷新地图[地图名] then
      已刷新地图[地图名] = true
      table.insert(刷新地图, 地图名)
    end
    for k=1,30 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1199"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=1500,
        玩家id=id,
        队伍组={},
        名称=怪物名称[取随机数(1,2)],
        模型=怪物造型[1],
        称谓="阵营任务",
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=地图名,
        类型=1199,
        销毁=true,
      }
      地图处理类:添加单位(任务id)
    end
  end

  local 地图列表 = table.concat(刷新地图, "、")
  广播消息({内容=format("#P《双龙之战》#Y/斥候海妖出现在了#G/【%s】#Y/里游荡，各位少侠快去击杀它们吧！！。", 地图列表),频道="xt"})
end


function 自写活动:下凡的灵猴()
  local 怪物名称 = {"下凡的灵猴","下凡的灵猴"}
  local 怪物造型 = {"超级六耳猕猴"}
  local 地图范围={1506,1193,1110,1514}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[取随机数(1,#地图范围)]
    for k=1,20 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1176"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=1500,
        玩家id=id,
        队伍组={},
        名称=怪物名称[取随机数(1,2)],
        模型=怪物造型[1],
        行走开关=true,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1176,
        销毁=true,
        -- 难度=i
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(下凡的灵猴)#W/雷霆一劈，天空中飞来许多灵猴，他们出现在了#Y/%s、%s、%s、%s#w/处捣乱，还请各位英雄侠土赶紧去降服它们。#G(少量银子,物品奖励,难度低)".."#"..取随机数(1,110),刷新地图[1],刷新地图[2],刷新地图[3],刷新地图[4]),频道="xt"})
end
function 自写活动:三界财神爷()
  local 怪物名称 = {"三界财神爷"}
  local 怪物造型 = {"进阶小毛头","进阶小丫丫"}--,"小魔头","小仙灵","小仙女"
  local 地图范围={1193,1506,1091,1110}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[取随机数(1,#地图范围)]
    for k=1,20 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1177"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3500,
        玩家id=id,
        队伍组={},
        名称=怪物名称[1],
        模型=怪物造型[取随机数(1,#怪物造型)],
        行走开关=true,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1177,
        销毁=true,
        -- 难度=i
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(三界财神爷)#W/财神爷，携带大量宝物，跑到#G%s、%s、%s、%s#W处躲藏，请各位少侠们，前去抓住他获得宝物。#G(大量银子,难度低)".."#"..取随机数(1,110),刷新地图[1],刷新地图[2],刷新地图[3],刷新地图[4]),频道="xt"})
end
function 自写活动:十二生肖()
  local 昼夜
   if 时辰信息.昼夜 == 1 then --晚上
      昼夜=1360
    else
      昼夜=1359
    end
  local 怪物名称 = {"生肖兽","生肖兽"}
  local 生肖模型 = {"超级神龙","超级神狗","超级青鸾","超级神牛","超级神虎","超级神兔","超级金猴","超级神马","超级神羊","超级神鸡","超级神蛇","超级神鼠"}
  local 地图范围={1208,1226,1193,1506,1091,1110,昼夜}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[取随机数(1,#地图范围)]
    for k=1,10 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1178"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3000,
        玩家id=id,
        队伍组={},
        名称="十二生肖",
        模型=生肖模型[取随机数(1,#生肖模型)],
        行走开关=true,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1178,
        销毁=true,
        -- 难度=i
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(十二生肖)#W一群生肖闪着金色光芒正在#G%s、%s#W场景中四处游玩，各位少侠可以去消灭他们。#G(物品,经验,难度自选)".."#"..取随机数(1,110),刷新地图[1],刷新地图[2]),频道="xt"})
end
function 自写活动:世界boss(id)
  local 怪物名称 = {"远古妖魔头目","远古妖魔头目"}
  local 生肖模型 = {"小蚩尤","小蚩尤"}
  local 地图范围={1506}
  local 等级=50
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,3 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..等级.."_"..取随机数(1999,11111).."_1179_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_"..等级
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3500,
        玩家id=id,
        队伍组={},
        名称=怪物名称[i],
        模型=生肖模型[取随机数(1,#生肖模型)],
        称谓="世界BOSS("..等级.."级)",
        行走开关=true,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1179,
        销毁=true,
        -- 难度=i
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(世界boss)#W妖门大开，魔王现世。#Y远古妖魔头目#W已经出现在#G%s#W场景内祸害四分，各位少侠可以去消灭他们。#G(大量银子,物品,经验,难度高)".."#"..取随机数(1,110),刷新地图[1]),频道="xt"})
  local 怪物名称 = {"远古妖魔领主","远古妖魔领主"}
  local 生肖模型 = {"小蚩尤","小蚩尤"}
  local 地图范围={1202}
  local 等级=100
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,3 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..等级.."_"..取随机数(1999,11111).."_1180_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_"..等级
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3500,
        玩家id=id,
        队伍组={},
        名称=怪物名称[i],
        模型=生肖模型[取随机数(1,#生肖模型)],
        称谓="世界BOSS("..等级.."级)",
        行走开关=true,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1180,
        销毁=true,
        -- 难度=i
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(世界boss)#W妖门大开，魔王现世。#Y远古妖魔领主#W已经出现在#G%s#W场景内祸害四分，各位少侠可以去消灭他们。#G(大量银子,物品,经验,难度高)".."#"..取随机数(1,110),刷新地图[1]),频道="xt"})
  local 怪物名称 = {"远古妖魔尊主","远古妖魔尊主"}
  local 生肖模型 = {"小蚩尤","小蚩尤"}
  local 地图范围={1204}
  local 等级=150
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,3 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..等级.."_"..取随机数(1999,11111).."_1181_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_"..等级
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3500,
        玩家id=id,
        队伍组={},
        名称=怪物名称[i],
        模型=生肖模型[取随机数(1,#生肖模型)],
        称谓="世界BOSS("..等级.."级)",
        行走开关=true,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1181,
        销毁=true,
        -- 难度=i
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(世界boss)#W妖门大开，魔王现世。#Y远古妖魔尊主#W已经出现在#G%s#W场景内祸害四分，各位少侠可以去消灭他们。#G(大量银子,物品,经验,难度高)".."#"..取随机数(1,110),刷新地图[1]),频道="xt"})
end

function 自写活动:夏日炎炎()
  local 地图范围={1092,1501}
  local 随机地图=地图范围[取随机数(1,#地图范围)]  -- 随机选择其中一个地图
  local 刷新地图名称=取地图名称(随机地图)
  for k=1,30 do
    local xy=地图处理类.地图坐标[随机地图]:取随机点()
    local 任务id="_"..k.."_"..取随机数(1,99).."1184"..os.time().."_"..随机序列.."_"..取随机数(99,99)
    随机序列=随机序列+1
    任务数据[任务id]={
      id=任务id,
      起始=os.time(),
      结束=3000,
      玩家id=id,
      队伍组={},
      名称="夏日炎炎",
      模型="进阶雾中仙",
      行走开关=false,
      x=xy.x,
      y=xy.y,
      地图编号=随机地图,
      战斗显示=true,
      地图名称=刷新地图名称,
      类型=1184,
      销毁=true,
    }
    地图处理类:添加单位(任务id)
  end
  广播消息({
    内容=format("#P(夏日炎炎)#W一群夏日炎炎正在#G%s#W场景中四处游玩，各位少侠可以去消灭他们。#G(物品,经验,难度低)".."#"..取随机数(1,110), 刷新地图名称),
    频道="xt"
  })
end


function 自写活动:魂殿使者()
   local 怪物名称 = {"魂殿使者"}
  local 怪物模型 = {"吸血鬼"}
  local 地图范围={1208}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,20 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1185"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3000,
        玩家id=id,
        队伍组={},
        名称=怪物名称[i],
        模型=怪物模型[取随机数(1,#怪物模型)],
        行走开关=false,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1185,
        销毁=true,
        -- 难度=i
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(魂殿使者)#W一魂殿使者正在#G%s#W场景中四处游玩，各位少侠可以去消灭他们。#G(物品,经验,难度中等)".."#"..取随机数(1,110),刷新地图[1]),频道="xt"})
end

function 自写活动:魂殿殿主()
   local 怪物名称 = {"魂殿殿主"}
   local 怪物模型 = {"吸血鬼"}
   local 地图范围 = {1193}
   local 刷新地图 = {}
   -- 初始化随机序列（如果未定义）
   随机序列 = 随机序列 or 0
   for i=1, #地图范围 do
      local 地图 = 地图范围[i]
      for k=1, 20 do  -- 每张地图生成20个怪物
         local xy = 地图处理类.地图坐标[地图]:取随机点()
         local 任务id = "_"..i.."_"..取随机数(1,99).."1186"..os.time().."_"..随机序列.."_"..取随机数(99,99)
         随机序列 = 随机序列 + 1

         任务数据[任务id] = {
            id = 任务id,
            起始 = os.time(),
            结束 = 3000,  -- 假设3000秒后自动消失
            玩家id = id,
            队伍组 = {},
            名称 = 怪物名称[1],  -- 只有一个怪物名称，直接取第一个
            模型 = 怪物模型[1],  -- 只有一个怪物模型，直接取第一个
            行走开关 = false,
            x = xy.x,
            y = xy.y,
            地图编号 = 地图,
            战斗显示 = true,
            地图名称 = 取地图名称(地图),
            类型 = 1186,
            销毁 = true,
         }
         地图处理类:添加单位(任务id)
      end
      刷新地图[#刷新地图+1] = 取地图名称(地图)
   end
   广播消息({内容 = format("#P(魂殿殿主)#W一群魂殿殿主正在#G%s#W场景中四处游玩，各位少侠可以去消灭他们。#G(物品,经验,难度高)#%d",刷新地图[1], 取随机数(1,110)),频道 = "xt"})
end


function 自写活动:知了先锋()
   --local 怪物名称 = {"知了先锋"}
 -- local 怪物模型 = {"知了王"}
  local 地图范围={1501}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,20 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1187"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3000,
        玩家id=id,
        队伍组={},
        名称="知了先锋",
        模型="进阶百足将军",
        行走开关=true,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1187,
        销毁=true,
        -- 难度=i
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(知了先锋)#W一群知了先锋正在#G%s#W场景中四处游玩，各位少侠可以去消灭他们。#G(物品,经验,难度低)".."#"..取随机数(1,110),刷新地图[1]),频道="xt"})
end

function 自写活动:知了小王()
  -- local 怪物名称 = {"知了小王"}
--  local 怪物模型 = {"知了王"}
  local 地图范围={1501}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,10 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1188"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3000,
        玩家id=id,
        队伍组={},
        名称="知了小王",
        模型="知了王",
        行走开关=false,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1188,
        销毁=true,
        -- 难度=i
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(知了小王)#W一群知了小王正在#G%s#W场景中四处游玩，各位少侠可以去消灭他们。#G(物品,经验,难度低)".."#"..取随机数(1,110),刷新地图[1]),频道="xt"})
end

function 自写活动:知了大王()
 --  local 怪物名称 = {"知了大王"}
 -- local 怪物模型 = {"知了王"}
  local 地图范围={1208}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,20 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1189"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3000,
        玩家id=id,
        队伍组={},
        名称="知了大王",
        模型="知了王",
        行走开关=false,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1189,
        销毁=true,
        -- 难度=i
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(知了大王)#W一群知了大王正在#G%s#W场景中四处游玩，各位少侠可以去消灭他们。#G(物品,经验,难度中)".."#"..取随机数(1,110),刷新地图[1]),频道="xt"})
end

function 自写活动:知了统领()
 --  local 怪物名称 = {"知了统领"}
--  local 怪物模型 = {"知了王"}
  local 地图范围={1208}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,20 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1190"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3000,
        玩家id=id,
        队伍组={},
        名称="知了统领",
        模型="进阶地狱战神",
        行走开关=true,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1190,
        销毁=true,
        -- 难度=i
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(知了统领)#W一群知了统领正在#G%s#W场景中四处游玩，各位少侠可以去消灭他们。#G(物品,经验,难度中)".."#"..取随机数(1,110),刷新地图[1]),频道="xt"})
end

function 自写活动:千年知了王()
 --  local 怪物名称 = {"千年知了王"}
 -- local 怪物模型 = {"知了王"}
  local 地图范围={1173}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,20 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1191"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3000,
        玩家id=id,
        队伍组={},
        名称="千年知了王",
        模型="知了王",
        行走开关=false,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1191,
        销毁=true,
        -- 难度=i
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(千年知了王)#W一群千年知了王正在#G%s#W场景中四处游玩，各位少侠可以去消灭他们。#G(物品,经验,难度高)".."#"..取随机数(1,110),刷新地图[1]),频道="xt"})
end



function 自写活动:一层守护神()
  local 模型= Qu随机角色[取随机数(1,#Qu随机角色)]
--  local 怪物名称 = {"一层守护神"}
--  local 生肖模型 = {"逍遥生"}
  local 地图范围={10041}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,10 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1192"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=600,
        玩家id=id,
        队伍组={},
        名称="一层守护神",
        模型=模型,
        武器=取角色等级武器(模型,120),
        武器等级=120,

        行走开关=false,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1192,
        销毁=true,
        -- 难度=i
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(决战大雁塔一守护神)#W一群妖怪正在#G%s#W场景中四处游玩，各位少侠可以去消灭他们。#G(物品,经验,难度中)".."#"..取随机数(1,110),刷新地图[1]),频道="xt"})
end

function 自写活动:二层守护神()
  local 模型= Qu随机角色[取随机数(1,#Qu随机角色)]
 -- local 怪物名称 = {"二层守护神"}
 --- local 生肖模型 = {"逍遥生"}
  local 地图范围={10051}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,10 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1193"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=600,
        玩家id=id,
        队伍组={},
        名称="二层守护神",
        模型=模型,
        行走开关=false,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1193,
        销毁=true,
        -- 难度=i
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(决战大雁塔二守护神)#W一群妖怪正在#G%s#W场景中四处游玩，各位少侠可以去消灭他们。#G(物品,经验,难度中)".."#"..取随机数(1,110),刷新地图[1]),频道="xt"})
end



function 自写活动:三层守护神()
  local 模型= Qu随机角色[取随机数(1,#Qu随机角色)]
--  local 怪物名称 = {"三层守护神"}
--  local 生肖模型 = {"逍遥生"}
  local 地图范围={10061}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,10 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1194"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=600,
        玩家id=id,
        队伍组={},
        名称="三层守护神",
        模型=模型,
        行走开关=false,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1194,
        销毁=true,
        -- 难度=i
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(决战大雁塔三守护神)#W一群妖怪正在#G%s#W场景中四处游玩，各位少侠可以去消灭他们。#G(物品,经验,难度中)".."#"..取随机数(1,110),刷新地图[1]),频道="xt"})
end

function 自写活动:四层守护神()
   local 模型= Qu随机角色[取随机数(1,#Qu随机角色)]
--  local 怪物名称 = {"四层守护神"}
--  local 生肖模型 = {"逍遥生"}
  local 地图范围={10071}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,10 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1195"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=600,
        玩家id=id,
        队伍组={},
        名称="四层守护神",
        模型=模型,
        行走开关=false,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1195,
        销毁=true,
        -- 难度=i
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(决战大雁塔四守护神)#W一群妖怪正在#G%s#W场景中四处游玩，各位少侠可以去消灭他们。#G(物品,经验,难度难)".."#"..取随机数(1,110),刷新地图[1]),频道="xt"})
end

function 自写活动:五层守护神()
  local 模型= Qu随机角色[取随机数(1,#Qu随机角色)]
 -- local 怪物名称 = {"五层守护神"}
--  local 生肖模型 = {"逍遥生"}
  local 地图范围={10081}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,10 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1196"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=600,
        玩家id=id,
        队伍组={},
        名称="五层守护神",
        模型=模型,
        行走开关=false,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1196,
        销毁=true,
        -- 难度=i
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(决战大雁塔五守护神)#W一群妖怪正在#G%s#W场景中四处游玩，各位少侠可以去消灭他们。#G(物品,经验,难度难)".."#"..取随机数(1,110),刷新地图[1]),频道="xt"})
end

function 自写活动:六层守护神()
  local 模型= Qu随机角色[取随机数(1,#Qu随机角色)]
 -- local 怪物名称 = {"六层守护神"}
 -- local 生肖模型 = {"逍遥生"}
  local 地图范围={10901}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,10 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1197"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=600,
        玩家id=id,
        队伍组={},
        名称="六层守护神",
        模型=模型,
        行走开关=false,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1197,
        销毁=true,
        -- 难度=i
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(决战大雁塔六守护神)#W一群妖怪正在#G%s#W场景中四处游玩，各位少侠可以去消灭他们。#G(物品,经验,难度超难)".."#"..取随机数(1,110),刷新地图[1]),频道="xt"})
end



function 自写活动:七层守护神()
  local 模型= Qu随机角色[取随机数(1,#Qu随机角色)]
 -- local 怪物名称 = {"七层守护神"}
--  local 生肖模型 = {"逍遥生"}
  local 地图范围={10091}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,10 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1198"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=600,
        玩家id=id,
        队伍组={},
        名称="七层守护神",
        模型=模型,
        行走开关=false,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1198,
        销毁=true,
        -- 难度=i
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(决战大雁塔七守护神)#W一群妖怪正在#G%s#W场景中四处游玩，各位少侠可以去消灭他们。#G(物品,经验,难度超难)".."#"..取随机数(1,110),刷新地图[1]),频道="xt"})
end



function 自写活动:琴声悠悠()
--  local 怪物名称 = {"琴声悠悠"}
--  local 生肖模型 = {"进阶琴仙"}
  local 地图范围={1092}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,20 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1500"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3300,
        玩家id=id,
        队伍组={},
        名称="琴声悠悠",
        模型="进阶琴仙",
        行走开关=false,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1500,
        销毁=true,
        -- 难度=i
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(琴声悠悠)#W一群妖怪正在#G%s#W场景中四处游玩，各位少侠可以去消灭他们。#G(物品,经验,难度低)".."#"..取随机数(1,110),刷新地图[1]),频道="xt"})
end


function 自写活动:新春快乐()
--  local 怪物名称 = {"新春快乐"}
  --local 生肖模型 = {"玄珠灵仙"}
  local 地图范围={1207}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,20 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1501"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3300,
        玩家id=id,
        队伍组={},
        名称="新春快乐",
        模型="玄珠灵仙",
        行走开关=false,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1501,
        销毁=true,
        -- 难度=i
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(新春快乐)#W一群妖怪正在#G%s#W场景中四处游玩，各位少侠可以去消灭他们。#G(物品,经验,难度低)".."#"..取随机数(1,110),刷新地图[1]),频道="xt"})
end
function 自写活动:中秋快乐()
 -- local 怪物名称 = {"中秋快乐"}
 -- local 生肖模型 = {"曼珠沙华"}
  local 地图范围={1208}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,20 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1502"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3300,
        玩家id=id,
        队伍组={},
        名称="中秋快乐",
        模型="曼珠沙华",
        行走开关=false,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1502,
        销毁=true,
        -- 难度=i
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(中秋快乐)#W一群妖怪正在#G%s#W场景中四处游玩，各位少侠可以去消灭他们。#G(物品,经验,难度低)".."#"..取随机数(1,110),刷新地图[1]),频道="xt"})
end

function 自写活动:龙神()
  --local 怪物名称 = {"龙神"}
 -- local 生肖模型 = {"蛟龙"}
  local 地图范围={1116}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,20 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1503"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3300,
        玩家id=id,
        队伍组={},
        名称="龙神",
        模型="新蛟龙",
        行走开关=false,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1503,
        销毁=true,
        -- 难度=i
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(龙神)#W一群妖怪正在#G%s#W场景中四处游玩，各位少侠可以去消灭他们。#G(物品,经验,难度低)".."#"..取随机数(1,110),刷新地图[1]),频道="xt"})
end

function 自写活动:仙气十足()
 -- local 怪物名称 = {"仙气十足"}
--  local 生肖模型 = {"妙华天女"}
  local 地图范围={1207}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,20 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1504"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3300,
        玩家id=id,
        队伍组={},
        名称="仙气十足",  --怪物名称[i]
        模型="妙华天女",
        行走开关=false,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1504,
        销毁=true,
        -- 难度=i
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(仙气十足)#W一群妖怪正在#G%s#W场景中四处游玩，各位少侠可以去消灭他们。#G(物品,经验,难度低)".."#"..取随机数(1,110),刷新地图[1]),频道="xt"})
end

-- function 自写活动:武神坛服战8强()
--     local 锦衣 = {"青花瓷","浮生"}
--     local 造型 = {"龙太子","虎头怪","剑侠客","神天兵","巨魔王","逍遥生","偃无师"}
--     local 地图范围 = {1207,1193,1070,1122,1146,1040,1208,1226}
--     -- 随机选择锦衣、造型和地图
--     local 随机锦衣 = 锦衣[取随机数(1, #锦衣)]
--     local 随机造型 = 造型[取随机数(1, #造型)]
--     local 随机地图 = 地图范围[取随机数(1, #地图范围)]
--     local 武器级别 = 160
--     -- 在选定的地图上生成2个怪物
--     for i = 1, 2 do
--         local xy = 地图处理类.地图坐标[随机地图]:取随机点()
--         local 任务id = "_"..i.."_"..取随机数(1,99).."1505"..os.time().."_"..随机序列.."_"..取随机数(99,99)
--         随机序列 = 随机序列 + 1
--         任务数据[任务id] = {
--             id = 任务id,
--             起始 = os.time(),
--             结束 = 3300,
--             玩家id = id,
--             队伍组 = {},
--             名称 = "武神坛服战8强",
--             锦衣 = 随机锦衣,
--             模型 = 随机造型,
--             武器 = 取角色等级武器(随机造型, 武器级别),
--             武器等级 = 武器级别,
--             行走开关 = false,
--             x = xy.x,
--             y = xy.y,
--             地图编号 = 随机地图,
--             战斗显示 = true,
--             地图名称 = 取地图名称(随机地图),
--             类型 = 1505,
--             销毁 = true,
--         }
--         地图处理类:添加单位(任务id)
--     end
--     广播消息({
--         内容 = format("#P(武神坛服战8强)#W一群妖怪正在#G%s#W场景中四处游玩，各位少侠可以去消灭他们。#G(物品,经验,难度中)".."#"..取随机数(1,110), 取地图名称(随机地图)),
--         频道 = "xt"
--     })
-- end
-- function 自写活动:武神坛服战4强()
--     local 锦衣 = {"青花瓷","浮生"}
--     local 造型 = {"龙太子","虎头怪","剑侠客","神天兵","巨魔王","逍遥生","偃无师"}
--     local 地图范围 = {1207,1193,1070,1122,1146,1040,1208,1226}
--     -- 随机选择锦衣、造型和地图
--     local 随机锦衣 = 锦衣[取随机数(1, #锦衣)]
--     local 随机造型 = 造型[取随机数(1, #造型)]
--     local 随机地图 = 地图范围[取随机数(1, #地图范围)]
--     local 武器级别 = 160
--     -- 在选定的地图上生成2个怪物
--     for i = 1, 2 do
--         local xy = 地图处理类.地图坐标[随机地图]:取随机点()
--         local 任务id = "_"..i.."_"..取随机数(1,99).."1506"..os.time().."_"..随机序列.."_"..取随机数(99,99)
--         随机序列 = 随机序列 + 1
--         任务数据[任务id] = {
--             id = 任务id,
--             起始 = os.time(),
--             结束 = 3300,
--             玩家id = id,
--             队伍组 = {},
--             名称 = "武神坛服战4强",
--             锦衣 = 随机锦衣,
--             模型 = 随机造型,
--             武器 = 取角色等级武器(随机造型, 武器级别),
--             武器等级 = 武器级别,
--             行走开关 = false,
--             x = xy.x,
--             y = xy.y,
--             地图编号 = 随机地图,
--             战斗显示 = true,
--             地图名称 = 取地图名称(随机地图),
--             类型 = 1506,
--             销毁 = true,
--         }
--         地图处理类:添加单位(任务id)
--     end
--     广播消息({
--         内容 = format("#P(武神坛服战4强)#W一群妖怪正在#G%s#W场景中四处游玩，各位少侠可以去消灭他们。#G(物品,经验,难度中)".."#"..取随机数(1,110), 取地图名称(随机地图)),
--         频道 = "xt"
--     })
-- end
-- function 自写活动:武神坛服战季军()
--     local 锦衣 = {"青花瓷","浮生"}
--     local 造型 = {"龙太子","虎头怪","剑侠客","神天兵","巨魔王","逍遥生","偃无师"}
--     local 地图范围 = {1207,1193,1070,1122,1146,1040,1208,1226}
--     -- 随机选择锦衣、造型和地图
--     local 随机锦衣 = 锦衣[取随机数(1, #锦衣)]
--     local 随机造型 = 造型[取随机数(1, #造型)]
--     local 随机地图 = 地图范围[取随机数(1, #地图范围)]
--     local 武器级别 = 160
--     -- 在选定的地图上生成2个怪物
--     for i = 1, 2 do
--         local xy = 地图处理类.地图坐标[随机地图]:取随机点()
--         local 任务id = "_"..i.."_"..取随机数(1,99).."1507"..os.time().."_"..随机序列.."_"..取随机数(99,99)
--         随机序列 = 随机序列 + 1
--         任务数据[任务id] = {
--             id = 任务id,
--             起始 = os.time(),
--             结束 = 3300,
--             玩家id = id,
--             队伍组 = {},
--             名称 = "武神坛服战季军",
--             锦衣 = 随机锦衣,
--             模型 = 随机造型,
--             武器 = 取角色等级武器(随机造型, 武器级别),
--             武器等级 = 武器级别,
--             行走开关 = false,
--             x = xy.x,
--             y = xy.y,
--             地图编号 = 随机地图,
--             战斗显示 = true,
--             地图名称 = 取地图名称(随机地图),
--             类型 = 1507,
--             销毁 = true,
--         }
--         地图处理类:添加单位(任务id)
--     end
--     广播消息({
--         内容 = format("#P(武神坛服战季军)#W一群妖怪正在#G%s#W场景中四处游玩，各位少侠可以去消灭他们。#G(物品,经验,难度中)".."#"..取随机数(1,110), 取地图名称(随机地图)),
--         频道 = "xt"
--     })
-- end
-- function 自写活动:武神坛服战亚军()
--     local 锦衣 = {"青花瓷","浮生"}
--     local 造型 = {"龙太子","虎头怪","剑侠客","神天兵","巨魔王","逍遥生","偃无师"}
--     local 地图范围 = {1207,1193,1070,1122,1146,1040,1208,1226}
--     -- 随机选择锦衣、造型和地图
--     local 随机锦衣 = 锦衣[取随机数(1, #锦衣)]
--     local 随机造型 = 造型[取随机数(1, #造型)]
--     local 随机地图 = 地图范围[取随机数(1, #地图范围)]
--     local 武器级别 = 160
--     -- 在选定的地图上生成2个怪物
--     for i = 1, 2 do
--         local xy = 地图处理类.地图坐标[随机地图]:取随机点()
--         local 任务id = "_"..i.."_"..取随机数(1,99).."1508"..os.time().."_"..随机序列.."_"..取随机数(99,99)
--         随机序列 = 随机序列 + 1
--         任务数据[任务id] = {
--             id = 任务id,
--             起始 = os.time(),
--             结束 = 3300,
--             玩家id = id,
--             队伍组 = {},
--             名称 = "武神坛服战亚军",
--             锦衣 = 随机锦衣,
--             模型 = 随机造型,
--             武器 = 取角色等级武器(随机造型, 武器级别),
--             武器等级 = 武器级别,
--             行走开关 = false,
--             x = xy.x,
--             y = xy.y,
--             地图编号 = 随机地图,
--             战斗显示 = true,
--             地图名称 = 取地图名称(随机地图),
--             类型 = 1508,
--             销毁 = true,
--         }
--         地图处理类:添加单位(任务id)
--     end
--     广播消息({
--         内容 = format("#P(武神坛服战亚军)#W一群妖怪正在#G%s#W场景中四处游玩，各位少侠可以去消灭他们。#G(物品,经验,难度高)".."#"..取随机数(1,110), 取地图名称(随机地图)),
--         频道 = "xt"
--     })
-- end
-- function 自写活动:武神坛服战冠军()
--     local 锦衣 = {"青花瓷","浮生"}
--     local 造型 = {"龙太子","虎头怪","剑侠客","神天兵","巨魔王","逍遥生","偃无师"}
--     local 地图范围 = {1207,1193,1070,1122,1146,1040,1208,1226}
--     -- 随机选择锦衣、造型和地图
--     local 随机锦衣 = 锦衣[取随机数(1, #锦衣)]
--     local 随机造型 = 造型[取随机数(1, #造型)]
--     local 随机地图 = 地图范围[取随机数(1, #地图范围)]
--     local 武器级别 = 160
--     -- 在选定的地图上生成2个怪物
--     for i = 1, 2 do
--         local xy = 地图处理类.地图坐标[随机地图]:取随机点()
--         local 任务id = "_"..i.."_"..取随机数(1,99).."1509"..os.time().."_"..随机序列.."_"..取随机数(99,99)
--         随机序列 = 随机序列 + 1
--         任务数据[任务id] = {
--             id = 任务id,
--             起始 = os.time(),
--             结束 = 3300,
--             玩家id = id,
--             队伍组 = {},
--             名称 = "武神坛服战冠军",
--             锦衣 = 随机锦衣,
--             模型 = 随机造型,
--             武器 = 取角色等级武器(随机造型, 武器级别),
--             武器等级 = 武器级别,
--             行走开关 = false,
--             x = xy.x,
--             y = xy.y,
--             地图编号 = 随机地图,
--             战斗显示 = true,
--             地图名称 = 取地图名称(随机地图),
--             类型 = 1509,
--             销毁 = true,
--         }
--         地图处理类:添加单位(任务id)
--     end
--     广播消息({
--         内容 = format("#P(武神坛服战冠军)#W一群妖怪正在#G%s#W场景中四处游玩，各位少侠可以去消灭他们。#G(物品,经验,难度低)".."#"..取随机数(1,110), 取地图名称(随机地图)),
--         频道 = "xt"
--     })
-- end
function 自写活动:客服小二()
    local 地图范围 = {1207, 1193, 1070, 1122, 1146, 1040, 1208, 1226}
    local 随机地图 = 地图范围[取随机数(1, #地图范围)]  -- 随机选择其中一个地图
    local 刷新地图名称 = 取地图名称(随机地图)  -- 获取地图名称用于广播
    -- 在该地图上刷新2个怪物
    for i = 1, 10 do
        local xy = 地图处理类.地图坐标[随机地图]:取随机点()
        local 任务id = "_" .. i .. "_" .. 取随机数(1, 99) .. "1510" .. os.time() .. "_" .. 随机序列 .. "_" .. 取随机数(99, 99)
        随机序列 = 随机序列 + 1
        任务数据[任务id] = {
            id = 任务id,
            起始 = os.time(),
            结束 = 3300,
            玩家id = id,
            队伍组 = {},
            名称 = "客服小二",
            模型 = "客服小妹",
            行走开关 = true,
            x = xy.x,
            y = xy.y,
            地图编号 = 随机地图,
            战斗显示 = true,
            地图名称 = 刷新地图名称,
            类型 = 1510,
            销毁 = true,
        }
        地图处理类:添加单位(任务id)
    end
    -- 广播消息，提示刷新的地图
    广播消息({
        内容 = format("#P(客服小二)#W妖怪正在#G%s#W场景中游玩，各位少侠可以去消灭他们。#G(物品,经验,难度超高)" .. "#" .. 取随机数(1, 110), 刷新地图名称),
        频道 = "xt"
    })
end

function 自写活动:武神坛服战()
    --local 锦衣 = {"青花瓷","浮生"}
    local 锦衣={"青花瓷","浮生","浮生绡·点黛","小福兔·月白","春日宴","旃檀香·墨黑","灼灼韶华","青花瓷月白","青花瓷月黑"}
    local 造型 = {"龙太子","虎头怪","剑侠客","神天兵","巨魔王","逍遥生","鬼潇潇","飞燕女","玄彩娥","桃夭夭"}
   -- local 地图范围 = {1207,1193,1070,1122,1146,1040,1208,1226}
    local 地图范围 = {1228,1207,1216,1242,1920,1203,1232}
    -- 随机选择锦衣、造型和地图
    local 随机锦衣 = 锦衣[取随机数(1, #锦衣)]
    local 随机造型 = 造型[取随机数(1, #造型)]
    local 随机地图 = 地图范围[取随机数(1, #地图范围)]
    local 武器级别 = 160
    -- 在选定的地图上生成2个怪物
    for i = 1, 5 do
        local xy = 地图处理类.地图坐标[随机地图]:取随机点()
        local 任务id = "_"..i.."_"..取随机数(1,99).."1532"..os.time().."_"..随机序列.."_"..取随机数(99,99)
        随机序列 = 随机序列 + 1
        任务数据[任务id] = {
            id = 任务id,
            起始 = os.time(),
            结束 = 3300,
            玩家id = id,
            队伍组 = {},
            名称 = "武神坛服战",
            锦衣 = 随机锦衣,
            模型 = 随机造型,
            武器 = 取角色等级武器(随机造型, 武器级别),
            武器等级 = 武器级别,
            行走开关 = true,
            x = xy.x,
            y = xy.y,
            地图编号 = 随机地图,
            战斗显示 = true,
            地图名称 = 取地图名称(随机地图),
            类型 = 1532,
            销毁 = false,--true,
        }
        地图处理类:添加单位(任务id)
    end
    广播消息({
        内容 = format("#P(武神坛服战)#W服战选手们正在#G%s#W场景中四处游玩，各位少侠可以去挑战他们。#G(物品,经验,难度自选)".."#"..取随机数(1,110), 取地图名称(随机地图)),
        频道 = "xt"
    })
end


function 自写活动:醉凡尘()
 --   local 怪物名称 = {"醉凡尘"}
 --   local 怪物造型 = {"剑侠客"}
    local 地图范围={1232}
    local 随机地图 = 地图范围[取随机数(1, #地图范围)]
    for i = 1, 15 do
        local xy = 地图处理类.地图坐标[随机地图]:取随机点()
        local 任务id = "_"..i.."_"..取随机数(1,99).."1533"..os.time().."_"..随机序列.."_"..取随机数(99,99)
        随机序列 = 随机序列 + 1
        任务数据[任务id] = {
            id = 任务id,
            起始 = os.time(),
            结束 = 3300,
            玩家id = id,
            队伍组 = {},
            名称="醉凡尘",
            模型="剑侠客",
            武器="斩妖泣血",
            染色方案=2,
            染色组={[1]=5,[2]=3,[3]=3},
            称谓="★★★★★★★",
            行走开关 = true,
            x = xy.x,
            y = xy.y,
            地图编号 = 随机地图,
            战斗显示 = true,
            地图名称 = 取地图名称(随机地图),
            类型 = 1533,
            销毁 = true,
        }
        地图处理类:添加单位(任务id)
    end
    广播消息({
        内容 = format("#P(醉凡尘)#W/平生自在任逍遥，笑看江湖醉凡尘，凡尘仙出现在#G%s#W附近，请各位少侠们，前去挑战。#G(难度7)".."#"..取随机数(1,110), 取地图名称(随机地图)),
        频道 = "xt"
    })
end

function 自写活动:仙魔灵墟()
  local 怪物名称 = {"仙魔灵墟","仙魔灵墟","仙魔灵墟","仙魔灵墟","仙魔灵墟","仙魔灵墟","仙魔灵墟","仙魔灵墟","仙魔灵墟","仙魔灵墟","仙魔灵墟","仙魔灵墟","仙魔灵墟","仙魔灵墟","仙魔灵墟","仙魔灵墟","仙魔灵墟","仙魔灵墟","仙魔灵墟","仙魔灵墟","仙魔灵墟"}
  local 怪物造型 = {"精灵女皇","镇妖塔守卫","武神坛使者","女帝","金龙使者","孔雀女皇","暗黑剑圣","斩妖","灵蝶仙子","风琴神女","之祠","龙鲤仙子","刀圣","琵琶神女","天界守卫","瑶池仙女","赤焰战神","宝塔天王","西域女王","冰轮丸","八卦阵灵"}
    local 地图范围 = {1242}
    local 随机地图 = 地图范围[取随机数(1, #地图范围)]
    for i = 1, 15 do
        local xy = 地图处理类.地图坐标[随机地图]:取随机点()
        local 任务id = "_"..i.."_"..取随机数(1,99).."1534"..os.time().."_"..随机序列.."_"..取随机数(99,99)
        随机序列 = 随机序列 + 1
        任务数据[任务id] = {
            id = 任务id,
            起始 = os.time(),
            结束 = 3300,
            玩家id = id,
            队伍组 = {},
            名称=怪物名称[i],
            模型=怪物造型[取随机数(1,#怪物造型)],
            称谓="★★★★★★★",
            行走开关 = true,
            x = xy.x,
            y = xy.y,
            地图编号 = 随机地图,
            战斗显示 = true,
            地图名称 = 取地图名称(随机地图),
            类型 = 1534,
            销毁 = true,
        }
        地图处理类:添加单位(任务id)
    end
    广播消息({
        内容 = format("#P(仙魔灵墟)#W/天裂三百年仙骨堕凡尘，这仙魔颠倒的乱世，你我皆在劫中，仙魔至尊出现在#G%s#W附近，请各位少侠们，前去挑战。#G(难度7)".."#"..取随机数(1,110), 取地图名称(随机地图)),
        频道 = "xt"
    })
end

function 自写活动:云生梦泽()
  local 怪物名称 = {"云生梦泽","云生梦泽","云生梦泽","云生梦泽","云生梦泽","云生梦泽","云生梦泽","云生梦泽","云生梦泽","云生梦泽","云生梦泽","云生梦泽","云生梦泽","云生梦泽","云生梦泽"}
  local 怪物造型 = {"进阶超级神虎(壬寅)","进阶超级飞廉","进阶超级离火兽","进阶超级神兔(癸卯)睡梦","进阶超级鲲鹏","进阶超级神牛(辛丑)","进阶超级有熊","进阶超级神猪","进阶超级红孩儿","进阶超级神柚","进阶超级神狗"}
    local 地图范围 = {1251}
    local 随机地图 = 地图范围[取随机数(1, #地图范围)]
    for i = 1, 15 do
        local xy = 地图处理类.地图坐标[随机地图]:取随机点()
        local 任务id = "_"..i.."_"..取随机数(1,99).."1535"..os.time().."_"..随机序列.."_"..取随机数(99,99)
        随机序列 = 随机序列 + 1
        任务数据[任务id] = {
            id = 任务id,
            起始 = os.time(),
            结束 = 3300,
            玩家id = id,
            队伍组 = {},
            名称=怪物名称[i],
            模型=怪物造型[取随机数(1,#怪物造型)],
            称谓="★★★★★★★",
            行走开关 = true,
            x = xy.x,
            y = xy.y,
            地图编号 = 随机地图,
            战斗显示 = true,
            地图名称 = 取地图名称(随机地图),
            类型 = 1535,
            销毁 = true,
        }
        地图处理类:添加单位(任务id)
    end
    广播消息({
        内容 = format("#P(云生梦泽)#W/福如东海寿比南山，东海之滨的奇珍异兽们出现在#G%s#W附近，请各位少侠们，前去挑战。#G(难度7)".."#"..取随机数(1,110), 取地图名称(随机地图)),
        频道 = "xt"
    })
end

--------------------------------------------------------------炎海----------------------------------------------------
function 自写活动:沸涌炎海的信标(id)
  local 怪物名称 = {"沸涌炎海巡守","沸涌炎海帝子","沸涌炎海统御"}
  local 生肖模型 = {"食铁兽","火月蛙","炎魔神"}
  local 地图范围={5001}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,15 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1999,11111).."1187.1"..os.time().."_"..随机序列.."_"..取随机数(88,99999999)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3000,
        可见id=id,
        玩家id=id,
        队伍组={},
        名称=怪物名称[i],
        模型=生肖模型[取随机数(1,#生肖模型)],
        称谓="★★★★★★★★★★",
        行走开关=true,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1187.1,
        销毁=true,
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
   广播消息({内容=format("#S神秘人打开了【沸涌炎海】的封印#G%s#W珠光宝气、霞光满天，究竟是福是祸，犹未可知#G(难度10)#W".."#"..取随机数(1,110),刷新地图[1],刷新地图[2]),频道="xt"})
end
----------------------
function 自写活动:完成沸涌炎海的信标(id组)
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(2000,2100)
        local 银子=平均等级*取随机数(1000,1500)
        local 仙玉=平均等级*2
        local 通知开关=true
        local 奖励参数=取随机数(1,100)
        玩家数据[id].角色:添加经验(经验,"沸涌炎海的信标",1)
        玩家数据[id].角色:添加银子(银子,"沸涌炎海的信标",1)
        玩家数据[id].角色:添加仙玉(仙玉,"沸涌炎海的信标",1)

        local 奖励参数=取随机数()
        if 奖励参数<=10 then
        elseif 奖励参数<=11 then
            玩家数据[id].道具:给予道具(id,"奖池抽奖",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"奖池抽奖"),频道="xt"})
        elseif 奖励参数<=15  then
            玩家数据[id].道具:给予道具(id,"星辉石",1)
               广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"星辉石"),频道="xt"})
        elseif 奖励参数<=24  then
            玩家数据[id].道具:给予道具(id,"特殊兽诀·碎片",3)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,3),玩家数据[id].角色.名称,"特殊兽诀·碎片"),频道="xt"})
        elseif 奖励参数<=26 then
            玩家数据[id].道具:给予道具(id,"超级兽诀·碎片",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"超级兽诀·碎片"),频道="xt"})
        elseif 奖励参数<=30 then
            玩家数据[id].道具:给予道具(id,"玉刚卯",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"玉刚卯"),频道="xt"})
        elseif 奖励参数<=38 then
            玩家数据[id].道具:给予道具(id,"凤纹灵坠",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"凤纹灵坠"),频道="xt"})
        elseif 奖励参数<=35 then
            玩家数据[id].道具:给予道具(id,"词条洗练石",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"词条洗练石"),频道="xt"})
        elseif 奖励参数<=45 then
            玩家数据[id].道具:给予道具(id,"特效宝珠",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"特效宝珠"),频道="xt"})
        elseif 奖励参数<=50 then
            玩家数据[id].道具:给予道具(id,"观照万象碎片",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"观照万象碎片"),频道="xt"})
        elseif 奖励参数<=60 then
            玩家数据[id].道具:给予道具(id,"焕彩石",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"焕彩石"),频道="xt"})
        elseif 奖励参数<=70 then
            玩家数据[id].道具:给予道具(id,"五彩神石",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"五彩神石"),频道="xt"})
        elseif 奖励参数<=80 then
            玩家数据[id].道具:给予道具(id,"青花瓷锦衣·碎片",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"青花瓷锦衣·碎片"),频道="xt"})
        elseif 奖励参数<=85 then
            玩家数据[id].道具:给予道具(id,"装备词条石",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"装备词条石"),频道="xt"})
        elseif 奖励参数<=90 then
            玩家数据[id].道具:给予道具(id,"装备属性石",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"装备属性石"),频道="xt"})
        elseif 奖励参数<=95 then
            玩家数据[id].道具:给予道具(id,"词条属性石",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"词条属性石"),频道="xt"})
        elseif 奖励参数<=100 then
            玩家数据[id].道具:给予道具(id,"灵饰洗练石",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"灵饰洗练石"),频道="xt"})

        end
    end
end
----------------------------------------------------------------------------------------------------------------------------------------
function 自写活动:钢铁炼境的信标(id)
  local 怪物名称 = {"钢铁炼境巡守","钢铁炼境帝子","钢铁炼境统御"}
  local 生肖模型 = {"进阶白熊","进阶黑山老妖","进阶地狱战神"}
  local 地图范围={1241}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,15 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1999,11111).."1187.2"..os.time().."_"..随机序列.."_"..取随机数(88,99999999)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3000,
        可见id=id,
        玩家id=id,
        队伍组={},
        名称=怪物名称[i],
        模型=生肖模型[取随机数(1,#生肖模型)],
        称谓="★★★★★★★★★★",
        行走开关=true,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1187.2,
        销毁=true,
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
   广播消息({内容=format("#S神秘人打开了【钢铁炼境】的封印#G%s#W珠光宝气、霞光满天，究竟是福是祸，犹未可知#G(难度10)#W".."#"..取随机数(1,110),刷新地图[1],刷新地图[2]),频道="xt"})
end
-----
function 自写活动:完成钢铁炼境的信标(id组)
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(2200,2300)
        local 银子=平均等级*取随机数(1200,1700)
        local 仙玉=平均等级*3
        local 通知开关=true
        local 奖励参数=取随机数(1,112)
        玩家数据[id].角色:添加经验(经验,"钢铁炼境的信标",1)
        玩家数据[id].角色:添加银子(银子,"钢铁炼境的信标",1)
        玩家数据[id].角色:添加仙玉(仙玉,"钢铁炼境的信标",1)

 local 奖励参数=取随机数()
        if 奖励参数<=10 then
        elseif 奖励参数<=11 then
            玩家数据[id].道具:给予道具(id,"奖池抽奖",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"奖池抽奖"),频道="xt"})
        elseif 奖励参数<=15  then
            玩家数据[id].道具:给予道具(id,"星辉石",1)
               广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"星辉石"),频道="xt"})
        elseif 奖励参数<=24  then
            玩家数据[id].道具:给予道具(id,"特殊兽诀·碎片",3)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,3),玩家数据[id].角色.名称,"特殊兽诀·碎片"),频道="xt"})
        elseif 奖励参数<=26 then
            玩家数据[id].道具:给予道具(id,"超级兽诀·碎片",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"超级兽诀·碎片"),频道="xt"})
        elseif 奖励参数<=30 then
            玩家数据[id].道具:给予道具(id,"玉刚卯",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"玉刚卯"),频道="xt"})
        elseif 奖励参数<=38 then
            玩家数据[id].道具:给予道具(id,"凤纹灵坠",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"凤纹灵坠"),频道="xt"})
        elseif 奖励参数<=35 then
            玩家数据[id].道具:给予道具(id,"词条洗练石",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"词条洗练石"),频道="xt"})
        elseif 奖励参数<=45 then
            玩家数据[id].道具:给予道具(id,"特效宝珠",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"特效宝珠"),频道="xt"})
        elseif 奖励参数<=50 then
            玩家数据[id].道具:给予道具(id,"观照万象碎片",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"观照万象碎片"),频道="xt"})
        elseif 奖励参数<=60 then
            玩家数据[id].道具:给予道具(id,"焕彩石",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"焕彩石"),频道="xt"})
        elseif 奖励参数<=70 then
            玩家数据[id].道具:给予道具(id,"五彩神石",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"五彩神石"),频道="xt"})
        elseif 奖励参数<=80 then
            玩家数据[id].道具:给予道具(id,"青花瓷锦衣·碎片",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"青花瓷锦衣·碎片"),频道="xt"})
        elseif 奖励参数<=85 then
            玩家数据[id].道具:给予道具(id,"装备词条石",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"装备词条石"),频道="xt"})
        elseif 奖励参数<=90 then
            玩家数据[id].道具:给予道具(id,"装备属性石",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"装备属性石"),频道="xt"})
        elseif 奖励参数<=95 then
            玩家数据[id].道具:给予道具(id,"词条属性石",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"词条属性石"),频道="xt"})
        elseif 奖励参数<=100 then
            玩家数据[id].道具:给予道具(id,"灵饰洗练石",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"灵饰洗练石"),频道="xt"})

        end
    end
end
----------------------------------------------------------------------------------------------------------------------------------------
function 自写活动:雷鸣废土的信标(id)
  local 怪物名称 = {"雷鸣废土巡守","雷鸣废土帝子","雷鸣废土统御"}
  local 生肖模型 = {"进阶雨师","净瓶女娲","进阶雷龙"}
  local 地图范围={1885}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,15 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1999,11111).."1187.3"..os.time().."_"..随机序列.."_"..取随机数(88,99999999)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        可见id=id,
        玩家id=id,
        起始=os.time(),
        结束=3000,
        队伍组={},
        名称=怪物名称[i],
        模型=生肖模型[取随机数(1,#生肖模型)],
        称谓="★★★★★★★★★★",
        行走开关=true,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1187.3,
        销毁=true,
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
   广播消息({内容=format("#S神秘人打开了【雷鸣废土】的封印#G%s#W珠光宝气、霞光满天，究竟是福是祸，犹未可知#G(难度10)#W".."#"..取随机数(1,110),刷新地图[1],刷新地图[2]),频道="xt"})
end
-----
function 自写活动:完成雷鸣废土的信标(id组)
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(2500,2600)
        local 银子=平均等级*取随机数(1500,2000)
        local 仙玉=平均等级*4
        local 通知开关=true
        local 奖励参数=取随机数(1,115)
        玩家数据[id].角色:添加经验(经验,"雷鸣废土的信标",1)
        玩家数据[id].角色:添加银子(银子,"雷鸣废土的信标",1)
        玩家数据[id].角色:添加仙玉(仙玉,"雷鸣废土的信标",1)


local 奖励参数=取随机数()
        if 奖励参数<=10 then
        elseif 奖励参数<=12 then
            玩家数据[id].道具:给予道具(id,"奖池抽奖",1)
              广播消息({内容=format("#S【雷鸣废土的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"奖池抽奖"),频道="xt"})
        elseif 奖励参数<=20  then
            玩家数据[id].道具:给予道具(id,"特殊兽诀·碎片",3)
              广播消息({内容=format("#S【雷鸣废土的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,3),玩家数据[id].角色.名称,"特殊兽诀·碎片"),频道="xt"})
        elseif 奖励参数<=25 then
            玩家数据[id].道具:给予道具(id,"超级兽诀·碎片",1)
              广播消息({内容=format("#S【雷鸣废土的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"超级兽诀·碎片"),频道="xt"})
        elseif 奖励参数<=33 then
            玩家数据[id].道具:给予道具(id,"玉刚卯",1)
              广播消息({内容=format("#S【雷鸣废土的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"玉刚卯"),频道="xt"})
        elseif 奖励参数<=36 then
            玩家数据[id].道具:给予道具(id,"凤纹灵坠",1)
              广播消息({内容=format("#S【雷鸣废土的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"凤纹灵坠"),频道="xt"})
        elseif 奖励参数<=35 then
            玩家数据[id].道具:给予道具(id,"词条洗练石",1)
              广播消息({内容=format("#S【雷鸣废土的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"词条洗练石"),频道="xt"})
        elseif 奖励参数<=45 then
            玩家数据[id].道具:给予道具(id,"特效宝珠",1)
              广播消息({内容=format("#S【雷鸣废土的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"特效宝珠"),频道="xt"})
        elseif 奖励参数<=50 then
            玩家数据[id].道具:给予道具(id,"观照万象碎片",1)
              广播消息({内容=format("#S【雷鸣废土的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"观照万象碎片"),频道="xt"})
        elseif 奖励参数<=60 then
            玩家数据[id].道具:给予道具(id,"焕彩石",1)
              广播消息({内容=format("#S【雷鸣废土的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"焕彩石"),频道="xt"})
        elseif 奖励参数<=70 then
            玩家数据[id].道具:给予道具(id,"五彩神石",1)
              广播消息({内容=format("#S【雷鸣废土的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"五彩神石"),频道="xt"})
        elseif 奖励参数<=80 then
            玩家数据[id].道具:给予道具(id,"青花瓷锦衣·碎片",1)
              广播消息({内容=format("#S【雷鸣废土的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"青花瓷锦衣·碎片"),频道="xt"})
        elseif 奖励参数<=85 then
            玩家数据[id].道具:给予道具(id,"装备词条石",1)
              广播消息({内容=format("#S【雷鸣废土的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"装备词条石"),频道="xt"})
        elseif 奖励参数<=90 then
            玩家数据[id].道具:给予道具(id,"装备属性石",1)
              广播消息({内容=format("#S【雷鸣废土的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"装备属性石"),频道="xt"})
        elseif 奖励参数<=95 then
            玩家数据[id].道具:给予道具(id,"词条属性石",1)
              广播消息({内容=format("#S【雷鸣废土的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"词条属性石"),频道="xt"})
        elseif 奖励参数<=100 then
            玩家数据[id].道具:给予道具(id,"灵饰洗练石",1)
              广播消息({内容=format("#S【雷鸣废土的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"灵饰洗练石"),频道="xt"})

        end
    end
end
--------------------------------------------------------------------------------------------------------------------------------------
function 自写活动:幽夜暗域的信标(id)
  local 怪物名称 = {"幽夜暗域巡守","幽夜暗域帝子","幽夜暗域统御"}
  local 生肖模型 = {"雷龙","进阶谛听","风祖飞廉"}
  local 地图范围={1223}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,15 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1999,11111).."1187.4"..os.time().."_"..随机序列.."_"..取随机数(88,99999999)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        可见id=id,
        玩家id=id,
        起始=os.time(),
        结束=3000,
        队伍组={},
        名称=怪物名称[i],
        模型=生肖模型[取随机数(1,#生肖模型)],
        称谓="★★★★★★★★★★",
        行走开关=true,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1187.4,
        销毁=true,
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
   广播消息({内容=format("#S神秘人打开了【幽夜暗域】的封印#G%s#W珠光宝气、霞光满天，究竟是福是祸，犹未可知#G(难度10)#W".."#"..取随机数(1,110),刷新地图[1],刷新地图[2]),频道="xt"})
end
-----
function 自写活动:完成幽夜暗域的信标(id组)
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(2700,2800)
        local 银子=平均等级*取随机数(1500,2500)
        local 仙玉=平均等级*5
        local 通知开关=true
        local 奖励参数=取随机数(1,122)
        玩家数据[id].角色:添加经验(经验,"幽夜暗域的信标",1)
        玩家数据[id].角色:添加银子(银子,"幽夜暗域的信标",1)
        玩家数据[id].角色:添加仙玉(仙玉,"幽夜暗域的信标",1)

 local 奖励参数=取随机数()
        if 奖励参数<=10 then
        elseif 奖励参数<=13 then
            玩家数据[id].道具:给予道具(id,"奖池抽奖",1)
              广播消息({内容=format("#S【幽夜暗域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"奖池抽奖"),频道="xt"})
        elseif 奖励参数<=20  then
            玩家数据[id].道具:给予道具(id,"特殊兽诀·碎片",3)
              广播消息({内容=format("#S【幽夜暗域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,3),玩家数据[id].角色.名称,"特殊兽诀·碎片"),频道="xt"})
        elseif 奖励参数<=25 then
            玩家数据[id].道具:给予道具(id,"超级兽诀·碎片",1)
              广播消息({内容=format("#S【幽夜暗域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"超级兽诀·碎片"),频道="xt"})
        elseif 奖励参数<=30 then
            玩家数据[id].道具:给予道具(id,"玉刚卯",1)
              广播消息({内容=format("#S【幽夜暗域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"玉刚卯"),频道="xt"})
        elseif 奖励参数<=38 then
            玩家数据[id].道具:给予道具(id,"凤纹灵坠",1)
              广播消息({内容=format("#S【幽夜暗域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"凤纹灵坠"),频道="xt"})
        elseif 奖励参数<=35 then
            玩家数据[id].道具:给予道具(id,"词条洗练石",1)
              广播消息({内容=format("#S【幽夜暗域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"词条洗练石"),频道="xt"})
        elseif 奖励参数<=45 then
            玩家数据[id].道具:给予道具(id,"特效宝珠",1)
              广播消息({内容=format("#S【幽夜暗域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"特效宝珠"),频道="xt"})
        elseif 奖励参数<=50 then
            玩家数据[id].道具:给予道具(id,"观照万象碎片",1)
              广播消息({内容=format("#S【幽夜暗域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"观照万象碎片"),频道="xt"})
        elseif 奖励参数<=60 then
            玩家数据[id].道具:给予道具(id,"焕彩石",1)
              广播消息({内容=format("#S【幽夜暗域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"焕彩石"),频道="xt"})
        elseif 奖励参数<=70 then
            玩家数据[id].道具:给予道具(id,"五彩神石",1)
              广播消息({内容=format("#S【幽夜暗域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"五彩神石"),频道="xt"})
        elseif 奖励参数<=80 then
            玩家数据[id].道具:给予道具(id,"青花瓷锦衣·碎片",1)
              广播消息({内容=format("#S【幽夜暗域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"青花瓷锦衣·碎片"),频道="xt"})
        elseif 奖励参数<=85 then
            玩家数据[id].道具:给予道具(id,"装备词条石",1)
              广播消息({内容=format("#S【幽夜暗域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"装备词条石"),频道="xt"})
        elseif 奖励参数<=90 then
            玩家数据[id].道具:给予道具(id,"装备属性石",1)
              广播消息({内容=format("#S【幽夜暗域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"装备属性石"),频道="xt"})
        elseif 奖励参数<=95 then
            玩家数据[id].道具:给予道具(id,"词条属性石",1)
              广播消息({内容=format("#S【幽夜暗域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"词条属性石"),频道="xt"})
        elseif 奖励参数<=100 then
            玩家数据[id].道具:给予道具(id,"灵饰洗练石",1)
              广播消息({内容=format("#S【幽夜暗域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"灵饰洗练石"),频道="xt"})

        end
    end
end
------------------------------------------------------------------------------------------------------------------------------------
function 自写活动:混乱终末的信标(id)
  local 怪物名称 = {"混乱终末巡守","混乱终末帝子","混乱终末统御"}
  local 生肖模型 = {"新二大王","新猪八戒","新孙悟空"}
  local 地图范围={1041}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,15 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1999,11111).."1187.5"..os.time().."_"..随机序列.."_"..取随机数(88,99999999)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3000,
        玩家id=id,
        可见id=id,
        队伍组={},
        名称=怪物名称[i],
        模型=生肖模型[取随机数(1,#生肖模型)],
        称谓="★★★★★★★★★★",
        行走开关=true,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1187.5,
        销毁=true,
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
   广播消息({内容=format("#S神秘人打开了【混乱终末】的封印#G%s#W珠光宝气、霞光满天，究竟是福是祸，犹未可知#G(难度10)#W".."#"..取随机数(1,110),刷新地图[1],刷新地图[2]),频道="xt"})
end
-----
function 自写活动:完成混乱终末的信标(id组)
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(2900,3000)
        local 银子=平均等级*取随机数(2500,3000)
        local 仙玉=平均等级*6
        local 通知开关=true
        local 奖励参数=取随机数(1,127)
        玩家数据[id].角色:添加经验(经验,"混乱终末的信标",1)
        玩家数据[id].角色:添加银子(银子,"混乱终末的信标",1)
        玩家数据[id].角色:添加仙玉(仙玉,"混乱终末的信标",1)

 local 奖励参数=取随机数()
        if 奖励参数<=10 then
        elseif 奖励参数<=14 then
            玩家数据[id].道具:给予道具(id,"奖池抽奖",1)
              广播消息({内容=format("#S【混乱终末的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"奖池抽奖"),频道="xt"})
        elseif 奖励参数<=20  then
            玩家数据[id].道具:给予道具(id,"特殊兽诀·碎片",3)
              广播消息({内容=format("#S【混乱终末的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,3),玩家数据[id].角色.名称,"特殊兽诀·碎片"),频道="xt"})
        elseif 奖励参数<=26 then
            玩家数据[id].道具:给予道具(id,"超级兽诀·碎片",1)
              广播消息({内容=format("#S【混乱终末的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"超级兽诀·碎片"),频道="xt"})
        elseif 奖励参数<=30 then
            玩家数据[id].道具:给予道具(id,"玉刚卯",1)
              广播消息({内容=format("#S【混乱终末的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"玉刚卯"),频道="xt"})
        elseif 奖励参数<=38 then
            玩家数据[id].道具:给予道具(id,"凤纹灵坠",1)
              广播消息({内容=format("#S【混乱终末的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"凤纹灵坠"),频道="xt"})
        elseif 奖励参数<=35 then
            玩家数据[id].道具:给予道具(id,"词条洗练石",1)
              广播消息({内容=format("#S【混乱终末的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"词条洗练石"),频道="xt"})
        elseif 奖励参数<=46 then
            玩家数据[id].道具:给予道具(id,"特效宝珠",1)
              广播消息({内容=format("#S【混乱终末的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"特效宝珠"),频道="xt"})
        elseif 奖励参数<=50 then
            玩家数据[id].道具:给予道具(id,"观照万象碎片",1)
              广播消息({内容=format("#S【混乱终末的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"观照万象碎片"),频道="xt"})
        elseif 奖励参数<=60 then
            玩家数据[id].道具:给予道具(id,"焕彩石",1)
              广播消息({内容=format("#S【混乱终末的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"焕彩石"),频道="xt"})
        elseif 奖励参数<=70 then
            玩家数据[id].道具:给予道具(id,"五彩神石",1)
              广播消息({内容=format("#S【混乱终末的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"五彩神石"),频道="xt"})
        elseif 奖励参数<=80 then
            玩家数据[id].道具:给予道具(id,"青花瓷锦衣·碎片",1)
              广播消息({内容=format("#S【混乱终末的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"青花瓷锦衣·碎片"),频道="xt"})
        elseif 奖励参数<=85 then
            玩家数据[id].道具:给予道具(id,"装备词条石",1)
              广播消息({内容=format("#S【混乱终末的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"装备词条石"),频道="xt"})
        elseif 奖励参数<=90 then
            玩家数据[id].道具:给予道具(id,"装备属性石",1)
              广播消息({内容=format("#S【混乱终末的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"装备属性石"),频道="xt"})
        elseif 奖励参数<=95 then
            玩家数据[id].道具:给予道具(id,"词条属性石",1)
              广播消息({内容=format("#S【混乱终末的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"词条属性石"),频道="xt"})
        elseif 奖励参数<=100 then
            玩家数据[id].道具:给予道具(id,"灵饰洗练石",1)
              广播消息({内容=format("#S【混乱终末的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"灵饰洗练石"),频道="xt"})

        end
    end
end
---------------------------------------------------------------------------------------------------------------------------------------
function 自写活动:伟大虚空的信标(id)
  local 怪物名称 = {"伟大虚空巡守","伟大虚空帝子","伟大虚空统御"}
  local 生肖模型 = {"自在天魔宝珠","自在天魔","自在天魔刀"}
  local 地图范围={1212}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,15 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1999,11111).."1187.6"..os.time().."_"..随机序列.."_"..取随机数(88,99999999)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3000,
        可见id=id,
        玩家id=id,
        队伍组={},
        名称=怪物名称[i],
        模型=生肖模型[取随机数(1,#生肖模型)],
        称谓="★★★★★★★★★★",
        行走开关=true,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1187.6,
        销毁=true,
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
   广播消息({内容=format("#S神秘人打开了【伟大虚空】的封印#G%s#W珠光宝气、霞光满天，究竟是福是祸，犹未可知#G(难度10)#W".."#"..取随机数(1,110),刷新地图[1],刷新地图[2]),频道="xt"})
end
-----
function 自写活动:完成伟大虚空的信标(id组)
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(3100,3200)
        local 银子=平均等级*取随机数(2500,3500)
        local 仙玉=平均等级*7
        local 通知开关=true
        local 奖励参数=取随机数(1,127)
        玩家数据[id].角色:添加经验(经验,"伟大虚空的信标",1)
        玩家数据[id].角色:添加银子(银子,"伟大虚空的信标",1)
        玩家数据[id].角色:添加仙玉(仙玉,"伟大虚空的信标",1)

 local 奖励参数=取随机数()
        if 奖励参数<=10 then
        elseif 奖励参数<=15 then
            玩家数据[id].道具:给予道具(id,"奖池抽奖",1)
              广播消息({内容=format("#S【伟大虚空的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"奖池抽奖"),频道="xt"})
        elseif 奖励参数<=20  then
            玩家数据[id].道具:给予道具(id,"特殊兽诀·碎片",3)
              广播消息({内容=format("#S【伟大虚空的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,3),玩家数据[id].角色.名称,"特殊兽诀·碎片"),频道="xt"})
        elseif 奖励参数<=25 then
            玩家数据[id].道具:给予道具(id,"超级兽诀·碎片",1)
              广播消息({内容=format("#S【伟大虚空的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"超级兽诀·碎片"),频道="xt"})
        elseif 奖励参数<=30 then
            玩家数据[id].道具:给予道具(id,"玉刚卯",1)
              广播消息({内容=format("#S【伟大虚空的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"玉刚卯"),频道="xt"})
        elseif 奖励参数<=35 then
            玩家数据[id].道具:给予道具(id,"凤纹灵坠",1)
              广播消息({内容=format("#S【伟大虚空的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"凤纹灵坠"),频道="xt"})
        elseif 奖励参数<=40 then
            玩家数据[id].道具:给予道具(id,"词条洗练石",1)
              广播消息({内容=format("#S【伟大虚空的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"词条洗练石"),频道="xt"})
        elseif 奖励参数<=45 then
            玩家数据[id].道具:给予道具(id,"特效宝珠",1)
              广播消息({内容=format("#S【伟大虚空的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"特效宝珠"),频道="xt"})
        elseif 奖励参数<=50 then
            玩家数据[id].道具:给予道具(id,"观照万象碎片",1)
              广播消息({内容=format("#S【伟大虚空的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"观照万象碎片"),频道="xt"})
        elseif 奖励参数<=55 then
            玩家数据[id].道具:给予道具(id,"焕彩石",1)
              广播消息({内容=format("#S【伟大虚空的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"焕彩石"),频道="xt"})
        elseif 奖励参数<=69 then
            玩家数据[id].道具:给予道具(id,"五彩神石",1)
              广播消息({内容=format("#S【伟大虚空的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"五彩神石"),频道="xt"})
        elseif 奖励参数<=80 then
            玩家数据[id].道具:给予道具(id,"青花瓷锦衣·碎片",1)
              广播消息({内容=format("#S【伟大虚空的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"青花瓷锦衣·碎片"),频道="xt"})
        elseif 奖励参数<=85 then
            玩家数据[id].道具:给予道具(id,"装备词条石",1)
              广播消息({内容=format("#S【伟大虚空的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"装备词条石"),频道="xt"})
        elseif 奖励参数<=90 then
            玩家数据[id].道具:给予道具(id,"装备属性石",1)
              广播消息({内容=format("#S【伟大虚空的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"装备属性石"),频道="xt"})
        elseif 奖励参数<=95 then
            玩家数据[id].道具:给予道具(id,"词条属性石",1)
              广播消息({内容=format("#S【伟大虚空的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"词条属性石"),频道="xt"})
        elseif 奖励参数<=100 then
            玩家数据[id].道具:给予道具(id,"灵饰洗练石",1)
              广播消息({内容=format("#S【伟大虚空的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"灵饰洗练石"),频道="xt"})

        end
    end
end
--------------------------------------------------------------------------------------------------------------------------------------
function 自写活动:巅峰领域的信标(id)
  local 怪物名称 = {"巅峰领域巡守","巅峰领域帝子","巅峰领域统御"}
  local 生肖模型 = {"进阶雷龙","进阶涂山雪","进阶大力金刚"}
  local 地图范围={5006}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,15 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1999,11111).."1187.7"..os.time().."_"..随机序列.."_"..取随机数(88,99999999)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3000,
        可见id=id,
        玩家id=id,
        队伍组={},
        名称=怪物名称[i],
        模型=生肖模型[取随机数(1,#生肖模型)],
        称谓="★★★★★★★★★★",
        行走开关=true,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1187.7,

        销毁=true,
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
   广播消息({内容=format("#S神秘人打开了【巅峰领域】的封印#G%s#W珠光宝气、霞光满天，究竟是福是祸，犹未可知#G(难度10)#W".."#"..取随机数(1,110),刷新地图[1],刷新地图[2]),频道="xt"})
end
-----
function 自写活动:完成巅峰领域的信标(id组)
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(3300,3400)
        local 银子=平均等级*取随机数(2500,4000)
        local 仙玉=平均等级*8
        local 通知开关=true
        local 奖励参数=取随机数(1,127)
        玩家数据[id].角色:添加经验(经验,"巅峰领域的信标",1)
        玩家数据[id].角色:添加银子(银子,"巅峰领域的信标",1)
        玩家数据[id].角色:添加仙玉(仙玉,"巅峰领域的信标",1)


 local 奖励参数=取随机数()
        if 奖励参数<=10 then
        elseif 奖励参数<=15 then
            玩家数据[id].道具:给予道具(id,"奖池抽奖",1)
              广播消息({内容=format("#S【巅峰领域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"奖池抽奖"),频道="xt"})
        elseif 奖励参数<=22  then
            玩家数据[id].道具:给予道具(id,"特殊兽诀·碎片",3)
              广播消息({内容=format("#S【巅峰领域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,3),玩家数据[id].角色.名称,"特殊兽诀·碎片"),频道="xt"})
        elseif 奖励参数<=29 then
            玩家数据[id].道具:给予道具(id,"超级兽诀·碎片",1)
              广播消息({内容=format("#S【巅峰领域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"超级兽诀·碎片"),频道="xt"})
        elseif 奖励参数<=30 then
            玩家数据[id].道具:给予道具(id,"玉刚卯",1)
              广播消息({内容=format("#S【巅峰领域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"玉刚卯"),频道="xt"})
        elseif 奖励参数<=38 then
            玩家数据[id].道具:给予道具(id,"凤纹灵坠",1)
              广播消息({内容=format("#S【巅峰领域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"凤纹灵坠"),频道="xt"})
        elseif 奖励参数<=40 then
            玩家数据[id].道具:给予道具(id,"词条洗练石",1)
              广播消息({内容=format("#S【巅峰领域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"词条洗练石"),频道="xt"})
        elseif 奖励参数<=50 then
            玩家数据[id].道具:给予道具(id,"特效宝珠",1)
              广播消息({内容=format("#S【巅峰领域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"特效宝珠"),频道="xt"})
        elseif 奖励参数<=53 then
            玩家数据[id].道具:给予道具(id,"观照万象碎片",1)
              广播消息({内容=format("#S【巅峰领域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"观照万象碎片"),频道="xt"})
        elseif 奖励参数<=60 then
            玩家数据[id].道具:给予道具(id,"焕彩石",1)
              广播消息({内容=format("#S【巅峰领域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"焕彩石"),频道="xt"})
        elseif 奖励参数<=70 then
            玩家数据[id].道具:给予道具(id,"五彩神石",1)
              广播消息({内容=format("#S【巅峰领域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"五彩神石"),频道="xt"})
        elseif 奖励参数<=80 then
            玩家数据[id].道具:给予道具(id,"青花瓷锦衣·碎片",1)
              广播消息({内容=format("#S【巅峰领域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"青花瓷锦衣·碎片"),频道="xt"})
        elseif 奖励参数<=85 then
            玩家数据[id].道具:给予道具(id,"装备词条石",1)
              广播消息({内容=format("#S【巅峰领域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"装备词条石"),频道="xt"})
        elseif 奖励参数<=90 then
            玩家数据[id].道具:给予道具(id,"装备属性石",1)
              广播消息({内容=format("#S【巅峰领域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"装备属性石"),频道="xt"})
        elseif 奖励参数<=95 then
            玩家数据[id].道具:给予道具(id,"词条属性石",1)
              广播消息({内容=format("#S【巅峰领域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"词条属性石"),频道="xt"})
        elseif 奖励参数<=100 then
            玩家数据[id].道具:给予道具(id,"灵饰洗练石",1)
              广播消息({内容=format("#S【巅峰领域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"灵饰洗练石"),频道="xt"})

        end
    end
end
----------------------------------------------------------------------------




function 自写活动:战斗胜利处理(id组,战斗类型,任务id)
    if 任务数据[任务id]==nil then
        return
    end
    地图处理类:删除单位(任务数据[任务id].地图编号,任务数据[任务id].单位编号)
    任务数据[任务id]=nil
    if 战斗类型==160009 then
      self:决战大雁塔1(id组)
    elseif 战斗类型==160010 then
      self:决战大雁塔2(id组)
    elseif 战斗类型==160011 then
      self:决战大雁塔3(id组)
    elseif 战斗类型==160012 then
      self:决战大雁塔4(id组)
    elseif 战斗类型==160013 then
      self:决战大雁塔5(id组)
    elseif 战斗类型==160014 then
      self:决战大雁塔6(id组)
    elseif 战斗类型==160015 then
      self:决战大雁塔7(id组)
    elseif 战斗类型==120047 then
      self:决战大雁塔1(id组)
  elseif 战斗类型==155561 then
    self:完成生肖1星(id组)
  elseif 战斗类型==155561.1 then
    self:完成生肖2星(id组)
  elseif 战斗类型==155561.2 then
    self:完成生肖3星(id组)
  elseif 战斗类型==155561.3 then
    self:完成生肖4星(id组)
  elseif 战斗类型==155561.4 then
    self:完成生肖5星(id组)
  elseif 战斗类型==155559 then
    self:完成下凡的灵猴(id组)
  elseif 战斗类型==155560 then
    self:完成三界财神爷(id组)
  elseif 战斗类型==155562 then
    self:完成50级世界BOSS(id组)
  elseif 战斗类型==155563 then
    self:完成100级世界BOSS(id组)
  elseif 战斗类型==155564 then
    self:完成150级世界BOSS(id组)
  elseif 战斗类型==160001 then
    self:完成夏日炎炎(id组)
  elseif 战斗类型==160002 then
    self:完成魂殿使者(id组)
  elseif 战斗类型==160003 then
    self:完成魂殿殿主(id组)
  elseif 战斗类型==160004 then
    self:完成知了先锋(id组)
  elseif 战斗类型==160005 then
    self:完成知了小王(id组)
  elseif 战斗类型==160006 then
    self:完成知了大王(id组)
  elseif 战斗类型==160007 then
    self:完成知了统领(id组)
  elseif 战斗类型==160008 then
    self:完成千年知了王(id组)
  elseif 战斗类型==160016 then
    self:完成琴声悠悠(id组)
  elseif 战斗类型==160017 then
    self:完成新春快乐(id组)
  elseif 战斗类型==160018 then
    self:完成中秋快乐(id组)
  elseif 战斗类型==160019 then
    self:完成龙神(id组)
  elseif 战斗类型==160020 then
    self:完成仙气十足(id组)
  -- elseif 战斗类型==160021 then
  --   self:完成武神坛服战8强(id组)
  -- elseif 战斗类型==160022 then
  --   self:完成武神坛服战4强(id组)
  -- elseif 战斗类型==160023 then
  --   self:完成武神坛服战季军(id组)
  -- elseif 战斗类型==160024 then
  --   self:完成武神坛服战亚军(id组)
  -- elseif 战斗类型==160025 then
  --   self:完成武神坛服战冠军(id组)
  elseif 战斗类型==160026 then
    self:完成客服小二(id组)
  elseif 战斗类型==120068 then
    self:完成斥候海妖(id组)
   elseif 战斗类型==150100 then
      self:完成盘龙岛小怪(id组)
-------------------------------------------
elseif 战斗类型==160030 then
    self:完成捣乱年兽(id组)
elseif 战斗类型==160031 then
    self:完成贺新年(id组)
elseif 战斗类型==160032 then
    self:完成万象福(id组)
elseif 战斗类型==160033 then
    self:完成糖果派对(id组)
elseif 战斗类型==160034 then
    self:完成六欲心魔(id组)
elseif 战斗类型==160035 then
    self:完成恭喜发财(id组)
elseif 战斗类型==160036 then
    self:完成魔化师傅(id组)
elseif 战斗类型==160037 then
    self:完成四圣青龙(id组)
elseif 战斗类型==160038 then
    self:完成四圣白虎(id组)
elseif 战斗类型==160039 then
    self:完成四圣朱雀(id组)
elseif 战斗类型==160040 then
    self:完成四圣玄武(id组)
elseif 战斗类型==160050 then
    self:完成知了王(id组)
elseif 战斗类型==160051 then
    self:完成巡山小妖(id组)
elseif 战斗类型==160052 then
    self:完成白骨精(id组)
elseif 战斗类型==160053 then
    self:完成狮驼国(id组)
elseif 战斗类型==160054 then
    self:完成美猴王(id组)
elseif 战斗类型==160071 then
    self:完成武神八强(id组)
elseif 战斗类型==160071.1 then
    self:完成武神四强(id组)
elseif 战斗类型==160071.2 then
    self:完成武神季军(id组)
elseif 战斗类型==160071.3 then
    self:完成武神亚军(id组)
elseif 战斗类型==160071.4 then
    self:完成武神冠军(id组)
elseif 战斗类型==160072 then
    self:完成醉凡尘(id组)
elseif 战斗类型==160073 then
    self:完成仙魔灵墟(id组)
elseif 战斗类型==160074 then
    self:完成云生梦泽(id组)

elseif 战斗类型==155564.1 then
        self:完成沸涌炎海的信标(id组)

    elseif 战斗类型==155564.2 then
        self:完成钢铁炼境的信标(id组)

    elseif 战斗类型==155564.3 then
        self:完成雷鸣废土的信标(id组)

    elseif 战斗类型==155564.4 then
        self:完成幽夜暗域的信标(id组)

    elseif 战斗类型==155564.5 then
        self:完成混乱终末的信标(id组)

    elseif 战斗类型==155564.6 then
        self:完成伟大虚空的信标(id组)

    elseif 战斗类型==155564.7 then
        self:完成巅峰领域的信标(id组)
--------------------------------------------
    end
end
-----------------------------------------
function 自写活动:完成捣乱年兽(id组)
      添加完成次数(id组[1],"捣乱年兽")  -----限制刷怪
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(420,530)
        local 银子=平均等级*160+15000
        玩家数据[id].角色:添加经验(经验*HDPZ["捣乱年兽"].经验,"捣乱年兽",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["捣乱年兽"].银子),"捣乱年兽",1)
        玩家数据[id].角色:添加除妖军功(1)

        添加活跃(id,1)
        if 取随机数()<=HDPZ["捣乱年兽"].爆率 then
            local 链接 = {提示=format("#S(捣乱年兽)#R/%s#Y经过一番激烈的战斗，最终战胜了#R捣乱年兽#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["捣乱年兽"].ITEM),"捣乱年兽")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end

function 自写活动:完成贺新年(id组)
      添加完成次数(id组[1],"贺新年")  -----限制刷怪
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(420,530)
        local 银子=平均等级*160+15000
        玩家数据[id].角色:添加经验(经验*HDPZ["贺新年"].经验,"贺新年",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["贺新年"].银子),"贺新年",1)
        玩家数据[id].角色:添加除妖军功(1)

        添加活跃(id,1)
        if 取随机数()<=HDPZ["贺新年"].爆率 then
            local 链接 = {提示=format("#S(贺新年)#R/%s#Y经过一番激烈的战斗，最终战胜了#R贺新年#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["贺新年"].ITEM),"贺新年")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end

function 自写活动:完成万象福(id组)
      添加完成次数(id组[1],"万象福")  -----限制刷怪
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(420,530)
        local 银子=平均等级*160+15000
        玩家数据[id].角色:添加经验(经验*HDPZ["万象福"].经验,"万象福",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["万象福"].银子),"万象福",1)
        玩家数据[id].角色:添加除妖军功(1)

        添加活跃(id,1)
        if 取随机数()<=HDPZ["万象福"].爆率 then
            local 链接 = {提示=format("#S(万象福)#R/%s#Y经过一番激烈的战斗，最终战胜了#R万象福#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["万象福"].ITEM),"万象福")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end

function 自写活动:完成糖果派对(id组)
      添加完成次数(id组[1],"糖果派对")  -----限制刷怪
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(620,730)
        local 银子=平均等级*360+20000
        local 仙玉=取随机数(18,35)
        玩家数据[id].角色:添加经验(经验*HDPZ["糖果派对"].经验,"糖果派对",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["糖果派对"].银子),"糖果派对",1)
        玩家数据[id].角色:添加仙玉(仙玉,"糖果派对",1)
        玩家数据[id].角色:添加除妖军功(1)

        添加活跃(id,1)
        if 取随机数()<=HDPZ["糖果派对"].爆率 then
            local 链接 = {提示=format("#S(糖果派对)#R/%s#Y经过一番激烈的战斗，最终战胜了#R糖果派对#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["糖果派对"].ITEM),"糖果派对")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end

function 自写活动:完成六欲心魔(id组)
      添加完成次数(id组[1],"六欲心魔")  -----限制刷怪
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(620,730)
        local 银子=平均等级*360+20000
        local 仙玉=取随机数(18,35)
        玩家数据[id].角色:添加经验(经验*HDPZ["六欲心魔"].经验,"六欲心魔",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["六欲心魔"].银子),"六欲心魔",1)
        玩家数据[id].角色:添加仙玉(仙玉,"六欲心魔",1)
        玩家数据[id].角色:添加除妖军功(1)

        添加活跃(id,1)
        if 取随机数()<=HDPZ["六欲心魔"].爆率 then
            local 链接 = {提示=format("#S(六欲心魔)#R/%s#Y经过一番激烈的战斗，最终战胜了#R六欲心魔#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["六欲心魔"].ITEM),"六欲心魔")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end

function 自写活动:完成恭喜发财(id组)
      添加完成次数(id组[1],"恭喜发财")  -----限制刷怪
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(620,730)
        local 银子=平均等级*360+20000
        local 仙玉=取随机数(18,35)
        玩家数据[id].角色:添加经验(经验*HDPZ["恭喜发财"].经验,"恭喜发财",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["恭喜发财"].银子),"恭喜发财",1)
        玩家数据[id].角色:添加仙玉(仙玉,"恭喜发财",1)
        玩家数据[id].角色:添加除妖军功(1)

        添加活跃(id,1)
        if 取随机数()<=HDPZ["恭喜发财"].爆率 then
            local 链接 = {提示=format("#S(恭喜发财)#R/%s#Y经过一番激烈的战斗，最终战胜了#R恭喜发财#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["恭喜发财"].ITEM),"恭喜发财")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end

function 自写活动:完成魔化师傅(id组)
      添加完成次数(id组[1],"魔化师傅")  -----限制刷怪
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(720,830)
        local 银子=平均等级*560+25000
        local 仙玉=取随机数(25,48)
        玩家数据[id].角色:添加经验(经验*HDPZ["魔化师傅"].经验,"魔化师傅",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["魔化师傅"].银子),"魔化师傅",1)
        玩家数据[id].角色:添加仙玉(仙玉,"魔化师傅",1)
        玩家数据[id].角色:添加除妖军功(1)

        添加活跃(id,1)
        if 取随机数()<=HDPZ["魔化师傅"].爆率 then
            local 链接 = {提示=format("#S(魔化师傅)#R/%s#Y经过一番激烈的战斗，最终战胜了#R魔化师傅#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["魔化师傅"].ITEM),"魔化师傅")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end

function 自写活动:完成四圣青龙(id组)
      添加完成次数(id组[1],"四圣青龙")  -----限制刷怪
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(720,830)
        local 银子=平均等级*560+25000
        local 仙玉=取随机数(25,48)
        玩家数据[id].角色:添加经验(经验*HDPZ["四圣青龙"].经验,"四圣青龙",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["四圣青龙"].银子),"四圣青龙",1)
        玩家数据[id].角色:添加仙玉(仙玉,"四圣青龙",1)
        玩家数据[id].角色:添加除妖军功(1)

        添加活跃(id,1)
        if 取随机数()<=HDPZ["四圣青龙"].爆率 then
            local 链接 = {提示=format("#S(四圣青龙)#R/%s#Y经过一番激烈的战斗，最终战胜了#R四圣青龙#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["四圣青龙"].ITEM),"四圣青龙")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end

function 自写活动:完成四圣白虎(id组)
      添加完成次数(id组[1],"四圣白虎")  -----限制刷怪
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(720,830)
        local 银子=平均等级*560+25000
        local 仙玉=取随机数(25,48)
        玩家数据[id].角色:添加经验(经验*HDPZ["四圣白虎"].经验,"四圣白虎",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["四圣白虎"].银子),"四圣白虎",1)
        玩家数据[id].角色:添加仙玉(仙玉,"四圣白虎",1)
        玩家数据[id].角色:添加除妖军功(1)

        添加活跃(id,1)
        if 取随机数()<=HDPZ["四圣白虎"].爆率 then
            local 链接 = {提示=format("#S(四圣白虎)#R/%s#Y经过一番激烈的战斗，最终战胜了#R四圣白虎#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["四圣白虎"].ITEM),"四圣白虎")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end

function 自写活动:完成四圣朱雀(id组)
      添加完成次数(id组[1],"四圣朱雀")  -----限制刷怪
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(720,830)
        local 银子=平均等级*560+25000
        local 仙玉=取随机数(25,48)
        玩家数据[id].角色:添加经验(经验*HDPZ["四圣朱雀"].经验,"四圣朱雀",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["四圣朱雀"].银子),"四圣朱雀",1)
        玩家数据[id].角色:添加仙玉(仙玉,"四圣朱雀",1)
        玩家数据[id].角色:添加除妖军功(1)

        添加活跃(id,1)
        if 取随机数()<=HDPZ["四圣朱雀"].爆率 then
            local 链接 = {提示=format("#S(四圣朱雀)#R/%s#Y经过一番激烈的战斗，最终战胜了#R四圣朱雀#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["四圣朱雀"].ITEM),"四圣朱雀")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end

function 自写活动:完成四圣玄武(id组)
      添加完成次数(id组[1],"四圣玄武")  -----限制刷怪
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(720,830)
        local 银子=平均等级*560+25000
        local 仙玉=取随机数(25,48)
        玩家数据[id].角色:添加经验(经验*HDPZ["四圣玄武"].经验,"四圣玄武",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["四圣玄武"].银子),"四圣玄武",1)
        玩家数据[id].角色:添加仙玉(仙玉,"四圣玄武",1)
        玩家数据[id].角色:添加除妖军功(1)

        添加活跃(id,1)
        if 取随机数()<=HDPZ["四圣玄武"].爆率 then
            local 链接 = {提示=format("#S(四圣玄武)#R/%s#Y经过一番激烈的战斗，最终战胜了#R四圣玄武#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["四圣玄武"].ITEM),"四圣玄武")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end

function 自写活动:完成知了王(id组)
      添加完成次数(id组[1],"知了王")  -----限制刷怪
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(620,730)
        local 银子=平均等级*360+20000
        local 仙玉=取随机数(18,35)
        玩家数据[id].角色:添加经验(经验*HDPZ["知了王"].经验,"知了王",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["知了王"].银子),"知了王",1)
        玩家数据[id].角色:添加仙玉(仙玉,"知了王",1)
        玩家数据[id].角色:添加除妖军功(1)

        添加活跃(id,1)
        if 取随机数()<=HDPZ["知了王"].爆率 then
            local 链接 = {提示=format("#S(知了王)#R/%s#Y经过一番激烈的战斗，最终战胜了#R知了王#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["知了王"].ITEM),"知了王")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end

function 自写活动:完成巡山小妖(id组)
      添加完成次数(id组[1],"巡山小妖")  -----限制刷怪
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(320,430)
        local 银子=平均等级*160+15000
        玩家数据[id].角色:添加经验(经验*HDPZ["巡山小妖"].经验,"巡山小妖",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["巡山小妖"].银子),"巡山小妖",1)
        玩家数据[id].角色:添加除妖军功(1)

        添加活跃(id,1)
        if 取随机数()<=HDPZ["巡山小妖"].爆率 then
            local 链接 = {提示=format("#S(巡山小妖)#R/%s#Y经过一番激烈的战斗，最终战胜了#R巡山小妖#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["巡山小妖"].ITEM),"巡山小妖")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end

function 自写活动:完成白骨精(id组)
      添加完成次数(id组[1],"白骨精")  -----限制刷怪
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(420,530)
        local 银子=平均等级*260
        玩家数据[id].角色:添加经验(经验*HDPZ["白骨精"].经验,"白骨精",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["白骨精"].银子),"白骨精",1)
        玩家数据[id].角色:添加除妖军功(1)

        添加活跃(id,1)
        if 取随机数()<=HDPZ["白骨精"].爆率 then
            local 链接 = {提示=format("#S(白骨精)#R/%s#Y经过一番激烈的战斗，最终战胜了#R白骨精#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["白骨精"].ITEM),"白骨精")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end

function 自写活动:完成狮驼国(id组)
      添加完成次数(id组[1],"狮驼国")  -----限制刷怪
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(420,530)
        local 银子=平均等级*260
        玩家数据[id].角色:添加经验(经验*HDPZ["狮驼国"].经验,"狮驼国",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["狮驼国"].银子),"狮驼国",1)
        玩家数据[id].角色:添加除妖军功(1)

        添加活跃(id,1)
        if 取随机数()<=HDPZ["狮驼国"].爆率 then
            local 链接 = {提示=format("#S(狮驼国)#R/%s#Y经过一番激烈的战斗，最终战胜了#R狮驼国#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["狮驼国"].ITEM),"狮驼国")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end

function 自写活动:完成美猴王(id组)
      添加完成次数(id组[1],"美猴王")  -----限制刷怪
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(420,530)
        local 银子=平均等级*260
        玩家数据[id].角色:添加经验(经验*HDPZ["美猴王"].经验,"美猴王",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["美猴王"].银子),"美猴王",1)
        玩家数据[id].角色:添加除妖军功(1)

        添加活跃(id,1)
        if 取随机数()<=HDPZ["美猴王"].爆率 then
            local 链接 = {提示=format("#S(美猴王)#R/%s#Y经过一番激烈的战斗，最终战胜了#R美猴王#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["美猴王"].ITEM),"美猴王")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end

function 自写活动:完成盘龙岛小怪(id组)
  for n=1,#id组 do
      local id=id组[n]
      local 等级=玩家数据[id].角色.等级
      local 经验=150000
      local 储备=等级*400+10000
      local 镇妖分  = 玩家数据[id].角色.镇妖关积分
      local 镇妖分A  = 玩家数据[id].角色.镇妖关积分A
      local 镇妖分B  = 玩家数据[id].角色.镇妖关积分B
      local 镇妖分C  = 玩家数据[id].角色.镇妖关积分C
      local 镇妖分D  = 玩家数据[id].角色.镇妖关积分D
      local 镇妖分E  = 玩家数据[id].角色.镇妖关积分E
      local 镇妖分F  = 玩家数据[id].角色.镇妖关积分F
      if 镇妖分A < 1 then 玩家数据[id].角色:添加镇妖关积分A(1,"盘龙岛",1) end
      if 镇妖分B < 1 then 玩家数据[id].角色:添加镇妖关积分B(1,"盘龙岛",1) end
      if 镇妖分C < 1 then 玩家数据[id].角色:添加镇妖关积分C(1,"盘龙岛",1) end
      if 镇妖分D< 1 then 玩家数据[id].角色:添加镇妖关积分D(1,"盘龙岛",1) end
      if 镇妖分E < 1 then 玩家数据[id].角色:添加镇妖关积分E(1,"盘龙岛",1) end
      if 镇妖分F < 1 then 玩家数据[id].角色:添加镇妖关积分F(1,"盘龙岛",1) end

      玩家数据[id].角色:添加镇妖关积分(1,"盘龙岛小怪",1)
      玩家数据[id].角色:添加经验(经验*HDPZ["盘龙岛小怪"].经验,"盘龙岛小怪",1)
      玩家数据[id].角色:添加银子(储备*HDPZ["盘龙岛小怪"].银子,"盘龙岛小怪",1)
    if 取随机数()<=HDPZ["盘龙岛小怪"].爆率 then
     local 链接 = {提示=format("#P(怒蛟)#W对#G/%s的表现尤为赞赏，特赠送",玩家数据[id].角色.名称),频道="xt",结尾="W以资鼓励！"}
              local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["盘龙岛小怪"].ITEM),"盘龙岛小怪")
              if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
              else
                          玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
              end
    end
  end
end

function 自写活动:完成斥候海妖(id组)
    for n=1,#id组 do
        local id=id组[n]
             -- ★ 新增：日期检查，跨天自动重置每日任务 ★
        if 玩家数据[id].双龙之战.数据.每日任务.日期 ~= tonumber(os.date("%Y%m%d")) then
        玩家数据[id].双龙之战.数据.每日任务[4] = 0
        玩家数据[id].双龙之战.数据.每日任务.日期 = tonumber(os.date("%Y%m%d"))
         end
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(220,230)
        local 银子=平均等级*160+15000
        玩家数据[id].角色:添加经验(经验*HDPZ["斥候海妖"].经验*10,"斥候海妖",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["斥候海妖"].银子*10),"斥候海妖",1)
        玩家数据[id].角色:添加储备(qz(银子*0.2*HDPZ["斥候海妖"].银子*10),"斥候海妖",1)
        玩家数据[id].角色:添加除妖军功(1)

        添加活跃(id,1)

        -- 更新每个队员的每日任务进度
        if 玩家数据[id].双龙之战.数据.每日任务[4]==nil then
            玩家数据[id].双龙之战.数据.每日任务[4]=0
        end
        if 玩家数据[id].双龙之战.数据.每日任务[4] < 20 then
            玩家数据[id].双龙之战.数据.每日任务[4] = 玩家数据[id].双龙之战.数据.每日任务[4] + 1
            常规提示(id,"#Y今天已击杀#G"..玩家数据[id].双龙之战.数据.每日任务[4].."#Y次斥候海妖")
        end
    end
end

function 自写活动:完成客服小二(id组)
      添加完成次数(id组[1],"客服小二")  -----限制刷怪
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(620,830)
        local 银子=平均等级*560+25000
        local 仙玉=取随机数(36,58)
        玩家数据[id].角色:添加经验(经验*HDPZ["客服小二"].经验,"客服小二",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["客服小二"].银子),"客服小二",1)
        玩家数据[id].角色:添加仙玉(仙玉,"客服小二",1)
        玩家数据[id].角色:添加除妖军功(1)

        添加活跃(id,10)
        更新玩家每日(id,"日常任务","客服小二")
        if 取随机数()<=HDPZ["客服小二"].爆率 then
            local 链接 = {提示=format("#S(客服小二)#R/%s#Y经过一番激烈的战斗，最终战胜了#R客服小二#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["客服小二"].ITEM),"客服小二")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end
-- function 自写活动:完成武神坛服战冠军(id组)
--       添加完成次数(id组[1],"武神坛服战冠军")  -----限制刷怪
--     for n=1,#id组 do
--         local id=id组[n]
--         local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
--         local 经验=平均等级*取随机数(220,230)
--         local 银子=平均等级*160+15000
--         玩家数据[id].角色:添加经验(经验*HDPZ["武神坛服战冠军"].经验,"武神坛服战冠军",1)
--         玩家数据[id].角色:添加银子(qz(银子*HDPZ["武神坛服战冠军"].银子),"武神坛服战冠军",1)
--         玩家数据[id].角色:添加除妖军功(1)

--         添加活跃(id,8)
--         更新玩家每日(id,"日常任务","武神坛服战冠军")
--         if 取随机数()<=HDPZ["武神坛服战冠军"].爆率 then
--             local 链接 = {提示=format("#S(武神坛服战冠军)#R/%s#Y经过一番激烈的战斗，最终战胜了#R武神坛服战冠军#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
--             local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["武神坛服战冠军"].ITEM),"武神坛服战冠军")
--             if 数量== 9999 then --环
--                 玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
--             else
--                 玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
--             end
--         end
--     end
-- end
-- function 自写活动:完成武神坛服战亚军(id组)
--       添加完成次数(id组[1],"武神坛服战亚军")  -----限制刷怪
--     for n=1,#id组 do
--         local id=id组[n]
--         local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
--         local 经验=平均等级*取随机数(220,230)
--         local 银子=平均等级*160+15000
--         玩家数据[id].角色:添加经验(经验*HDPZ["武神坛服战亚军"].经验,"武神坛服战亚军",1)
--         玩家数据[id].角色:添加银子(qz(银子*HDPZ["武神坛服战亚军"].银子),"武神坛服战亚军",1)
--         玩家数据[id].角色:添加除妖军功(1)

--         添加活跃(id,6)
--         更新玩家每日(id,"日常任务","武神坛服战亚军")
--         if 取随机数()<=HDPZ["武神坛服战亚军"].爆率 then
--             local 链接 = {提示=format("#S(武神坛服战亚军)#R/%s#Y经过一番激烈的战斗，最终战胜了#R武神坛服战季军#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
--             local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["武神坛服战亚军"].ITEM),"武神坛服战亚军")
--             if 数量== 9999 then --环
--                 玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
--             else
--                 玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
--             end
--         end
--     end
-- end

-- function 自写活动:完成武神坛服战季军(id组)
--       添加完成次数(id组[1],"武神坛服战季军")  -----限制刷怪
--     for n=1,#id组 do
--         local id=id组[n]
--         local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
--         local 经验=平均等级*取随机数(220,230)
--         local 银子=平均等级*160+15000
--         玩家数据[id].角色:添加经验(经验*HDPZ["武神坛服战季军"].经验,"武神坛服战季军",1)
--         玩家数据[id].角色:添加银子(qz(银子*HDPZ["武神坛服战季军"].银子),"武神坛服战季军",1)
--         玩家数据[id].角色:添加除妖军功(1)

--         添加活跃(id,6)
--         更新玩家每日(id,"日常任务","武神坛服战季军")
--         if 取随机数()<=HDPZ["武神坛服战季军"].爆率 then
--             local 链接 = {提示=format("#S(武神坛服战季军)#R/%s#Y经过一番激烈的战斗，最终战胜了#R武神坛服战季军#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
--             local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["武神坛服战季军"].ITEM),"武神坛服战季军")
--             if 数量== 9999 then --环
--                 玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
--             else
--                 玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
--             end
--         end
--     end
-- end

-- function 自写活动:完成武神坛服战4强(id组)
--       添加完成次数(id组[1],"武神坛服战4强")  -----限制刷怪
--     for n=1,#id组 do
--         local id=id组[n]
--         local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
--         local 经验=平均等级*取随机数(220,230)
--         local 银子=平均等级*160+15000
--         玩家数据[id].角色:添加经验(经验*HDPZ["武神坛服战4强"].经验,"武神坛服战4强",1)
--         玩家数据[id].角色:添加银子(qz(银子*HDPZ["武神坛服战4强"].银子),"武神坛服战4强",1)
--         玩家数据[id].角色:添加除妖军功(1)

--         添加活跃(id,4)
--         更新玩家每日(id,"日常任务","武神坛服战4强")

--         if 取随机数()<=HDPZ["武神坛服战4强"].爆率 then
--             local 链接 = {提示=format("#S(武神坛服战4强)#R/%s#Y经过一番激烈的战斗，最终战胜了#R武神坛服战4强#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
--             local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["武神坛服战4强"].ITEM),"武神坛服战4强")
--             if 数量== 9999 then --环
--                 玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
--             else
--                 玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
--             end
--         end
--     end
-- end
-- function 自写活动:完成武神坛服战8强(id组)
--       添加完成次数(id组[1],"武神坛服战8强")  -----限制刷怪
--     for n=1,#id组 do
--         local id=id组[n]
--         local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
--         local 经验=平均等级*取随机数(220,230)
--         local 银子=平均等级*160+15000
--         玩家数据[id].角色:添加经验(经验*HDPZ["武神坛服战8强"].经验,"武神坛服战8强",1)
--         玩家数据[id].角色:添加银子(qz(银子*HDPZ["武神坛服战8强"].银子),"武神坛服战8强",1)
--         玩家数据[id].角色:添加除妖军功(1)

--         添加活跃(id,2)
--         更新玩家每日(id,"日常任务","武神坛服战8强")
--         if 取随机数()<=HDPZ["武神坛服战8强"].爆率 then
--             local 链接 = {提示=format("#S(武神坛服战8强)#R/%s#Y经过一番激烈的战斗，最终战胜了#R武神坛服战8强#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
--             local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["武神坛服战8强"].ITEM),"武神坛服战8强")
--             if 数量== 9999 then --环
--                 玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
--             else
--                 玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
--             end
--         end
--     end
-- end
function 自写活动:完成仙气十足(id组)
      添加完成次数(id组[1],"仙气十足")  -----限制刷怪
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(220,230)
        local 银子=平均等级*160+15000
        玩家数据[id].角色:添加经验(经验*HDPZ["仙气十足"].经验,"仙气十足",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["仙气十足"].银子),"仙气十足",1)
        玩家数据[id].角色:添加除妖军功(1)

        添加活跃(id,1)
        更新玩家每日(id,"日常任务","仙气十足")
        if 取随机数()<=HDPZ["仙气十足"].爆率 then
            local 链接 = {提示=format("#S(仙气十足)#R/%s#Y经过一番激烈的战斗，最终战胜了#R仙气十足#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["仙气十足"].ITEM),"仙气十足")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end

function 自写活动:完成龙神(id组)
      添加完成次数(id组[1],"龙神")  -----限制刷怪
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(220,230)
        local 银子=平均等级*160+15000
        玩家数据[id].角色:添加经验(经验*HDPZ["龙神"].经验,"龙神",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["龙神"].银子),"龙神",1)
        玩家数据[id].角色:添加除妖军功(1)

        添加活跃(id,1)
        更新玩家每日(id,"日常任务","龙神")

        if 取随机数()<=HDPZ["龙神"].爆率 then
            local 链接 = {提示=format("#S(龙神)#R/%s#Y经过一番激烈的战斗，最终战胜了#R龙神#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["龙神"].ITEM),"龙神")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end
function 自写活动:完成中秋快乐(id组)
      添加完成次数(id组[1],"中秋快乐")  -----限制刷怪
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(220,230)
        local 银子=平均等级*160+15000
        玩家数据[id].角色:添加经验(经验*HDPZ["中秋快乐"].经验,"中秋快乐",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["中秋快乐"].银子),"中秋快乐",1)
        玩家数据[id].角色:添加除妖军功(1)

        添加活跃(id,1)
        更新玩家每日(id,"日常任务","中秋快乐")
        if 取随机数()<=HDPZ["中秋快乐"].爆率 then
            local 链接 = {提示=format("#S(中秋快乐)#R/%s#Y经过一番激烈的战斗，最终战胜了#R中秋快乐#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["中秋快乐"].ITEM),"中秋快乐")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end

function 自写活动:完成新春快乐(id组)
      添加完成次数(id组[1],"新春快乐")  -----限制刷怪
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(220,230)
        local 银子=平均等级*160+15000
        玩家数据[id].角色:添加经验(经验*HDPZ["新春快乐"].经验,"新春快乐",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["新春快乐"].银子),"新春快乐",1)
        玩家数据[id].角色:添加除妖军功(1)

        添加活跃(id,1)
        更新玩家每日(id,"日常任务","新春快乐")
        if 取随机数()<=HDPZ["新春快乐"].爆率 then
            local 链接 = {提示=format("#S(新春快乐)#R/%s#Y经过一番激烈的战斗，最终战胜了#R新春快乐#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["新春快乐"].ITEM),"新春快乐")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end


function 自写活动:完成琴声悠悠(id组)
      添加完成次数(id组[1],"琴声悠悠")  -----限制刷怪
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(220,230)
        local 银子=平均等级*160+15000
        玩家数据[id].角色:添加经验(经验*HDPZ["琴声悠悠"].经验,"琴声悠悠",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["琴声悠悠"].银子),"琴声悠悠",1)
        玩家数据[id].角色:添加除妖军功(1)

        添加活跃(id,1)
        更新玩家每日(id,"日常任务","新年快乐")

        if 取随机数()<=HDPZ["琴声悠悠"].爆率 then
            local 链接 = {提示=format("#S(琴声悠悠)#R/%s#Y经过一番激烈的战斗，最终战胜了#R琴声悠悠#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["琴声悠悠"].ITEM),"琴声悠悠")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end
function 自写活动:完成千年知了王(id组)
      添加完成次数(id组[1],"千年知了王")  -----限制刷怪
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(220,230)
        local 银子=平均等级*160+15000
        玩家数据[id].角色:添加经验(经验*HDPZ["千年知了王"].经验,"千年知了王",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["千年知了王"].银子),"千年知了王",1)
        玩家数据[id].角色:添加除妖军功(1)

        添加活跃(id,1)
        更新玩家每日(id,"日常任务","千年知了王")

        if 取随机数()<=HDPZ["千年知了王"].爆率 then
            local 链接 = {提示=format("#S(千年知了王)#R/%s#Y经过一番激烈的战斗，最终战胜了#R千年知了王#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["千年知了王"].ITEM),"千年知了王")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end

function 自写活动:完成知了统领(id组)
      添加完成次数(id组[1],"知了统领")  -----限制刷怪
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(220,230)
        local 银子=平均等级*160+15000
        玩家数据[id].角色:添加经验(经验*HDPZ["知了统领"].经验,"知了统领",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["知了统领"].银子),"知了统领",1)
        玩家数据[id].角色:添加除妖军功(1)

        添加活跃(id,1)
        更新玩家每日(id,"日常任务","知了统领")

        if 取随机数()<=HDPZ["知了统领"].爆率 then
            local 链接 = {提示=format("#S(知了统领)#R/%s#Y经过一番激烈的战斗，最终战胜了#R知了统领#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["知了统领"].ITEM),"知了统领")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end

function 自写活动:完成知了大王(id组)
      添加完成次数(id组[1],"知了大王")  -----限制刷怪
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(220,230)
        local 银子=平均等级*160+15000
        玩家数据[id].角色:添加经验(经验*HDPZ["知了大王"].经验,"知了大王",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["知了大王"].银子),"知了大王",1)
        玩家数据[id].角色:添加除妖军功(1)

        添加活跃(id,1)
        更新玩家每日(id,"日常任务","知了大王")

        if 取随机数()<=HDPZ["知了大王"].爆率 then
            local 链接 = {提示=format("#S(知了大王)#R/%s#Y经过一番激烈的战斗，最终战胜了#R知了大王#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["知了大王"].ITEM),"知了大王")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end
function 自写活动:完成知了小王(id组)
      添加完成次数(id组[1],"知了小王")  -----限制刷怪
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(220,230)
        local 银子=平均等级*160+15000
        玩家数据[id].角色:添加经验(经验*HDPZ["知了小王"].经验,"知了小王",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["知了小王"].银子),"知了小王",1)
        玩家数据[id].角色:添加除妖军功(1)

        添加活跃(id,1)
        更新玩家每日(id,"日常任务","知了小王")

        if 取随机数()<=HDPZ["知了小王"].爆率 then
            local 链接 = {提示=format("#S(知了小王)#R/%s#Y经过一番激烈的战斗，最终战胜了#R知了小王#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["知了小王"].ITEM),"知了小王")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end

function 自写活动:完成知了先锋(id组)
      添加完成次数(id组[1],"知了先锋")  -----限制刷怪
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(220,230)
        local 银子=平均等级*160+15000
        玩家数据[id].角色:添加经验(经验*HDPZ["知了先锋"].经验,"知了先锋",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["知了先锋"].银子),"知了先锋",1)
        玩家数据[id].角色:添加除妖军功(1)

        添加活跃(id,1)
        更新玩家每日(id,"日常任务","知了先锋")

        if 取随机数()<=HDPZ["知了先锋"].爆率 then
            local 链接 = {提示=format("#S(知了先锋)#R/%s#Y经过一番激烈的战斗，最终战胜了#R知了先锋#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["知了先锋"].ITEM),"知了先锋")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end

function 自写活动:完成魂殿殿主(id组)
      添加完成次数(id组[1],"魂殿殿主")  -----限制刷怪
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(220,230)
        local 银子=平均等级*160+15000
        玩家数据[id].角色:添加经验(经验*HDPZ["魂殿殿主"].经验,"魂殿殿主",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["魂殿殿主"].银子),"魂殿使者",1)
        玩家数据[id].角色:添加除妖军功(1)

        添加活跃(id,1)
        更新玩家每日(id,"日常任务","魂殿殿主")

        if 取随机数()<=HDPZ["魂殿使者"].爆率 then
            local 链接 = {提示=format("#S(魂殿使者)#R/%s#Y经过一番激烈的战斗，最终战胜了#R魂殿殿主#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["魂殿使者"].ITEM),"魂殿使者")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end

function 自写活动:完成魂殿使者(id组)
      添加完成次数(id组[1],"魂殿使者")  -----限制刷怪
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(220,230)
        local 银子=平均等级*160+15000
        玩家数据[id].角色:添加经验(经验*HDPZ["魂殿使者"].经验,"魂殿使者",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["魂殿使者"].银子),"魂殿使者",1)
        玩家数据[id].角色:添加除妖军功(1)

        添加活跃(id,1)
        更新玩家每日(id,"日常任务","魂殿使者")

        if 取随机数()<=HDPZ["魂殿使者"].爆率 then
            local 链接 = {提示=format("#S(魂殿使者)#R/%s#Y经过一番激烈的战斗，最终战胜了#R魂殿使者#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["魂殿使者"].ITEM),"魂殿使者")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end

    end

end
function 自写活动:完成夏日炎炎(id组)
      添加完成次数(id组[1],"夏日炎炎")  -----限制刷怪
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(220,230)
        local 银子=平均等级*160+15000
        玩家数据[id].角色:添加经验(经验*HDPZ["夏日炎炎"].经验,"夏日炎炎",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["夏日炎炎"].银子),"夏日炎炎",1)
        玩家数据[id].角色:添加除妖军功(1)

        添加活跃(id,1)
        更新玩家每日(id,"日常任务","夏日炎炎")

        if 取随机数()<=HDPZ["夏日炎炎"].爆率 then
            local 链接 = {提示=format("#S(夏日炎炎)#R/%s#Y经过一番激烈的战斗，最终战胜了#R夏日炎炎#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["夏日炎炎"].ITEM),"夏日炎炎")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end
function 自写活动:完成150级世界BOSS(id组)
      添加完成次数(id组[1],"远古妖魔尊主")  -----限制刷怪
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(220,230)
        local 银子=平均等级*160+15000
        玩家数据[id].角色:添加经验(经验*HDPZ["远古妖魔尊主"].经验,"远古妖魔尊主",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["远古妖魔尊主"].银子),"远古妖魔尊主",1)
        玩家数据[id].角色:添加除妖军功(1)

        添加活跃(id,8)
        更新玩家每日(id,"日常任务","远古妖魔尊主")

        if 取随机数()<=HDPZ["远古妖魔尊主"].爆率 then
            local 链接 = {提示=format("#S(远古妖魔尊主)#R/%s#Y经过一番激烈的战斗，最终战胜了#R妖魔尊主#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["远古妖魔尊主"].ITEM),"远古妖魔尊主")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end


function 自写活动:完成100级世界BOSS(id组)
      添加完成次数(id组[1],"远古妖魔领主")  -----限制刷怪
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(220,230)
        local 银子=平均等级*160+15000
        玩家数据[id].角色:添加经验(经验*HDPZ["远古妖魔领主"].经验,"远古妖魔领主",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["远古妖魔领主"].银子),"远古妖魔领主",1)
        玩家数据[id].角色:添加除妖军功(1)

        添加活跃(id,5)
        更新玩家每日(id,"日常任务","远古妖魔领主")

        if 取随机数()<=HDPZ["远古妖魔领主"].爆率 then
            local 链接 = {提示=format("#S(远古妖魔领主)#R/%s#Y经过一番激烈的战斗，最终战胜了#R妖魔领主#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["远古妖魔领主"].ITEM),"远古妖魔领主")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end

function 自写活动:完成50级世界BOSS(id组)
      添加完成次数(id组[1],"远古妖魔头目")  -----限制刷怪
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(220,230)
        local 银子=平均等级*160+15000
        玩家数据[id].角色:添加经验(经验*HDPZ["远古妖魔头目"].经验,"远古妖魔头目",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["远古妖魔头目"].银子),"远古妖魔头目",1)
        玩家数据[id].角色:添加除妖军功(1)

        添加活跃(id,2)
        更新玩家每日(id,"日常任务","远古妖魔头目")

        if 取随机数()<=HDPZ["远古妖魔头目"].爆率 then
            local 链接 = {提示=format("#S(远古妖魔头目)#R/%s#Y经过一番激烈的战斗，最终战胜了#R妖魔头目#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["远古妖魔头目"].ITEM),"远古妖魔头目")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end
function 自写活动:完成三界财神爷(id组)
      添加完成次数(id组[1],"三界财神爷")  -----限制刷怪
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(220,230)
        local 银子=平均等级*160+15000
        玩家数据[id].角色:添加经验(经验*HDPZ["三界财神爷"].经验,"三界财神爷",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["三界财神爷"].银子),"三界财神爷",1)
        玩家数据[id].角色:添加储备(qz(银子*0.2*HDPZ["三界财神爷"].银子),"三界财神爷",1)
        玩家数据[id].角色:添加除妖军功(1)

        添加活跃(id,1)
        更新玩家每日(id,"日常任务","三界财神爷")

        if 取随机数()<=HDPZ["三界财神爷"].爆率 then
            local 链接 = {提示=format("#S(三界财神爷)#R/%s#Y经过一番激烈的战斗，最终战胜了#R财神爷#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["三界财神爷"].ITEM),"三界财神爷")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end

function 自写活动:完成下凡的灵猴(id组)
      添加完成次数(id组[1],"下凡的灵猴")  -----限制刷怪
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(220,230)
        local 银子=平均等级*160+15000
        玩家数据[id].角色:添加经验(经验*HDPZ["下凡的灵猴"].经验,"下凡的灵猴",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["下凡的灵猴"].银子),"下凡的灵猴",1)
        玩家数据[id].角色:添加储备(qz(银子*0.2*HDPZ["下凡的灵猴"].银子),"下凡的灵猴",1)
        玩家数据[id].角色:添加除妖军功(1)

        添加活跃(id,1)
        更新玩家每日(id,"日常任务","下凡的灵猴")
        if 取随机数()<=HDPZ["下凡的灵猴"].爆率 then
            local 链接 = {提示=format("#S(下凡的灵猴)#R/%s#Y经过一番激烈的战斗，最终战胜了#R灵猴#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["下凡的灵猴"].ITEM),"下凡的灵猴")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end
function 自写活动:完成生肖1星(id组)
        添加完成次数(id组[1],"十二生肖")  -----限制刷怪
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(320,530)
        local 银子=平均等级*160+15000
        local 仙玉=取随机数(18,35)
        玩家数据[id].角色:添加仙玉(仙玉,"生肖1星",1)
        玩家数据[id].角色:添加经验(经验*HDPZ["生肖1星"].经验,"生肖1星",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["生肖1星"].银子),"生肖1星",1)
        玩家数据[id].角色:添加储备(qz(银子*0.2*HDPZ["生肖1星"].银子),"生肖1星",1)
        玩家数据[id].角色:添加除妖军功(1)

        添加活跃(id,2)
        更新玩家每日(id,"日常任务","十二生肖")

        if 取随机数()<=HDPZ["生肖1星"].爆率 then
            local 链接 = {提示=format("#S(十二生肖1★)#R/%s#Y经过一番激烈的战斗，最终战胜了#R1★十二生肖#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["生肖1星"].ITEM),"生肖1星")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end


function 自写活动:完成生肖2星(id组)
        添加完成次数(id组[1],"十二生肖")  -----限制刷怪
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(320,530)
        local 银子=平均等级*160+15000
        local 仙玉=取随机数(18,35)
        玩家数据[id].角色:添加仙玉(仙玉,"生肖2星",1)
        玩家数据[id].角色:添加经验(经验*HDPZ["生肖2星"].经验,"生肖2星",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["生肖2星"].银子),"生肖2星",1)
        玩家数据[id].角色:添加储备(qz(银子*0.2*HDPZ["生肖2星"].银子),"生肖2星",1)
        玩家数据[id].角色:添加除妖军功(1)

        添加活跃(id,4)
        更新玩家每日(id,"日常任务","十二生肖")

        if 取随机数()<=HDPZ["生肖2星"].爆率 then
            local 链接 = {提示=format("#S(十二生肖2★)#R/%s#Y经过一番激烈的战斗，最终战胜了#R2★十二生肖#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["生肖2星"].ITEM),"生肖2星")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end
function 自写活动:完成生肖3星(id组)
        添加完成次数(id组[1],"十二生肖")  -----限制刷怪
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(320,530)
        local 银子=平均等级*160+15000
        local 仙玉=取随机数(18,35)
        玩家数据[id].角色:添加仙玉(仙玉,"生肖3星",1)
        玩家数据[id].角色:添加经验(经验*HDPZ["生肖3星"].经验,"生肖3星",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["生肖3星"].银子),"生肖3星",1)
        玩家数据[id].角色:添加储备(qz(银子*0.2*HDPZ["生肖3星"].银子),"生肖3星",1)
        玩家数据[id].角色:添加除妖军功(1)

        添加活跃(id,6)
        更新玩家每日(id,"日常任务","十二生肖")

        if 取随机数()<=HDPZ["生肖3星"].爆率 then
            local 链接 = {提示=format("#S(十二生肖3★)#R/%s#Y经过一番激烈的战斗，最终战胜了#R3★十二生肖#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["生肖3星"].ITEM),"生肖3星")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end
function 自写活动:完成生肖4星(id组)
        添加完成次数(id组[1],"十二生肖")  -----限制刷怪
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(320,530)
        local 银子=平均等级*160+15000
        local 仙玉=取随机数(18,35)
        玩家数据[id].角色:添加仙玉(仙玉,"生肖4星",1)
        玩家数据[id].角色:添加经验(经验*HDPZ["生肖4星"].经验,"生肖4星",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["生肖4星"].银子),"生肖4星",1)
        玩家数据[id].角色:添加储备(qz(银子*0.2*HDPZ["生肖4星"].银子),"生肖4星",1)
        玩家数据[id].角色:添加除妖军功(1)

        添加活跃(id,8)
        更新玩家每日(id,"日常任务","十二生肖")

        if 取随机数()<=HDPZ["生肖4星"].爆率 then
            local 链接 = {提示=format("#S(十二生肖4★)#R/%s#Y经过一番激烈的战斗，最终战胜了#R4★十二生肖#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["生肖4星"].ITEM),"生肖4星")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end
function 自写活动:完成生肖5星(id组)
        添加完成次数(id组[1],"十二生肖")  -----限制刷怪
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(320,530)
        local 银子=平均等级*160+15000
        local 仙玉=取随机数(18,35)
        玩家数据[id].角色:添加仙玉(仙玉,"生肖5星",1)
        玩家数据[id].角色:添加经验(经验*HDPZ["生肖5星"].经验,"生肖5星",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["生肖5星"].银子),"生肖5星",1)
        玩家数据[id].角色:添加储备(qz(银子*0.2*HDPZ["生肖5星"].银子),"生肖5星",1)
        玩家数据[id].角色:添加除妖军功(1)

        添加活跃(id,10)
        更新玩家每日(id,"日常任务","十二生肖")

        if 取随机数()<=HDPZ["生肖5星"].爆率 then
            local 链接 = {提示=format("#S(十二生肖5★)#R/%s#Y经过一番激烈的战斗，最终战胜了#R5★十二生肖#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["生肖5星"].ITEM),"生肖5星")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end
--=========================武神坛服战
function 自写活动:完成武神八强(id组)
      添加完成次数(id组[1],"武神坛服战")  -----限制刷怪
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(620,830)
        local 银子=平均等级*360+20000
        local 仙玉=取随机数(25,48)
        玩家数据[id].角色:添加经验(经验*HDPZ["武神八强"].经验,"武神八强",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["武神八强"].银子),"武神八强",1)
        玩家数据[id].角色:添加仙玉(仙玉,"武神八强",1)
        玩家数据[id].角色:添加除妖军功(1)

        添加活跃(id,4)
        if 取随机数()<=HDPZ["武神八强"].爆率 then
            local 链接 = {提示=format("#S(武神八强)#R/%s#Y经过一番激烈的战斗，最终战胜了#R武神八强#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["武神八强"].ITEM),"武神八强")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end

function 自写活动:完成武神四强(id组)
      添加完成次数(id组[1],"武神坛服战")  -----限制刷怪
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(620,830)
        local 银子=平均等级*360+20000
        local 仙玉=取随机数(25,48)
        玩家数据[id].角色:添加经验(经验*HDPZ["武神四强"].经验,"武神四强",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["武神四强"].银子),"武神四强",1)
        玩家数据[id].角色:添加仙玉(仙玉,"武神四强",1)
        玩家数据[id].角色:添加除妖军功(1)

        添加活跃(id,5)
        if 取随机数()<=HDPZ["武神四强"].爆率 then
            local 链接 = {提示=format("#S(武神四强)#R/%s#Y经过一番激烈的战斗，最终战胜了#R武神四强#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["武神四强"].ITEM),"武神四强")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end

function 自写活动:完成武神季军(id组)
      添加完成次数(id组[1],"武神坛服战")  -----限制刷怪
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(620,830)
        local 银子=平均等级*360+20000
        local 仙玉=取随机数(25,48)
        玩家数据[id].角色:添加经验(经验*HDPZ["武神季军"].经验,"武神季军",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["武神季军"].银子),"武神季军",1)
        玩家数据[id].角色:添加仙玉(仙玉,"武神季军",1)
        玩家数据[id].角色:添加除妖军功(1)

        添加活跃(id,6)
        if 取随机数()<=HDPZ["武神季军"].爆率 then
            local 链接 = {提示=format("#S(武神季军)#R/%s#Y经过一番激烈的战斗，最终战胜了#R武神季军#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["武神季军"].ITEM),"武神季军")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end

function 自写活动:完成武神亚军(id组)
      添加完成次数(id组[1],"武神坛服战")  -----限制刷怪
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(620,830)
        local 银子=平均等级*360+20000
        local 仙玉=取随机数(25,48)
        玩家数据[id].角色:添加经验(经验*HDPZ["武神亚军"].经验,"武神亚军",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["武神亚军"].银子),"武神亚军",1)
        玩家数据[id].角色:添加仙玉(仙玉,"武神亚军",1)
        玩家数据[id].角色:添加除妖军功(1)

        添加活跃(id,7)
        if 取随机数()<=HDPZ["武神亚军"].爆率 then
            local 链接 = {提示=format("#S(武神亚军)#R/%s#Y经过一番激烈的战斗，最终战胜了#R武神亚军#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["武神亚军"].ITEM),"武神亚军")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end

function 自写活动:完成武神冠军(id组)
      添加完成次数(id组[1],"武神坛服战")  -----限制刷怪
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(620,830)
        local 银子=平均等级*360+20000
        local 仙玉=取随机数(25,48)
        玩家数据[id].角色:添加经验(经验*HDPZ["武神冠军"].经验,"武神冠军",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["武神冠军"].银子),"武神冠军",1)
        玩家数据[id].角色:添加仙玉(仙玉,"武神冠军",1)
        玩家数据[id].角色:添加除妖军功(1)

        添加活跃(id,8)
        if 取随机数()<=HDPZ["武神冠军"].爆率 then
            local 链接 = {提示=format("#S(武神冠军)#R/%s#Y经过一番激烈的战斗，最终战胜了#R武神冠军#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["武神冠军"].ITEM),"武神冠军")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end

function 自写活动:完成醉凡尘(id组)
      添加完成次数(id组[1],"醉凡尘")  -----限制刷怪
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(620,830)
        local 银子=平均等级*560+25000
        local 仙玉=取随机数(36,58)
        玩家数据[id].角色:添加经验(经验*HDPZ["醉凡尘"].经验,"醉凡尘",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["醉凡尘"].银子),"醉凡尘",1)
        玩家数据[id].角色:添加仙玉(仙玉,"醉凡尘",1)
        玩家数据[id].角色:添加除妖军功(1)

        添加活跃(id,1)
        if 取随机数()<=HDPZ["醉凡尘"].爆率 then
            local 链接 = {提示=format("#S(醉凡尘)#R/%s#Y经过一番激烈的战斗，最终战胜了#R醉凡尘#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["醉凡尘"].ITEM),"醉凡尘")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end

function 自写活动:完成仙魔灵墟(id组)
      添加完成次数(id组[1],"仙魔灵墟")  -----限制刷怪
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(620,830)
        local 银子=平均等级*560+25000
        local 仙玉=取随机数(36,58)
        玩家数据[id].角色:添加经验(经验*HDPZ["仙魔灵墟"].经验,"仙魔灵墟",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["仙魔灵墟"].银子),"仙魔灵墟",1)
        玩家数据[id].角色:添加仙玉(仙玉,"仙魔灵墟",1)
        玩家数据[id].角色:添加除妖军功(1)

        添加活跃(id,1)
        if 取随机数()<=HDPZ["仙魔灵墟"].爆率 then
            local 链接 = {提示=format("#S(仙魔灵墟)#R/%s#Y经过一番激烈的战斗，最终战胜了#R仙魔灵墟#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["仙魔灵墟"].ITEM),"仙魔灵墟")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end

function 自写活动:完成云生梦泽(id组)
      添加完成次数(id组[1],"云生梦泽")  -----限制刷怪
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(620,830)
        local 银子=平均等级*560+25000
        local 仙玉=取随机数(36,58)
        玩家数据[id].角色:添加经验(经验*HDPZ["云生梦泽"].经验,"云生梦泽",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["云生梦泽"].银子),"云生梦泽",1)
        玩家数据[id].角色:添加仙玉(仙玉,"云生梦泽",1)
        玩家数据[id].角色:添加除妖军功(1)

        添加活跃(id,1)
        if 取随机数()<=HDPZ["云生梦泽"].爆率 then
            local 链接 = {提示=format("#S(云生梦泽)#R/%s#Y经过一番激烈的战斗，最终战胜了#R云生梦泽#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["云生梦泽"].ITEM),"云生梦泽")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end
--==============================

function 自写活动:决战大雁塔1(id组)
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(220,230)
        local 银子=平均等级*160+15000
        local 决战积分=2
        玩家数据[id].角色:添加经验(经验*HDPZ["决战大雁塔"].经验,"决战大雁塔",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["决战大雁塔"].银子),"决战大雁塔",1)
        玩家数据[id].角色:添加储备(qz(银子*0.2*HDPZ["决战大雁塔"].银子),"决战大雁塔",1)
        玩家数据[id].角色:添加除妖军功(1)

        if 玩家数据[id].角色.决战积分==nil then
            玩家数据[id].角色.决战积分=0
        end
        玩家数据[id].角色.决战积分=玩家数据[id].角色.决战积分+决战积分
        常规提示(id,"#Y/恭喜你战胜了(一层守护神)获得了"..决战积分.."点决战积分")
        if 取随机数()<=HDPZ["决战大雁塔"].爆率 then
            local 链接 = {提示=format("#S(决战大雁塔一守护神)#R/%s#Y经过一番激烈的战斗，最终战胜了#R一层守护神#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["决战大雁塔"].ITEM),"决战大雁塔")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end
function 自写活动:决战大雁塔2(id组)
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(320,430)
        local 银子=平均等级*160+15000
        local 决战积分=2
        玩家数据[id].角色:添加经验(经验*HDPZ["决战大雁塔"].经验,"决战大雁塔",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["决战大雁塔"].银子),"决战大雁塔",1)
        玩家数据[id].角色:添加储备(qz(银子*0.2*HDPZ["决战大雁塔"].银子),"决战大雁塔",1)
        玩家数据[id].角色:添加除妖军功(1)

        if 玩家数据[id].角色.决战积分==nil then
            玩家数据[id].角色.决战积分=0
        end
        玩家数据[id].角色.决战积分=玩家数据[id].角色.决战积分+决战积分
        常规提示(id,"#Y/恭喜你战胜了(二层守护神)获得了"..决战积分.."点决战积分")
        if 取随机数()<=HDPZ["决战大雁塔"].爆率 then
            local 链接 = {提示=format("#S(决战大雁塔二守护神)#R/%s#Y经过一番激烈的战斗，最终战胜了#R二层守护神#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["决战大雁塔"].ITEM),"决战大雁塔")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end
function 自写活动:决战大雁塔3(id组)
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(420,530)
        local 银子=平均等级*160+15000
        local 决战积分=2
        玩家数据[id].角色:添加经验(经验*HDPZ["决战大雁塔"].经验,"决战大雁塔",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["决战大雁塔"].银子),"决战大雁塔",1)
        玩家数据[id].角色:添加储备(qz(银子*0.2*HDPZ["决战大雁塔"].银子),"决战大雁塔",1)
        玩家数据[id].角色:添加除妖军功(1)

        if 玩家数据[id].角色.决战积分==nil then
            玩家数据[id].角色.决战积分=0
        end
        玩家数据[id].角色.决战大雁塔=玩家数据[id].角色.决战大雁塔+决战积分
        常规提示(id,"#Y/恭喜你战胜了(三层守护神)获得了"..决战积分.."点决战积分")
        if 取随机数()<=HDPZ["决战大雁塔"].爆率 then
            local 链接 = {提示=format("#S(决战大雁塔三守护神)#R/%s#Y经过一番激烈的战斗，最终战胜了#R三层守护神#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["决战大雁塔"].ITEM),"决战大雁塔")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end
function 自写活动:决战大雁塔4(id组)
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(620,730)
        local 银子=平均等级*160+15000
        local 决战积分=2
        玩家数据[id].角色:添加经验(经验*HDPZ["决战大雁塔"].经验,"决战大雁塔",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["决战大雁塔"].银子),"决战大雁塔",1)
        玩家数据[id].角色:添加储备(qz(银子*0.2*HDPZ["决战大雁塔"].银子),"决战大雁塔",1)
        玩家数据[id].角色:添加除妖军功(1)

        if 玩家数据[id].角色.决战积分==nil then
            玩家数据[id].角色.决战积分=0
        end
        玩家数据[id].角色.决战积分=玩家数据[id].角色.决战积分+决战积分
        常规提示(id,"#Y/恭喜你战胜了(四层守护神)获得了"..决战积分.."点决战积分")
        if 取随机数()<=HDPZ["决战大雁塔"].爆率 then
            local 链接 = {提示=format("#S(决战大雁塔四守护神)#R/%s#Y经过一番激烈的战斗，最终战胜了#R四层守护神#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["决战大雁塔"].ITEM),"决战大雁塔")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end
function 自写活动:决战大雁塔5(id组)
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(820,930)
        local 银子=平均等级*160+15000
        local 决战积分=2
        玩家数据[id].角色:添加经验(经验*HDPZ["决战大雁塔"].经验,"决战大雁塔",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["决战大雁塔"].银子),"决战大雁塔",1)
        玩家数据[id].角色:添加储备(qz(银子*0.2*HDPZ["决战大雁塔"].银子),"决战大雁塔",1)
        玩家数据[id].角色:添加除妖军功(1)

        if 玩家数据[id].角色.决战积分==nil then
            玩家数据[id].角色.决战积分=0
        end
        玩家数据[id].角色.决战积分=玩家数据[id].角色.决战积分+决战积分
        常规提示(id,"#Y/恭喜你战胜了(五层守护神)获得了"..决战积分.."点决战积分")
        if 取随机数()<=HDPZ["决战大雁塔"].爆率 then
            local 链接 = {提示=format("#S(决战大雁塔五守护神)#R/%s#Y经过一番激烈的战斗，最终战胜了#R五层守护神#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["决战大雁塔"].ITEM),"决战大雁塔")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end
function 自写活动:决战大雁塔6(id组)
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(1020,1130)
        local 银子=平均等级*160+15000
        local 决战积分=2
        玩家数据[id].角色:添加经验(经验*HDPZ["决战大雁塔"].经验,"决战大雁塔",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["决战大雁塔"].银子),"决战大雁塔",1)
        玩家数据[id].角色:添加储备(qz(银子*0.2*HDPZ["决战大雁塔"].银子),"决战大雁塔",1)
        玩家数据[id].角色:添加除妖军功(1)

        if 玩家数据[id].角色.决战积分==nil then
            玩家数据[id].角色.决战积分=0
        end
        玩家数据[id].角色.决战积分=玩家数据[id].角色.决战积分+决战积分
        常规提示(id,"#Y/恭喜你战胜了(五层守护神)获得了"..决战积分.."点决战积分")
        if 取随机数()<=HDPZ["决战大雁塔"].爆率 then
            local 链接 = {提示=format("#S(决战大雁塔五守护神)#R/%s#Y经过一番激烈的战斗，最终战胜了#R五层守护神#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["决战大雁塔"].ITEM),"决战大雁塔")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end
function 自写活动:决战大雁塔7(id组)
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(1220,1330)
        local 银子=平均等级*160+15000
        local 决战积分=2
        玩家数据[id].角色:添加经验(经验*HDPZ["决战大雁塔"].经验,"决战大雁塔",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["决战大雁塔"].银子),"决战大雁塔",1)
        玩家数据[id].角色:添加储备(qz(银子*0.2*HDPZ["决战大雁塔"].银子),"决战大雁塔",1)
        玩家数据[id].角色:添加除妖军功(1)

        if 玩家数据[id].角色.决战积分==nil then
            玩家数据[id].角色.决战积分=0
        end
        玩家数据[id].角色.决战积分=玩家数据[id].角色.决战积分+决战积分
        常规提示(id,"#Y/恭喜你战胜了(六层守护神)获得了"..决战积分.."点决战积分")
        if 取随机数()<=HDPZ["决战大雁塔"].爆率 then
            local 链接 = {提示=format("#S(决战大雁塔六守护神)#R/%s#Y经过一番激烈的战斗，最终战胜了#R六层守护神#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
            local 名称,数量,参数=糖果生成产出(糖果产出物品计算(HDPZ["决战大雁塔"].ITEM),"决战大雁塔")
            if 数量== 9999 then --环
                玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
            else
                玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end
return 自写活动