-- @作者: baidwwy
-- @邮箱:  313738139@qq.com
-- @创建时间:   2023-09-09 17:55:25
-- @最后修改来自: baidwwy
-- @Last Modified time: 2026-05-18 20:36:06
local 镖王活动 = class()
镖王数据={         ----
	{地图=1193,x=135,y=20,z=1}   --(完成任务npc地图坐标,可添加减少)
	,{地图=1501,x=186,y=29,z=0}
	,{地图=1506,x=92,y=36,z=0}
	,{地图=1092,x=23,y=14,z=1}
	,{地图=1514,x=130,y=12,z=0}
	,{地图=1174,x=12,y=142,z=0}
	,开启时间={时=21,分=0,秒=0}
      ,结束时间={时=21,分=30,秒=0}


}
function 镖王活动:初始化()

end
function 镖王活动:定时器()

     if  服务端参数.小时+0==镖王数据.开启时间.时 and 服务端参数.分钟+0 ==镖王数据.开启时间.分  and  服务端参数.秒+0==镖王数据.开启时间.秒  then
        self:开启活动()
       elseif   服务端参数.小时+0==镖王数据.结束时间.时 and 服务端参数.分钟+0 ==镖王数据.结束时间.分   and  服务端参数.秒+0==镖王数据.结束时间.秒 then
        镖王活动开关=false
         广播消息({内容="#G/镖王活动#Y/已经结束,领完任务的还能继续完成镖王活动#32",频道="xt"})
         发送公告("#G/镖王活动#Y/已经结束,领完任务的还能继续完成镖王活动#32")
    end
end
function 镖王活动:开启活动()
  for n=1,6 do
    local 任务id=n.."_"..取随机数(999,1111).."_207_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999)
    随机序列=随机序列+1
    local 地图=镖王数据[n].地图
    local 结束时间= 1800
    任务数据[任务id]={
      id=任务id,
      起始=os.time(),
      结束=结束时间,
      玩家id=id,
      队伍组={},
      名称="镖师",
      称谓="镖王活动",
      模型="护卫",
      x=镖王数据[n].x,
      y=镖王数据[n].y,
      方向=镖王数据[n].z,
      地图编号=地图,
      序列=n,
      地图名称=取地图名称(地图),
      类型=207
    }
    地图处理类:添加单位(任务id)
  end
  广播消息({内容="#G/镖王活动已经开启，各位玩家可以前往长风镖局的#R/郑镖头#G/处报名参加#32",频道="xt"})
  发送公告("#G镖王活动已经开启，各位玩家可以前往长风镖局的#R/郑镖头#G/处报名参加")
   镖王活动开关=true
end
function 镖王活动:添加镖王任务(id,难度)

  if 玩家数据[id].队伍==0 then
    添加最后对话(id,"此活动最少需要五人组队参加。")
    return
  elseif 取队伍人数(id)<1 then
    添加最后对话(id,"此活动最少需要五人组队参加。")
    return
  elseif 取等级要求(id,69)==false then
    添加最后对话(id,"此活动要求最低等级不能小于69级，队伍中有成员等级未达到此要求。")
    return
  elseif 取队伍任务(玩家数据[id].队伍,208) then
    常规提示(id,"#Y/队伍中已有队员领取过此任务了")
    return


  elseif 镖王活动开关~=true then
    添加最后对话(id,"当前不是活动时间。")
    return
  end
  local 任务id=id.."_"..取随机数(999,1111).."_208_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_"..难度
  随机序列=随机序列+1
  local 地图=镖王数据[1].地图
  local 结束时间=3600
  local x临时人物队伍={}
  if 玩家数据[id].队伍~=nil and 玩家数据[id].队伍~=0 then
    for i=1,#队伍数据[玩家数据[id].队伍].成员数据 do
      if 队伍数据[玩家数据[id].队伍].成员数据[i]~=nil then
        x临时人物队伍[#x临时人物队伍+1]=队伍数据[玩家数据[id].队伍].成员数据[i]
      end
    end
  end
  任务数据[任务id]={
    领取人id=x临时人物队伍,
    id=任务id,
    起始=os.time(),
    结束=结束时间,
    玩家id=id,
    队伍组={},
    名称="镖师",
    称谓="镖王活动",
    模型="护卫",
    x=镖王数据[1].x,
    y=镖王数据[1].y,
    方向=镖王数据[1].z,
    地图编号=地图,
    序列=1,
    难度=难度,
    完成={1,2,3,4,5,6},
    地图名称=取地图名称(地图),
    类型=208
  }
  local 队伍id=玩家数据[id].队伍
  for n=1,#队伍数据[队伍id].成员数据 do
    local 临时id=队伍数据[队伍id].成员数据[n]
    任务数据[任务id].队伍组[#任务数据[任务id].队伍组+1]=临时id
    玩家数据[临时id].角色:添加任务(任务id)
    发送数据(玩家数据[临时id].连接id,1501,{名称="郑镖头",模型="男人_镖头",对话=format("请带着这批#Y%s镖银#W立即前往#Y%s(%s,%s)#W处的镖师报道。",任务数据[任务id].难度,任务数据[任务id].地图名称,任务数据[任务id].x,任务数据[任务id].y)})
  end
end

function 镖王活动:怪物对话内容(id,类型,标识,地图)
  local 对话数据={}
  对话数据.模型=任务数据[标识].模型
  对话数据.名称=任务数据[标识].名称
  if 玩家数据[id].角色:取任务(208) ~= 0 and 任务数据[玩家数据[id].角色:取任务(208)].进程 == 任务数据[标识].序号 then
    对话数据.对话="你准备好接受我的考验了么！#24"
    对话数据.选项={"准备好了","我再考虑考虑"}
  else
    对话数据.对话="迎来了中秋的笑脸,迎来了中秋的喜悦!愿你在这双重喜庆的包围下永远幸福、快乐!!"
  end
  return 对话数据
end

-- function 镖王活动:镖王对话处理(数字id,序列,标识,地图)
-- 	对话数据={}
-- 	 local 任务id=玩家数据[数字id].角色:取任务(208)
-- 	    if 任务id==0 then

--          添加最后对话(数字id,"请先前往长风镖局的郑镖头处报名参加本活动")
--     return
-- 	    elseif 玩家数据[数字id].队伍==0 then

--            添加最后对话(数字id,"本活动需要组队才能完成。")
-- 	    elseif 取队伍人数(数字id)<5 then

--          添加最后对话(数字id,"本活动最少需要五人组队才能完成。")
-- 	    else
-- 	      local 通过=true
-- 	      local 队伍id=玩家数据[数字id].队伍
-- 	      for n=1,#队伍数据[队伍id].成员数据 do
-- 	        local 队员id=队伍数据[队伍id].成员数据[n]
-- 	        if 玩家数据[队员id].角色:取任务(208)~=任务id then
-- 	          通过=false
-- 	        end
-- 	      end

-- 	      if 通过==false then
-- 	        对话数据.对话="队伍中存在任务数据不一致的成员。"
-- 	      elseif 任务数据[任务id].序列~=任务数据[标识].序列 then
-- 	        对话数据.对话="你当前不需要在我这里报道。"
-- 	      else
-- 	        --常规提示(数字id,"#Y请接受我的考验吧")
-- 	        战斗准备类:创建战斗(数字id+0,100025,任务id)
-- 	        玩家数据[数字id].地图单位=nil
-- 	        return
-- 	      end
-- 	    end
-- end
function 镖王活动:对话事件处理(id,名称,事件,类型)

  if 事件=="准备好了" then
    if 玩家数据[id].角色:取任务(208) ~= 0 then
      if 任务数据[玩家数据[id].地图单位.标识] == nil then return  end
      if 玩家数据[id].队伍 == 0 then 添加最后对话(id,"此活动可以组队完成,请最少5人组队参加") return  end
      if 取队伍人数(id)<1 then 添加最后对话(id,"此活动最少要有1人") return  end
      if 取等级要求(id,50)==false then 添加最后对话(id,"参与此任务需要全队等级达到50级") return  end
      if not 取队员任务一致(id,208) then  return end
      战斗准备类:创建战斗(id+0,100025,玩家数据[id].角色:取任务(208))
      玩家数据[id].地图单位=nil
    else
      添加最后对话(数字id,"你没有这样的任务")
    end
  end
end
function 镖王活动:战斗胜利处理(id组,任务id)

	 if 任务数据[任务id].序列==6 then --#镖王数据 then
      	    self:完成镖王活动(任务id,id组[1])
            else
	        任务数据[任务id].序列=任务数据[任务id].序列+1
	        任务数据[任务id].地图=镖王数据[任务数据[任务id].序列].地图
	        任务数据[任务id].y=镖王数据[任务数据[任务id].序列].y
	        任务数据[任务id].x=镖王数据[任务数据[任务id].序列].x
	        任务数据[任务id].地图名称=取地图名称(镖王数据[任务数据[任务id].序列].地图)
                   table.remove(任务数据[任务id].完成,任务数据[任务id].战斗序列)
	        for n=1,#id组  do
	          常规提示(id组[n],"#Y恭喜你们通过了本镖师考验，请立即前往下一个镖师处")
	          玩家数据[id组[n]].角色:刷新任务跟踪()
	        end
           end
end
function 镖王活动:完成镖王活动(任务id,数字id)
  if 任务数据[任务id]==nil then
    return
  end
  local 难度=任务数据[任务id].难度
  任务数据[任务id]=nil
  local 队伍id=玩家数据[数字id].队伍
  for n=1,#队伍数据[队伍id].成员数据 do

      local id=队伍数据[队伍id].成员数据[n]
      玩家数据[id].角色:取消任务(任务id)
      --  添加活动次数(id,"镖王押镖")

      -- 妖魔积分[id].当前=妖魔积分[id].当前+30
      -- 妖魔积分[id].总计=妖魔积分[id].总计+30
      -- 常规提示(id,"#Y/你获得了30点妖魔积分(可用于兑换和幸运转盘抽奖)")
      -- 活跃数据[id].活跃度=活跃数据[id].活跃度+30
      -- 玩家数据[id].角色.数据.累积活跃.当前积分=玩家数据[id].角色.数据.累积活跃.当前积分+30
      local 经验加成=2
      local 银子加成=2
      if 难度=="高级" then
        经验加成=3
        银子加成=3
      elseif 难度=="珍贵" then
        经验加成=4
        银子加成=4
      end
     local 等级=玩家数据[id].角色.等级
     local 经验=qz(等级*1000*2*经验加成)
     local 银子=qz(等级*1000*2*银子加成)
     玩家数据[id].角色:添加经验(经验,"镖王活动")
     玩家数据[id].角色:添加银子(银子,"镖王活动",1)
    if 玩家数据[id].角色.参战信息~=nil then
         玩家数据[id].召唤兽:获得经验(玩家数据[id].角色.参战宝宝.认证码,qz(5000),id,"镖王活动",self.地图等级)
     end

      if 难度=="普通" then
        添加仙玉(10,玩家数据[id].账号,id,"珍贵镖王")
         local 奖励参数=取随机数(1,100)
        if 取随机数()<=20 then
          local 名称="鬼谷子"
          玩家数据[id].道具:给予道具(id,名称)
          常规提示(id,"#Y/你获得了"..名称)
          广播消息({内容=format("#S(镖王大赛)#R/在押送#G%s镖银#Y途中表现突出获得了郑镖头的赏识，因此获得了郑镖头额外奖励的#G/%s#Y",玩家数据[id].角色.名称,难度,名称),频道="xt"})
        end
        if 奖励参数<=40 then
          local 名称=取宝石()
          玩家数据[id].道具:给予道具(id,名称,1,1)
          常规提示(id,"#Y/你获得了"..名称)
          广播消息({内容=format("#S(镖王大赛)#R/%s#Y携带着#G%s镖银#Y历经千辛万难终于通过了所有镖师的考验，因此获得了郑镖头奖励的#G/%s#Y",玩家数据[id].角色.名称,难度,名称),频道="xt"})
        elseif 奖励参数<=50 then
          local 名称="高级魔兽要诀"
          玩家数据[id].道具:给予道具(id,名称)
          常规提示(id,"#Y/你获得了"..名称)
          广播消息({内容=format("#S(镖王大赛)#R/%s#Y携带着#G%s镖银#Y历经千辛万难终于通过了所有镖师的考验，因此获得了郑镖头奖励的#G/%s#Y",玩家数据[id].角色.名称,难度,名称),频道="xt"})
        elseif 奖励参数<=60 then
          local 名称="特赦令牌"
          玩家数据[id].道具:给予道具(id,名称,取随机数(1,1))
          常规提示(id,"#Y/你获得了"..名称)
          广播消息({内容=format("#S(镖王大赛)#R/%s#Y携带着#G%s镖银#Y历经千辛万难终于通过了所有镖师的考验，因此获得了郑镖头奖励的#G/%s#Y",玩家数据[id].角色.名称,难度,名称),频道="xt"})
        elseif 奖励参数<=80 then
          local 名称="修炼果"
          玩家数据[id].道具:给予道具(id,名称,1,1)
          常规提示(id,"#Y/你获得了"..名称)
          广播消息({内容=format("#S(镖王大赛)#R/%s#Y携带着#G%s镖银#Y历经千辛万难终于通过了所有镖师的考验，因此获得了郑镖头奖励的#G/%s#Y",玩家数据[id].角色.名称,难度,名称),频道="xt"})
        elseif 奖励参数<=100 then
          local 名称="召唤兽内丹"
          玩家数据[id].道具:给予道具(id,名称,1)
          常规提示(id,"#Y/你获得了"..名称)
          广播消息({内容=format("#S(镖王大赛)#R/%s#Y携带着#G%s镖银#Y历经千辛万难终于通过了所有镖师的考验，因此获得了郑镖头奖励的#G/%s#Y",玩家数据[id].角色.名称,难度,名称),频道="xt"})
        end
      elseif 难度=="高级" then
        添加仙玉(20,玩家数据[id].账号,id,"珍贵镖王")
        local 奖励参数=取随机数(1,110)
        if 取随机数()<=10 then
          local 名称="鬼谷子"
          玩家数据[id].道具:给予道具(id,名称)
          常规提示(id,"#Y/你获得了"..名称)
          广播消息({内容=format("#S(镖王大赛)#R/在押送#G%s镖银#Y途中表现突出获得了郑镖头的赏识，因此获得了郑镖头额外奖励的#G/%s#Y",玩家数据[id].角色.名称,难度,名称),频道="xt"})
        end
        if 奖励参数<=20 then
          local 名称=取宝石()
          玩家数据[id].道具:给予道具(id,名称,1,1)
          常规提示(id,"#Y/你获得了"..名称)
          广播消息({内容=format("#S(镖王大赛)#R/%s#Y携带着#G%s镖银#Y历经千辛万难终于通过了所有镖师的考验，因此获得了郑镖头奖励的#G/%s#Y",玩家数据[id].角色.名称,难度,名称),频道="xt"})
        elseif 奖励参数<=40 then
          local 名称="符石卷轴"
          玩家数据[id].道具:给予道具(id,名称,取随机数(1,1))
          常规提示(id,"#Y/你获得了"..名称)
          广播消息({内容=format("#S(镖王大赛)#R/%s#Y携带着#G%s镖银#Y历经千辛万难终于通过了所有镖师的考验，因此获得了郑镖头奖励的#G/%s#Y",玩家数据[id].角色.名称,难度,名称),频道="xt"})
        elseif 奖励参数<=50 then
          local 名称="高级魔兽要诀"
          玩家数据[id].道具:给予道具(id,名称)
          常规提示(id,"#Y/你获得了"..名称)
          广播消息({内容=format("#S(镖王大赛)#R/%s#Y携带着#G%s镖银#Y历经千辛万难终于通过了所有镖师的考验，因此获得了郑镖头奖励的#G/%s#Y",玩家数据[id].角色.名称,难度,名称),频道="xt"})
        elseif 奖励参数<=60 then
          local 名称="特赦令牌"
          玩家数据[id].道具:给予道具(id,名称,取随机数(1,1))
          常规提示(id,"#Y/你获得了"..名称)
          广播消息({内容=format("#S(镖王大赛)#R/%s#Y携带着#G%s镖银#Y历经千辛万难终于通过了所有镖师的考验，因此获得了郑镖头奖励的#G/%s#Y",玩家数据[id].角色.名称,难度,名称),频道="xt"})
        elseif 奖励参数<=70 then
          local 名称="修炼果"
          玩家数据[id].道具:给予道具(id,名称,1,1)
          常规提示(id,"#Y/你获得了"..名称)
          广播消息({内容=format("#S(镖王大赛)#R/%s#Y携带着#G%s镖银#Y历经千辛万难终于通过了所有镖师的考验，因此获得了郑镖头奖励的#G/%s#Y",玩家数据[id].角色.名称,难度,名称),频道="xt"})
        elseif 奖励参数<=95 then
          local 名称="召唤兽内丹"
          玩家数据[id].道具:给予道具(id,名称,1)
          常规提示(id,"#Y/你获得了"..名称)
          广播消息({内容=format("#S(镖王大赛)#R/%s#Y携带着#G%s镖银#Y历经千辛万难终于通过了所有镖师的考验，因此获得了郑镖头奖励的#G/%s#Y",玩家数据[id].角色.名称,难度,名称),频道="xt"})

        end
     elseif 难度=="珍贵" then
          添加仙玉(30,玩家数据[id].账号,id,"珍贵镖王")
        local 奖励参数=取随机数(1,100)
         if 取随机数()<=10 then
          local 名称="鬼谷子"
          玩家数据[id].道具:给予道具(id,名称)
          常规提示(id,"#Y/你获得了"..名称)
          广播消息({内容=format("#S(镖王大赛)#R/在押送#G%s镖银#Y途中表现突出获得了郑镖头的赏识，因此获得了郑镖头额外奖励的#G/%s#Y",玩家数据[id].角色.名称,难度,名称),频道="xt"})
        end
        if 奖励参数<=20 then
          local 名称="金柳露"
          玩家数据[id].道具:给予道具(id,名称,1)
          常规提示(id,"#Y/你获得了"..名称)
          广播消息({内容=format("#S(镖王大赛)#R/%s#Y携带着#G%s镖银#Y历经千辛万难终于通过了所有镖师的考验，因此获得了郑镖头奖励的#G/%s#Y",玩家数据[id].角色.名称,难度,名称),频道="xt"})
        elseif 奖励参数<=30 then
          local 名称="符石卷轴"
          玩家数据[id].道具:给予道具(id,名称,取随机数(1,1))
          常规提示(id,"#Y/你获得了"..名称)
          广播消息({内容=format("#S(镖王大赛)#R/%s#Y携带着#G%s镖银#Y历经千辛万难终于通过了所有镖师的考验，因此获得了郑镖头奖励的#G/%s#Y",玩家数据[id].角色.名称,难度,名称),频道="xt"})
        elseif 奖励参数<=40 then
          local 名称="高级魔兽要诀"
          玩家数据[id].道具:给予道具(id,名称)
          常规提示(id,"#Y/你获得了"..名称)
          广播消息({内容=format("#S(镖王大赛)#R/%s#Y携带着#G%s镖银#Y历经千辛万难终于通过了所有镖师的考验，因此获得了郑镖头奖励的#G/%s#Y",玩家数据[id].角色.名称,难度,名称),频道="xt"})
        elseif 奖励参数<=50 then
          local 名称="特赦令牌"
          玩家数据[id].道具:给予道具(id,名称,1)
          常规提示(id,"#Y/你获得了"..名称)
          广播消息({内容=format("#S(镖王大赛)#R/%s#Y携带着#G%s镖银#Y历经千辛万难终于通过了所有镖师的考验，因此获得了郑镖头奖励的#G/%s#Y",玩家数据[id].角色.名称,难度,名称),频道="xt"})
        elseif 奖励参数<=60 then
          local 名称="高级召唤兽内丹"
          玩家数据[id].道具:给予道具(id,名称,1)
          常规提示(id,"#Y/你获得了"..名称)
          广播消息({内容=format("#S(镖王大赛)#R/%s#Y携带着#G%s镖银#Y历经千辛万难终于通过了所有镖师的考验，因此获得了郑镖头奖励的#G/%s#Y",玩家数据[id].角色.名称,难度,名称),频道="xt"})
        elseif 奖励参数<=70 then
          local 名称="召唤兽内丹"
          玩家数据[id].道具:给予道具(id,名称,1)
          常规提示(id,"#Y/你获得了"..名称)
          广播消息({内容=format("#S(镖王大赛)#R/%s#Y携带着#G%s镖银#Y历经千辛万难终于通过了所有镖师的考验，因此获得了郑镖头奖励的#G/%s#Y",玩家数据[id].角色.名称,难度,名称),频道="xt"})
        elseif 奖励参数<=80 then
          local 名称=取宝石()
          玩家数据[id].道具:给予道具(id,名称,1)
          常规提示(id,"#Y/你获得了"..名称)
          广播消息({内容=format("#S(镖王大赛)#R/%s#Y携带着#G%s镖银#Y历经千辛万难终于通过了所有镖师的考验，因此获得了郑镖头奖励的#G/%s#Y",玩家数据[id].角色.名称,难度,名称),频道="xt"})
        elseif 奖励参数<=82 then
          local 名称="无级别宝珠"
          玩家数据[id].道具:给予道具(id,名称,1)
          常规提示(id,"#Y/你获得了"..名称)
          广播消息({内容=format("#S(镖王大赛)#R/%s#Y携带着#G%s镖银#Y历经千辛万难终于通过了所有镖师的考验，因此获得了郑镖头奖励的#G/%s#Y",玩家数据[id].角色.名称,难度,名称),频道="xt"})

        end
        end
        end
        end
return  镖王活动