-- @Author: 小神QQ190909219
-- @Date:   2025-04-11 10:13:38
-- @Last Modified by:   tangguo
-- @Last Modified time: 2026-05-06 11:39:03
-- @Author: baidwwy
-- @Date:   2025-04-11 06:11:19
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2025-04-11 08:32:15
local 糖果专用系统 = class()
local ffi = require("ffi")
function 糖果专用系统:初始化()
加载内充数据()
end

function 糖果专用系统:糖果内充系统类(id,内容)
  local a =nil

  for n, v in pairs(内充组) do
      local c = os.remove(程序目录..[[\自动充值\]]..n..[[\]]..内容..[[.txt]])
      if c then
          local x = 分割文本(n, "-")
        if x[1]=="点卡" then
          添加点卡(id,玩家数据[id].账号,x[2],"cdk充值")
          添加累充(id,x[3],"cdk充值",1)
        elseif x[1]=="累充" then
          添加累充(id,x[2],"cdk充值",1)
        elseif x[1]=="奖池抽奖" then
           local 令牌数量 = tonumber(x[2])
           玩家数据[id].道具:给予道具(id,"奖池抽奖",令牌数量,nil,"不存共享")
           添加累充(id,x[3],"cdk充值",1)
        广播消息({内容="#S (奖池抽奖)#Y玩家：#R"..玩家数据[id].角色.名称.."#Y在老G处赞助了"..x[2].."个奖池抽奖,感谢老板为本服做出的贡献！".."#"..取随机数(1,110),频道="xt"})
        elseif x[1]=="仙玉" then
         添加仙玉(id,玩家数据[id].账号,x[2],"cdk充值")
         添加累充(id,x[3],"cdk充值",1)
        广播消息({内容="#S (仙玉)#Y玩家：#R"..玩家数据[id].角色.名称.."#Y在老G处赞助了"..x[3].."元的仙玉,感谢老板为本服做出的贡献！".."#"..取随机数(1,110),频道="xt"})
        elseif x[1]=="银子" then
         玩家数据[id].角色:添加银子(x[2],"cdk充值",1)
         添加累充(id,x[3],"cdk充值",1)
        elseif x[1]=="鲲鹏礼包" then
         添加累充(id,x[2],"cdk充值",1)
         玩家数据[id].道具:给予道具(id,"鲲鹏礼包",1,nil,"赞助")
        广播消息({内容="#S/(鲲鹏礼包)#Y玩家：#R"..玩家数据[id].角色.名称.."#Y在老G处赞助了一个"..x[1]..",感谢老板为本服做出的贡献！".."#"..取随机数(1,110),频道="xt"})
        elseif x[1]=="五福鲲鹏礼包" then
         添加累充(id,x[2],"cdk充值",1)
          玩家数据[id].道具:给予道具(id,"五福鲲鹏礼包",1,nil,"赞助")
        广播消息({内容="#S/(五福鲲鹏礼包)#Y玩家：#R"..玩家数据[id].角色.名称.."#Y在老G处赞助了一个"..x[1]..",感谢老板为本服做出的贡献！".."#"..取随机数(1,110),频道="xt"})
        elseif x[1]=="钟灵石" then
          添加累充(id,x[2],"cdk充值",1)
          玩家数据[id].道具:给予道具(id,"自选钟灵石",4,nil,"赞助")
          广播消息({内容="#S/(钟灵石)#Y玩家：#R"..玩家数据[id].角色.名称.."#Y在老G处赞助了一套10级"..x[1].."礼包,感谢老板为本服做出的贡献！".."#"..取随机数(1,110),频道="xt"})
        elseif x[1]=="上古玉魄自选" then
          添加累充(id,x[2],"cdk充值",1)
          玩家数据[id].道具:给予道具(id,"上古玉魄阳自选",1,nil,"赞助")
          玩家数据[id].道具:给予道具(id,"上古玉魄阴自选",1,nil,"赞助")
          广播消息({内容="#S/(上古玉魄自选)#Y玩家：#R"..玩家数据[id].角色.名称.."#Y在老G处赞助了一套"..x[1].."礼包,感谢老板为本服做出的贡献！".."#"..取随机数(1,110),频道="xt"})
        elseif x[1]=="首冲奖励" then
          local 奖励列表 = 首冲配置.物品
          if 玩家数据[id].角色.首冲奖励 then
                常规提示(id,"#y/少侠你已购买过此礼包，无法继续购买。")
                return
          end
          if 奖励列表 and type(奖励列表) == "table" then
            for i = 1, #奖励列表 do
              local 奖励 = 奖励列表[i]
              玩家数据[id].道具:给予道具(id, 奖励.名称, 奖励.数量, nil, "不存共享")
            end
          end
          玩家数据[id].角色.首冲奖励 = true
          发送数据(玩家数据[id].连接id, 200.2, {已购买 = 玩家数据[id].角色.首冲奖励})
          添加累充(id,x[2],"cdk充值",1)
          广播消息({内容="#S/(首冲奖励)#Y玩家：#R"..玩家数据[id].角色.名称.."#Y在老G处激活了首冲,感谢老板为本服做出的贡献！".."#"..取随机数(1,110),频道="xt"})

        elseif x[1]=="588R满赞礼包" then
          添加累充(id,x[2],"cdk充值",1)
          玩家数据[id].道具:给予道具(id,"自选钟灵石",4,nil,"赞助")
          玩家数据[id].道具:给予道具(id,"五福鲲鹏礼包",1,nil,"赞助")
          添加仙玉(id,玩家数据[id].账号,x[3],"cdk充值")
          广播消息({内容="#S/(588R满赞礼包)#Y玩家：#R"..玩家数据[id].角色.名称.."#Y在老G处购买了一套"..x[1]..",感谢老板为本服做出的贡献！".."#"..取随机数(1,110),频道="xt"})

        elseif x[1]=="新人礼包" then
          if 玩家数据[id].角色.新人礼包==1 and not 调试模式 then
            常规提示(id,"你已兑换过新人礼包，无法再次兑换")
            return
          end
          玩家数据[id].道具:给予道具(id,"自动抓鬼卡礼包",5,nil,"赞助")
          玩家数据[id].道具:给予道具(id,"青花瓷锦衣",1,nil,"赞助")
          玩家数据[id].道具:给予道具(id,"会员周卡",1,nil,"赞助")
           玩家数据[id].角色:添加仙玉(30000)
          if 玩家数据[id].角色.新人礼包==0 then
                玩家数据[id].角色.新人礼包=1
          end
        elseif x[1]=="会员卡" then
           if  玩家数据[id].角色.月卡 == nil then
                玩家数据[id].角色.月卡 = {生效=true,到期时间=os.time()+60*60*24*365}
            elseif os.time()-玩家数据[id].角色.月卡.到期时间 >= 0 then
                玩家数据[id].角色.月卡 = {生效=true,到期时间=os.time()+60*60*24*365}
          else
                玩家数据[id].角色.月卡 = {生效=true,到期时间=玩家数据[id].角色.月卡.到期时间+60*60*24*365}
          end
          local 经验=30000000
          local 银子=100000000
          玩家数据[id].角色:添加经验(经验,"月卡",1)
          玩家数据[id].角色:添加银子(银子,"月卡",1)
          --玩家数据[id].道具:给予道具(id,"奖池抽奖",5,nil,"赞助")
          玩家数据[id].道具:给予道具(id,"修炼果",20,nil,"赞助")
          玩家数据[id].道具:给予道具(id,"神兜兜",20,nil,"赞助")
          --玩家数据[id].道具:给予道具(id,"扫荡卡",30,nil,"赞助")
          玩家数据[id].道具:给予道具(id,"九转金丹礼包",5,nil,"赞助")
         -- 玩家数据[id].道具:给予道具(id,"自动抓鬼年卡",1,nil,"赞助")
          发送数据(玩家数据[id].连接id,6573.1,{月卡=玩家数据[id].角色.月卡})
          添加累充(id,x[2],"cdk充值",1)
          常规提示(id,"#Y激活会员成功,会员到期日前,每日可领取奖励物品！")
        广播消息({内容="#S/(会员卡)#Y玩家：#R"..玩家数据[id].角色.名称.."#Y在老G处赞助了一年"..x[1]..",感谢老板为本服做出的贡献！".."#"..取随机数(1,110),频道="xt"})
      end
         发送数据(玩家数据[id].连接id,7,"#G/充值成功！")
        local CDK记录=读入文件([[充值记录\]]..[[\消费记录.txt]])
        CDK记录=CDK记录..format("%s：玩家账号[%s]ID:[%s]卡号:[%s]==本次触发事件[%s]",时间转换(os.time()),玩家数据[id].账号,id,内容,x[1]).."\n"
        写出文件([[充值记录\]]..[[\消费记录.txt]],CDK记录)

        return 0
      end
  end
  if a==nil then
    发送数据(玩家数据[id].连接id,7,"#G/CDK无效或已经被兑换")
  end
end

function 糖果专用系统:召唤兽切换锦衣(id)
    if 玩家数据[id].角色.参战信息==nil then
        添加最后对话(id,"请将需要切换的宝宝参战！")
        return
    end
    local 编号=玩家数据[id].召唤兽:取编号(玩家数据[id].角色.参战宝宝.认证码)
    if 编号~=0 and 玩家数据[id].召唤兽.数据[编号] then
        if 玩家数据[id].召唤兽.数据[编号].饰品~=nil then
            添加最后对话(id,"请先卸下召唤兽饰品！")
            return
        elseif 玩家数据[id].召唤兽.数据[编号].锦衣编号==nil then
            添加最后对话(id,"#17少侠，该召唤兽未获得锦衣或者召唤兽造型未开放，无法切换！！")
            return
        elseif 玩家数据[id].召唤兽.数据[编号].锦衣编号==0 then
            添加最后对话(id,"#17少侠，该召唤兽未获得锦衣或者召唤兽造型未开放，无法切换！！")
            return
        end
        if string.find(玩家数据[id].召唤兽.数据[编号].模型,"锦衣")~=nil then
            if 玩家数据[id].角色:扣除银子(5000000,0,0,"切换宝宝造型") then
              玩家数据[id].召唤兽.数据[编号].模型=string.gsub(玩家数据[id].召唤兽.数据[编号].模型,"锦衣","")
              -- if 调试模式 then
              --     玩家数据[id].道具:给予道具(id,"召唤兽锦衣",1)
              --     玩家数据[id].召唤兽.数据[编号].锦衣编号=0
              --     print("召唤兽锦衣")
              -- end
                if tonumber(玩家数据[id].召唤兽.数据[编号].攻击资质) ~= nil then
                  玩家数据[id].召唤兽.数据[编号].攻击资质 = 玩家数据[id].召唤兽.数据[编号].攻击资质
                end
                if tonumber(玩家数据[id].召唤兽.数据[编号].防御资质) ~= nil then
                  玩家数据[id].召唤兽.数据[编号].防御资质 = 玩家数据[id].召唤兽.数据[编号].防御资质
                end
                if tonumber(玩家数据[id].召唤兽.数据[编号].体力资质) ~= nil then
                  玩家数据[id].召唤兽.数据[编号].体力资质 = 玩家数据[id].召唤兽.数据[编号].体力资质
                end
                if tonumber(玩家数据[id].召唤兽.数据[编号].法力资质) ~= nil then
                  玩家数据[id].召唤兽.数据[编号].法力资质 = 玩家数据[id].召唤兽.数据[编号].法力资质
                end
                if tonumber(玩家数据[id].召唤兽.数据[编号].速度资质) ~= nil then
                  玩家数据[id].召唤兽.数据[编号].速度资质 = 玩家数据[id].召唤兽.数据[编号].速度资质
                end
                if tonumber(玩家数据[id].召唤兽.数据[编号].躲闪资质) ~= nil then
                  玩家数据[id].召唤兽.数据[编号].躲闪资质 = 玩家数据[id].召唤兽.数据[编号].躲闪资质
                end
                if tonumber(玩家数据[id].召唤兽.数据[编号].成长) ~= nil then
                  玩家数据[id].召唤兽.数据[编号].成长 = 玩家数据[id].召唤兽.数据[编号].成长
                end
                发送数据(id,6556,玩家数据[id].召唤兽.数据[编号])
                发送数据(玩家数据[id].连接id,6556,玩家数据[id].召唤兽.数据[编号])
                添加最后对话(id,"恭喜你的召唤兽获得了新的形态！")
            end
        else
            local mx="锦衣"..玩家数据[id].召唤兽.数据[编号].模型
            local go=false
            if self:取召唤兽锦衣(mx) then
                go=true
            end
            if go then
                if 玩家数据[id].角色:扣除银子(5000000,0,0,"切换宝宝造型") then
                    玩家数据[id].召唤兽.数据[编号].模型=mx
                    if tonumber(玩家数据[id].召唤兽.数据[编号].攻击资质) ~= nil then
                      玩家数据[id].召唤兽.数据[编号].攻击资质 = 玩家数据[id].召唤兽.数据[编号].攻击资质
                    end
                    if tonumber(玩家数据[id].召唤兽.数据[编号].防御资质) ~= nil then
                      玩家数据[id].召唤兽.数据[编号].防御资质 = 玩家数据[id].召唤兽.数据[编号].防御资质
                    end
                    if tonumber(玩家数据[id].召唤兽.数据[编号].体力资质) ~= nil then
                      玩家数据[id].召唤兽.数据[编号].体力资质 = 玩家数据[id].召唤兽.数据[编号].体力资质
                    end
                    if tonumber(玩家数据[id].召唤兽.数据[编号].法力资质) ~= nil then
                      玩家数据[id].召唤兽.数据[编号].法力资质 = 玩家数据[id].召唤兽.数据[编号].法力资质
                    end
                    if tonumber(玩家数据[id].召唤兽.数据[编号].速度资质) ~= nil then
                      玩家数据[id].召唤兽.数据[编号].速度资质 = 玩家数据[id].召唤兽.数据[编号].速度资质
                    end
                    if tonumber(玩家数据[id].召唤兽.数据[编号].躲闪资质) ~= nil then
                      玩家数据[id].召唤兽.数据[编号].躲闪资质 = 玩家数据[id].召唤兽.数据[编号].躲闪资质
                    end
                    if tonumber(玩家数据[id].召唤兽.数据[编号].成长) ~= nil then
                      玩家数据[id].召唤兽.数据[编号].成长 = 玩家数据[id].召唤兽.数据[编号].成长
                    end
                    发送数据(id,6556,玩家数据[id].召唤兽.数据[编号])
                    发送数据(玩家数据[id].连接id,6556,玩家数据[id].召唤兽.数据[编号])
                    添加最后对话(id,"恭喜你的召唤兽获得了新的形态！")
                end
            else
                添加最后对话(id,"#17少侠，该召唤兽造型未开放")
            end
        end
    else
        添加最后对话(id,"少侠您的召唤兽好像无法转换造型。")
    end
end
function 糖果专用系统:取召唤兽锦衣(sj)
local lb = {
"锦衣鬼将","锦衣持国巡守","锦衣谛听",
"锦衣画魂","锦衣狂豹人形","锦衣猫灵人形",
"锦衣雷鸟人","锦衣龙鲤","锦衣毗舍童子",
"锦衣日游神","锦衣涂山瞳","锦衣涂山雪",
"锦衣吸血鬼","锦衣月魅"
}
 local fhz = false
  for i=1,#lb do
    if lb[i] == sj then
        fhz = true
    end
  end
  return fhz
end
return 糖果专用系统