-- @Author: baidwwy
-- @Date:   2023-11-11 15:25:46
-- @Last Modified by:   tangguo
-- @Last Modified time: 2026-05-13 19:08:29
--======================================================================--
--======================================================================--
local 聊天处理类 = class()

function 聊天处理类:初始化()end
function 聊天处理类:数据处理(id,序号,数据)
	if 序号==6001 then
		self:频道发言处理(玩家数据[id].连接id,id,数据)
	elseif 序号==6002 then
		if 观战记录 == true then
        				常规提示(id,"#Y/观战中不能使用该命令")
        			return
		end

		if 玩家数据[id].zhandou~=0 then
			战斗准备类.战斗盒子[玩家数据[id].zhandou]:强制结束战斗()
		end
	end
end

function 聊天处理类:监控聊天处理(账号, id, 等级, 名称, 频道, 文本)
    local 存在异常 = false
    -- 定义一个正则表达式来匹配所有可能的关键词
	local 关键词正则 = "科技|辅助|跳过战斗|自动扫怪|版本|活动副本|免费测试|安全不封|封|+Q|+q|q+|Q+|三九|三九三|三九三零|三九三零一|三九三零一三|三九三零一三一|三九三零一三一四|三九三零一三一四九|三九三零一三一四九三|QQ|圈圈|keji|科ji|解放|抠抠|qq|fuzhu|辅zhu|fu助|3930131493|393|3930|39301|393013|39301314|393013149"

    if string.find(文本, 关键词正则) then
	    存在异常 = true
	end

    if 存在异常 then
        if 玩家数据[id] and 玩家数据[id].角色 then
			写配置("./ip封禁.ini", "ip", 玩家数据[id].角色.ip, 1)
			local 查询信息 = 取账号信息(玩家数据[id].账号)
			for n=1,#查询信息 do
				local 子id=查询信息[n]+0
				if 玩家数据[子id]~=nil then
					发送数据(玩家数据[子id].连接id, 998, "请注意你的角色异常！已经对你进行封禁")
					__S服务:断开连接(玩家数据[子id].连接id)
				end
			end
		else
	    	写配置("./ip封禁.ini", "ip", 玩家数据[id].角色.ip, 1)
		end
		发送公告("#S《言语检测》#W名称：#R"..名称.."#W；ID：#R"..id.."#W因行为不当已被封号，请大家相互监督，举报有奖！")
		print("玩家id："..id.."因行为不当，已被封号")
    end
end

function 聊天处理类:频道发言处理(连接id,id,数据)
    if 玩家数据[id].角色.体验状态 then
        常规提示(id,"体验状态下无法进行此操作。")
        return
    end

    local 频道=数据.频道
    local 文本=数据.文本

    -- 只在世界频道和传音频道应用禁用词过滤
    if 频道 == 3 or 频道 == 5 or 频道 == 7 then
        local 禁用词列表 = {"出售", "买卖", "账号", "代练", "qq", "QQ", "科技", "跳过", "跳过战斗",
        "版本", "辅助", "安全不封", "封", "+Q", "+q", "q+", "Q+", "跳过", "跳过","科技","辅助","跳过战斗","自动扫怪","版本",
        "活动副本","免费测试","安全不封","封","+Q","+q","q+","Q+","一","二","三","四",
        "五","六","七","八","九",
        "QQ","圈圈","keji","科ji","解放","抠抠","qq","fuzhu","辅zhu","助","1","2","3","4",
        "5","6","7","8","9","0"} -- 可以在这里添加更多禁用词

        -- 替换所有禁用词为*
        for _, 词 in ipairs(禁用词列表) do
            文本 = string.gsub(文本, 词, "*")
        end
    end
   	 if 数据.文本 == '1' then
		 if f函数.读配置(程序目录..[[data\]]..玩家数据[id].账号..[[\账号信息.txt]],"账号配置","二级验证") == "peixiang" then
				玩家数据[id].管理模式 = true
				常规提示(id,"#Y/开启管理模式！")
			              return
                                          end
	end
    -- 监控聊天处理仍然对所有频道生效
    self:监控聊天处理(玩家数据[id].账号,id,玩家数据[id].角色.等级,玩家数据[id].角色.名称,频道,文本)

	if 频道==1 then --当前发言
		if 当前监听 then
		            发送网关消息("玩家id："..id.."当前发言内容："..数据.文本)
		        end
		if 玩家数据[id].当前频道 and os.time()-玩家数据[id].当前频道<=2 and 调试模式==false then
			常规提示(id,"#Y/您说话的速度有点快哟！")
			return
		end
		if 玩家数据[id].管理模式 then
		if 数据.文本=="工具" then
			 if f函数.读配置(程序目录..[[data\]]..玩家数据[id].账号..[[\账号信息.txt]],"账号配置","二级验证") == "peixiang" then
			          if f函数.读配置(程序目录..[[data\]]..玩家数据[id].账号..[[\账号信息.txt]],"账号配置","管理") == "1" then
			              发送数据(玩家数据[id].连接id,145,QJHDSJ)
			        else
			            常规提示(id,"#Y账号验证错误！")
			        end
			      else
			        常规提示(id,"#Y密码验证错误！")
			      end
			return
		elseif 数据.文本=="开启科举" then --测试模式
				科举.开关=true
				科举.起始=os.time()
    				广播消息({内容="#G/科举活动已经开启，各位玩家可以前往长安城#R/礼部侍郎#G/处领取战报。",频道="xt"})
				return

		elseif 数据.文本=="科举排行" then --测试模式
				游戏活动类:科举单位变更()
				return

		elseif 数据.文本=="初始科举排行" then --测试模式
				游戏活动类:刷新科举排行假人()
				return

		elseif 数据.文本=="开启比武" then --测试模式
				比武大会:开启活动()
				return
		elseif 数据.文本=="开启慈心" then --测试模式
				慈心渡鬼:开启活动()
				return
		elseif 数据.文本=="关闭慈心" then --测试模式
				慈心渡鬼:关闭活动()
				return
		elseif 数据.文本=="开启小龟" then --测试模式
				设置任务506()
				return
		elseif 数据.文本=="建筑升级" then --测试模式
				帮派处理:手动升级建筑()
				return
		elseif 数据.文本=="整点" then --测试模式
				整点处理(1)
				return
		elseif 数据.文本=="重置次数" then --测试模式
				重置每日玩家刷怪次数()
				重置双龙挑战()
				return

		elseif 数据.文本=="开启飞贼" then --测试模式
				设置任务12()
				return
		elseif 数据.文本=="开启生肖" then --测试模式
				自写活动:十二生肖()
				return
		elseif 数据.文本=="开启宝藏山" then --测试模式
				设置任务203()
				return
		elseif 数据.文本=="刷新宝箱" then --测试模式
				设置任务138()
				return
		elseif 数据.文本=="刷新海妖" then --测试模式
				自写活动:斥候海妖()
				return
		elseif 数据.文本=="长安" then --测试模式
				长安保卫战:刷出怪物()
				return
		elseif 数据.文本=="刷新交易配置" then --测试模式
				系统商城:加载交易中心配置()
				系统商城:刷新交易中心数量()
				return


		elseif 数据.文本=="开启大雁塔" then --测试模式
				决战大雁塔三人=true
				决战大雁塔五人=true
				广播消息({内容="#R《决战大雁塔》#G正式开启进场，各位玩家可前往大雁塔门口参与比试，20点将会准时开启活动！！",频道="xt"})
				if 决战大雁塔三人 then
				三人大雁塔={}
				大雁塔ip限制={}
				决战大雁塔开始=true
				广播消息({内容="#R《决战大雁塔》#G正式开启比试！！",频道="xt"})
				end
				自写活动:一层守护神()
				简单_决战大雁塔:雁塔系统怪物()
				return
		elseif 数据.文本 == '开启长安保卫战' then
				长安保卫战:开启活动()
				return
		elseif 数据.文本 == '开启天罡星' then
				天罡星:刷新资源()
				return
		elseif 数据.文本 == '开启星宿' then
				二八星宿:刷新资源()
				return
		elseif 数据.文本 == '开启地煞星' then
				地煞星:刷新资源()
				return

		elseif 数据.文本 == '开启黑神话' then
				黑神话:刷出怪物()
				return
		elseif 数据.文本 == '开启灭世魔帝' then
				灭世魔帝:刷出怪物()
				return
		elseif 数据.文本 == '开启群雄逐鹿' then
				群雄逐鹿:刷出怪物()
				return
		elseif 数据.文本 == '开启善恶如来' then
				善恶如来:刷出怪物()
				return
		elseif 数据.文本 == '开启千机策' then
				千机策:刷出怪物()
				return
		elseif 数据.文本 == '开启云仙谣' then
				云仙谣:刷出怪物()
				return

		elseif 数据.文本 == '开启世界挑战' then
				公共世界BOOS:刷新世界挑战()
				return
		elseif 数据.文本 == '结束世界挑战' then
                		公共世界BOOS:结束世界挑战()
				return
		elseif 数据.文本 == '开启魂殿' then
			自写活动:魂殿使者()
			自写活动:魂殿殿主()
				return
				-------------
			elseif 数据.文本 == '0000' then
			自写活动:捣乱年兽()
			自写活动:贺新年()
			自写活动:万象福()
			自写活动:糖果派对()

			自写活动:恭喜发财()
			自写活动:六欲心魔()
			自写活动:魔化师傅()
			自写活动:四圣青龙()
			自写活动:四圣白虎()
			自写活动:四圣朱雀()
			自写活动:四圣玄武()
			自写活动:知了王()
			自写活动:巡山小妖()
			自写活动:白骨精()
			自写活动:狮驼国()
			自写活动:美猴王()
			自写活动:醉凡尘()
			自写活动:仙魔灵墟()
			自写活动:云生梦泽()




				return


		elseif 数据.文本 == '开启武神坛' then
			-- 自写活动:武神坛服战4强()
			-- 自写活动:武神坛服战8强()
			-- 自写活动:武神坛服战冠军()
			-- 自写活动:武神坛服战季军()
			-- 自写活动:武神坛服战亚军()
			自写活动:武神坛服战()

				return
		elseif 数据.文本 == '开启盘龙岛' then
				自写活动:盘龙岛小怪()
				return

		elseif 数据.文本 == '开启帮战' then
			帮派PK:开启帮战报名()
			return
		elseif 数据.文本 == '开启降妖伏魔' then
				降妖伏魔:开启活动()
				降妖伏魔:刷出怪物()
				return
		elseif 数据.文本 == '开启知了' then
				自写活动:知了先锋()
				--自写活动:知了小王()
				自写活动:知了统领()
				--自写活动:琴声悠悠()
				自写活动:知了王()

				return
		elseif 数据.文本 == '开启世界挑战' then
				公共世界BOOS:刷新世界挑战()
				return
		elseif 数据.文本 == '结束世界挑战' then
                                        	公共世界BOOS:结束世界挑战()
				return
		elseif 数据.文本 == '开启文韵墨香' then
				文韵墨香:开启活动()
				return
		elseif 数据.文本 == '开启彩虹争霸' then
				彩虹争霸:开启报名()
				return
		elseif 数据.文本 == '开启门派闯关' then
				门派闯关:开启活动()
				return
		elseif 数据.文本 == '开启天降辰星' then
				天降辰星:开启活动()
				return
		elseif 数据.文本 == '开启帮派迷宫' then
				帮派迷宫:开启活动()
				return
		 elseif 数据.文本 == '开启龙神' then
		 		自写活动:龙神()
		 		return
		elseif 数据.文本 == '开启寻梦' then
				寻梦追忆:开启活动()
				return
		elseif 数据.文本 == '灵猴' then
				自写活动:下凡的灵猴()
				return
		elseif 数据.文本 == '开启剑会' then
				-- 任务处理类.开启剑会天下("单人")
				剑会:开启活动()
				return

		elseif 数据.文本=="刷新摊位" then
					假人事件类:刷新摊位()
					常规提示(id,"摊位刷新成功")

		elseif 数据.文本=="@重置排行榜" then
				排行榜数据={玩家伤害排行={}, 玩家速度排行={},玩家气血排行={},玩家财富排行={},玩家等级排行={},玩家仙玉排行={},玩家防御排行={},玩家灵力排行={},玩家仙玉排行={}}
				发送网关消息(string.format("%s成功",data))
		elseif 数据.文本=="@gxsj" then
			if 玩家数据[id].管理模式 == true then
				保存系统数据(2)
				发送网关消息("成功")
				获取__商城数据()
				商城处理类:加载商品()
				发送网关消息("成功")
				获取__怪物属性系数()
				发送网关消息("更新怪物属性数据成功")
				获取__物品数据()
				发送网关消息("成功")
				获取__礼包配置数据()
				获取__抽奖数据()
				发送网关消息("成功")
				更新全局基础数据()
				发送网关消息("成功")
				获取__活动时间配置()
				发送网关消息("成功")
				获取__梦幻指引()
				发送网关消息("成功")
				获取__物品奖励数据()
				刷新自定义数据()
				发送网关消息("成功")
				获取__商店数据()
				发送网关消息("成功")
				获取__技能消耗()
				发送网关消息("成功")
        		常规提示(id,"#Y/已刷新")
			else
				常规提示(id,"#Y/请打开管理模式！")
			end
			end
			end
		if 数据.文本=="代理系统" then
		elseif 数据.文本=="清除打造" then --测试模式
			local 任务id = 玩家数据[id].角色:取任务(5)
			if 任务id~=0 then
	            玩家数据[id].角色:取消任务(任务id)
				任务数据[任务id]=nil
	        end
		elseif 数据.文本=="@清包" then --测试模式
			玩家数据[id].道具:清空包裹(连接id,id)
			return
		elseif 数据.文本=="@清空wbsj" then --测试模式
			玩家数据[id].角色.五宝数据={夜光珠=0,龙鳞=0,定魂珠=0,避水珠=0,金刚石=0}
			return

		elseif 数据.文本=="退出战斗" then
			if 观战记录 == true then
        				常规提示(id,"#Y/观战中不能使用该命令")
        			return
			elseif 玩家数据[id].zhandou~=0 and
				战斗准备类.战斗盒子[玩家数据[id].zhandou].战斗类型~=200001 and
				战斗准备类.战斗盒子[玩家数据[id].zhandou].战斗类型~=200002 and
				战斗准备类.战斗盒子[玩家数据[id].zhandou].战斗类型~=200003 and
				战斗准备类.战斗盒子[玩家数据[id].zhandou].战斗类型~=200004 and
				战斗准备类.战斗盒子[玩家数据[id].zhandou].战斗类型~=200005
				then
				if 战斗准备类.战斗盒子[玩家数据[id].zhandou]:强制结束战斗() then
					玩家数据[id].当前频道=os.time()+60
				end
				return
			end
		end

		玩家数据[id].当前频道=os.time()
		地图处理类:当前消息广播(玩家数据[id].角色.地图数据,玩家数据[id].角色.名称,文本,id,玩家数据[id].角色.发言特效)
		if 玩家数据[id].zhandou==0 then
			发送数据(连接id,1017,{文本=文本,特效=玩家数据[id].角色.发言特效})
		else
			local 编号=战斗准备类.战斗盒子[玩家数据[id].zhandou]:取参战编号(id,"角色")
			if 编号==nil then return  end
			for n=1,#战斗准备类.战斗盒子[玩家数据[id].zhandou].参战玩家 do
				发送数据(战斗准备类.战斗盒子[玩家数据[id].zhandou].参战玩家[n].连接id,5512,{id=编号,文本=文本,特效=玩家数据[id].角色.发言特效})
			end
		end
	elseif 频道==2 then  --队伍发言
		if 队伍监听 then
            		发送网关消息("玩家id："..id.."队伍发言内容："..数据.文本)
        		end
		if 玩家数据[id].队伍==0 then
			常规提示(id,"#Y/你似乎还没有加入任何队伍")
			return
		end
		if 数据.发送方式 == 1 then
			-- 广播队伍消息(玩家数据[id].队伍,"qqq|"..玩家数据[id].角色.名称.."*"..玩家数据[id].角色.造型.."*玩家信息*"..id.."/["..玩家数据[id].角色.名称.."]#"..文本)
			广播队伍消息(玩家数据[id].队伍,"qqq|"..玩家数据[id].角色.名称.."*"..玩家数据[id].角色.造型.."*玩家信息*"..id.."/["..玩家数据[id].角色.名称.."]#"..添加ID特效(id,文本))--C改

		else
			local 返回信息 = {}
			for i=1,#数据.超链接 do
				local x = 分割文本(文本,"["..数据.超链接[i].名称.."]")
				if 数据.超链接[i].类型 == "道具" then
					local 道具id=玩家数据[id].角色[数据.超链接[i].点击类型][数据.超链接[i].编号]
					文本 = x[1].."#G/qqq|"..数据.超链接[i].名称.."*"..玩家数据[id].道具.数据[道具id].识别码.."*"..数据.超链接[i].类型.."/["..数据.超链接[i].名称.."]#W"..x[2]
					返回信息[#返回信息+1] = 玩家数据[id].道具.数据[道具id]
					返回信息[#返回信息].索引类型 = 数据.超链接[i].类型
				elseif 数据.超链接[i].类型 == "召唤兽" then
					local bh = 玩家数据[id].召唤兽:取编号(数据.超链接[i].编号) --数据.超链接[i].编号=认证码 数据.超链接[i].类型 = "召唤兽"
					if 玩家数据[id].召唤兽.数据[bh] ~= nil then
						文本 = x[1].."#G/qqq|"..数据.超链接[i].名称.."*"..玩家数据[id].召唤兽.数据[bh].认证码.."*"..数据.超链接[i].类型.."/["..数据.超链接[i].名称.."]#W"..x[2]
						返回信息[#返回信息+1] = 玩家数据[id].召唤兽.数据[bh]
						返回信息[#返回信息].索引类型 = 数据.超链接[i].类型
					end
				end
			end
			广播队伍链接(玩家数据[id].队伍,{内容="qqq|"..玩家数据[id].角色.名称.."*"..玩家数据[id].角色.造型.."*玩家信息*"..id.."/["..玩家数据[id].角色.名称.."]#W"..添加ID特效(id,文本),频道="dw",超链接=返回信息})--C改
			-- 广播队伍链接(玩家数据[id].队伍,{内容="qqq|"..玩家数据[id].角色.名称.."*"..玩家数据[id].角色.造型.."*玩家信息*"..id.."/["..玩家数据[id].角色.名称.."]#W"..文本,频道="dw",超链接=返回信息})
		end
		if  玩家数据[id].zhandou==0 then
			发送数据(连接id,1017,{文本=文本,队伍=true,特效=玩家数据[id].角色.发言特效})
			for n=1,#队伍数据[玩家数据[id].队伍].成员数据 do
				if 队伍数据[玩家数据[id].队伍].成员数据[n]~=id then
					发送数据(玩家数据[队伍数据[玩家数据[id].队伍].成员数据[n]].连接id,1018,{id=id,队伍=true,文本=文本,特效=玩家数据[id].角色.发言特效})
				end
			end
		else
			local 编号=战斗准备类.战斗盒子[玩家数据[id].zhandou]:取参战编号(id,"角色")
			if 编号==nil then return  end
			for n=1,#队伍数据[玩家数据[id].队伍].成员数据 do
				-- if 队伍、数据[玩家数据[id].队伍].成员数据[n]~=id then
					发送数据(玩家数据[队伍数据[玩家数据[id].队伍].成员数据[n]].连接id,5512,{id=编号,队伍=true,文本=文本,特效=玩家数据[id].角色.发言特效}) --1018
				-- end
			end
		end
	elseif 频道==3 then  --世界发言
		if 世界监听 then
            发送网关消息("玩家id："..id.."世界发言内容："..数据.文本)
        end
		if 神话 then
			if 取VIP等级(取累充金额1(id)) < 1 then
				常规提示(id,"#Y/VIP1以下无法在该频道发言")
				return
			end
		end
		if 数据.发送方式 == 1 then --测试模式
			local 发言限制=100-玩家数据[id].角色.等级
			if 发言限制<20 then
				发言限制=20
			end
			if os.time()-玩家数据[id].世界频道<=发言限制 then
				常规提示(id,"#Y/您说话的速度有点快哟！")
				return
			elseif 玩家数据[id].角色.等级<20 then
				常规提示(id,"#Y/等级达到20级才可在世界频道发言")
				return
			end
			玩家数据[id].世界频道=os.time()
			-- 广播消息({内容="qqq|"..玩家数据[id].角色.名称.."*"..玩家数据[id].角色.造型.."*玩家信息*"..id.."/["..玩家数据[id].角色.名称.."]#W"..文本,频道="sj"})
			广播消息({内容="qqq|"..玩家数据[id].角色.名称.."*"..玩家数据[id].角色.造型.."*玩家信息*"..id.."/["..玩家数据[id].角色.名称.."]#W"..添加ID特效(id,文本),频道="sj"})--C改

		else
			local 发言限制=100-玩家数据[id].角色.等级
			if 发言限制<20 then
				发言限制=20
			end
			if os.time()-玩家数据[id].世界频道<=发言限制 then
				常规提示(id,"#Y/您说话的速度有点快哟！")
				--return
			elseif 玩家数据[id].角色.等级<20 then
				常规提示(id,"#Y/等级达到20级才可在世界频道发言")
				return
			end
			local 返回信息 = {}
			for i=1,#数据.超链接 do
				local x = 分割文本(文本,"["..数据.超链接[i].名称.."]")
				if 数据.超链接[i].类型 == "道具" then
					local 道具id=玩家数据[id].角色[数据.超链接[i].点击类型][数据.超链接[i].编号]
					if 玩家数据[id].道具.数据[道具id].识别码 == nil then
						玩家数据[id].道具.数据[道具id].识别码 = id.."_"..os.time().."_"..取随机数(1000,9999).."_"..随机序列
					end
					文本 = x[1].."#G/qqq|"..数据.超链接[i].名称.."*"..玩家数据[id].道具.数据[道具id].识别码.."*"..数据.超链接[i].类型.."/["..数据.超链接[i].名称.."]#W"..x[2]
					返回信息[#返回信息+1] = 玩家数据[id].道具.数据[道具id]
					返回信息[#返回信息].索引类型 = 数据.超链接[i].类型
				elseif 数据.超链接[i].类型 == "召唤兽" then
					local bh = 玩家数据[id].召唤兽:取编号(数据.超链接[i].编号) --数据.超链接[i].编号=认证码 数据.超链接[i].类型 = "召唤兽"
					if 玩家数据[id].召唤兽.数据[bh] ~= nil then
						文本 = x[1].."#G/qqq|"..数据.超链接[i].名称.."*"..玩家数据[id].召唤兽.数据[bh].认证码.."*"..数据.超链接[i].类型.."/["..数据.超链接[i].名称.."]#W"..x[2]
						返回信息[#返回信息+1] = 玩家数据[id].召唤兽.数据[bh]
						返回信息[#返回信息].索引类型 = 数据.超链接[i].类型
					end
				end
			end
			玩家数据[id].世界频道=os.time()
			广播消息({内容="qqq|"..玩家数据[id].角色.名称.."*"..玩家数据[id].角色.造型.."*玩家信息*"..id.."/["..玩家数据[id].角色.名称.."]#W"..文本,频道="sj",方式=1,超链接=返回信息})
		end
	elseif 频道==5 then  --传闻发言
		if 传闻监听 then
            发送网关消息("玩家id："..id.."传闻发言内容："..数据.文本)
        end
		if os.time()-玩家数据[id].传闻频道<=99 then--测试模式
			常规提示(id,"#Y/您说话的速度有点快哟！")
			return
		elseif 玩家数据[id].角色.等级<20 then
			常规提示(id,"#Y/等级达到20级才可在世界频道发言")
			return
		elseif 玩家数据[id].角色.银子<5000 then
			常规提示(id,"#Y/本频道发言需要消耗5000两银子")
			return
		end
		玩家数据[id].传闻频道=os.time()
		玩家数据[id].角色:扣除银子(5000,0,0,"传闻频道发言",1)
		if 取随机数()<=10 then
			广播消息({内容="["..玩家数据[id].角色.名称.."]"..文本,频道="cw"})
		else
			广播消息({内容="[某人]"..文本,频道="cw"})
		end
	elseif 频道==7 then --传音
		if 传音监听 then
            		发送网关消息("玩家id："..id.."传音发言内容："..数据.文本)
        		end
		if not 玩家数据[id].角色:扣除银子(20000,0,0,"传音发言",1) then
			常规提示(id,"#Y/传音发言需要20000两银子一次")
			return
		elseif 发言特效传音 and (玩家数据[id].角色.发言特效 == nil or 玩家数据[id].角色.发言特效 == 0) then
			常规提示(id,"#Y/传音发言需要拥有发言特效才可以，前往商城购买吧！")
			return
		end
		if 数据.发送方式 == 1 then --测试模式
			玩家数据[id].世界频道=os.time()
			-- 发送传音({内容="/qqq|"..玩家数据[id].角色.名称.."*"..玩家数据[id].角色.造型.."*玩家信息*"..id.."/["..玩家数据[id].角色.名称.."]#W"..文本})
			发送传音({内容="/qqq|"..玩家数据[id].角色.名称.."*"..玩家数据[id].角色.造型.."*玩家信息*"..id.."/["..玩家数据[id].角色.名称.."]#W"..添加ID特效(id,文本)})---C改

		else
			local 返回信息 = {}
			for i=1,#数据.超链接 do
				if 数据.超链接[i] and 数据.超链接[i].名称 then
					local x = 分割文本(文本,"["..数据.超链接[i].名称.."]")
					if 数据.超链接[i].类型 == "道具" then
						local 道具id=玩家数据[id].角色[数据.超链接[i].点击类型][数据.超链接[i].编号]
						文本 = x[1].."#G/qqq|"..数据.超链接[i].名称.."*"..玩家数据[id].道具.数据[道具id].识别码.."*"..数据.超链接[i].类型.."/["..数据.超链接[i].名称.."]#W"..x[2]
						返回信息[#返回信息+1] = 玩家数据[id].道具.数据[道具id]
						返回信息[#返回信息].索引类型 = 数据.超链接[i].类型
					elseif 数据.超链接[i].类型 == "召唤兽" then
						local bh = 玩家数据[id].召唤兽:取编号(数据.超链接[i].编号)
						if 玩家数据[id].召唤兽.数据[bh] ~= nil then
							文本 = x[1].."#G/qqq|"..数据.超链接[i].名称.."*"..玩家数据[id].召唤兽.数据[bh].认证码.."*"..数据.超链接[i].类型.."/["..数据.超链接[i].名称.."]#W"..x[2]
							返回信息[#返回信息+1] = 玩家数据[id].召唤兽.数据[bh]
							返回信息[#返回信息].索引类型 = 数据.超链接[i].类型
						end
					end
				end
			end
			玩家数据[id].世界频道=os.time()
			-- 发送传音({内容="/qqq|"..玩家数据[id].角色.名称.."*"..玩家数据[id].角色.造型.."*玩家信息*"..id.."/["..玩家数据[id].角色.名称.."]#W"..文本,方式=1,超链接=返回信息})
			发送传音({内容="/qqq|"..玩家数据[id].角色.名称.."*"..玩家数据[id].角色.造型.."*玩家信息*"..id.."/["..玩家数据[id].角色.名称.."]#W"..添加ID特效(id,文本),方式=1,超链接=返回信息})---C改

		end

	end
end

local dfgdfgf={黄金ID={},紫色ID={},绿色ID={},蓝色ID={},趣味ID={}}
dfgdfgf["黄金ID"][1]="#121"
dfgdfgf["黄金ID"][2]="#122"
dfgdfgf["黄金ID"][3]="#123"
dfgdfgf["黄金ID"][4]="#124"
dfgdfgf["黄金ID"][5]="#125"
dfgdfgf["黄金ID"][6]="#126"
dfgdfgf["黄金ID"][7]="#127"
dfgdfgf["黄金ID"][8]="#128"
dfgdfgf["黄金ID"][9]="#129"
dfgdfgf["黄金ID"][0]="#130"
dfgdfgf["紫色ID"][1]="#131"
dfgdfgf["紫色ID"][2]="#132"
dfgdfgf["紫色ID"][3]="#133"
dfgdfgf["紫色ID"][4]="#134"
dfgdfgf["紫色ID"][5]="#135"
dfgdfgf["紫色ID"][6]="#136"
dfgdfgf["紫色ID"][7]="#137"
dfgdfgf["紫色ID"][8]="#138"
dfgdfgf["紫色ID"][9]="#139"
dfgdfgf["紫色ID"][0]="#140"
dfgdfgf["绿色ID"][1]="#141"
dfgdfgf["绿色ID"][2]="#142"
dfgdfgf["绿色ID"][3]="#143"
dfgdfgf["绿色ID"][4]="#144"
dfgdfgf["绿色ID"][5]="#145"
dfgdfgf["绿色ID"][6]="#146"
dfgdfgf["绿色ID"][7]="#147"
dfgdfgf["绿色ID"][8]="#148"
dfgdfgf["绿色ID"][9]="#149"
dfgdfgf["绿色ID"][0]="#150"
dfgdfgf["蓝色ID"][1]="#151"
dfgdfgf["蓝色ID"][2]="#152"
dfgdfgf["蓝色ID"][3]="#153"
dfgdfgf["蓝色ID"][4]="#154"
dfgdfgf["蓝色ID"][5]="#155"
dfgdfgf["蓝色ID"][6]="#156"
dfgdfgf["蓝色ID"][7]="#157"
dfgdfgf["蓝色ID"][8]="#158"
dfgdfgf["蓝色ID"][9]="#159"
dfgdfgf["蓝色ID"][0]="#160"

dfgdfgf["趣味ID"][1]="#161"
dfgdfgf["趣味ID"][2]="#162"
dfgdfgf["趣味ID"][3]="#163"
dfgdfgf["趣味ID"][4]="#164"
dfgdfgf["趣味ID"][5]="#165"
dfgdfgf["趣味ID"][6]="#166"
dfgdfgf["趣味ID"][7]="#167"
dfgdfgf["趣味ID"][8]="#168"
dfgdfgf["趣味ID"][9]="#169"
dfgdfgf["趣味ID"][0]="#170"

function 添加ID特效(id,内容)
	if 玩家数据[id] and dfgdfgf[玩家数据[id].角色.id特效] then
		local tx=玩家数据[id].角色.id特效
		local hdgge="("
		for i=1,string.len(id) do
			local numb = string.sub(id, i, i)
			hdgge=hdgge..dfgdfgf[tx][numb+0]
		end
		return hdgge..")"..内容
	end
	return 内容
end

function 添加ID特效1(id)
	if 玩家数据[id] and dfgdfgf[玩家数据[id].角色.id特效] then
		local tx=玩家数据[id].角色.id特效
		local hdgge="("
		for i=1,string.len(id) do
			local numb = string.sub(id, i, i)
			hdgge=hdgge..dfgdfgf[tx][numb+0]
		end
		return hdgge..")"
	end
end

return 聊天处理类