-- @Author: baidwwy
-- @Date:   2023-08-31 23:34:34
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2025-11-13 13:10:43
-- @Last Modified time: 2024-01-01 11:42:26
--======================================================================--
-- @作者: GGE研究群: 342119466
-- @创建时间:   2018-03-03 02:34:19
-- @Last Modified time: 2023-06-13 22:23:25
-- 梦幻西游游戏资源破解 baidwwy@vip.qq.com(313738139) 老毕   和 C++PrimerPlus 717535046 这俩位大神破解所以资源
--======================================================================--
function 取低级要诀()
	local ms = {"反震","吸血","反击","连击","飞行","驱鬼","隐身","感知","再生","冥思","慧根","必杀","幸运","神迹","招架","永恒","敏捷","强力","防御","偷袭","毒","鬼魂术","魔之心","神佑复生","精神集中","否定信仰","雷击","落岩","水攻","烈火","法术连击","法术暴击","法术波动","雷属性吸收","土属性吸收","火属性吸收","水属性吸收","迟钝"}
	return ms[取随机数(1,#ms)]
end

function 取高级要诀()
	local ms =  {"嗜血追击","高级夜战","高级进击必杀","高级盾气","高级反震","高级进击法暴","高级遗志","高级吸血","高级反击","高级连击","高级飞行","高级驱鬼","高级隐身","高级感知","高级再生","高级冥思","高级慧根","高级必杀","高级幸运","高级神迹","高级招架","高级永恒","高级敏捷","高级强力","高级防御","高级偷袭","高级毒","高级鬼魂术","高级魔之心","高级神佑复生","高级精神集中","高级否定信仰","奔雷咒","泰山压顶","水漫金山","地狱烈火","高级法术连击","高级法术暴击","高级法术波动","高级雷属性吸收","高级土属性吸收","高级火属性吸收","高级水属性吸收"}

	return ms[取随机数(1,#ms)]
end
function 法系高级兽决()
	local ms =  {"高级魔之心","高级法术连击","高级法术暴击","高级法术波动","须弥真言"}
	return ms[取随机数(1,#ms)]
end

function 物理高级兽决()
	local ms =  {"高级强力","高级夜战","高级吸血","高级连击","高级必杀","高级偷袭","高级进击必杀","死亡召唤","剑荡四方","善恶有报","壁垒击破","力劈华山",}
	return ms[取随机数(1,#ms)]
end
function 被动高级兽决()
	local ms =  {"高级反击","高级反震","高级神迹","高级招架","高级永恒","高级防御","高级幸运","高级神佑复生","高级感知","高级飞行","高级隐身","高级独行","高级遗志","高级合纵"}
	return ms[取随机数(1,#ms)]
end

function 取特殊魔兽要诀()
	local ms =  {"龙魂","八凶法阵","出其不意","嗜血追击","流沙轻音","浮云神马","势如破竹","凭风借力","顾盼生姿","拘魂索命","溜之大吉","神出鬼没","昼伏夜出","凝光炼彩","净台妙谛","津津有味","灵山禅语"}
	return ms[取随机数(1,#ms)]
end
function 取特殊要诀()
	local ms =  {"嗜血追击","龙魂","八凶法阵","出其不意","嗜血追击","流沙轻音","浮云神马","势如破竹","凭风借力","顾盼生姿","拘魂索命","溜之大吉","神出鬼没","昼伏夜出","凝光炼彩","净台妙谛","津津有味","灵山禅语"}
	return ms[取随机数(1,#ms)]
end
function 取碎片特殊要诀()
	local ms =  {"龙魂","八凶法阵","出其不意","气贯长虹","流沙轻音","食指大动","食指大动","风起龙游","食指大动",
	"欣欣向荣","柳暗花明","义薄云天","柳暗花明","风之沙盾","灵山禅语","神出鬼没","力劈华山","顾盼生姿","与生俱来","善恶有报","善恶有报","力劈华山",
	"从天而降","无上正真","大快朵颐","苍鸾怒击","力劈华山","龙魂","浮云神马","千钧一怒","千钧一怒","势如破竹","乘胜追击","凭风借力","顾盼生姿",
	"拘魂索命","溜之大吉","神出鬼没","昼伏夜出","月光","凝光炼彩","净台妙谛","流沙轻音","清风之华","八凶法阵","夜舞倾城","流沙轻音","法术防御","津津有味","灵能激发","叱咤风云",
	"天降灵葫","映雪棱镜","天降灵葫","无畏布施","理直气壮","净台妙谛","势如破竹","津津有味","雨露之泽","虎虎生风","乘胜追击","无畏布施","超级神柚复生"}
	return ms[取随机数(1,#ms)]
end

-- function 取碎片特殊要诀()
-- 	local ms =  {"力劈华山","善恶有报","法术防御","死亡召唤","灵能激发","夜舞倾城","上古灵符","力劈华山","善恶有报","法术防御","死亡召唤","灵能激发","夜舞倾城","上古灵符","龙魂","须弥真言","出其不意","流沙轻音","食指大动","大快朵颐","苍鸾怒击","浮云神马","千钧一怒","势如破竹","乘胜追击","凭风借力","顾盼生姿","拘魂索命","溜之大吉","神出鬼没","昼伏夜出","凝光炼彩","净台妙谛","津津有味","灵山禅语"}
-- 	return ms[取随机数(1,#ms)]
-- end

function 兑换特殊要诀()
	local ms =  {"力劈华山","善恶有报","法术防御","死亡召唤","苍鸾怒击","浮云神马","灵能激发","夜舞倾城","上古灵符","龙魂","须弥真言","高级必杀","高级偷袭"}
	if RpbARGB.序列==3 then
	  ms = {"力劈华山","高级必杀","高级偷袭","高级必杀","高级偷袭","善恶有报","法术防御","死亡召唤","灵能激发","夜舞倾城","上古灵符","力劈华山","善恶有报","法术防御","死亡召唤","灵能激发","夜舞倾城","上古灵符","龙魂","须弥真言","出其不意","流沙轻音","食指大动","大快朵颐","苍鸾怒击","浮云神马","千钧一怒","势如破竹","乘胜追击","凭风借力","顾盼生姿","拘魂索命","溜之大吉","神出鬼没","昼伏夜出","凝光炼彩","净台妙谛","津津有味","灵山禅语"}
	end
	return ms[取随机数(1,#ms)]
end

function 取碎片超级要诀()
	local ms = {"超级必杀","超级偷袭","超级夜战","超级连击","超级魔之心","超级法术连击","超级法术波动","超级法术暴击","超级感知","超级雷属性吸收",
	"超级强力","超级防御","超级防御","超级冥思","超级强力","超级防御","超级永恒","超级吸血","超级隐身","超级法术抵抗","超级反击","超级招架",
	"超级防御","超级冥思","超级防御","超级地狱烈火","超级再生","超级精神集中","超级火属性吸收",
	"超级慧根","超级防御","超级感知","超级防御","超级进击必杀","超级遗志","超级盾气",
	"超级防御","超级感知","超级强力","超级泰山压顶","超级进击法暴","超级火属性吸收","超级驱鬼",
"超级吸血","超级壁垒击破","超级壁垒击破","超级地狱烈火","超级反击",
"超级壁垒击破","超级吸血","超级水漫金山","超级水漫金山","超级水漫金山",
"超级招架","超级必杀","超级幸运","超级幸运","超级幸运","超级进击必杀","超级遗志","超级永恒",
"超级偷袭","超级偷袭","超级夜战","超级招架","超级冥思","超级连击","超级冥思","超级奔雷咒",
"超级神迹","超级神迹","超级神迹","超级神迹","超级再生","超级水属性吸收","超级水属性吸收","超级土属性吸收","超级进击法暴",
"超级雷属性吸收","超级火属性吸收","超级精神集中","超级吸血","超级驱鬼","超级隐身",
"超级合纵","超级合纵","超级水属性吸收","超级盾气","超级土属性吸收","超级雷属性吸收","超级火属性吸收","超级反震","超级反震","超级反震",
"超级反击","超级反击","超级敏捷","超级法术抵抗","超级敏捷","超级敏捷","超级招架","超级魔之心","超级法术连击",
"超级法术波动","超级法术暴击","超级感知","超级地狱烈火","超级泰山压顶","超级土属性吸收","超级连击",
"超级泰山压顶","超级奔雷咒","超级奔雷咒","超级隐身","超级驱鬼","超级夜战",
"超级慧根","超级慧根","超级慧根","超级再生","超级精神集中",
"超级永恒","超级进击必杀","超级进击法暴","超级遗志"}
	return ms[取随机数(1,#ms)]
end
function 取内丹(类型)
	if 类型 == "高级" then
		local 高级内丹 ={ "神机步","腾挪劲","玄武躯","龙胄铠","玉砥柱","碎甲刃","阴阳护","凛冽气","舍身击","电魂闪","通灵法","双星爆","催心浪","隐匿击","生死决","血债偿"}
		return 高级内丹[取随机数(1,#高级内丹)]
	else
		local 普通内丹 = {"迅敏","狂怒","阴伤","静岳","擅咒","灵身","矫健","深思","钢化","坚甲","慧心","撞击","无畏","愤恨","淬毒","狙刺","连环","圣洁","灵光"}
		return 普通内丹[取随机数(1,#普通内丹)]
	end
end

function 取赐福超级要诀()
	local ms = {"超级必杀","超级毒","超级盾气","超级法术暴击","超级法术波动","超级法术抵抗","超级法术连击","超级反击","超级反震","超级防御","超级飞行","超级否定信仰","超级感知","超级合纵","超级慧根","超级火属性吸收","超级进击必杀","超级进击法暴",
"超级精神集中","超级雷属性吸收","超级连击","超级敏捷","超级冥思","超级魔之心","超级强力","超级驱鬼","超级神迹","超级水属性吸收","超级偷袭","超级土属性吸收","超级吸血","超级幸运","超级夜战","超级遗志","超级隐身","超级永恒","超级再生","超级招架",
"超级奔雷咒","超级壁垒击破","超级地狱烈火","超级水漫金山","超级泰山压顶"}
  return ms[取随机数(1,#ms)]
end

function 取超级要诀()
	local ms = {"超级必杀","超级毒","超级盾气","超级法术暴击","超级法术波动","超级法术抵抗","超级法术连击","超级反击","超级反震","超级防御","超级飞行","超级感知","超级合纵","超级慧根","超级火属性吸收","超级进击必杀","超级进击法暴",
"超级精神集中","超级雷属性吸收","超级连击","超级敏捷","超级冥思","超级魔之心","超级强力","超级驱鬼","超级神迹","超级水属性吸收","超级偷袭","超级土属性吸收","超级吸血","超级幸运","超级夜战","超级遗志","超级隐身","超级永恒","超级再生","超级招架",
"超级奔雷咒","超级壁垒击破","超级地狱烈火","超级水漫金山","超级泰山压顶"}
  return ms[取随机数(1,#ms)]
end

function 取是否为超级要诀(名称)
	local ms = {"超级必杀","超级毒","超级盾气","超级法术暴击","超级法术波动","超级法术抵抗","超级法术连击","超级反击","超级反震","超级防御","超级飞行","超级否定信仰","超级感知","超级合纵","超级慧根","超级火属性吸收","超级进击必杀","超级进击法暴",
"超级精神集中","超级雷属性吸收","超级连击","超级敏捷","超级冥思","超级魔之心","超级强力","超级驱鬼","超级神迹","超级水属性吸收","超级偷袭","超级土属性吸收","超级吸血","超级幸运","超级夜战","超级遗志","超级隐身","超级永恒","超级再生","超级招架",
"超级奔雷咒","超级壁垒击破","超级地狱烈火","超级水漫金山","超级泰山压顶"}
  for i = 1 , #ms do
  	if ms[i] == 名称 then
  		return true
  	end
  end
  return false
end

-- function 取技能是否有高级(bb,jn) --该技能是否在bb身上有高级的，有就返回高级否则返回低级
-- 	if bb==nil and jn==nil then return end
-- 	if bb==nil then return jn,ssy end
-- 	for kn,vn in pairs(bb.技能) do
-- 		if vn == jn then
-- 			return vn,false
-- 		elseif vn == "高级"..jn then
-- 			return vn,true
-- 		end
-- 	end
-- 	return
-- end
function 取技能是否有高级(bb,jn)
	if bb==nil and jn==nil then return end
	local ssy=false
	if bb==nil then return jn,ssy end
	for kn,vn in pairs(bb.技能) do
		local gjjn = "高级" ..jn
		if vn == jn or vn.名称 == jn then
			ssy=true
		end
		if vn == gjjn or vn.名称 == gjjn then
			ssy=true
			return gjjn,ssy
		end
	end
	return jn,ssy
end
function 取丸子技能是否符合(wzjn,cjjn)
	local fh=false
	for k,v in pairs(wzjn) do
		  local ab = "超级" ..v
		  local bgj="高级" ..v
		  if ab == cjjn then
		  	fh=true
		  	break
		  end
	end
	return fh
end

function 取宝宝装备()
	if 取随机数()<=70 then
		return "炼妖石"
	else
		return "上古锻造图策"
	end
end

function 宝宝特性属性(等级,特性,最优)
	local aa
	local bb
	if 特性=="力破" then
		aa={-20,0,20,40,60}
		if 最优 then return aa[#aa]+等级, 4 end
		return  aa[取随机数(1,5)]+等级 , 取随机数(4,8) --a="#Y/忽略人物角色#G/"..xa[1].."#Y/防御力".."减少对召唤兽的伤害结果#R"..xa[2].."#Y。对NPC无效果"
	elseif 特性=="巧劲" then
		aa={5,10,15,20,25}
		if 最优 then return aa[#aa], 10 end
		return  aa[取随机数(1,5)] , 取随机数(10,20) --a="#Y/普通攻击增加伤害结果"..xa[1].."受到的所有伤害增加"..xa[2]
	elseif 特性=="识药" then
		aa={10,14,15,20,20}
		if 最优 then return aa[#aa], 10 end
		return  aa[取随机数(1,5)] , 取随机数(10,20) --a="#Y/药物效果提高"..xa[1].."受到的所有伤害增加"..xa[2]
	elseif 特性=="抗物" then
		if 最优 then return 30, 10 end
		return  取随机数(5,30) , 取随机数(10,22) --a="#Y/在场时，我方所有单位物理防御增加"..xa[1].."，自身受到法术伤害增加"..xa[2]
	elseif 特性=="抗法" then
		if 最优 then return 30, 10 end
		return  取随机数(5,30) , 取随机数(10,22) --a="#Y/在场时，我方所有单位法术防御增加"..xa[1].."，自身受到物理伤害增加"..xa[2]
	elseif 特性=="复仇" then
		aa={33,50,60,80,100}
		if 最优 then return aa[#aa], 5 end
		return  aa[取随机数(1,5)], 取随机数(5,10) --a="#Y/主人被击倒时，有"..xa[1].."概率向敌方单位发动一次攻击，最多生效3次。减少所有防御力"..xa[2]
	elseif 特性=="自恋" then
		aa={33,50,60,80,100}
		if 最优 then return aa[#aa], 4 end
		return  aa[取随机数(1,5)], 取随机数(4,8)
	elseif 特性=="灵刃" then
		aa={33,50,60,80,100}
		if 最优 then return aa[#aa], 5 end
		return  aa[取随机数(1,5)], 取随机数(5,10)
	elseif 特性=="灵法" then
		aa={33,50,60,80,100}
		if 最优 then return aa[#aa], 5 end
		return  aa[取随机数(1,5)], 取随机数(5,10)
	elseif 特性=="预知" then
		aa={10,16,21,26,32}
		return  aa[取随机数(1,5)], 取随机数(4,8)
	elseif 特性=="灵动" then
		aa={10,16,21,26,32}
		return  aa[取随机数(1,5)], 取随机数(4,8)
	elseif 特性=="瞬击" then
		aa={33,50,60,80,100}
		if 最优 then return aa[#aa], 5 end
		return  aa[取随机数(1,5)], 取随机数(5,10)
	elseif 特性=="瞬法" then
		aa={33,50,60,80,100}
		if 最优 then return aa[#aa], 5 end
		return  aa[取随机数(1,5)], 取随机数(5,10)
	elseif 特性=="阳护" then
		aa={33,50,60,80,100}
		if 最优 then return aa[#aa], 15 end
		return  aa[取随机数(1,5)], 取随机数(15,30)
	elseif 特性=="识物" then
		aa={5,8,10,13,16}
		if 最优 then return aa[#aa], 4 end
		return  aa[取随机数(1,5)], 取随机数(4,8) --a="#Y/召唤兽套装附带的技能为法术技能时，触发概率提高"..xa[1].."全属性降低"..xa[2]
	elseif 特性=="护佑" then
		if 最优 then return 50, 5 end
		return  取随机数(20,50), 取随机数(5,10) --a="#Y/第2回合进场，我方百分比最低的单位受到的伤害降低"..xa[1].."持续2回合，法术伤害力降低#R/"..xa[2]
	elseif 特性=="洞察" then
		aa={33,50,60,80,100}
		if 最优 then return aa[#aa], 4 end
		return  aa[取随机数(1,5)], 取随机数(4,8) --a="#Y/PVP战斗中行动时有"..xa[1].."概率发现什么，全属性降低"..xa[2]
	elseif 特性=="弑神" then
		aa={60,90,120,150,180}
		bb={20,30,40}
		if 最优 then return aa[#aa], bb[1] end
		return  aa[取随机数(1,5)], bb[取随机数(1,3)] --a="#Y/对已经神佑过的召唤兽法术伤害增加"..xa[1].."，普通攻击命中率下降"..xa[2]
	elseif 特性=="御风" then
		aa={7,10,14,17,21,30}
		if 最优 then return aa[#aa], 10 end
		return  aa[取随机数(1,6)], 取随机数(10,20)
	elseif 特性=="顺势" then
		aa={60,90,120,150,180}
		bb={90,90,90,120,150,180}
		if 最优 then return aa[#aa], bb[1] end
		return  aa[取随机数(1,5)], bb[取随机数(1,6)]
	elseif 特性=="怒吼" then
		aa={30,50,60,70,90}
		if 最优 then return aa[#aa]+等级, 5 end
		return  aa[取随机数(1,5)]+等级, 取随机数(5,10) --"#Y/第二回合以后进场时，我方伤害最高的单位提高"..xa[1].."伤害力，持续2回合，法术伤害力降低"..xa[2]
	elseif 特性=="逆境" then
		aa={33,50,60,80,100}
		bb={15,15,20,30}
		if 最优 then return aa[#aa], bb[1] end
		return  aa[取随机数(1,5)], bb[取随机数(1,4)]
	elseif 特性=="吮魔" then
		if 最优 then return 5, 15 end
		return  取随机数(1,5), 取随机数(15,25) --(普通物理攻击时，吸取对方损失气血的魔法；对当前魔法超过50%的单位伤害结果减少)
	elseif 特性=="争锋" then
		aa={6,10,13,16,20}
		if 最优 then return aa[#aa], 40 end
		return  aa[取随机数(1,5)], 取随机数(40,110) --a="#Y/对召唤兽物理伤害结果增加"..xa[1].."对人物伤害结果减少"..xa[2]
	elseif 特性=="灵断" then
		aa={33,50,60,80,100}
		if 最优 then return aa[#aa], 5 end
		return  aa[取随机数(1,5)], 取随机数(5,10)
	elseif 特性=="乖巧" then
		aa={20,30,40,50,50}
		return  aa[取随机数(1,5)], 取随机数(4,8)
	end
end

function 取冲突技能(技能)
	if 技能=="高级必杀" then
		return {"合纵","高级合纵"}
	elseif 技能=="合纵" then
		return {"招架","法波"}
	elseif 技能=="高级法术暴击" then
		return {"高级幸运"}
	elseif 技能=="高级幸运" then
		return {"永恒"}
	elseif 技能=="高级法术波动" then
		return {"敏捷","高级精神集中"}
	elseif 技能=="高级招架" then
		return {"魔之心"}
	elseif 技能=="高级永恒" then
		return {"偷袭"}
	elseif 技能=="高级敏捷" then
		return {"雷击"}
	elseif 技能=="死亡召唤" then
		return {"水攻"}
	elseif 技能=="惊心一剑" then
		return {"落岩","高级火属性吸收"}
	elseif 技能=="烈火" then
		return {"高级偷袭"}
	elseif 技能=="高级魔之心" then
		return {"水攻"}
	elseif 技能=="善恶有报" then
		return {"雷属性吸收","奔雷咒"}
	elseif 技能=="火属性吸收" then
		return {"夜战"}
	elseif 技能=="地狱烈火" then
		return {"夜战"}
	elseif 技能=="高级火属性吸收" then
		return {"高级夜战"}
	elseif 技能=="强力" then
		return {"反击"}
	elseif 技能=="防御" then
		return {"反震"}
	elseif 技能=="反震" then
		return {"法术抵抗"}
	elseif 技能=="高级夜战" then
		return {"连击"}
	elseif 技能=="高级强力" then
		return {"高级反击","法术抵抗","飞行"}
	elseif 技能=="高级反击" then
		return {"飞行"}
	elseif 技能=="法术抵抗" then
		return {"高级防御"}
	elseif 技能=="高级反震" then
		return {"高级防御","壁垒击破","隐身","高级法术抵抗"}
	elseif 技能=="高级防御" then
		return {"壁垒击破","隐身"}
	elseif 技能=="隐身" then
		return {"法术连击"}
	elseif 技能=="高级吸血" then
		return {"盾气","感知","嗜血追击"}
	elseif 技能=="感知" then
		return {"嗜血追击"}
	elseif 技能=="高级独行" then
		return {"高级法术连击"}
	elseif 技能=="嗜血追击" then
		return {"高级连击"}
	elseif 技能=="高级连击" then
		return {"高级盾气","再生"}
	elseif 技能=="高级盾气" then
		return {"须弥真言","再生"}
	elseif 技能=="须弥真言" then
		return {"再生","法术暴击"}
	elseif 技能=="再生" then
		return {"剑荡四方"}
	elseif 技能=="高级飞行" then
		return {"冥思","弱点土"}
	elseif 技能=="高级隐身" then
		return {"弱点水","神佑复生"}
	elseif 技能=="冥思" then
		return {"弱点土"}
	elseif 技能=="观照万象" then
		return {"鬼魂术"}
	elseif 技能=="出其不意" then
		return {"高级感知"}
	elseif 技能=="遗志" then
		return {"鬼魂术"}
	elseif 技能=="神佑复生" then
		return {"高级冥思","毒"}
	elseif 技能=="高级感知" then
		return {"鬼魂术"}
	elseif 技能=="高级再生" then
		return {"驱鬼"}
	elseif 技能=="高级冥思" then
		return {"毒"}
	elseif 技能=="慧根" then
		return {"力劈华山","高级神佑复生","高级遗志","法术暴击","神迹"}
	elseif 技能=="力劈华山" then
		return {"高级神佑复生"}
	elseif 技能=="高级神佑复生" then
		return {"高级遗志"}
	elseif 技能=="必杀" then
		return {"高级鬼魂术"}
	elseif 技能=="高级驱鬼" then
		return {"幸运","高级法术连击"}
	elseif 技能=="幸运" then
		return {"高级法术连击"}
	elseif 技能=="法术连击" then
		return {"精神集中"}
	elseif 技能=="高级毒" then
		return {"法术连击","精神集中"}
	elseif 技能=="高级进击法暴" then
		return {"神佑复生"}
	elseif 技能=="高级夜战" then
		return {"净台妙谛"}
	elseif 技能=="高级进击必杀" then
		return {"高级飞行"}
	elseif 技能=="法术暴击" then
		return {"神迹"}
	end
	return 0
end

-- function 取伙伴(模型)
-- 	local 伙伴数据 = {}
-- 	伙伴数据["青狮精"]= {模型="青狮精",类别=1,拥有=0,星级=1,技能="剑荡四方",参战=0,伙伴等级=1,伙伴经验=1,仙器等级=1,仙器经验=1,升仙等级=1,升仙经验=1,灵仙等级=1,灵仙经验=1}
-- 	伙伴数据["沙和尚"]= {模型="沙和尚",类别=2,拥有=0,星级=1,技能="剑荡四方",参战=0,伙伴等级=1,伙伴经验=1,仙器等级=1,仙器经验=1,升仙等级=1,升仙经验=1,灵仙等级=1,灵仙经验=1}
-- 	伙伴数据["地藏菩萨"]={模型="地藏菩萨",类别=2,拥有=0,星级=1,技能="泰山压顶",参战=0,伙伴等级=1,伙伴经验=1,仙器等级=1,仙器经验=1,升仙等级=1,升仙经验=1,灵仙等级=1,灵仙经验=1}
-- 	伙伴数据["晶晶姑娘"]={模型="晶晶姑娘",类别=2,拥有=0,星级=1,技能="泰山压顶",参战=0,伙伴等级=1,伙伴经验=1,仙器等级=1,仙器经验=1,升仙等级=1,升仙经验=1,灵仙等级=1,灵仙经验=1}
-- 	伙伴数据["阎罗王"]= {模型="阎罗王",类别=2,拥有=0,星级=1,技能="地狱烈火",参战=0,伙伴等级=1,伙伴经验=1,仙器等级=1,仙器经验=1,升仙等级=1,升仙经验=1,灵仙等级=1,灵仙经验=1}
-- 	伙伴数据["镇元子"]= {模型="镇元子",类别=2,拥有=0,星级=1,技能="天雷斩",参战=0,伙伴等级=1,伙伴经验=1,仙器等级=1,仙器经验=1,升仙等级=1,升仙经验=1,灵仙等级=1,灵仙经验=1}
-- 	伙伴数据["九头虫"]= {模型="九头虫",类别=2,拥有=0,星级=1,技能="剑荡四方",参战=0,伙伴等级=1,伙伴经验=1,仙器等级=1,仙器经验=1,升仙等级=1,升仙经验=1,灵仙等级=1,灵仙经验=1}
-- 	伙伴数据["李天王"]= {模型="李天王",类别=3,拥有=0,星级=1,技能="雷霆万钧",参战=0,伙伴等级=1,伙伴经验=1,仙器等级=1,仙器经验=1,升仙等级=1,升仙经验=1,灵仙等级=1,灵仙经验=1}
-- 	伙伴数据["巫奎虎"]= {模型="巫奎虎",类别=3,拥有=0,星级=1,技能="落叶萧萧",参战=0,伙伴等级=1,伙伴经验=1,仙器等级=1,仙器经验=1,升仙等级=1,升仙经验=1,灵仙等级=1,灵仙经验=1}
-- 	伙伴数据["东海龙王"]={模型="东海龙王",类别=3,拥有=0,星级=1,技能="龙卷雨击",参战=0,伙伴等级=1,伙伴经验=1,仙器等级=1,仙器经验=1,升仙等级=1,升仙经验=1,灵仙等级=1,灵仙经验=1}
-- 	伙伴数据["菩提老祖"]={模型="菩提老祖",类别=3,拥有=0,星级=1,技能="奔雷咒",参战=0,伙伴等级=1,伙伴经验=1,仙器等级=1,仙器经验=1,升仙等级=1,升仙经验=1,灵仙等级=1,灵仙经验=1}
-- 	伙伴数据["九灵元圣"]={模型="九灵元圣",类别=3,拥有=0,星级=1,技能="水漫金山",参战=0,伙伴等级=1,伙伴经验=1,仙器等级=1,仙器经验=1,升仙等级=1,升仙经验=1,灵仙等级=1,灵仙经验=1}
-- 	伙伴数据["孙婆婆"]= {模型="孙婆婆",类别=3,拥有=0,星级=1,技能="落叶萧萧",参战=0,伙伴等级=1,伙伴经验=1,仙器等级=1,仙器经验=1,升仙等级=1,升仙经验=1,灵仙等级=1,灵仙经验=1}
-- 	伙伴数据["猪八戒"]= {模型="猪八戒",类别=3,拥有=0,星级=1,技能="水漫金山",参战=0,伙伴等级=1,伙伴经验=1,仙器等级=1,仙器经验=1,升仙等级=1,升仙经验=1,灵仙等级=1,灵仙经验=1}
-- 	伙伴数据["地涌夫人"]={模型="地涌夫人",类别=3,拥有=0,星级=1,技能="推气过宫",参战=0,伙伴等级=1,伙伴经验=1,仙器等级=1,仙器经验=1,升仙等级=1,升仙经验=1,灵仙等级=1,灵仙经验=1}
-- 	伙伴数据["二郎神"]= {模型="二郎神",类别=3,拥有=0,星级=1,技能="天雷斩",参战=0,伙伴等级=1,伙伴经验=1,仙器等级=1,仙器经验=1,升仙等级=1,升仙经验=1,灵仙等级=1,灵仙经验=1}
-- 	伙伴数据["成周妖皇"]={模型="成周妖皇",类别=4,拥有=0,星级=1,技能="天雷斩",参战=0,伙伴等级=1,伙伴经验=1,仙器等级=1,仙器经验=1,升仙等级=1,升仙经验=1,灵仙等级=1,灵仙经验=1}
-- 	伙伴数据["牛魔王"]= {模型="牛魔王",类别=4,拥有=0,星级=1,技能="飞砂走石",参战=0,伙伴等级=1,伙伴经验=1,仙器等级=1,仙器经验=1,升仙等级=1,升仙经验=1,灵仙等级=1,灵仙经验=1}
-- 	伙伴数据["程咬金"]= {模型="程咬金",类别=4,拥有=0,星级=1,技能="天雷斩",参战=0,伙伴等级=1,伙伴经验=1,仙器等级=1,仙器经验=1,升仙等级=1,升仙经验=1,灵仙等级=1,灵仙经验=1}
-- 	伙伴数据["观音菩萨"]={模型="观音菩萨",类别=4,拥有=0,星级=1,技能="推气过宫",参战=0,伙伴等级=1,伙伴经验=1,仙器等级=1,仙器经验=1,升仙等级=1,升仙经验=1,灵仙等级=1,灵仙经验=1}
-- 	伙伴数据["齐天大圣"]={模型="齐天大圣",类别=4,拥有=0,星级=1,技能="天雷斩",参战=0,伙伴等级=1,伙伴经验=1,仙器等级=1,仙器经验=1,升仙等级=1,升仙经验=1,灵仙等级=1,灵仙经验=1}
-- 	if 伙伴数据[模型] ~= nil then
-- 	return 伙伴数据[模型]
-- 	end
-- end
超级技能状态名称={}

超级技能状态名称[1]="超级赐福·元吉"
超级技能状态名称[2]="超级赐福·双喜"
超级技能状态名称[3]="超级赐福·三合"
超级技能状态名称[4]="超级赐福·四季"
超级技能状态名称[5]="超级赐福·五福"
超级技能状态名称[6]="超级赐福·六临"
超级技能状态名称[7]="超级赐福·七神"
超级技能状态名称[8]="超级赐福·八欲"
超级技能状态名称[9]="超级赐福·九功"
超级技能状态名称[10]="超级赐福·十满"
超级技能状态名称[11]="超级赐福·万利"

function 取饰品表(sj)
	local lb = {"野猪","羊头怪","牛头","马面","雷鸟人","进阶雷鸟人","蝴蝶仙子","进阶蝴蝶仙子","古代瑞兽","进阶古代瑞兽","白熊","进阶白熊","黑山老妖","进阶黑山老妖",
	"天兵","进阶天兵","进阶天将","地狱战神","进阶地狱战神","风伯","进阶风伯","凤凰","进阶凤凰","蛟龙","进阶蛟龙","雨师","进阶雨师","进阶如意仙子","芙蓉仙子","进阶芙蓉仙子",
	"巡游天神","进阶巡游天神","星灵仙子","进阶星灵仙子","幽灵","进阶幽灵","鬼将","进阶鬼将","吸血鬼","进阶吸血鬼","净瓶女娲","进阶净瓶女娲",
	"五行山神(金)","五行山神(木)","五行山神(水)","五行山神(火)","五行山神(土)","进阶五行山神(金)","进阶五行山神(木)","进阶五行山神(水)","进阶五行山神(火)","进阶五行山神(土)",
	"律法女娲","进阶律法女娲","灵符女娲","进阶灵符女娲","律法女娲","进阶律法女娲","灵符女娲","进阶灵符女娲","大力金刚","进阶大力金刚","雾中仙",
	"进阶雾中仙","灵鹤","进阶灵鹤","夜罗刹","进阶夜罗刹","进阶炎魔神","噬天虎","进阶噬天虎","野猪精","进阶野猪精","鼠先锋","进阶鼠先锋","百足将军","进阶百足将军",
	"红萼仙子","进阶红萼仙子","龙龟","进阶龙龟","进阶阴阳伞","机关兽","进阶机关兽","机关鸟","进阶机关鸟","机关人人形","进阶机关人人形","进阶连弩车","巴蛇",
	"进阶巴蛇","进阶蚌精","鲛人","进阶鲛人","碧水夜叉","进阶碧水夜叉","锦毛貂精","进阶锦毛貂精","千年蛇魅","进阶千年蛇魅","犀牛将军人形","进阶犀牛将军人形","犀牛将军兽形","进阶犀牛将军兽形",
	"机关人车","葫芦宝贝","进阶葫芦宝贝","猫灵人形","进阶猫灵人形","猫灵兽形","进阶猫灵兽形","狂豹兽形","进阶狂豹兽形","狂豹人形","进阶狂豹人形","蝎子精",
	"进阶蝎子精","混沌兽","进阶混沌兽","画魂","进阶画魂","长眉灵猴","进阶长眉灵猴","巨力神猿","进阶巨力神猿","修罗傀儡鬼","进阶修罗傀儡鬼","藤蔓妖花",
	--新增
	"巨石守卫夜","巨石守卫昼","涂山瞳","月魅","夜游神","幻姬","踏云兽","无常鬼差白","无常鬼差黑","执音","有苏鸩","司辰侍者未来","司辰侍者过去","雷龙",
	"涂山雪","魔化毗舍童子","五行山神(金)","五行山神(木)","五行山神(水)","五行山神(火)","五行山神(土)","多闻巡守","妙华天女","谛听","长乐灵仙","沙暴",
	"觉醒涂山雪","司风","司雪","司雨","自在心猿","玄珠灵仙","虬龙","狐不归","云游火","金翼","日游神","炼丹童子","月影仙","独角鬼王","阿宝",
	"花铃",
	"进阶巨石守卫夜","进阶巨石守卫昼","进阶涂山瞳","进阶月魅","进阶夜游神","进阶幻姬","进阶云游火","进阶月影仙","进阶独角鬼王","进阶阿宝",
	"进阶踏云兽","进阶无常鬼差白","进阶无常鬼差黑","进阶执音","进阶有苏鸩","进阶金翼","进阶日游神","进阶花铃",
	"进阶司辰侍者未来","进阶司辰侍者过去","进阶涂山雪","进阶魔化毗舍童子","进阶炼丹童子",
	"进阶雷龙","进阶觉醒涂山雪","进阶司风","进阶司雪","进阶司雨","进阶自在心猿",
	"进阶五行山神(金)","进阶五行山神(木)","进阶五行山神(水)","进阶五行山神(火)","进阶五行山神(土)",
	"进阶多闻巡守","进阶妙华天女","进阶谛听","进阶长乐灵仙","进阶沙暴","进阶玄珠灵仙","进阶虬龙","进阶狐不归",
	--新增结束
	"进阶藤蔓妖花","蜃气妖","进阶蜃气妖","修罗傀儡妖","进阶修罗傀儡妖","金身罗汉","进阶金身罗汉","曼珠沙华","进阶曼珠沙华","善财童子","进阶善财童子",
	"进阶小毛头","进阶小丫丫","进阶小仙灵","进阶小仙女","进阶小精灵","进阶小魔头","泡泡","章鱼","狸","海星","幽萤娃娃","进阶幽萤娃娃","持国巡守",
	"进阶持国巡守","毗舍童子","进阶毗舍童子","真陀护法","进阶真陀护法","泪妖","进阶泪妖","镜妖","进阶镜妖","琴仙","进阶琴仙","金饶僧","进阶金饶僧",
	"增长巡守","进阶增长巡守","灵灯侍者","进阶灵灯侍者","般若天女","进阶般若天女"}
	local fhz = false
	for i=1,#lb do
		if lb[i] == sj then
		  fhz = true
		end
	end
	return fhz
end

function 取饰品表1(sj)
	local lb = {"野猪饰品","羊头怪饰品","牛头饰品","马面饰品","雷鸟人饰品","进阶雷鸟人饰品","蝴蝶仙子饰品","进阶蝴蝶仙子饰品","古代瑞兽饰品","进阶古代瑞兽饰品","白熊饰品","进阶白熊饰品","黑山老妖饰品","进阶黑山老妖饰品",
	"天兵饰品","进阶天兵饰品","进阶天将饰品","地狱战神饰品","进阶地狱战神饰品","风伯饰品","进阶风伯饰品","凤凰饰品","进阶凤凰饰品","蛟龙饰品","进阶蛟龙饰品","雨师饰品","进阶雨师饰品","进阶如意仙子饰品","芙蓉仙子饰品","进阶芙蓉仙子饰品",
	"巡游天神饰品","进阶巡游天神饰品","星灵仙子饰品","进阶星灵仙子饰品","幽灵饰品","进阶幽灵饰品","鬼将饰品","进阶鬼将饰品","吸血鬼饰品","进阶吸血鬼饰品","净瓶女娲饰品","进阶净瓶女娲饰品",
	"律法女娲饰品","进阶律法女娲饰品","灵符女娲饰品","进阶灵符女娲饰品","律法女娲饰品","进阶律法女娲饰品","灵符女娲饰品","进阶灵符女娲饰品","大力金刚饰品","进阶大力金刚饰品","雾中仙饰品",
	"进阶雾中仙饰品","灵鹤饰品","进阶灵鹤饰品","夜罗刹饰品","进阶夜罗刹饰品","进阶炎魔神饰品","噬天虎饰品","进阶噬天虎饰品","野猪精饰品","进阶野猪精饰品","鼠先锋饰品","进阶鼠先锋饰品","百足将军饰品","进阶百足将军饰品",
	"红萼仙子饰品","进阶红萼仙子饰品","龙龟饰品","进阶龙龟饰品","进阶阴阳伞饰品","机关兽饰品","进阶机关兽饰品","机关鸟饰品","进阶机关鸟饰品","机关人人形饰品","进阶机关人人形饰品","进阶连弩车饰品","巴蛇饰品",
	"进阶巴蛇饰品","进阶蚌精饰品","鲛人饰品","进阶鲛人饰品","碧水夜叉饰品","进阶碧水夜叉饰品","锦毛貂精饰品","进阶锦毛貂精饰品","千年蛇魅饰品","进阶千年蛇魅饰品","犀牛将军人形饰品","进阶犀牛将军人形饰品","犀牛将军兽形饰品","进阶犀牛将军兽形饰品",
	"机关人车饰品","葫芦宝贝饰品","进阶葫芦宝贝饰品","猫灵人形饰品","进阶猫灵人形饰品","猫灵兽形饰品","进阶猫灵兽形饰品","狂豹兽形饰品","进阶狂豹兽形饰品","狂豹人形饰品","进阶狂豹人形饰品","蝎子精饰品",
	"进阶蝎子精饰品","混沌兽饰品","进阶混沌兽饰品","画魂饰品","进阶画魂饰品","长眉灵猴饰品","进阶长眉灵猴饰品","巨力神猿饰品","进阶巨力神猿饰品","修罗傀儡鬼饰品","进阶修罗傀儡鬼饰品","藤蔓妖花饰品",
	"进阶藤蔓妖花饰品","蜃气妖饰品","进阶蜃气妖饰品","修罗傀儡妖饰品","进阶修罗傀儡妖饰品","金身罗汉饰品","进阶金身罗汉饰品","曼珠沙华饰品","进阶曼珠沙华饰品","善财童子饰品","进阶善财童子饰品",
	"进阶小毛头饰品","进阶小丫丫饰品","进阶小仙灵饰品","进阶小仙女饰品","进阶小精灵饰品","进阶小魔头饰品","泡泡饰品","章鱼饰品","狸饰品","海星饰品","幽萤娃娃饰品","进阶幽萤娃娃饰品","持国巡守饰品",
	"进阶持国巡守饰品","毗舍童子饰品","进阶毗舍童子饰品","真陀护法饰品","进阶真陀护法饰品","泪妖饰品","进阶泪妖饰品","镜妖饰品","进阶镜妖饰品","琴仙饰品","进阶琴仙饰品","金饶僧饰品","进阶金饶僧饰品",
	"增长巡守饰品","进阶增长巡守饰品","灵灯侍者饰品","进阶灵灯侍者饰品","般若天女饰品","进阶般若天女饰品",
	--新增
	"巨石守卫夜饰品","巨石守卫昼饰品","进阶巨石守卫夜饰品","进阶巨石守卫昼饰品","涂山瞳饰品","进阶涂山瞳饰品","月魅饰品","进阶月魅饰品","夜游神饰品","进阶夜游神饰品","幻姬饰品","进阶幻姬饰品",
	"踏云兽饰品","进阶踏云兽饰品","无常鬼差白饰品","无常鬼差黑饰品","进阶无常鬼差白饰品","进阶无常鬼差黑饰品","执音饰品","进阶执音饰品","有苏鸩饰品","进阶有苏鸩饰品",
	"司辰侍者未来饰品","司辰侍者过去饰品","进阶司辰侍者未来饰品","进阶司辰侍者过去饰品","涂山雪饰品","进阶涂山雪饰品","魔化毗舍童子饰品","进阶魔化毗舍童子饰品",
	"雷龙饰品","进阶雷龙饰品","觉醒涂山雪饰品","进阶觉醒涂山雪饰品","司风饰品","进阶司风饰品","司雪饰品","进阶司雪饰品","司雨饰品","进阶司雨饰品","自在心猿饰品","进阶自在心猿饰品",
	"五行山神(金)饰品","五行山神(木)饰品","五行山神(水)饰品","五行山神(火)饰品","五行山神(土)饰品","进阶五行山神(金)饰品","进阶五行山神(木)饰品","进阶五行山神(水)饰品","进阶五行山神(火)饰品","进阶五行山神(土)饰品",
	"多闻巡守饰品","进阶多闻巡守饰品","妙华天女饰品","进阶妙华天女饰品","谛听饰品","进阶谛听饰品","长乐灵仙饰品","进阶长乐灵仙饰品","沙暴饰品","进阶沙暴",
	"玄珠灵仙饰品","进阶玄珠灵仙饰品","虬龙饰品","进阶虬龙饰品","狐不归饰品","进阶狐不归饰品","云游火饰品","进阶云游火饰品","金翼饰品","进阶金翼饰品",
	"日游神饰品","进阶日游神饰品","炼丹童子饰品","进阶炼丹童子饰品","月影仙饰品","进阶月影仙饰品","独角鬼王饰品","进阶独角鬼王饰品","阿宝饰品","进阶阿宝饰品",
	"花铃饰品","进阶花铃饰品",
	--新增结束
	}

	local fhz = false
	for i=1,#lb do
		if lb[i] == sj then
		  fhz = true
		end
	end
	return fhz
end


function 取进阶表(sj)
  local lb = {"进阶雷鸟人","进阶蝴蝶仙子","进阶古代瑞兽","进阶白熊","进阶黑山老妖","进阶天兵","进阶天将","进阶地狱战神","进阶风伯","进阶凤凰","进阶蛟龙",
  "进阶雨师","进阶如意仙子","进阶芙蓉仙子","进阶巡游天神","进阶星灵仙子","进阶幽灵","进阶鬼将","进阶吸血鬼","进阶净瓶女娲","进阶律法女娲","进阶灵符女娲",
  "进阶律法女娲","进阶灵符女娲","进阶大力金刚","进阶雾中仙","进阶灵鹤","进阶夜罗刹","进阶炎魔神","进阶噬天虎","进阶野猪精","进阶鼠先锋","进阶百足将军",
  "进阶龙龟","进阶阴阳伞","进阶机关兽","进阶机关鸟","进阶机关人人形","进阶连弩车","进阶巴蛇","进阶蚌精","进阶鲛人","进阶碧水夜叉","进阶锦毛貂精","进阶千年蛇魅",
  "进阶犀牛将军人形","进阶犀牛将军兽形","进阶葫芦宝贝","进阶猫灵人形","进阶猫灵兽形","进阶狂豹兽形","进阶狂豹人形","进阶蝎子精","进阶混沌兽","进阶画魂",
  "进阶长眉灵猴","进阶巨力神猿","进阶修罗傀儡鬼","进阶藤蔓妖花","进阶蜃气妖","进阶修罗傀儡妖","进阶金身罗汉","进阶曼珠沙华","进阶善财童子","进阶幽萤娃娃",
  "进阶持国巡守","进阶毗舍童子","进阶真陀护法","进阶泪妖","进阶镜妖","进阶琴仙","进阶金饶僧","进阶增长巡守","进阶灵灯侍者","进阶般若天女","进阶涂山雪",
  "进阶狐不归","进阶花铃","进阶月魅","进阶月影仙","进阶云游火","进阶超级玉兔","进阶超级土地公公","进阶超级神鸡","进阶超级神猴","进阶超级神狗","进阶超级神猪",
  "进阶超级神鼠","进阶超级猪小戒","进阶超级小白龙","进阶谛听","进阶红萼仙子",
  "进阶超级飞天","进阶超级人参娃娃","进阶超级泡泡","进阶超级大熊猫","进阶超级金猴","进阶超级大象","进阶超级白泽","进阶超级灵鹿","进阶超级赤焰兽","进阶超级大鹏",
  "进阶超级筋斗云","进阶超级神牛","进阶超级神虎","进阶超级海豚","进阶超级神虎","进阶超级海豚","进阶超级神兔","进阶超级神龙","进阶超级腾蛇","进阶超级孔雀",
  "进阶超级灵狐","进阶超级神蛇","进阶超级神马","进阶超级青鸾","进阶超级麒麟","进阶超级神羊","进阶超级六耳猕猴","进阶超级鲲鹏","进阶超级神蛇乙巳",
	"进阶巨石守卫夜","进阶巨石守卫昼","进阶涂山瞳","进阶月魅","进阶夜游神","进阶幻姬","进阶玄珠灵仙","进阶虬龙","进阶金翼","进阶日游神",
	"进阶踏云兽","进阶无常鬼差白","进阶无常鬼差黑","进阶执音","进阶有苏鸩","进阶炼丹童子","进阶独角鬼王","进阶阿宝",
	"进阶司辰侍者未来","进阶司辰侍者过去","进阶涂山雪","进阶魔化毗舍童子",
	"进阶雷龙","进阶觉醒涂山雪","进阶司风","进阶司雪","进阶司雨","进阶自在心猿",
	"进阶五行山神(金)","进阶五行山神(木)","进阶五行山神(水)","进阶五行山神(火)","进阶五行山神(土)",
	"进阶多闻巡守","进阶妙华天女","进阶谛听","进阶长乐灵仙","进阶沙暴"
	}
 local fhz = false
  for i=1,#lb do
	if lb[i] == sj then
		fhz = true
	end
  end
  return fhz
end

function 取进阶子女表(sj)
  local lb = {"进阶小毛头","进阶小丫丫","进阶小仙灵","进阶小仙女","进阶小精灵","进阶小魔头",}
  local fhz = false
  for i=1,#lb do
	if lb[i] == sj then
	  fhz = true
	end
  end
 return fhz
end

function 取进阶神兽表(sj)
  local lb = {"进阶超级玉兔","进阶超级土地公公","进阶超级神鸡","进阶超级神猴","进阶超级神狗","进阶超级神猪","进阶超级神鼠","进阶超级猪小戒","进阶超级小白龙",
  "进阶超级飞天","进阶超级人参娃娃","进阶超级泡泡","进阶超级大熊猫","进阶超级金猴","进阶超级大象","进阶超级白泽","进阶超级灵鹿","进阶超级赤焰兽","进阶超级大鹏",
  "进阶超级筋斗云","进阶超级神牛","进阶超级神虎","进阶超级海豚","进阶超级神虎","进阶超级海豚","进阶超级神兔","进阶超级神龙","进阶超级腾蛇","进阶超级孔雀","进阶超级神蛇乙巳",
  "进阶超级灵狐","进阶超级神蛇","进阶超级神马","进阶超级青鸾","进阶超级麒麟","进阶超级神羊","进阶超级六耳猕猴","进阶超级鲲鹏"}
  local fhz = false
  for i=1,#lb do
	if lb[i] == sj then
	  fhz = true
	end
  end
  return fhz
end

function 取神兽表(sj)
  local lb = {"超级泡泡", "超级神虎", "超级大熊猫", "超级金猴", "超级人参娃娃", "超级大象", "超级筋斗云", "超级灵狐", "超级孔雀", "超级神龙",
  "超级神马", "超级麒麟", "超级神蛇", "超级青鸾", "超级灵鹿", "超级白泽", "超级赤焰兽", "超级大鹏", "超级神牛", "超级海豚", "超级神兔","超级神蛇乙巳",
	"超级神羊", "超级六耳猕猴", "超级土地公公", "超级神猴", "超级神鸡", "超级玉兔", "超级神狗", "超级小白龙", "超级神猪", "超级飞天", "超级神鼠",
	"超级鲲鹏", "超级离火兽", "超级神牛(辛丑)", "超级神柚", "超级猪小戒", "超级有熊", "超级神虎(壬寅)", "超级神兔(癸卯)", "超级飞廉", "超级神龙(甲辰)",
	"超级红孩儿"}
  local fhz = false
  for i=1,#lb do
	if lb[i] == sj then
	  fhz = true
	end
  end
  return fhz
end

function 取随机神兽()
	local 随机神兽 = {"超级六耳猕猴","超级神龙","超级青鸾","超级玉兔","超级白泽","超级泡泡","超级赤焰兽","超级神牛","超级神虎","超级海豚","超级人参娃娃","超级大熊猫","超级金猴",
		"超级大象","超级灵鹿","超级大鹏","超级筋斗云","超级神兔","超级灵狐","超级神蛇","超级神马","超级麒麟","超级神羊","超级孔雀","超级神猴","超级神鸡",
		"超级神猪","超级小白龙","超级神鼠","超级猪小戒","超级神狗","超级飞天","超级土地公公", "超级红孩儿", "超级飞廉", "超级神虎(壬寅)" }
	return 随机神兽[取随机数(1,#随机神兽)]
end

function 取盲盒随机神兽()
	local 随机神兽 = {"超级六耳猕猴","超级神龙","超级青鸾","超级玉兔","超级白泽","超级泡泡","超级赤焰兽","超级神牛","超级神虎","超级海豚","超级人参娃娃","超级大熊猫","超级金猴",
		"超级大象","超级灵鹿","超级大鹏","超级筋斗云","超级神兔","超级灵狐","超级神蛇","超级神马","超级麒麟","超级神羊","超级孔雀","超级神猴","超级神鸡",
		"超级神猪","超级小白龙","超级神鼠","超级猪小戒","超级神狗","超级飞天","超级土地公公", "超级红孩儿", "超级飞廉", "超级神虎(壬寅)", "超级鲲鹏" }
	return 随机神兽[取随机数(1,#随机神兽)]
end

function 取随机普通神兽() --,"超级飞天"
	local 随机神兽 = {"超级六耳猕猴","超级神龙","超级青鸾","超级玉兔","超级白泽","超级泡泡","超级赤焰兽","超级神牛","超级神虎","超级海豚","超级人参娃娃","超级大熊猫","超级金猴",
		"超级大象","超级灵鹿","超级大鹏","超级筋斗云","超级神兔","超级灵狐","超级神蛇","超级神马","超级麒麟","超级神羊","超级孔雀","超级神猴","超级神鸡","超级小白龙","超级土地公公"}
	return 随机神兽[取随机数(1,#随机神兽)]
end

function 取内丹数量(lv)

	if lv<35 then
		return 1
	elseif lv>=35 and lv<75 then
		return 2
	elseif lv>=75 and lv<105 then
		return 3
	elseif lv>=105 and lv<145 then
		return 4
	elseif lv>=145 and lv<175 then
		return 5
	else
		return 6
	end
end

function 取神兽技能(bb,物法,dingzhi)

	local fh
	if 物法=="物理型（单点爆伤）" then
		if bb=="超级泡泡" then
			fh = {"高级神佑复生","高级必杀","高级感知","夜战","幸运"}
		elseif bb=="超级神虎" then
			fh = {"嗜血追击","高级感知","高级夜战","连击","强力"}
		elseif bb=="超级大熊猫" then
			fh = {"高级连击","高级防御","高级感知","夜战","幸运"}
		elseif bb=="超级金猴" then
			fh = {"高级偷袭","高级敏捷","高级幸运","夜战","幸运"}
		elseif bb=="超级人参娃娃" then
			fh = {"壁垒击破","高级必杀","高级强力","幸运"}
		elseif bb=="超级大象" then
			fh = {"高级强力","高级反震","高级再生","夜战","幸运"}
		elseif bb=="超级筋斗云" then
			fh = {"高级神佑复生","高级偷袭","高级敏捷","强力"}
		elseif bb=="超级灵狐" then
			fh = {"惊心一剑","高级敏捷","高级必杀","夜战"}
		elseif bb=="超级孔雀" then
			fh = {"高级飞行","高级偷袭","高级再生","必杀"}
		elseif bb=="超级神龙" then
			fh ={"高级必杀","高级驱鬼","高级夜战","幸运","强力"}
		elseif bb=="超级神牛" then
			fh = {"力劈华山","高级幸运","高级招架","必杀","强力"}
		elseif bb=="超级神兔" then
			fh = {"高级连击","高级偷袭","高级敏捷","夜战","幸运"}
		elseif bb=="超级神蛇" then
			fh = {"高级连击","高级毒","高级夜战","偷袭","敏捷"}
		elseif bb=="超级灵鹿" then
			fh = {"善恶有报","高级冥思","高级再生","永恒","幸运"}
		elseif bb=="超级白泽" then
			fh = {"高级必杀","高级敏捷","高级夜战","感知","幸运"}
		elseif bb=="超级赤焰兽" then
			fh = {"高级必杀","高级反击","高级感知","夜战","幸运"}
		elseif bb=="超级神牛" then
			fh = {"力劈华山","高级幸运","高级招架","必杀","强力"}
		elseif bb=="超级神猴" then
			fh = {"高级神佑复生","高级吸血","大快朵颐","必杀","连击"}
		elseif bb=="超级神鸡" then
			fh = {"高级神佑复生","高级强力","从天而降","夜战","必杀"}
		elseif bb=="超级神狗" then
			fh = {"高级独行","高级神佑复生","理直气壮","强力","再生"}
		elseif bb=="超级神猪" then
			fh = {"高级神佑复生","高级防御","津津有味","幸运","再生"}
		elseif bb=="超级麒麟" then
			fh = {"高级合纵","高级连击","高级幸运","偷袭"}
		elseif bb=="超级青鸾" then
			fh = {"苍鸾怒击","高级夜战","高级飞行","反震"}
		elseif bb=="超级六耳猕猴" then
			fh = {"高级连击","高级敏捷","高级招架","幸运"}

		elseif bb=="超级神蛇乙巳" then
			fh = {"节节高升","高级夜战","高级感知","敏捷","毒"}

		elseif bb=="超级土地公公" then
			fh = {"高级敏捷","高级必杀","高级神佑复生","夜战"}
		elseif bb=="超级海豚" then
			fh = {"剑荡四方","高级必杀","高级偷袭","夜战"}
		elseif bb=="超级大鹏" then
			fh = {"高级飞行","高级敏捷","高级神佑复生","必杀"}
		elseif bb=="超级离火兽" then
			fh = {"焚天陨火","高级连击","高级感知","再生"}
		elseif bb=="超级玉兔" then
			fh = {"高级夜战","高级敏捷","偷袭","连击"}
		elseif bb=="超级猪小戒" then
			fh = {"高级必杀","高级强力","高级防御","高级偷袭","反击"}
		elseif bb=="超级飞天" then
			fh = {"高级连击","高级飞行","高级敏捷","神佑复生"}
		elseif bb=="超级小白龙" then
			fh = {"高级必杀","高级反击","高级再生","感知"}
		elseif bb=="超级有熊" then
			fh = {"狂莽一击","高级连击","高级防御","吸血"}
		elseif bb=="超级神鼠" then
			fh = {"昼伏夜出","神出鬼没","溜之大吉","偷袭","吸血"}
		elseif bb=="超级神牛(辛丑)" then
			fh = {"高级必杀","高级连击","高级再生","幸运","招架"}
		elseif bb=="超级神虎(壬寅)" then
			fh = {"虎虎生风","高级敏捷","高级反击","强力","必杀"}
		elseif bb=="超级鲲鹏" then
			fh = {"北冥之渊","水击三千","高级必杀","高级偷袭","高级神佑复生","逍遥游","夜战","再生","高级防御"}
		elseif bb=="超级神马" then
			fh = {"高级连击","高级神佑复生","浮云神马","幸运","神迹"}
		elseif bb=="超级神羊" then
			fh = {"高级必杀","高级连击","千钧一怒","反震","感知"}
		elseif bb=="超级腾蛇" then
			fh = {"高级连击","高级毒","高级夜战","偷袭","敏捷"}
		elseif bb == "超级飞廉" then
			fh = {"灵能激发","地狱烈火","高级法术波动","魔之心","永恒"}
			if dingzhi then
				fh = {"高级偷袭","夜战","高级防御","诸天正法","高级必杀","虎虎生风","高级连击"}
			end
		elseif bb == "超级红孩儿" then
			fh = {"灵能激发","地狱烈火","高级法术波动","魔之心","永恒"}
			if dingzhi then
				fh = {"圣婴大王","敏捷","高级魔之心","法术暴击","超级三昧真火","桀骜自恃","高级法术连击"}
			end
		elseif bb == "恶魔泡泡" then
			fh = {"灵能激发","地狱烈火","高级法术波动","魔之心","永恒"}
			if dingzhi then
				fh = {"昼伏夜出","力劈华山","诸天正法","偷袭","高级强力","高级必杀","津津有味"}
			end
		elseif bb == "自在心猿" then
			fh = {"灵能激发","地狱烈火","高级法术波动","魔之心","永恒"}
			if dingzhi then
				fh = {"高级法术暴击","高级魔之心","须弥真言","食指大动","法术波动","高级法术连击","出其不意"}
			end
		end
	else--if 物法=="法术型（秒伤）" then
		if bb=="超级泡泡" then
			fh = {"高级慧根","高级魔之心","奔雷咒","水攻","感知"}
		elseif bb=="超级神虎" then
			fh = {"高级法术暴击","高级驱鬼","地狱烈火","法术波动","魔之心"}
		elseif bb=="超级大熊猫" then
			fh = {"高级冥思","高级魔之心","奔雷咒","水攻","感知"}
		elseif bb=="超级金猴" then
			fh = {"高级精神集中","高级魔之心","奔雷咒","水攻","感知"}
		elseif bb=="超级人参娃娃" then
			fh = {"泰山压顶","高级法术波动","高级冥思","魔之心"}
		elseif bb=="超级大象" then
			fh = {"高级神迹","高级魔之心","奔雷咒","水攻","感知"}
		elseif bb=="超级筋斗云" then
			fh = {"高级法术连击","高级感知","反震","奔雷咒"}
		elseif bb=="超级灵狐" then
			fh = {"高级法术暴击","高级感知","奔雷咒","法术连击"}
		elseif bb=="超级孔雀" then
			fh = {"高级魔之心","高级神佑复生","奔雷咒","幸运"}
		elseif bb=="超级神牛" then
			fh = {"高级法术波动","高级法术连击","奔雷咒","冥思","魔之心"}
		elseif bb=="超级神兔" then
			fh = {"高级法术连击","高级反震","奔雷咒","魔之心","感知"}
		elseif bb=="超级神龙" then
			fh = {"高级法术波动","龙魂","奔雷咒","魔之心","再生"}
		elseif bb=="超级神蛇" then
			fh = {"灵能激发","地狱烈火","高级法术波动","魔之心","永恒"}
		elseif bb=="超级灵鹿" then
			fh = {"泰山压顶","高级法术连击","高级法术暴击","上古灵符","感知"}
		elseif bb=="超级白泽" then
			fh = {"水漫金山","高级魔之心","高级法术暴击","上古灵符","感知"}
		elseif bb=="超级赤焰兽" then
			fh = {"地狱烈火","高级冥思","八凶法阵","魔之心","感知"}
		elseif bb=="超级神牛" then
			fh = {"地狱烈火","高级法术波动","高级法术连击","冥思","魔之心"}
		elseif bb=="超级神羊" then
			fh = {"地狱烈火","高级法术波动","高级魔之心","法术暴击","驱鬼"}
		elseif bb=="超级神猴" then
			fh = {"地狱烈火","高级法术波动","高级法术连击","魔之心","法术暴击"}
		elseif bb=="超级神鸡" then
			fh = {"地狱烈火","高级法术波动","高级感知","招架","魔之心"}
		elseif bb=="超级神狗" then
			fh = {"地狱烈火","高级招架","高级防御","法术暴击","魔之心"}
		elseif bb=="超级神猪" then
			fh = {"地狱烈火","高级魔之心","高级法术暴击","招架","驱鬼"}
		elseif bb=="超级神蛇乙巳" then
			fh = {"节节高升","高级夜战","高级感知","敏捷","毒"}
		elseif bb=="超级麒麟" then
			fh = {"泰山压顶","高级魔之心","高级驱鬼","感知"}
		elseif bb=="超级青鸾" then
			fh = {"高级幸运","奔雷咒","高级魔之心","法术暴击"}
		elseif bb=="超级六耳猕猴" then
			fh = {"须弥真言","上古灵符","高级法术连击","永恒"}
		elseif bb=="超级土地公公" then
			fh = {"天降灵葫","高级法术连击","高级神佑复生","招架"}
		elseif bb=="超级海豚" then
			fh = {"水漫金山","高级法术暴击","高级魔之心","慧根"}

		elseif bb=="超级神兔(癸卯)睡梦" then
			fh = {"好梦连连","迟钝","高级神佑复生","高级连击","驱鬼"}


		elseif bb=="超级大鹏" then
			fh = {"奔雷咒","高级法术波动","高级法术暴击","冥思"}
		elseif bb=="超级离火兽" then
			fh = {"地狱烈火","高级魔之心","高级法术暴击","永恒"}
		elseif bb=="超级玉兔" then
			fh = {"月光","高级法术暴击","高级法术波动","驱鬼"}
		elseif bb=="超级猪小戒" then
			fh = {"食指大动","高级魔之心","高级感知","高级法术连击","法术波动"}
		elseif bb=="超级飞天" then
			fh = {"流沙轻音","净台妙谛","高级法术暴击","幸运"}
		elseif bb=="超级小白龙" then
			fh = {"高级法术连击","高级法术暴击","叱咤风云","永恒"}
		elseif bb=="超级有熊" then
			fh = {"泰山压顶","高级魔之心","高级法术波动","神迹"}
		elseif bb=="超级神鼠" then
			fh = {"奔雷咒","高级慧根","高级再生","魔之心","法术波动"}
		elseif bb=="超级神牛(辛丑)" then
			fh = {"神来气旺","地狱烈火","高级法术暴击","驱鬼","法术波动"}
		elseif bb=="超级神虎(壬寅)" then
			fh = {"奔雷咒","高级法术波动","高级反震","招架","法术暴击"}
		elseif bb=="超级鲲鹏" then
			fh = {"北冥之渊","扶摇万里","高级魔之心","高级法术暴击","高级神佑复生","逍遥游","精神集中","法术波动","高级法术连击"}
		elseif bb=="超级神马" then
			fh = {"高级魔之心","高级法术连击","泰山压顶","法术暴击","慧根"}
		elseif bb=="超级腾蛇" then
			fh = {"灵能激发","地狱烈火","高级法术波动","魔之心","永恒"}
		elseif bb == "超级飞廉" then
			fh = {"灵能激发","地狱烈火","高级法术波动","魔之心","永恒"}
			if dingzhi then
				fh = {"高级偷袭","夜战","高级防御","诸天正法","高级必杀","虎虎生风","高级连击"}
			end
		elseif bb == "超级红孩儿" then
			fh = {"灵能激发","地狱烈火","高级法术波动","魔之心","永恒"}
			if dingzhi then
				fh = {"圣婴大王","敏捷","高级魔之心","法术暴击","超级三昧真火","桀骜自恃","高级法术连击"}
			end
		elseif bb == "恶魔泡泡" then
			fh = {"灵能激发","地狱烈火","高级法术波动","魔之心","永恒"}
			if dingzhi then
				fh = {"昼伏夜出","力劈华山","诸天正法","偷袭","高级强力","高级必杀","津津有味"}
			end
		elseif bb == "自在心猿" then
			fh = {"灵能激发","地狱烈火","高级法术波动","魔之心","永恒"}
			if dingzhi then
				fh = {"高级法术暴击","高级魔之心","须弥真言","食指大动","法术波动","高级法术连击","出其不意"}
			end
		end
	end
	return fh
end


Qubaobao={}
--0-35携带
Qubaobao["泡泡"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1380
	,bbs_4 = 4200
	,bbs_5 = 2160
	,bbs_6 = 1320
	,bbs_7 = 1320
	,bbs_8 = {1.048,1.059,1.07,1.08,1.091}
	,bbs_9 = {"高级防御","高级幸运","连击","精神集中","泰山压顶"}
}
Qubaobao["树怪"]={
	bbs_1 = 5
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 3300
	,bbs_5 = 1320
	,bbs_6 = 900
	,bbs_7 = 960
	,bbs_8 = {0.882,0.891,0.9,0.909,0.918}
	,bbs_9 = {"反击","感知","驱鬼","再生","烈火","弱点火","迟钝"}
}
Qubaobao["大海龟"]={
	bbs_1 = 0
	,bbs_2 = 960
	,bbs_3 = 960
	,bbs_4 = 3600
	,bbs_5 = 1200
	,bbs_6 = 840
	,bbs_7 = 1320
	,bbs_8 = {0.882,0.891,0.9,0.909,0.918}
	,bbs_9 = {"反震","慧根","幸运","水属性吸收","防御"}
}
Qubaobao["巨蛙"]={
	bbs_1 = 0
	,bbs_2 = 1080
	,bbs_3 = 840
	,bbs_4 = 2700
	,bbs_5 = 1190
	,bbs_6 = 1309
	,bbs_7 = 1309
	,bbs_8 = {0.882,0.891,0.9,0.909,0.918}
	,bbs_9 = {"慧根","幸运","水攻","弱点火"}
}
Qubaobao["章鱼"]={
	bbs_1 = 0
	,bbs_2 = 1440
	,bbs_3 = 840
	,bbs_4 = 2400
	,bbs_5 = 1200
	,bbs_6 = 1320
	,bbs_7 = 1200
	,bbs_8 = {0.989,0.999,1.01,1.02,1.03}
	,bbs_9 = {"连击","毒","吸血","水属性吸收","弱点火"}
}
Qubaobao["海星"]={
	bbs_1 = 0
	,bbs_2 = 1080
	,bbs_3 = 1140
	,bbs_4 = 2400
	,bbs_5 = 1440
	,bbs_6 = 1200
	,bbs_7 = 1020
	,bbs_8 = {0.989,0.999,1.01,1.02,1.04}
	,bbs_9 = {"水属性吸收","弱点火","慧根","高级反震","水攻"}
}
Qubaobao["护卫"]={
	bbs_1 = 0
	,bbs_2 = 1140
	,bbs_3 = 1020
	,bbs_4 = 2700
	,bbs_5 = 1800
	,bbs_6 = 1200
	,bbs_7 = 1200
	,bbs_8 = {0.931,0.94,0.95,0.959,0.969}
	,bbs_9 = {"反击","必杀","强力"}
}
Qubaobao["草龟"]={
	bbs_1 = 0
	,bbs_2 = 960
	,bbs_3 = 960
	,bbs_4 = 3900
	,bbs_5 = 1200
	,bbs_6 = 1080
	,bbs_7 = 840
	,bbs_8 = {0.882,0.891,0.9,0.909,0.918}
	,bbs_9 = {"土属性吸收","防御","迟钝","盾气"}
}
Qubaobao["草叶虫"]={
	bbs_1 = 0
	,bbs_2 = 1200
	,bbs_3 = 900
	,bbs_4 = 2400
	,bbs_5 = 1200
	,bbs_6 = 1200
	,bbs_7 = 1440
	,bbs_8 = {0.882,0.891,0.9,0.909,1.02}
	,bbs_9 = {"反震","感知","再生","弱点火"}
}
Qubaobao["竹笋虫"]={
	bbs_1 = 0
	,bbs_2 = 1200
	,bbs_3 = 900
	,bbs_4 = 2400
	,bbs_5 = 1200
	,bbs_6 = 1200
	,bbs_7 = 1440
	,bbs_8 = {0.882,0.891,0.9,0.909,1.02}
	,bbs_9 = {"反震","感知","再生","弱点火"}
}
Qubaobao["积水蛙"]={
	bbs_1 = 0
	,bbs_2 = 1080
	,bbs_3 = 840
	,bbs_4 = 2700
	,bbs_5 = 1200
	,bbs_6 = 1020
	,bbs_7 = 1200
	,bbs_8 = {0.882,0.891,0.9,0.909,0.918}
	,bbs_9 = {"慧根","幸运"}
}
Qubaobao["元宝龟"]={
	bbs_1 = 0
	,bbs_2 = 960
	,bbs_3 = 1380
	,bbs_4 = 3600
	,bbs_5 = 1500
	,bbs_6 = 1320
	,bbs_7 = 840
	,bbs_8 = {0.882,0.891,0.9,0.909,0.918}
	,bbs_9 = {"敏捷","慧根","神迹","高级感知", "高级幸运"}
}
Qubaobao["天机虫"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1200
	,bbs_4 = 2700
	,bbs_5 = 2100
	,bbs_6 = 1200
	,bbs_7 = 1320
	,bbs_8 = {0.882,0.891,0.9,0.909,0.918}
	,bbs_9 = {"高级否定信仰","偷袭","防御","弱点火"}
}
Qubaobao["海毛虫"]={
	bbs_1 = 5
	,bbs_2 = 1440
	,bbs_3 = 900
	,bbs_4 = 2400
	,bbs_5 = 1200
	,bbs_6 = 1320
	,bbs_7 = 1200
	,bbs_8 = {0.989,0.999,1.01,1.02,1.03}
	,bbs_9 = {"毒","高级反震","必杀","驱鬼","弱点火"}
}
Qubaobao["野猪"]={
	bbs_1 = 5
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 3300
	,bbs_5 = 1320
	,bbs_6 = 900
	,bbs_7 = 960
	,bbs_8 = {0.999,1.009,1.02,1.03,1.04}
	,bbs_9 = {"感知","高级感知","高级幸运","强力","弱点土","弱点火"}
}
Qubaobao["大蝙蝠"]={
	bbs_1 = 5
	,bbs_2 = 1080
	,bbs_3 = 1140
	,bbs_4 = 2520
	,bbs_5 = 1800
	,bbs_6 = 1500
	,bbs_7 = 1500
	,bbs_8 = {1.058,1.069,1.08,1.09,1.101}
	,bbs_9 = {"吸血","高级感知","高级驱鬼","飞行","高级驱鬼","弱点水"}
}
Qubaobao["狸"]={
	bbs_1 = 0
	,bbs_2 = 1440
	,bbs_3 = 900
	,bbs_4 = 2880
	,bbs_5 = 1200
	,bbs_6 = 1380
	,bbs_7 = 1320
	,bbs_8 = {0.996,1.002,1.03,1.032,1.042}
	,bbs_9 = {"幸运","偷袭","必杀","招架"}
}
Qubaobao["强盗"]={
	bbs_1 = 5
	,bbs_2 = 1260
	,bbs_3 = 1260
	,bbs_4 = 3300
	,bbs_5 = 1380
	,bbs_6 = 1200
	,bbs_7 = 1200
	,bbs_8 = {0.989,0.999,1.01,1.02,1.03}
	,bbs_9 = {"连击","烈火","强力","否定信仰"}
}
Qubaobao["山贼"]={
	bbs_1 = 5
	,bbs_2 = 1080
	,bbs_3 = 1200
	,bbs_4 = 3600
	,bbs_5 = 1200
	,bbs_6 = 1200
	,bbs_7 = 1320
	,bbs_8 = {0.989,0.999,1.01,1.02,1.03}
	,bbs_9 = {"招架","偷袭","强力","高级否定信仰"}
}
Qubaobao["赌徒"]={
	bbs_1 = 5
	,bbs_2 = 1020
	,bbs_3 = 1140
	,bbs_4 = 3000
	,bbs_5 = 1440
	,bbs_6 = 1440
	,bbs_7 = 1380
	,bbs_8 = {0.931,0.94,0.95,0.959,0.969}
	,bbs_9 = {"反击","偷袭"}
}
Qubaobao["沙狸"]={
	bbs_1 = 5
	,bbs_2 = 1320
	,bbs_3 = 900
	,bbs_4 = 2880
	,bbs_5 = 1200
	,bbs_6 = 1320
	,bbs_7 = 1380
	,bbs_8 = {0.931,0.94,0.95,0.959,0.969}
	,bbs_9 = {"反击","偷袭"}
}
Qubaobao["海狸"]={
	bbs_1 = 5
	,bbs_2 = 1200
	,bbs_3 = 1200
	,bbs_4 = 3600
	,bbs_5 = 2100
	,bbs_6 = 1320
	,bbs_7 = 1320
	,bbs_8 = {0.931,0.94,0.95,0.959,0.969}
	,bbs_9 = {"反击","偷袭"}
}
Qubaobao["羊头怪"]={
	bbs_1 = 15
	,bbs_2 = 1260
	,bbs_3 = 1380
	,bbs_4 = 3360
	,bbs_5 = 1320
	,bbs_6 = 1200
	,bbs_7 = 1200
	,bbs_8 = {1.004,1.014,1.025,1.035,1.045}
	,bbs_9 = {"连击","必杀","幸运","永恒"}
}
Qubaobao["花妖"]={
	bbs_1 = 15
	,bbs_2 = 1020
	,bbs_3 = 1440
	,bbs_4 = 3780
	,bbs_5 = 1440
	,bbs_6 = 1140
	,bbs_7 = 1140
	,bbs_8 = {1.029,1.039,1.05,1.06,1.071}
	,bbs_9 = {"感知","慧根","落岩","防御","水属性吸收"}
}
Qubaobao["骷髅怪"]={
	bbs_1 = 15
	,bbs_2 = 1260
	,bbs_3 = 1380
	,bbs_4 = 3360
	,bbs_5 = 1320
	,bbs_6 = 1200
	,bbs_7 = 1200
	,bbs_8 = {1.004,1.014,1.025,1.035,1.045}
	,bbs_9 = {"土属性吸收","弱点雷","鬼魂术","驱鬼"}
}
Qubaobao["蛤蟆精"]={
	bbs_1 = 15
	,bbs_2 = 1380
	,bbs_3 = 1140
	,bbs_4 = 3300
	,bbs_5 = 1200
	,bbs_6 = 1320
	,bbs_7 = 1320
	,bbs_8 = {1.009,1.019,1.03,1.04,1.05}
	,bbs_9 = {"毒","必杀"}
}
Qubaobao["老虎"]={
	bbs_1 = 15
	,bbs_2 = 1080
	,bbs_3 = 1140
	,bbs_4 = 2520
	,bbs_5 = 1800
	,bbs_6 = 1500
	,bbs_7 = 1500
	,bbs_8 = {1.058,1.069,1.08,1.09,1.101}
	,bbs_9 = {"连击","驱鬼","幸运","强力"}
}
Qubaobao["黑熊"]={
	bbs_1 = 15
	,bbs_2 = 1080
	,bbs_3 = 1140
	,bbs_4 = 2520
	,bbs_5 = 1800
	,bbs_6 = 1500
	,bbs_7 = 1500
	,bbs_8 = {1.058,1.069,1.08,1.09,1.101}
	,bbs_9 = {"反击","必杀","强力","防御","迟钝"}
}
Qubaobao["狐狸精"]={
	bbs_1 = 15
	,bbs_2 = 1320
	,bbs_3 = 1260
	,bbs_4 = 3000
	,bbs_5 = 1440
	,bbs_6 = 1320
	,bbs_7 = 1200
	,bbs_8 = {1.009,1.019,1.03,1.04,1.05}
	,bbs_9 = {"驱鬼","高级感知","慧根","高级慧根","弱点雷"}
}
Qubaobao["岩龟"]={
	bbs_1 = 15
	,bbs_2 = 1320
	,bbs_3 = 1380
	,bbs_4 = 4800
	,bbs_5 = 1800
	,bbs_6 = 1080
	,bbs_7 = 840
	,bbs_8 = {1.009,1.019,1.03,1.04,1.05}
	,bbs_9 = {"驱鬼","高级感知","慧根","高级慧根","弱点雷"}
}
Qubaobao["望月蛙"]={
	bbs_1 = 15
	,bbs_2 = 1320
	,bbs_3 = 1080
	,bbs_4 = 3600
	,bbs_5 = 3000
	,bbs_6 = 1020
	,bbs_7 = 1080
	,bbs_8 = {1.009,1.019,1.03,1.04,1.05}
	,bbs_9 = {"驱鬼","高级感知","慧根","高级慧根","弱点雷"}
}
Qubaobao["海盗狸"]={
	bbs_1 = 15
	,bbs_2 = 1440
	,bbs_3 = 900
	,bbs_4 = 3600
	,bbs_5 = 1200
	,bbs_6 = 1200
	,bbs_7 = 1320
	,bbs_8 = {1.009,1.019,1.03,1.04,1.05}
	,bbs_9 = {"驱鬼","高级感知","慧根","高级慧根","弱点雷"}
}
Qubaobao["雪狸"]={
	bbs_1 = 15
	,bbs_2 = 1380
	,bbs_3 = 1320
	,bbs_4 = 3900
	,bbs_5 = 1200
	,bbs_6 = 1200
	,bbs_7 = 1080
	,bbs_8 = {1.009,1.019,1.03,1.04,1.05}
	,bbs_9 = {"驱鬼","高级感知","慧根","高级慧根","弱点雷"}
}
Qubaobao["小龙女"]={
	bbs_1 = 25
	,bbs_2 = 1500
	,bbs_3 = 1020
	,bbs_4 = 3000
	,bbs_5 = 1140
	,bbs_6 = 1320
	,bbs_7 = 960
	,bbs_8 = {1.058,1.069,1.08,1.09,1.101}
	,bbs_9 = {"神佑复生","高级驱鬼","慧根","水攻","高级水属性吸收"}
}
Qubaobao["狼"]={
	bbs_1 = 25
	,bbs_2 = 1500
	,bbs_3 = 1120
	,bbs_4 = 3200
	,bbs_5 = 1140
	,bbs_6 = 1320
	,bbs_7 = 1160
	,bbs_8 = {1.058,1.069,1.08,1.09,1.101}
	,bbs_9 = {"高级连击","夜战","驱鬼","连击","偷袭"}
	,bbs_10 = {"夜战","连击","偷袭"} --必带
}
Qubaobao["野鬼"]={
	bbs_1 = 35
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 4200
	,bbs_5 = 1200
	,bbs_6 = 1140
	,bbs_7 = 1260
	,bbs_8 = {0.994,1.004,1.015,1.025,1.035}
	,bbs_9 = {"落岩","弱点雷","鬼魂术","驱鬼"}
}
Qubaobao["虾兵"]={
	bbs_1 = 25
	,bbs_2 = 1200
	,bbs_3 = 1380
	,bbs_4 = 4800
	,bbs_5 = 2400
	,bbs_6 = 1080
	,bbs_7 = 1140
	,bbs_8 = {1.014,1.024,1.035,1.045,1.055}
	,bbs_9 = {"高级反击","高级必杀","驱鬼","水属性吸收"}
	,bbs_10 = {"水属性吸收"} --必带
}
Qubaobao["蟹将"]={
	bbs_1 = 25
	,bbs_2 = 1320
	,bbs_3 = 1200
	,bbs_4 = 5100
	,bbs_5 = 2280
	,bbs_6 = 1200
	,bbs_7 = 1200
	,bbs_8 = {1.048,1.059,1.07,1.08,1.091}
	,bbs_9 = {"高级连击","精神集中","招架","水属性吸收"}
}
Qubaobao["牛妖"]={
	bbs_1 = 25
	,bbs_2 = 1080
	,bbs_3 = 1140
	,bbs_4 = 2520
	,bbs_5 = 1800
	,bbs_6 = 1500
	,bbs_7 = 1500
	,bbs_8 = {1.058,1.069,1.08,1.09,1.101}
	,bbs_9 = {"高级反击","高级慧根","高级防御","烈火"}
}
Qubaobao["熔岩龟"]={
	bbs_1 = 25
	,bbs_2 = 1200
	,bbs_3 = 1380
	,bbs_4 = 4800
	,bbs_5 = 2580
	,bbs_6 = 1080
	,bbs_7 = 960
	,bbs_8 = {1.058,1.069,1.08,1.09,1.101}
	,bbs_9 = {"高级反击","高级慧根","高级防御","烈火"}
}
Qubaobao["冰龟"]={
	bbs_1 = 25
	,bbs_2 = 1080
	,bbs_3 = 1380
	,bbs_4 = 4800
	,bbs_5 = 2400
	,bbs_6 = 1080
	,bbs_7 = 840
	,bbs_8 = {1.058,1.069,1.08,1.09,1.101}
	,bbs_9 = {"高级反击","高级慧根","高级防御","烈火"}
}
Qubaobao["沙虫"]={
	bbs_1 = 25
	,bbs_2 = 1320
	,bbs_3 = 900
	,bbs_4 = 2400
	,bbs_5 = 1200
	,bbs_6 = 1200
	,bbs_7 = 1320
	,bbs_8 = {1.058,1.069,1.08,1.09,1.101}
	,bbs_9 = {"高级反击","高级慧根","高级防御","烈火"}
}
Qubaobao["熔火虫"]={
	bbs_1 = 25
	,bbs_2 = 1440
	,bbs_3 = 900
	,bbs_4 = 2700
	,bbs_5 = 2700
	,bbs_6 = 1200
	,bbs_7 = 1320
	,bbs_8 = {1.058,1.069,1.08,1.09,1.101}
	,bbs_9 = {"高级反击","高级慧根","高级防御","烈火"}
}
Qubaobao["雪蛙"]={
	bbs_1 = 25
	,bbs_2 = 1080
	,bbs_3 = 900
	,bbs_4 = 2700
	,bbs_5 = 2700
	,bbs_6 = 1200
	,bbs_7 = 1320
	,bbs_8 = {1.058,1.069,1.08,1.09,1.101}
	,bbs_9 = {"高级反击","高级慧根","高级防御","烈火"}
}
Qubaobao["熔火蛙"]={
	bbs_1 = 25
	,bbs_2 = 1380
	,bbs_3 = 1320
	,bbs_4 = 3600
	,bbs_5 = 1200
	,bbs_6 = 1020
	,bbs_7 = 1080
	,bbs_8 = {1.058,1.069,1.08,1.09,1.101}
	,bbs_9 = {"高级反击","高级慧根","高级防御","烈火"}
}
Qubaobao["纵火狸"]={
	bbs_1 = 25
	,bbs_2 = 1320
	,bbs_3 = 1200
	,bbs_4 = 3600
	,bbs_5 = 2400
	,bbs_6 = 1320
	,bbs_7 = 1320
	,bbs_8 = {1.058,1.069,1.08,1.09,1.101}
	,bbs_9 = {"高级反击","高级慧根","高级防御","烈火"}
}
Qubaobao["兔子怪"]={
	bbs_1 = 35
	,bbs_2 = 1320
	,bbs_3 = 1140
	,bbs_4 = 4200
	,bbs_5 = 2400
	,bbs_6 = 1440
	,bbs_7 = 1140
	,bbs_8 = {1.038,1.049,1.06,1.07,1.081}
	,bbs_9 = {"高级感知","高级冥思","高级驱鬼","高级幸运","高级永恒","高级敏捷","弱点土"}
}
Qubaobao["黑熊精"]={
	bbs_1 = 35
	,bbs_2 = 1380
	,bbs_3 = 1260
	,bbs_4 = 5040
	,bbs_5 = 2160
	,bbs_6 = 1020
	,bbs_7 = 1320
	,bbs_8 = {1.038,1.049,1.06,1.07,1.081}
	,bbs_9 = {"反震","必杀","幸运","高级强力","弱点雷"}
}
Qubaobao["牛头"]={
	bbs_1 = 35
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 3600
	,bbs_5 = 1800
	,bbs_6 = 1400
	,bbs_7 = 1200
	,bbs_8 = {1.058,1.069,1.08,1.09,1.101}
	,bbs_9 = {"驱鬼","高级必杀","招架","高级鬼魂术","驱鬼"}
}
Qubaobao["马面"]={
	bbs_1 = 35
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 3600
	,bbs_5 = 1800
	,bbs_6 = 1440
	,bbs_7 = 1200
	,bbs_8 = {1.048,1.059,1.07,1.08,1.091}
	,bbs_9 = {"驱鬼","高级必杀","强力","高级鬼魂术","驱鬼"}
}
Qubaobao["僵尸"]={
	bbs_1 = 35
	,bbs_2 = 1440
	,bbs_3 = 1080
	,bbs_4 = 4320
	,bbs_5 = 2400
	,bbs_6 = 1200
	,bbs_7 = 1380
	,bbs_8 = {1.048,1.059,1.07,1.08,1.091}
	,bbs_9 = {"土属性吸收","弱点雷","防御","鬼魂术","驱鬼"}
}
Qubaobao["龟丞相"]={
	bbs_1 = 35
	,bbs_2 = 1375
	,bbs_3 = 1313
	,bbs_4 = 3000
	,bbs_5 = 2500
	,bbs_6 = 1500
	,bbs_7 = 1500
	,bbs_8 = {1.038,1.049,1.06,1.07,1.081}
	,bbs_9 = {"冥思","驱鬼","防御","水漫金山","水属性吸收","水攻"}
}
Qubaobao["蜘蛛精"]={
	bbs_1 = 35
	,bbs_2 = 1140
	,bbs_3 = 1355
	,bbs_4 = 4980
	,bbs_5 = 2580
	,bbs_6 = 1080
	,bbs_7 = 1200
	,bbs_8 = {1.038,1.049,1.06,1.07,1.081}
	,bbs_9 = {"吸血","高级感知","高级毒","弱点土"}
}
Qubaobao["毒花龟(日)"]={
	bbs_1 = 35
	,bbs_2 = 1080
	,bbs_3 = 1356
	,bbs_4 = 4800
	,bbs_5 = 2400
	,bbs_6 = 1080
	,bbs_7 = 960
	,bbs_8 = {1.038,1.049,1.06,1.07,1.081}
	,bbs_9 = {"吸血","高级感知","高级毒","弱点土"}
}
Qubaobao["毒花龟(夜)"]={
	bbs_1 = 35
	,bbs_2 = 1320
	,bbs_3 = 1356
	,bbs_4 = 4800
	,bbs_5 = 2580
	,bbs_6 = 1080
	,bbs_7 = 960
	,bbs_8 = {1.038,1.049,1.06,1.07,1.081}
	,bbs_9 = {"吸血","高级感知","高级毒","弱点土"}
}
Qubaobao["云龟"]={
	bbs_1 = 35
	,bbs_2 = 960
	,bbs_3 = 1200
	,bbs_4 = 3600
	,bbs_5 = 2700
	,bbs_6 = 1080
	,bbs_7 = 1380
	,bbs_8 = {1.038,1.049,1.06,1.07,1.081}
	,bbs_9 = {"吸血","高级感知","高级毒","弱点土"}
}
Qubaobao["金乌虫"]={
	bbs_1 = 35
	,bbs_2 = 1500
	,bbs_3 = 900
	,bbs_4 = 2700
	,bbs_5 = 1800
	,bbs_6 = 1200
	,bbs_7 = 1320
	,bbs_8 = {1.038,1.049,1.06,1.07,1.081}
	,bbs_9 = {"真灵（火）","法术暴击","烈火","反击"}--技能组
}
Qubaobao["月光虫"]={
	bbs_1 = 35
	,bbs_2 = 960
	,bbs_3 = 900
	,bbs_4 = 2700
	,bbs_5 = 3000
	,bbs_6 = 1200
	,bbs_7 = 1320
	,bbs_8 = {1.038,1.049,1.06,1.07,1.081}
	,bbs_9 ={"茁壮","慧根","冥思","精神集中"}--技能组
}
Qubaobao["食魂虫(日)"]={
	bbs_1 = 35
	,bbs_2 = 1080
	,bbs_3 = 900
	,bbs_4 = 2700
	,bbs_5 = 2100
	,bbs_6 = 1200
	,bbs_7 = 1320
	,bbs_8 = {1.038,1.049,1.06,1.07,1.081}
	,bbs_9 = {"真灵（木）","招架","毒"}--技能组
}
Qubaobao["食魂虫(夜)"]={
	bbs_1 = 35
	,bbs_2 = 1440
	,bbs_3 = 900
	,bbs_4 = 2700
	,bbs_5 = 2400
	,bbs_6 = 1200
	,bbs_7 = 1320
	,bbs_8 = {1.038,1.049,1.06,1.07,1.081}
	,bbs_9 = {"万物之灵（木）","夜战","强力","毒"}--技能组
}
Qubaobao["鬼蛙"]={
	bbs_1 = 35
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 3600
	,bbs_5 = 1500
	,bbs_6 = 1020
	,bbs_7 = 1080
	,bbs_8 = {1.038,1.049,1.06,1.07,1.081}
	,bbs_9 ={"夜战","弱点雷","吸血","鬼魂术"}--技能组
}
Qubaobao["鬼狸"]={
	bbs_1 = 35
	,bbs_2 = 1320
	,bbs_3 = 1200
	,bbs_4 = 3900
	,bbs_5 = 1320
	,bbs_6 = 1080
	,bbs_7 = 1080
	,bbs_8 = {1.038,1.049,1.06,1.07,1.081}
	,bbs_9 = {"法术暴击","法术连击","独行","鬼魂术"}--技能组
}
Qubaobao["岩冰龟"]={
	bbs_1 = 35
	,bbs_2 = 1320
	,bbs_3 = 1380
	,bbs_4 = 4800
	,bbs_5 = 1800
	,bbs_6 = 1080
	,bbs_7 = 840
	,bbs_8 = {1.038,1.049,1.06,1.07,1.081}
	,bbs_9 ={"防御","水攻","落岩","高级水属性吸收","力大无穷（水）"}--技能组
}
Qubaobao["毒云龟"]={
	bbs_1 = 35
	,bbs_2 = 960
	,bbs_3 = 1200
	,bbs_4 = 3600
	,bbs_5 = 2700
	,bbs_6 = 1080
	,bbs_7 = 1380
	,bbs_8 = {1.038,1.049,1.06,1.07,1.081}
	,bbs_9 = {"力大无穷（水）","力大无穷（火）","烈火","必杀"}--技能组
}
Qubaobao["冰火龟"]={
	bbs_1 = 35
	,bbs_2 = 1080
	,bbs_3 = 1380
	,bbs_4 = 4800
	,bbs_5 = 2400
	,bbs_6 = 1080
	,bbs_7 = 840
	,bbs_8 = {1.038,1.049,1.06,1.07,1.081}
	,bbs_9 =  {"力大无穷（水）","力大无穷（火）","烈火","必杀"}--技能组
}
Qubaobao["火云龟"]={
	bbs_1 = 35
	,bbs_2 = 1080
	,bbs_3 = 1200
	,bbs_4 = 3600
	,bbs_5 = 2700
	,bbs_6 = 1080
	,bbs_7 = 1380
	,bbs_8 = {1.038,1.049,1.06,1.07,1.081}
	,bbs_9 = {"力大无穷（火）","高级敏捷","高级驱鬼","雷属性吸收","飞行"}--技能组
}
Qubaobao["月光雪蛙"]={
	bbs_1 = 35
	,bbs_2 = 1080
	,bbs_3 = 1080
	,bbs_4 = 3000
	,bbs_5 = 1500
	,bbs_6 = 1020
	,bbs_7 = 1200
	,bbs_8 = {1.038,1.049,1.06,1.07,1.081}
	,bbs_9 =  {"万物之灵（水）","法术波动","水属性吸收","弱点火"}--技能组
}
Qubaobao["火月蛙"]={
	bbs_1 = 35
	,bbs_2 = 1320
	,bbs_3 = 1080
	,bbs_4 = 3600
	,bbs_5 = 3000
	,bbs_6 = 1020
	,bbs_7 = 1080
	,bbs_8 = {1.038,1.049,1.06,1.07,1.081}
	,bbs_9 = {"万物之灵（火）","慧根","冥思","高级精神集中","茁壮"}--技能组
}
Qubaobao["火沙虫"]={
	bbs_1 = 35
	,bbs_2 = 1320
	,bbs_3 = 900
	,bbs_4 = 2400
	,bbs_5 = 1200
	,bbs_6 = 1200
	,bbs_7 = 1320
	,bbs_8 = {1.038,1.049,1.06,1.07,1.081}
	,bbs_9 = {"万物之灵（土）","真灵（火）","盾气","连击"}--技能组
}
Qubaobao["金乌火虫"]={
	bbs_1 = 35
	,bbs_2 = 1500
	,bbs_3 = 900
	,bbs_4 = 2700
	,bbs_5 = 1800
	,bbs_6 = 1200
	,bbs_7 = 1320
	,bbs_8 = {1.038,1.049,1.06,1.07,1.081}
	,bbs_9 ={"万物之灵（金）","法术暴击","驱鬼","慧根"}--技能组
}
Qubaobao["强盗沙狸"]={
	bbs_1 = 35
	,bbs_2 = 1440
	,bbs_3 = 900
	,bbs_4 = 3600
	,bbs_5 = 1200
	,bbs_6 = 1200
	,bbs_7 = 1320
	,bbs_8 = {1.038,1.049,1.06,1.07,1.081}
	,bbs_9 ={"健壮（金）","力大无穷（土）","高级必杀","强力","高级反击"}--技能组
}
Qubaobao["鬼火狸"]={
	bbs_1 = 35
	,bbs_2 = 1320
	,bbs_3 = 1200
	,bbs_4 = 3600
	,bbs_5 = 2400
	,bbs_6 = 1320
	,bbs_7 = 1320
	,bbs_8 = {1.038,1.049,1.06,1.07,1.081}
	,bbs_9 = {"吸血","高级感知","高级毒","弱点土"}
}
Qubaobao["胖海狸"]={
	bbs_1 = 35
	,bbs_2 = 1200
	,bbs_3 = 1200
	,bbs_4 = 3600
	,bbs_5 = 2100
	,bbs_6 = 1320
	,bbs_7 = 1320
	,bbs_8 = {1.038,1.049,1.06,1.07,1.081}
	,bbs_9 = {"吸血","高级感知","高级毒","弱点土"}
}
Qubaobao["草叶魂虫"]={
	bbs_1 = 35
	,bbs_2 = 1440
	,bbs_3 = 900
	,bbs_4 = 2700
	,bbs_5 = 2400
	,bbs_6 = 1200
	,bbs_7 = 1320
	,bbs_8 = {1.038,1.049,1.06,1.07,1.081}
	,bbs_9 = {"吸血","高级感知","高级毒","弱点土"}
}
Qubaobao["月光金乌虫"]={
	bbs_1 = 35
	,bbs_2 = 1500
	,bbs_3 = 900
	,bbs_4 = 2700
	,bbs_5 = 1800
	,bbs_6 = 1200
	,bbs_7 = 1320
	,bbs_8 = {1.038,1.049,1.06,1.07,1.081}
	,bbs_9 = {"吸血","高级感知","高级毒","弱点土"}
}
Qubaobao["积水鬼蛙"]={
	bbs_1 = 35
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 3600
	,bbs_5 = 1500
	,bbs_6 = 1020
	,bbs_7 = 1080
	,bbs_8 = {1.038,1.049,1.06,1.07,1.081}
	,bbs_9 = {"吸血","高级感知","高级毒","弱点土"}
}
Qubaobao["雪月蛙"]={
	bbs_1 = 35
	,bbs_2 = 1320
	,bbs_3 = 1080
	,bbs_4 = 3600
	,bbs_5 = 3000
	,bbs_6 = 1020
	,bbs_7 = 1080
	,bbs_8 = {1.038,1.049,1.06,1.07,1.081}
	,bbs_9 = {"欣欣向荣","慧根","冥思","高级精神集中"}

}
Qubaobao["强盗鬼狸"]={
	bbs_1 = 35
	,bbs_2 = 1440
	,bbs_3 = 900
	,bbs_4 = 3600
	,bbs_5 = 1200
	,bbs_6 = 1200
	,bbs_7 = 1320
	,bbs_8 = {1.038,1.049,1.06,1.07,1.081}
	,bbs_9 = {"吸血","高级感知","高级毒","弱点土"}
}
Qubaobao["金乌月光虫"]={
	bbs_1 = 35
	,bbs_2 = 1320
	,bbs_3 = 1080
	,bbs_4 = 3600
	,bbs_5 = 3000
	,bbs_6 = 1020
	,bbs_7 = 1080
	,bbs_8 = {1.038,1.049,1.06,1.07,1.081}
	,bbs_9 = {"欣欣向荣","慧根","冥思","精神集中"}

}

--45-65级携带
Qubaobao["蝴蝶仙子"]={
	bbs_1 = 45
	,bbs_2 = 1320
	,bbs_3 = 1140
	,bbs_4 = 3000
	,bbs_5 = 3000
	,bbs_6 = 1440
	,bbs_7 = 1440
	,bbs_8 = {1.097,1.108,1.12,1.131,1.142}
	,bbs_9 = {"神迹","高级魔之心","高级敏捷","飞行","弱点水"}
}
Qubaobao["雷鸟人"]={
	bbs_1 = 45
	,bbs_2 = 1200
	,bbs_3 = 1200
	,bbs_4 = 4200
	,bbs_5 = 1920
	,bbs_6 = 1440
	,bbs_7 = 1140
	,bbs_8 = {1.127,1.138,1.15,1.161,1.173}
	,bbs_9 = {"高级雷属性吸收","奔雷咒","飞行","弱点土","雷击"}
}
Qubaobao["白熊"]={
	bbs_1 = 45
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 5280
	,bbs_5 = 1800
	,bbs_6 = 960
	,bbs_7 = 1380
	,bbs_8 = {1.097,1.108,1.12,1.131,1.142}
	,bbs_9 = {"迟钝","强力","防御","高级反击","高级必杀"}
}
Qubaobao["古代瑞兽"]={
	bbs_1 = 45
	,bbs_2 = 1210
	,bbs_3 = 1260
	,bbs_4 = 3600
	,bbs_5 = 2504
	,bbs_6 = 1380
	,bbs_7 = 1200
	,bbs_8 = {1.127,1.138,1.15,1.161,1.173}
	,bbs_9 = {"高级神迹","高级反震","泰山压顶","高级驱鬼"}
}
Qubaobao["黑山老妖"]={
	bbs_1 = 45
	,bbs_2 = 1130
	,bbs_3 = 1500
	,bbs_4 = 6000
	,bbs_5 = 2400
	,bbs_6 = 952
	,bbs_7 = 1320
	,bbs_8 = {1.107,1.118,1.13,1.141,1.152}
	,bbs_9 = {"高级偷袭","高级吸血","高级精神集中"}
}
Qubaobao["天将"]={
	bbs_1 = 55
	,bbs_2 = 1380
	,bbs_3 = 1140
	,bbs_4 = 5406
	,bbs_5 = 2450
	,bbs_6 = 1380
	,bbs_7 = 1204
	,bbs_8 = {1.136,1.148,1.16,1.171,1.183}
	,bbs_9 = {"高级强力","驱鬼","连击","幸运"}
}
Qubaobao["天兵"]={
	bbs_1 = 55
	,bbs_2 = 1400
	,bbs_3 = 1500
	,bbs_4 = 5100
	,bbs_5 = 2319
	,bbs_6 = 1368
	,bbs_7 = 1320
	,bbs_8 = {1.127,1.138,1.15,1.161,1.173}
	,bbs_9 = {"高级防御","高级感知","必杀","高级驱鬼"}
}
Qubaobao["风伯"]={
	bbs_1 = 55
	,bbs_2 = 1380
	,bbs_3 = 1395
	,bbs_4 = 4200
	,bbs_5 = 2358
	,bbs_6 = 1368
	,bbs_7 = 1320
	,bbs_8 = {1.127,1.138,1.15,1.161,1.173}
	,bbs_9 = {"高级敏捷","奔雷咒","高级雷属性吸收","高级飞行"}
}
Qubaobao["地狱战神"]={
	bbs_1 = 55
	,bbs_2 = 1500
	,bbs_3 = 1530
	,bbs_4 = 4500
	,bbs_5 = 1868
	,bbs_6 = 1080
	,bbs_7 = 1503
	,bbs_8 = {1.107,1.118,1.13,1.141,1.152}
	,bbs_9 = {"泰山压顶","高级连击","高级魔之心","高级反震"}
}
Qubaobao["花铃"]={
	bbs_1 = 65
	,bbs_2 = 1320
	,bbs_3 = 1440
	,bbs_4 = 4560
	,bbs_5 = 3000
	,bbs_6 = 1440
	,bbs_7 = 1320
	,bbs_8 = {1.2,1.21,1.229,1.238,1.254}
	,bbs_9 = {"敏捷","独行","法力陷阱","落岩","幸运"}
}
Qubaobao["阿宝"]={
	bbs_1 = 65
	,bbs_2 = 1440
	,bbs_3 = 1320
	,bbs_4 = 4560
	,bbs_5 = 2400
	,bbs_6 = 1080
	,bbs_7 = 1440
	,bbs_8 = {1.2,1.21,1.229,1.238,1.254}
	,bbs_9 = {"高级敏捷","独行","高级再生","土属性吸收","连击"}
}
Qubaobao["蛟龙"]={
	bbs_1 = 65
	,bbs_2 = 1440
	,bbs_3 = 1440
	,bbs_4 = 4560
	,bbs_5 = 3000
	,bbs_6 = 1200
	,bbs_7 = 1320
	,bbs_8 = {1.176,1.188,1.2,1.212,1.224}
	,bbs_9 = {"水漫金山","感知","高级永恒","高级水属性吸收"}
}
Qubaobao["凤凰"]={
	bbs_1 = 65
	,bbs_2 = 1200
	,bbs_3 = 1440
	,bbs_4 = 4200
	,bbs_5 = 2400
	,bbs_6 = 1560
	,bbs_7 = 1320
	,bbs_8 = {1.176,1.188,1.2,1.212,1.224}
	,bbs_9 = {"地狱烈火","高级神佑复生","高级火属性吸收","飞行"}
}
Qubaobao["蚌精"]={
	bbs_1 = 65
	,bbs_2 = 1200
	,bbs_3 = 1500
	,bbs_4 = 3840
	,bbs_5 = 2880
	,bbs_6 = 1200
	,bbs_7 = 1140
	,bbs_8 = {1.176,1.188,1.2,1.212,1.224}
	,bbs_9 = {"水攻","慧根","高级水属性吸收","神迹","冥思"}
}
Qubaobao["鲛人"]={
	bbs_1 = 65
	,bbs_2 = 1440
	,bbs_3 = 1440
	,bbs_4 = 4560
	,bbs_5 = 1920
	,bbs_6 = 1380
	,bbs_7 = 1440
	,bbs_8 = {1.176,1.188,1.2,1.212,1.224}
	,bbs_9 = {"连击","高级水属性吸收","移花接木","敏捷"}
}
Qubaobao["碧水夜叉"]={
	bbs_1 = 65
	,bbs_2 = 1380
	,bbs_3 = 1320
	,bbs_4 = 4200
	,bbs_5 = 2760
	,bbs_6 = 1440
	,bbs_7 = 1800
	,bbs_8 = {1.186,1.198,1.21,1.222,1.234}
	,bbs_9 = {"高级反震","奔雷咒","强力","壁垒击破"}
}
Qubaobao["雨师"]={
	bbs_1 = 65
	,bbs_2 = 1200
	,bbs_3 = 1380
	,bbs_4 = 4200
	,bbs_5 = 3000
	,bbs_6 = 1440
	,bbs_7 = 1618
	,bbs_8 = {1.156,1.168,1.18,1.191,1.203}
	,bbs_9 = {"水攻","烈火","高级雷属性吸收","高级水属性吸收","高级土属性吸收","高级火属性吸收"}
}
Qubaobao["独角鬼王"]={
	bbs_1 = 65
	,bbs_2 = 1380
	,bbs_3 = 1440
	,bbs_4 = 4200
	,bbs_5 = 2760
	,bbs_6 = 1320
	,bbs_7 = 1440
	,bbs_8 = {1.156,1.168,1.18,1.191,1.203}
	,bbs_9 = {"水攻","烈火","高级雷属性吸收","高级水属性吸收","高级土属性吸收","高级火属性吸收"}
}
Qubaobao["月影仙"]={
	bbs_1 = 65
	,bbs_2 = 1380
	,bbs_3 = 1200
	,bbs_4 = 3600
	,bbs_5 = 2160
	,bbs_6 = 1380
	,bbs_7 = 1440
	,bbs_8 = {1.176,1.188,1.2,1.212,1.224}
	,bbs_9 = {"必杀","弱点火","反击","高级强力","再生"}
}
Qubaobao["炼丹童子"]={
	bbs_1 = 65
	,bbs_2 = 1416
	,bbs_3 = 1440
	,bbs_4 = 4440
	,bbs_5 = 3000
	,bbs_6 = 1380
	,bbs_7 = 1320
	,bbs_8 = {1.176,1.188,1.2,1.212,1.224}
	,bbs_9 = {"必杀","弱点火","反击","高级强力","再生"}
}
Qubaobao["龙鲤"]={
	bbs_1 = 65
	,bbs_2 = 1440
	,bbs_3 = 1380
	,bbs_4 = 3600
	,bbs_5 = 2400
	,bbs_6 = 1440
	,bbs_7 = 1320
	,bbs_8 = {1.128,1.132,1.171,1.21,1.224}
	,bbs_9 = {"高级幸运","必杀","风起龙游","法术连击","高级连击"}
}

--75-95级携带
Qubaobao["芙蓉仙子"]={
	bbs_1 = 0
	,bbs_2 = 1440
	,bbs_3 = 1440
	,bbs_4 = 4560
	,bbs_5 = 2632
	,bbs_6 = 1380
	,bbs_7 = 1440
	,bbs_8 = {1.205,1.217,1.23,1.242,1.254}
	,bbs_9 = {"高级再生","高级飞行","高级幸运"}
}
Qubaobao["如意仙子"]={
	bbs_1 = 0
	,bbs_2 = 1200
	,bbs_3 = 1416
	,bbs_4 = 4378
	,bbs_5 = 2700
	,bbs_6 = 1400
	,bbs_7 = 1380
	,bbs_8 = {1.205,1.217,1.23,1.242,1.254}
	,bbs_9 = {"奔雷咒","地狱烈火","泰山压顶","烈火","雷击","弱点水"}
}
Qubaobao["星灵仙子"]={
	bbs_1 = 0
	,bbs_2 = 1200
	,bbs_3 = 1416
	,bbs_4 = 4378
	,bbs_5 = 2700
	,bbs_6 = 1440
	,bbs_7 = 1446
	,bbs_8 = {1.205,1.217,1.23,1.242,1.254}
	,bbs_9 = {"雷击","奔雷咒","水漫金山","高级慧根"}
}
Qubaobao["巡游天神"]={
	bbs_1 = 0
	,bbs_2 = 1380
	,bbs_3 = 1380
	,bbs_4 = 5400
	,bbs_5 = 2640
	,bbs_6 = 1210
	,bbs_7 = 1680
	,bbs_8 = {1.195,1.207,1.22,1.232,1.244}
	,bbs_9 = {"泰山压顶","地狱烈火","高级招架","高级必杀"}
}
Qubaobao["犀牛将军人形"]={
	bbs_1 = 0
	,bbs_2 = 1440
	,bbs_3 = 1464
	,bbs_4 = 4800
	,bbs_5 = 2520
	,bbs_6 = 1200
	,bbs_7 = 1140
	,bbs_8 = {1.205,1.217,1.23,1.242,1.254}
	,bbs_9 = {"高级强力","高级幸运","剑荡四方","再生"}
}
Qubaobao["犀牛将军兽形"]={
	bbs_1 = 0
	,bbs_2 = 1440
	,bbs_3 = 1464
	,bbs_4 = 4800
	,bbs_5 = 2520
	,bbs_6 = 1200
	,bbs_7 = 1140
	,bbs_8 = {1.205,1.217,1.23,1.242,1.254}
	,bbs_9 = {"法术暴击","土属性吸收","法术波动","落岩"}
}
Qubaobao["锦毛貂精"]={
	bbs_1 = 0
	,bbs_2 = 1200
	,bbs_3 = 1260
	,bbs_4 = 4200
	,bbs_5 = 2711
	,bbs_6 = 1560
	,bbs_7 = 1680
	,bbs_8 = {1.205,1.217,1.23,1.242,1.254}
	,bbs_9 = {"冥思","泰山压顶","法术连击","敏捷"}
}
Qubaobao["千年蛇魅"]={
	bbs_1 = 0
	,bbs_2 = 1380
	,bbs_3 = 1320
	,bbs_4 = 4380
	,bbs_5 = 2640
	,bbs_6 = 1440
	,bbs_7 = 1500
	,bbs_8 = {1.2,1.21,1.229,1.238,1.244}
	,bbs_9 = {"敏捷","毒","偷袭","高级吸血"}
}
Qubaobao["野猪精"]={
	bbs_1 = 0
	,bbs_2 = 1464
	,bbs_3 = 1560
	,bbs_4 = 4800
	,bbs_5 = 2400
	,bbs_6 = 1200
	,bbs_7 = 1320
	,bbs_8 = {1.205,1.217,1.23,1.242,1.254}
	,bbs_9 = {"反击","感知","弱点水","高级强力"}
}
Qubaobao["百足将军"]={
	bbs_1 = 0
	,bbs_2 = 1440
	,bbs_3 = 1320
	,bbs_4 = 4560
	,bbs_5 = 2640
	,bbs_6 = 1560
	,bbs_7 = 1320
	,bbs_8 = {1.205,1.217,1.23,1.242,1.254}
	,bbs_9 = {"毒","落岩","高级驱鬼","弱点水"}
}
Qubaobao["鼠先锋"]={
	bbs_1 = 0
	,bbs_2 = 1200
	,bbs_3 = 1440
	,bbs_4 = 4440
	,bbs_5 = 2880
	,bbs_6 = 1560
	,bbs_7 = 1560
	,bbs_8 = {1.205,1.217,1.23,1.242,1.254}
	,bbs_9 = {"驱鬼","冥思","泰山压顶","敏捷"}
}
Qubaobao["泪妖"]={
	bbs_1 = 0
	,bbs_2 = 1200
	,bbs_3 = 1200
	,bbs_4 = 3600
	,bbs_5 = 2400
	,bbs_6 = 1200
	,bbs_7 = 1560
	,bbs_8 = {1.176,1.188,1.2,1.212,1.224}
	,bbs_9 = {"冥思","高级魔之心","法术暴击","弱点土","水攻"}
}
Qubaobao["镜妖"]={
	bbs_1 = 0
	,bbs_2 = 1460
	,bbs_3 = 1320
	,bbs_4 = 3840
	,bbs_5 = 2400
	,bbs_6 = 1560
	,bbs_7 = 1440
	,bbs_8 = {1.205,1.217,1.23,1.242,1.254}
	,bbs_9 = {"反震","高级感知","鬼魂术","雷击"}
}
Qubaobao["日游神"]={
	bbs_1 = 0
	,bbs_2 = 1440
	,bbs_3 = 1260
	,bbs_4 = 4200
	,bbs_5 = 2400
	,bbs_6 = 1320
	,bbs_7 = 1380
	,bbs_8 = {1.205,1.217,1.23,1.242,1.254}
	,bbs_9 = {"反震","高级感知","鬼魂术","雷击"}
}
Qubaobao["金翼"]={
	bbs_1 = 0
	,bbs_2 = 1100
	,bbs_3 = 1440
	,bbs_4 = 3600
	,bbs_5 = 3000
	,bbs_6 = 1320
	,bbs_7 = 1380
	,bbs_8 = {1.205,1.217,1.23,1.242,1.254}
	,bbs_9 ={"薪火相传","高级神佑复生","烈火","飞行"}--技能组
}
Qubaobao["吸血鬼"]={
	bbs_1 = 0
	,bbs_2 = 1440
	,bbs_3 = 1320
	,bbs_4 = 3600
	,bbs_5 = 2400
	,bbs_6 = 1320
	,bbs_7 = 1800
	,bbs_8 = {1.205,1.217,1.23,1.242,1.254}
	,bbs_9 = {"偷袭","吸血","鬼魂术","驱鬼","弱点水"}
}
Qubaobao["幽灵"]={
	bbs_1 = 0
	,bbs_2 = 1476
	,bbs_3 = 1440
	,bbs_4 = 4200
	,bbs_5 = 2640
	,bbs_6 = 1320
	,bbs_7 = 1680
	,bbs_8 = {1.205,1.217,1.23,1.242,1.254}
	,bbs_9 = {"高级反击","高级飞行","死亡召唤","鬼魂术"}
}
Qubaobao["灵符女娲"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1560
	,bbs_4 = 4800
	,bbs_5 = 3000
	,bbs_6 = 1440
	,bbs_7 = 1440
	,bbs_8 = {1.205,1.217,1.23,1.242,1.254}
	,bbs_9 = {"上古灵符","高级冥思","地狱烈火","落岩"}
}
Qubaobao["律法女娲"]={
	bbs_1 = 0
	,bbs_2 = 1440
	,bbs_3 = 1560
	,bbs_4 = 4440
	,bbs_5 = 2400
	,bbs_6 = 1440
	,bbs_7 = 1680
	,bbs_8 = {1.205,1.217,1.23,1.242,1.254}
	,bbs_9 = {"善恶有报","敏捷","再生","高级反击"}
}
Qubaobao["阴阳伞"]={
	bbs_1 = 0
	,bbs_2 = 1440
	,bbs_3 = 1440
	,bbs_4 = 4800
	,bbs_5 = 3000
	,bbs_6 = 1500
	,bbs_7 = 1440
	,bbs_8 = {1.205,1.217,1.23,1.242,1.254}
	,bbs_9 = {"上古灵符","驱鬼","剑荡四方","高级飞行"}
}

--105-135级携带
Qubaobao["云游火"]={
	bbs_1 = 0
	,bbs_2 = 1452
	,bbs_3 = 1380
	,bbs_4 = 4440
	,bbs_5 = 2280
	,bbs_6 = 1320
	,bbs_7 = 1456
	,bbs_8 = {1.2,1.21,1.229,1.238,1.254}
	,bbs_9 = {"高级合纵","敏捷","高级独行","否定信仰","连击"}
}
Qubaobao["玄珠灵仙"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1380
	,bbs_4 = 4320
	,bbs_5 = 2940
	,bbs_6 = 1680
	,bbs_7 = 1464
	,bbs_8 = {1.2,1.21,1.229,1.238,1.254}
	,bbs_9 = {"高级合纵","敏捷","高级独行","否定信仰","连击"}
}
Qubaobao["巨石守卫昼"]={
	bbs_1 = 0
	,bbs_2 = 1416
	,bbs_3 = 1476
	,bbs_4 = 5400
	,bbs_5 = 2400
	,bbs_6 = 1440
	,bbs_7 = 1332
	,bbs_8 = {1.2,1.21,1.229,1.238,1.254}
	,bbs_9 = {"高级合纵","敏捷","高级独行","否定信仰","连击"}
}
Qubaobao["狐不归"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1380
	,bbs_4 = 4800
	,bbs_5 = 2400
	,bbs_6 = 1440
	,bbs_7 = 1560
	,bbs_8 = {1.2,1.21,1.229,1.238,1.254}
	,bbs_9 = {"高级水属性吸收","进击必杀","敏捷","冥思","招架"}
}
Qubaobao["虬龙"]={
	bbs_1 = 0
	,bbs_2 = 1500
	,bbs_3 = 1400
	,bbs_4 = 4800
	,bbs_5 = 1600
	,bbs_6 = 1200
	,bbs_7 = 1440
	,bbs_8 = {1.2,1.21,1.229,1.238,1.254}
	,bbs_9 = {"高级水属性吸收","进击必杀","敏捷","冥思","招架"}
}
Qubaobao["五行山神(金)"]={
	bbs_1 = 0
	,bbs_2 = 1416
	,bbs_3 = 1476
	,bbs_4 = 4800
	,bbs_5 = 2820
	,bbs_6 = 1560
	,bbs_7 = 1440
	,bbs_8 = {1.2,1.21,1.229,1.238,1.254}
	,bbs_9 = {"高级水属性吸收","进击必杀","敏捷","冥思","招架"}
}
Qubaobao["五行山神(木)"]={
	bbs_1 = 0
	,bbs_2 = 1416
	,bbs_3 = 1476
	,bbs_4 = 4800
	,bbs_5 = 2820
	,bbs_6 = 1560
	,bbs_7 = 1440
	,bbs_8 = {1.2,1.21,1.229,1.238,1.254}
	,bbs_9 = {"高级水属性吸收","进击必杀","敏捷","冥思","招架"}
}
Qubaobao["五行山神(水)"]={
	bbs_1 = 0
	,bbs_2 = 1416
	,bbs_3 = 1476
	,bbs_4 = 4800
	,bbs_5 = 2820
	,bbs_6 = 1560
	,bbs_7 = 1440
	,bbs_8 = {1.2,1.21,1.229,1.238,1.254}
	,bbs_9 = {"高级水属性吸收","进击必杀","敏捷","冥思","招架"}
}
Qubaobao["五行山神(火)"]={
	bbs_1 = 0
	,bbs_2 = 1416
	,bbs_3 = 1476
	,bbs_4 = 4800
	,bbs_5 = 2820
	,bbs_6 = 1560
	,bbs_7 = 1440
	,bbs_8 = {1.2,1.21,1.229,1.238,1.254}
	,bbs_9 = {"高级水属性吸收","进击必杀","敏捷","冥思","招架"}
}
Qubaobao["五行山神(土)"]={
	bbs_1 = 0
	,bbs_2 = 1416
	,bbs_3 = 1476
	,bbs_4 = 4800
	,bbs_5 = 2820
	,bbs_6 = 1560
	,bbs_7 = 1440
	,bbs_8 = {1.2,1.21,1.229,1.238,1.254}
	,bbs_9 = {"高级水属性吸收","进击必杀","敏捷","冥思","招架"}
}
Qubaobao["鬼将"]={
	bbs_1 = 0
	,bbs_2 = 1524
	,bbs_3 = 1380
	,bbs_4 = 5040
	,bbs_5 = 1440
	,bbs_6 = 1320
	,bbs_7 = 1320
	,bbs_8 = {1.215,1.227,1.24,1.252,1.264}
	,bbs_9 = {"惊心一剑","高级必杀","冥思","鬼魂术"}
}
Qubaobao["净瓶女娲"]={
	bbs_1 = 0
	,bbs_2 = 1464
	,bbs_3 = 1440
	,bbs_4 = 4800
	,bbs_5 = 2880
	,bbs_6 = 1560
	,bbs_7 = 1560
	,bbs_8 = {1.215,1.227,1.24,1.252,1.264}
	,bbs_9 = {"上古灵符","奔雷咒","高级慧根","感知"}
}
Qubaobao["幽萤娃娃"]={
	bbs_1 = 0
	,bbs_2 = 1440
	,bbs_3 = 1440
	,bbs_4 = 4200
	,bbs_5 = 2640
	,bbs_6 = 1536
	,bbs_7 = 1560
	,bbs_8 = {1.215,1.227,1.24,1.252,1.264}
	,bbs_9 = {"高级鬼魂术","高级防御","敏捷","高级法术抵抗"}
}
Qubaobao["画魂"]={
	bbs_1 = 0
	,bbs_2 = 1380
	,bbs_3 = 1440
	,bbs_4 = 4320
	,bbs_5 = 2880
	,bbs_6 = 1320
	,bbs_7 = 1440
	,bbs_8 = {1.215,1.227,1.24,1.252,1.264}
	,bbs_9 = {"高级鬼魂术","地狱烈火","幸运","高级魔之心"}
}
Qubaobao["巨石守卫夜"]={
	bbs_1 = 0
	,bbs_2 = 1416
	,bbs_3 = 1476
	,bbs_4 = 5400
	,bbs_5 = 2400
	,bbs_6 = 1440
	,bbs_7 = 1344
	,bbs_8 = {1.215,1.227,1.24,1.252,1.264}
	,bbs_9 = {"高级鬼魂术","地狱烈火","幸运","高级魔之心"}
}
Qubaobao["涂山瞳"]={
	bbs_1 = 0
	,bbs_2 = 1440
	,bbs_3 = 1500
	,bbs_4 = 4320
	,bbs_5 = 3200
	,bbs_6 = 1520
	,bbs_7 = 1440
	,bbs_8 = {1.215,1.227,1.24,1.252,1.264}
	,bbs_9 = {"高级否定信仰","高级法术波动","高级慧根","进击法暴"}
}
Qubaobao["大力金刚"]={
	bbs_1 = 0
	,bbs_2 = 1548
	,bbs_3 = 1334
	,bbs_4 = 6000
	,bbs_5 = 2640
	,bbs_6 = 1200
	,bbs_7 = 1200
	,bbs_8 = {1.215,1.227,1.24,1.252,1.264}
	,bbs_9 = {"高级强力","泰山压顶","力劈华山","高级永恒"}
}
Qubaobao["夜罗刹"]={
	bbs_1 = 0
	,bbs_2 = 1500
	,bbs_3 = 1440
	,bbs_4 = 5760
	,bbs_5 = 2880
	,bbs_6 = 1440
	,bbs_7 = 1440
	,bbs_8 = {1.215,1.227,1.24,1.252,1.264}
	,bbs_9 = {"必杀","高级敏捷","高级魔之心","夜舞倾城"}
}
Qubaobao["雾中仙"]={
	bbs_1 = 0
	,bbs_2 = 1440
	,bbs_3 = 1500
	,bbs_4 = 5400
	,bbs_5 = 3000
	,bbs_6 = 1320
	,bbs_7 = 1880
	,bbs_8 = {1.215,1.227,1.24,1.252,1.264}
	,bbs_9 = {"高级神佑复生","高级感知","法术连击","敏捷"}
}
Qubaobao["灵鹤"]={
	bbs_1 = 0
	,bbs_2 = 1440
	,bbs_3 = 1440
	,bbs_4 = 4560
	,bbs_5 = 2760
	,bbs_6 = 1560
	,bbs_7 = 1440
	,bbs_8 = {1.215,1.227,1.24,1.252,1.264}
	,bbs_9 = {"高级永恒","高级驱鬼","高级再生","高级慧根","飞行"}
}
Qubaobao["炎魔神"]={
	bbs_1 = 0
	,bbs_2 = 1500
	,bbs_3 = 1440
	,bbs_4 = 4800
	,bbs_5 = 3000
	,bbs_6 = 1440
	,bbs_7 = 1320
	,bbs_8 = {1.215,1.227,1.24,1.252,1.264}
	,bbs_9 = {"高级必杀","高级火属性吸收","烈火","地狱烈火"}
}
Qubaobao["噬天虎"]={
	bbs_1 = 0
	,bbs_2 = 1500
	,bbs_3 = 1440
	,bbs_4 = 4800
	,bbs_5 = 2400
	,bbs_6 = 1500
	,bbs_7 = 1560
	,bbs_8 = {1.215,1.227,1.24,1.252,1.264}
	,bbs_9 = {"高级连击","驱鬼","幸运","高级强力"}
}
Qubaobao["金饶僧"]={
	bbs_1 = 0
	,bbs_2 = 1550
	,bbs_3 = 1500
	,bbs_4 = 4800
	,bbs_5 = 2400
	,bbs_6 = 1500
	,bbs_7 = 1500
	,bbs_8 = {1.215,1.227,1.24,1.252,1.264}
	,bbs_9 = {"再生","必杀","招架","偷袭","高级防御"}
}
Qubaobao["月魅"]={
	bbs_1 = 0
	,bbs_2 = 1440
	,bbs_3 = 1380
	,bbs_4 = 5760
	,bbs_5 = 3000
	,bbs_6 = 1440
	,bbs_7 = 1560
	,bbs_8 = {1.215,1.229,1.239,1.258,1.264}
	,bbs_9 = {"高级招架","法术暴击","偷袭","法术连击","水攻"}
}
Qubaobao["夜游神"]={
	bbs_1 = 0
	,bbs_2 = 1440
	,bbs_3 = 1440
	,bbs_4 = 4560
	,bbs_5 = 3000
	,bbs_6 = 1560
	,bbs_7 = 1440
	,bbs_8 = {1.215,1.229,1.239,1.258,1.264}
	,bbs_9 = {"高级招架","法术暴击","偷袭","法术连击","水攻"}
}
Qubaobao["幻姬"]={
	bbs_1 = 0
	,bbs_2 = 1500
	,bbs_3 = 1440
	,bbs_4 = 4800
	,bbs_5 = 2160
	,bbs_6 = 1440
	,bbs_7 = 1560
	,bbs_8 = {1.215,1.229,1.239,1.258,1.264}
	,bbs_9 = {"高级招架","法术暴击","偷袭","法术连击","水攻"}
}
Qubaobao["琴仙"]={
	bbs_1 = 0
	,bbs_2 = 1440
	,bbs_3 = 1440
	,bbs_4 = 4800
	,bbs_5 = 3240
	,bbs_6 = 1380
	,bbs_7 = 1440
	,bbs_8 = {1.215,1.227,1.24,1.252,1.264}
	,bbs_9 = {"泰山压顶","感知","神佑复生","再生","敏捷"}
}
Qubaobao["踏云兽"]={
	bbs_1 = 0
	,bbs_2 = 1524
	,bbs_3 = 1440
	,bbs_4 = 5400
	,bbs_5 = 1800
	,bbs_6 = 1440
	,bbs_7 = 1440
	,bbs_8 = {1.225,1.237,1.25,1.262,1.275}
	,bbs_9 = {"高级招架","高级必杀","高级强力","弱点土"}
}
Qubaobao["红萼仙子"]={
	bbs_1 = 0
	,bbs_2 = 1500
	,bbs_3 = 1500
	,bbs_4 = 5400
	,bbs_5 = 3000
	,bbs_6 = 960
	,bbs_7 = 1800
	,bbs_8 = {1.225,1.237,1.25,1.262,1.275}
	,bbs_9 = {"上古灵符","高级飞行","高级冥思","奔雷咒"}
}
Qubaobao["葫芦宝贝"]={
	bbs_1 = 0
	,bbs_2 = 1440
	,bbs_3 = 1500
	,bbs_4 = 4800
	,bbs_5 = 2760
	,bbs_6 = 1320
	,bbs_7 = 1800
	,bbs_8 = {1.225,1.237,1.25,1.262,1.275}
	,bbs_9 = {"高级冥思","上古灵符","反震","魔之心"}
}
Qubaobao["猫灵兽形"]={
	bbs_1 = 0
	,bbs_2 = 1464
	,bbs_3 = 1464
	,bbs_4 = 4080
	,bbs_5 = 2400
	,bbs_6 = 1560
	,bbs_7 = 1680
	,bbs_8 = {1.225,1.237,1.25,1.262,1.275}
	,bbs_9 = {"必杀","敏捷","高级偷袭","弱点水"}
}
Qubaobao["狂豹兽形"]={
	bbs_1 = 0
	,bbs_2 = 1500
	,bbs_3 = 1440
	,bbs_4 = 4560
	,bbs_5 = 2160
	,bbs_6 = 1320
	,bbs_7 = 1560
	,bbs_8 = {1.225,1.237,1.25,1.262,1.275}
	,bbs_9 = {"高级强力","驱鬼","高级飞行","偷袭"}
}
Qubaobao["蝎子精"]={
	bbs_1 = 0
	,bbs_2 = 1464
	,bbs_3 = 1464
	,bbs_4 = 6240
	,bbs_5 = 2880
	,bbs_6 = 1320
	,bbs_7 = 1920
	,bbs_8 = {1.225,1.237,1.25,1.262,1.275}
	,bbs_9 = {"高级反震","招架","高级再生","毒"}
}
Qubaobao["龙龟"]={
	bbs_1 = 0
	,bbs_2 = 1440
	,bbs_3 = 1560
	,bbs_4 = 5760
	,bbs_5 = 3000
	,bbs_6 = 1200
	,bbs_7 = 1560
	,bbs_8 = {1.225,1.237,1.25,1.262,1.275}
	,bbs_9 = {"水属性吸收","反震","高级防御","法术防御","水攻"}
}
Qubaobao["机关人人形"]={
	bbs_1 = 0
	,bbs_2 = 1500
	,bbs_3 = 1500
	,bbs_4 = 5400
	,bbs_5 = 1680
	,bbs_6 = 1320
	,bbs_7 = 1440
	,bbs_8 = {1.225,1.237,1.25,1.262,1.275}
	,bbs_9 = {"壁垒击破","弱点火","必杀","高级招架"}
}
Qubaobao["机关兽"]={
	bbs_1 = 0
	,bbs_2 = 1440
	,bbs_3 = 1500
	,bbs_4 = 5280
	,bbs_5 = 2880
	,bbs_6 = 1440
	,bbs_7 = 1440
	,bbs_8 = {1.235,1.247,1.26,1.273,1.285}
	,bbs_9 = {"魔之心","高级法术连击","土属性吸收","烈火"}
}
Qubaobao["机关鸟"]={
	bbs_1 = 0
	,bbs_2 = 1500
	,bbs_3 = 1344
	,bbs_4 = 4800
	,bbs_5 = 2520
	,bbs_6 = 1560
	,bbs_7 = 1560
	,bbs_8 = {1.235,1.247,1.26,1.273,1.285}
	,bbs_9 = {"高级偷袭","驱鬼","高级再生","神迹","飞行"}
}
Qubaobao["连弩车"]={
	bbs_1 = 0
	,bbs_2 = 1500
	,bbs_3 = 1560
	,bbs_4 = 5400
	,bbs_5 = 2400
	,bbs_6 = 1200
	,bbs_7 = 1320
	,bbs_8 = {1.215,1.227,1.24,1.252,1.264}
	,bbs_9 = {"高级强力","防御","连击","迟钝"}
}
Qubaobao["巴蛇"]={
	bbs_1 = 0
	,bbs_2 = 1524
	,bbs_3 = 1440
	,bbs_4 = 4800
	,bbs_5 = 1560
	,bbs_6 = 1560
	,bbs_7 = 1560
	,bbs_8 = {1.235,1.247,1.26,1.273,1.285}
	,bbs_9 = {"敏捷","嗜血追击","感知","毒","再生"}
}
Qubaobao["猫灵人形"]={
	bbs_1 = 0
	,bbs_2 = 1524
	,bbs_3 = 1464
	,bbs_4 = 4560
	,bbs_5 = 2640
	,bbs_6 = 1500
	,bbs_7 = 1680
	,bbs_8 = {1.244,1.257,1.27,1.282,1.295}
	,bbs_9 = {"必杀","高级幸运","高级偷袭","反击","敏捷"}
}
Qubaobao["狂豹人形"]={
	bbs_1 = 0
	,bbs_2 = 1536
	,bbs_3 = 1440
	,bbs_4 = 4800
	,bbs_5 = 2280
	,bbs_6 = 1440
	,bbs_7 = 1560
	,bbs_8 = {1.244,1.257,1.27,1.282,1.295}
	,bbs_9 = {"驱鬼","高级飞行","高级强力","偷袭","吸血"}
}
Qubaobao["长眉灵猴"]={
	bbs_1 = 0
	,bbs_2 = 1440
	,bbs_3 = 1500
	,bbs_4 = 5640
	,bbs_5 = 3240
	,bbs_6 = 1200
	,bbs_7 = 1560
	,bbs_8 = {1.244,1.257,1.27,1.282,1.295}
	,bbs_9 = {"奔雷咒","高级法术暴击","冥思","高级再生"}
}
Qubaobao["巨力神猿"]={
	bbs_1 = 0
	,bbs_2 = 1500
	,bbs_3 = 1440
	,bbs_4 = 4560
	,bbs_5 = 2640
	,bbs_6 = 1500
	,bbs_7 = 1560
	,bbs_8 = {1.244,1.257,1.27,1.282,1.295}
	,bbs_9 = {"敏捷","高级盾气","高级连击","强力","高级驱鬼"}
}
Qubaobao["修罗傀儡鬼"]={
	bbs_1 = 0
	,bbs_2 = 1524
	,bbs_3 = 1380
	,bbs_4 = 5040
	,bbs_5 = 2400
	,bbs_6 = 1440
	,bbs_7 = 1440
	,bbs_8 = {1.234,1.247,1.26,1.272,1.285}
	,bbs_9 = {"高级夜战","反震","高级必杀","强力","嗜血追击"}
}
Qubaobao["藤蔓妖花"]={
	bbs_1 = 0
	,bbs_2 = 1464
	,bbs_3 = 1440
	,bbs_4 = 4560
	,bbs_5 = 3120
	,bbs_6 = 1200
	,bbs_7 = 1440
	,bbs_8 = {1.244,1.257,1.27,1.282,1.295}
	,bbs_9 = {"灵能激发","落岩","高级招架","高级法术连击"}
}
Qubaobao["无常鬼差白"]={
	bbs_1 = 0
	,bbs_2 = 1500
	,bbs_3 = 1440
	,bbs_4 = 4800
	,bbs_5 = 2880
	,bbs_6 = 1560
	,bbs_7 = 1476
	,bbs_8 = {1.244,1.257,1.27,1.282,1.295}
	,bbs_9 = {"灵能激发","落岩","高级招架","高级法术连击"}
}
Qubaobao["无常鬼差黑"]={
	bbs_1 = 0
	,bbs_2 = 1500
	,bbs_3 = 1440
	,bbs_4 = 4800
	,bbs_5 = 2880
	,bbs_6 = 1560
	,bbs_7 = 1476
	,bbs_8 = {1.244,1.257,1.27,1.282,1.295}
	,bbs_9 = {"灵能激发","落岩","高级招架","高级法术连击"}
}
Qubaobao["执音"]={
	bbs_1 = 0
	,bbs_2 = 1440
	,bbs_3 = 1500
	,bbs_4 = 5400
	,bbs_5 = 3240
	,bbs_6 = 1320
	,bbs_7 = 1200
	,bbs_8 = {1.243,1.256,1.269,1.281,1.294}
	,bbs_9 = {"飞行","地狱烈火","薪火相传","高级法术暴击","永恒"}
}
Qubaobao["有苏鸩"]={
	bbs_1 = 0
	,bbs_2 = 1440
	,bbs_3 = 1440
	,bbs_4 = 5500
	,bbs_5 = 3240
	,bbs_6 = 1560
	,bbs_7 = 1320
	,bbs_8 = {1.243,1.256,1.269,1.281,1.294}
	,bbs_9 = {"欣欣向荣","高级毒","魔之心","否定信仰"}

}
Qubaobao["司辰侍者未来"]={
	bbs_1 = 0
	,bbs_2 = 1440
	,bbs_3 = 1500
	,bbs_4 = 4800
	,bbs_5 = 3240
	,bbs_6 = 1680
	,bbs_7 = 1560
	,bbs_8 = {1.243,1.256,1.269,1.281,1.294}
	,bbs_9 = {"高级永恒","再生","飞行","慧根"}
}
Qubaobao["司辰侍者过去"]={
	bbs_1 = 0
	,bbs_2 = 1440
	,bbs_3 = 1500
	,bbs_4 = 4800
	,bbs_5 = 3240
	,bbs_6 = 1680
	,bbs_7 = 1560
	,bbs_8 = {1.243,1.256,1.269,1.281,1.294}
	,bbs_9 = {"高级永恒","再生","飞行","慧根"}

}
Qubaobao["混沌兽"]={
	bbs_1 = 0
	,bbs_2 = 1440
	,bbs_3 = 1476
	,bbs_4 = 5400
	,bbs_5 = 3240
	,bbs_6 = 1320
	,bbs_7 = 1560
	,bbs_8 = {1.244,1.257,1.27,1.282,1.295}
	,bbs_9 = {"再生","高级慧根","高级永恒","高级魔之心","奔雷咒"}
}
Qubaobao["蜃气妖"]={
	bbs_1 = 0
	,bbs_2 = 1464
	,bbs_3 = 1440
	,bbs_4 = 5040
	,bbs_5 = 3240
	,bbs_6 = 1320
	,bbs_7 = 1440
	,bbs_8 = {1.244,1.257,1.27,1.282,1.295}
	,bbs_9 = {"高级法术连击","雷击","法术暴击","上古灵符"}
}
Qubaobao["修罗傀儡妖"]={
	bbs_1 = 0
	,bbs_2 = 1536
	,bbs_3 = 1380
	,bbs_4 = 4800
	,bbs_5 = 2400
	,bbs_6 = 1500
	,bbs_7 = 1440
	,bbs_8 = {1.234,1.247,1.26,1.272,1.285}
	,bbs_9 = {"合纵","感知","高级幸运","高级连击"}
}
Qubaobao["金身罗汉"]={
	bbs_1 = 0
	,bbs_2 = 1380
	,bbs_3 = 1500
	,bbs_4 = 5400
	,bbs_5 = 2400
	,bbs_6 = 1560
	,bbs_7 = 1440
	,bbs_8 = {1.254,1.267,1.28,1.292,1.3}
	,bbs_9 = {"永恒","高级反震","神佑复生","盾气","高级敏捷"}
}
Qubaobao["曼珠沙华"]={
	bbs_1 = 0
	,bbs_2 = 1440
	,bbs_3 = 1440
	,bbs_4 = 4800
	,bbs_5 = 2800
	,bbs_6 = 1500
	,bbs_7 = 1440
	,bbs_8 = {1.254,1.267,1.28,1.292,1.3}
	,bbs_9 = {"高级再生","法力陷阱","反震","招架","法术抵抗"}
}
Qubaobao["毗舍童子"]={
	bbs_1 = 0
	,bbs_2 = 1560
	,bbs_3 = 1428
	,bbs_4 = 4200
	,bbs_5 = 2160
	,bbs_6 = 1440
	,bbs_7 = 1620
	,bbs_8 = {1.235,1.247,1.26,1.272,1.285}
	,bbs_9 = {"高级合纵","敏捷","高级法术抵抗","连击","神迹"}
}
Qubaobao["真陀护法"]={
	bbs_1 = 0
	,bbs_2 = 1536
	,bbs_3 = 1440
	,bbs_4 = 5040
	,bbs_5 = 2400
	,bbs_6 = 1380
	,bbs_7 = 1560
	,bbs_8 = {1.226,1.237,1.25,1.262,1.275}
	,bbs_9 = {"高级精神集中","必杀","吸血","偷袭","夜战","连击"}
}
Qubaobao["灵灯侍者"]={
	bbs_1 = 0
	,bbs_2 = 1404
	,bbs_3 = 1524
	,bbs_4 = 5760
	,bbs_5 = 2760
	,bbs_6 = 1440
	,bbs_7 = 1536
	,bbs_8 = {1.244,1.257,1.27,1.282,1.295}
	,bbs_9 = {"无畏布施","防御","雷击","高级雷属性吸收","高级慧根"}
}
Qubaobao["涂山雪"]={
	bbs_1 = 0
	,bbs_2 = 1512
	,bbs_3 = 1416
	,bbs_4 = 5040
	,bbs_5 = 2880
	,bbs_6 = 1320
	,bbs_7 = 1380
	,bbs_8 = {1.225,1.237,1.25,1.262,1.275}
	,bbs_9 = {"出其不意","冥思","高级神佑复生","防御"}
}
Qubaobao["魔化毗舍童子"]={
	bbs_1 = 0
	,bbs_2 = 1512
	,bbs_3 = 1416
	,bbs_4 = 5040
	,bbs_5 = 2880
	,bbs_6 = 1320
	,bbs_7 = 1380
	,bbs_8 = {1.225,1.237,1.25,1.262,1.275}
	,bbs_9 = {"出其不意","冥思","高级神佑复生","防御"}
}
Qubaobao["雷龙"]={
	bbs_1 = 0
	,bbs_2 = 1500
	,bbs_3 = 1500
	,bbs_4 = 5040
	,bbs_5 = 2600
	,bbs_6 = 1200
	,bbs_7 = 1200
	,bbs_8 = {1.225,1.27,1.25,1.262,1.275}
	,bbs_9 = {"风起龙游","连击","驱鬼","高级反震","高级神迹"}
}
Qubaobao["觉醒涂山雪"]={
	bbs_1 = 0
	,bbs_2 = 1519
	,bbs_3 = 1419
	,bbs_4 = 5049
	,bbs_5 = 2889
	,bbs_6 = 1329
	,bbs_7 = 1389
	,bbs_8 = {1.225,1.27,1.25,1.262,1.275}
	,bbs_9 = {"风起龙游","连击","驱鬼","高级反震","高级神迹"}
}
Qubaobao["司风"]={
	bbs_1 = 0
	,bbs_2 = 1440
	,bbs_3 = 1380
	,bbs_4 = 4080
	,bbs_5 = 2160
	,bbs_6 = 1500
	,bbs_7 = 1320
	,bbs_8 = {1.225,1.27,1.25,1.262,1.275}
	,bbs_9 =  {"清风之华","敏捷","连击","高级飞行"}--技能组
}
Qubaobao["司雪"]={
	bbs_1 = 0
	,bbs_2 = 1404
	,bbs_3 = 1400
	,bbs_4 = 4080
	,bbs_5 = 2160
	,bbs_6 = 1320
	,bbs_7 = 1200
	,bbs_8 = {1.225,1.27,1.25,1.262,1.275}
	,bbs_9 =  {"水漫金山","映雪棱镜","幸运","永恒"}--技能组
}
Qubaobao["司雨"]={
	bbs_1 = 0
	,bbs_2 = 1440
	,bbs_3 = 1380
	,bbs_4 = 4200
	,bbs_5 = 2160
	,bbs_6 = 1440
	,bbs_7 = 1200
	,bbs_8 = {1.225,1.27,1.25,1.262,1.275}
   	,bbs_9 = {"偷袭","必杀","高级再生","雨露之泽"}--技能组

}
Qubaobao["自在心猿"]={
	bbs_1 = 0
	,bbs_2 = 1584
	,bbs_3 = 1464
	,bbs_4 = 4800
	,bbs_5 = 2160
	,bbs_6 = 1500
	,bbs_7 = 1320
	,bbs_8 = {1.225,1.237,1.25,1.262,1.285}
	,bbs_9 = {"出其不意","冥思","高级神佑复生","防御"}
}
Qubaobao["持国巡守"]={
	bbs_1 = 0
	,bbs_2 = 1440
	,bbs_3 = 1380
	,bbs_4 = 6000
	,bbs_5 = 3000
	,bbs_6 = 1200
	,bbs_7 = 960
	,bbs_8 = {1.225,1.237,1.25,1.262,1.275}
	,bbs_9 = {"须弥真言","再生","奔雷咒","神佑复生"}
}
Qubaobao["增长巡守"]={
	bbs_1 = 0
	,bbs_2 = 1500
	,bbs_3 = 1380
	,bbs_4 = 6000
	,bbs_5 = 2760
	,bbs_6 = 1200
	,bbs_7 = 960
	,bbs_8 = {1.225,1.237,1.25,1.262,1.275}
	,bbs_9 = {"灵山禅语","高级招架","驱鬼","高级神佑复生"}
}
Qubaobao["般若天女"]={
	bbs_1 = 0
	,bbs_2 = 1459
	,bbs_3 = 1459
	,bbs_4 = 5521
	,bbs_5 = 3301
	,bbs_6 = 1471
	,bbs_7 = 1567
	,bbs_8 = {1.265,1.27,1.275,1.28,1.297}
	,bbs_9 = {"上古灵符","高级飞行","敏捷","魔之心","高级慧根","高级幸运"}
}
Qubaobao["广目巡守"]={
	bbs_1 = 0
	,bbs_2 = 1440
	,bbs_3 = 1380
	,bbs_4 = 6240
	,bbs_5 = 2640
	,bbs_6 = 1380
	,bbs_7 = 960
	,bbs_8 = {1.225,1.237,1.25,1.262,1.275}
	,bbs_9 = {"净台妙谛","高级敏捷","防御","神佑复生"}
}
Qubaobao["多闻巡守"]={
	bbs_1 = 0
	,bbs_2 = 1536
	,bbs_3 = 1380
	,bbs_4 = 6000
	,bbs_5 = 2640
	,bbs_6 = 960
	,bbs_7 = 1380
	,bbs_8 = {1.225,1.237,1.25,1.262,1.275}
	,bbs_9 = {"净台妙谛","高级敏捷","防御","神佑复生"}
}
Qubaobao["妙华天女"]={
	bbs_1 = 0
	,bbs_2 = 1423
	,bbs_3 = 1423
	,bbs_4 = 5449
	,bbs_5 = 3433
	,bbs_6 = 1471
	,bbs_7 = 1567
	,bbs_8 = {1.246,1.259,1.272,1.284,1.297}
	,bbs_9 = {"凝光炼彩","高级永恒","冥思","再生"}
}
Qubaobao["谛听"]={
	bbs_1 = 0
	,bbs_2 = 1464
	,bbs_3 = 1440
	,bbs_4 = 6000
	,bbs_5 = 3240
	,bbs_6 = 1416
	,bbs_7 = 1320
	,bbs_8 = {1.265,1.27,1.275,1.28,1.285}
	,bbs_9 = {"高级驱鬼","泰山压顶","落岩","观照万象"}--"观照万象",
}
Qubaobao["长乐灵仙"]={
	bbs_1 = 0
	,bbs_2 = 1404
	,bbs_3 = 1400
	,bbs_4 = 4200
	,bbs_5 = 2160
	,bbs_6 = 1500
	,bbs_7 = 1380
	,bbs_8 = {1.225,1.27,1.25,1.262,1.275}
	,bbs_9 = {"高级防御","招架","反击","法术抵抗","幸运"}
}
Qubaobao["沙暴"]={
	bbs_1 = 0
	,bbs_2 = 1404
	,bbs_3 = 1400
	,bbs_4 = 4200
	,bbs_5 = 2160
	,bbs_6 = 1500
	,bbs_7 = 1380
	,bbs_8 = {1.225,1.27,1.25,1.262,1.275}
	,bbs_9 = {"高级防御","招架","反击","法术抵抗","幸运"}
}


---神兽开始----
Qubaobao["超级泡泡"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 5280
	,bbs_5 = 1800
	,bbs_6 = 960
	,bbs_7 = 1380
	,bbs_8 = {1.097,1.108,1.12,1.131,1.142}
	,bbs_9 = {"迟钝","强力","防御","高级反击","高级必杀"}
}
Qubaobao["超级神虎"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 5280
	,bbs_5 = 1800
	,bbs_6 = 960
	,bbs_7 = 1380
	,bbs_8 = {1.097,1.108,1.12,1.131,1.142}
	,bbs_9 = {"迟钝","强力","防御","高级反击","高级必杀"}
}
Qubaobao["超级大熊猫"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 5280
	,bbs_5 = 1800
	,bbs_6 = 960
	,bbs_7 = 1380
	,bbs_8 = {1.097,1.108,1.12,1.131,1.142}
	,bbs_9 = {"迟钝","强力","防御","高级反击","高级必杀"}
}
Qubaobao["超级金猴"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 5280
	,bbs_5 = 1800
	,bbs_6 = 960
	,bbs_7 = 1380
	,bbs_8 = {1.097,1.108,1.12,1.131,1.142}
	,bbs_9 = {"迟钝","强力","防御","高级反击","高级必杀"}
}
Qubaobao["超级金猴"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 5280
	,bbs_5 = 1800
	,bbs_6 = 960
	,bbs_7 = 1380
	,bbs_8 = {1.097,1.108,1.12,1.131,1.142}
	,bbs_9 = {"迟钝","强力","防御","高级反击","高级必杀"}
}
Qubaobao["超级人参娃娃"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 5280
	,bbs_5 = 1800
	,bbs_6 = 960
	,bbs_7 = 1380
	,bbs_8 = {1.097,1.108,1.12,1.131,1.142}
	,bbs_9 = {"迟钝","强力","防御","高级反击","高级必杀"}
}
Qubaobao["超级大象"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 5280
	,bbs_5 = 1800
	,bbs_6 = 960
	,bbs_7 = 1380
	,bbs_8 = {1.097,1.108,1.12,1.131,1.142}
	,bbs_9 = {"迟钝","强力","防御","高级反击","高级必杀"}
}
Qubaobao["超级筋斗云"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 5280
	,bbs_5 = 1800
	,bbs_6 = 960
	,bbs_7 = 1380
	,bbs_8 = {1.097,1.108,1.12,1.131,1.142}
	,bbs_9 = {"迟钝","强力","防御","高级反击","高级必杀"}
}
Qubaobao["超级灵狐"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 5280
	,bbs_5 = 1800
	,bbs_6 = 960
	,bbs_7 = 1380
	,bbs_8 = {1.097,1.108,1.12,1.131,1.142}
	,bbs_9 = {"迟钝","强力","防御","高级反击","高级必杀"}
}
Qubaobao["超级孔雀"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 5280
	,bbs_5 = 1800
	,bbs_6 = 960
	,bbs_7 = 1380
	,bbs_8 = {1.097,1.108,1.12,1.131,1.142}
	,bbs_9 = {"迟钝","强力","防御","高级反击","高级必杀"}
}
Qubaobao["超级神龙"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 5280
	,bbs_5 = 1800
	,bbs_6 = 960
	,bbs_7 = 1380
	,bbs_8 = {1.097,1.108,1.12,1.131,1.142}
	,bbs_9 = {"迟钝","强力","防御","高级反击","高级必杀"}
}
Qubaobao["超级神马"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 5280
	,bbs_5 = 1800
	,bbs_6 = 960
	,bbs_7 = 1380
	,bbs_8 = {1.097,1.108,1.12,1.131,1.142}
	,bbs_9 = {"迟钝","强力","防御","高级反击","高级必杀"}
}
Qubaobao["超级麒麟"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 5280
	,bbs_5 = 1800
	,bbs_6 = 960
	,bbs_7 = 1380
	,bbs_8 = {1.097,1.108,1.12,1.131,1.142}
	,bbs_9 = {"迟钝","强力","防御","高级反击","高级必杀"}
}
Qubaobao["超级神蛇"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 5280
	,bbs_5 = 1800
	,bbs_6 = 960
	,bbs_7 = 1380
	,bbs_8 = {1.097,1.108,1.12,1.131,1.142}
	,bbs_9 = {"迟钝","强力","防御","高级反击","高级必杀"}
}
Qubaobao["超级青鸾"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 5280
	,bbs_5 = 1800
	,bbs_6 = 960
	,bbs_7 = 1380
	,bbs_8 = {1.097,1.108,1.12,1.131,1.142}
	,bbs_9 = {"迟钝","强力","防御","高级反击","高级必杀"}
}
Qubaobao["超级灵鹿"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 5280
	,bbs_5 = 1800
	,bbs_6 = 960
	,bbs_7 = 1380
	,bbs_8 = {1.097,1.108,1.12,1.131,1.142}
	,bbs_9 = {"迟钝","强力","防御","高级反击","高级必杀"}
}
Qubaobao["超级白泽"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 5280
	,bbs_5 = 1800
	,bbs_6 = 960
	,bbs_7 = 1380
	,bbs_8 = {1.097,1.108,1.12,1.131,1.142}
	,bbs_9 = {"迟钝","强力","防御","高级反击","高级必杀"}
}
Qubaobao["超级赤焰兽"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 5280
	,bbs_5 = 1800
	,bbs_6 = 960
	,bbs_7 = 1380
	,bbs_8 = {1.097,1.108,1.12,1.131,1.142}
	,bbs_9 = {"迟钝","强力","防御","高级反击","高级必杀"}
}
Qubaobao["超级大鹏"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 5280
	,bbs_5 = 1800
	,bbs_6 = 960
	,bbs_7 = 1380
	,bbs_8 = {1.097,1.108,1.12,1.131,1.142}
	,bbs_9 = {"迟钝","强力","防御","高级反击","高级必杀"}
}
Qubaobao["超级神牛"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 5280
	,bbs_5 = 1800
	,bbs_6 = 960
	,bbs_7 = 1380
	,bbs_8 = {1.097,1.108,1.12,1.131,1.142}
	,bbs_9 = {"迟钝","强力","防御","高级反击","高级必杀"}
}
Qubaobao["超级海豚"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 5280
	,bbs_5 = 1800
	,bbs_6 = 960
	,bbs_7 = 1380
	,bbs_8 = {1.097,1.108,1.12,1.131,1.142}
	,bbs_9 = {"迟钝","强力","防御","高级反击","高级必杀"}
}
Qubaobao["超级神兔"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 5280
	,bbs_5 = 1800
	,bbs_6 = 960
	,bbs_7 = 1380
	,bbs_8 = {1.097,1.108,1.12,1.131,1.142}
	,bbs_9 = {"迟钝","强力","防御","高级反击","高级必杀"}
}
Qubaobao["超级神羊"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 5280
	,bbs_5 = 1800
	,bbs_6 = 960
	,bbs_7 = 1380
	,bbs_8 = {1.097,1.108,1.12,1.131,1.142}
	,bbs_9 = {"迟钝","强力","防御","高级反击","高级必杀"}
}
Qubaobao["超级六耳猕猴"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 5280
	,bbs_5 = 1800
	,bbs_6 = 960
	,bbs_7 = 1380
	,bbs_8 = {1.097,1.108,1.12,1.131,1.142}
	,bbs_9 = {"迟钝","强力","防御","高级反击","高级必杀"}
}
Qubaobao["超级土地公公"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 5280
	,bbs_5 = 1800
	,bbs_6 = 960
	,bbs_7 = 1380
	,bbs_8 = {1.097,1.108,1.12,1.131,1.142}
	,bbs_9 = {"迟钝","强力","防御","高级反击","高级必杀"}
}
Qubaobao["超级神猴"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 5280
	,bbs_5 = 1800
	,bbs_6 = 960
	,bbs_7 = 1380
	,bbs_8 = {1.097,1.108,1.12,1.131,1.142}
	,bbs_9 = {"迟钝","强力","防御","高级反击","高级必杀"}
}
Qubaobao["超级神鸡"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 5280
	,bbs_5 = 1800
	,bbs_6 = 960
	,bbs_7 = 1380
	,bbs_8 = {1.097,1.108,1.12,1.131,1.142}
	,bbs_9 = {"迟钝","强力","防御","高级反击","高级必杀"}
}
Qubaobao["超级玉兔"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 5280
	,bbs_5 = 1800
	,bbs_6 = 960
	,bbs_7 = 1380
	,bbs_8 = {1.097,1.108,1.12,1.131,1.142}
	,bbs_9 = {"迟钝","强力","防御","高级反击","高级必杀"}
}
Qubaobao["超级神狗"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 5280
	,bbs_5 = 1800
	,bbs_6 = 960
	,bbs_7 = 1380
	,bbs_8 = {1.097,1.108,1.12,1.131,1.142}
	,bbs_9 = {"迟钝","强力","防御","高级反击","高级必杀"}
}
Qubaobao["超级小白龙"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 5280
	,bbs_5 = 1800
	,bbs_6 = 960
	,bbs_7 = 1380
	,bbs_8 = {1.097,1.108,1.12,1.131,1.142}
	,bbs_9 = {"迟钝","强力","防御","高级反击","高级必杀"}
}
Qubaobao["超级神猪"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 5280
	,bbs_5 = 1800
	,bbs_6 = 960
	,bbs_7 = 1380
	,bbs_8 = {1.097,1.108,1.12,1.131,1.142}
	,bbs_9 = {"迟钝","强力","防御","高级反击","高级必杀"}
}
Qubaobao["超级飞天"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 5280
	,bbs_5 = 1800
	,bbs_6 = 960
	,bbs_7 = 1380
	,bbs_8 = {1.097,1.108,1.12,1.131,1.142}
	,bbs_9 = {"迟钝","强力","防御","高级反击","高级必杀"}
}
Qubaobao["超级神鼠"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 5280
	,bbs_5 = 1800
	,bbs_6 = 960
	,bbs_7 = 1380
	,bbs_8 = {1.097,1.108,1.12,1.131,1.142}
	,bbs_9 = {"迟钝","强力","防御","高级反击","高级必杀"}
}
Qubaobao["超级鲲鹏"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 5280
	,bbs_5 = 1800
	,bbs_6 = 960
	,bbs_7 = 1380
	,bbs_8 = {1.097,1.108,1.12,1.131,1.142}
	,bbs_9 = {"迟钝","强力","防御","高级反击","高级必杀"}
}
Qubaobao["超级离火兽"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 5280
	,bbs_5 = 1800
	,bbs_6 = 960
	,bbs_7 = 1380
	,bbs_8 = {1.097,1.108,1.12,1.131,1.142}
	,bbs_9 = {"迟钝","强力","防御","高级反击","高级必杀"}
}
Qubaobao["超级神牛(辛丑)"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 5280
	,bbs_5 = 1800
	,bbs_6 = 960
	,bbs_7 = 1380
	,bbs_8 = {1.097,1.108,1.12,1.131,1.142}
	,bbs_9 = {"迟钝","强力","防御","高级反击","高级必杀"}
}
Qubaobao["超级神柚"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 5280
	,bbs_5 = 1800
	,bbs_6 = 960
	,bbs_7 = 1380
	,bbs_8 = {1.097,1.108,1.12,1.131,1.142}
	,bbs_9 = {"迟钝","强力","防御","高级反击","高级必杀"}
}
Qubaobao["超级猪小戒"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 5280
	,bbs_5 = 1800
	,bbs_6 = 960
	,bbs_7 = 1380
	,bbs_8 = {1.097,1.108,1.12,1.131,1.142}
	,bbs_9 = {"迟钝","强力","防御","高级反击","高级必杀"}
}
Qubaobao["超级有熊"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 5280
	,bbs_5 = 1800
	,bbs_6 = 960
	,bbs_7 = 1380
	,bbs_8 = {1.097,1.108,1.12,1.131,1.142}
	,bbs_9 = {"迟钝","强力","防御","高级反击","高级必杀"}
}
Qubaobao["超级神虎(壬寅)"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 5280
	,bbs_5 = 1800
	,bbs_6 = 960
	,bbs_7 = 1380
	,bbs_8 = {1.097,1.108,1.12,1.131,1.142}
	,bbs_9 = {"迟钝","强力","防御","高级反击","高级必杀"}
}
Qubaobao["超级神兔(癸卯)"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 5280
	,bbs_5 = 1800
	,bbs_6 = 960
	,bbs_7 = 1380
	,bbs_8 = {1.097,1.108,1.12,1.131,1.142}
	,bbs_9 = {"迟钝","强力","防御","高级反击","高级必杀"}
}
Qubaobao["超级飞廉"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 5280
	,bbs_5 = 1800
	,bbs_6 = 960
	,bbs_7 = 1380
	,bbs_8 = {1.097,1.108,1.12,1.131,1.142}
	,bbs_9 = {"迟钝","强力","防御","高级反击","高级必杀"}
}
Qubaobao["超级神龙(甲辰)"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 5280
	,bbs_5 = 1800
	,bbs_6 = 960
	,bbs_7 = 1380
	,bbs_8 = {1.097,1.108,1.12,1.131,1.142}
	,bbs_9 = {"迟钝","强力","防御","高级反击","高级必杀"}
}


Qubaobao["恶魔泡泡"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 5280
	,bbs_5 = 1800
	,bbs_6 = 960
	,bbs_7 = 1380
	,bbs_8 = {1.097,1.108,1.12,1.131,1.142}
	,bbs_9 = {"迟钝","强力","防御","高级反击","高级必杀"}
}

Qubaobao["超级红孩儿"]={
	bbs_1 = 0
	,bbs_2 = 1320
	,bbs_3 = 1320
	,bbs_4 = 5280
	,bbs_5 = 1800
	,bbs_6 = 960
	,bbs_7 = 1380
	,bbs_8 = {1.097,1.108,1.12,1.131,1.142}
	,bbs_9 = {"迟钝","强力","防御","高级反击","高级必杀"}
}

Qubaobao["小毛头"]={
	bbs_1 = 0
	,bbs_2 = 960
	,bbs_3 = 960
	,bbs_4 = 3600
	,bbs_5 = 1200
	,bbs_6 = 840
	,bbs_7 = 1320
	,bbs_8 = {0.882,0.891,0.9,0.909,0.918}
	,bbs_9 = {"高级连击","高级防御","高级驱鬼","高级偷袭"}
}
Qubaobao["小丫丫"]={
	bbs_1 = 0
	,bbs_2 = 960
	,bbs_3 = 960
	,bbs_4 = 3600
	,bbs_5 = 1200
	,bbs_6 = 840
	,bbs_7 = 1320
	,bbs_8 = {0.882,0.891,0.9,0.909,0.918}
	,bbs_9 = {"高级连击","高级防御","高级驱鬼","高级偷袭"}
}
---泡泡灵仙---
Qubaobao["泡泡灵仙·剑侠客"]={
	bbs_1 = 0
	,bbs_2 = 960
	,bbs_3 = 960
	,bbs_4 = 3600
	,bbs_5 = 1200
	,bbs_6 = 840
	,bbs_7 = 1320
	,bbs_8 = {0.882,0.891,0.9,0.909,0.918}
	,bbs_9 = {"高级连击","高级防御","高级驱鬼","高级偷袭"}
}
Qubaobao["泡泡灵仙·飞燕女"]={
	bbs_1 = 0
	,bbs_2 = 960
	,bbs_3 = 960
	,bbs_4 = 3600
	,bbs_5 = 1200
	,bbs_6 = 840
	,bbs_7 = 1320
	,bbs_8 = {0.882,0.891,0.9,0.909,0.918}
	,bbs_9 = {"高级连击","高级防御","高级驱鬼","高级偷袭"}
}
Qubaobao["泡泡灵仙·骨精灵"]={
	bbs_1 = 0
	,bbs_2 = 960
	,bbs_3 = 960
	,bbs_4 = 3600
	,bbs_5 = 1200
	,bbs_6 = 840
	,bbs_7 = 1320
	,bbs_8 = {0.882,0.891,0.9,0.909,0.918}
	,bbs_9 = {"高级连击","高级防御","高级驱鬼","高级偷袭"}
}
Qubaobao["泡泡灵仙·神天兵"]={
	bbs_1 = 0
	,bbs_2 = 960
	,bbs_3 = 960
	,bbs_4 = 3600
	,bbs_5 = 1200
	,bbs_6 = 840
	,bbs_7 = 1320
	,bbs_8 = {0.882,0.891,0.9,0.909,0.918}
	,bbs_9 = {"高级连击","高级防御","高级驱鬼","高级偷袭"}
}
Qubaobao["泡泡灵仙·龙太子"]={
	bbs_1 = 0
	,bbs_2 = 960
	,bbs_3 = 960
	,bbs_4 = 3600
	,bbs_5 = 1200
	,bbs_6 = 840
	,bbs_7 = 1320
	,bbs_8 = {0.882,0.891,0.9,0.909,0.918}
	,bbs_9 = {"高级连击","高级防御","高级驱鬼","高级偷袭"}
}
Qubaobao["泡泡灵仙·巫蛮儿"]={
	bbs_1 = 0
	,bbs_2 = 960
	,bbs_3 = 960
	,bbs_4 = 3600
	,bbs_5 = 1200
	,bbs_6 = 840
	,bbs_7 = 1320
	,bbs_8 = {0.882,0.891,0.9,0.909,0.918}
	,bbs_9 = {"高级连击","高级防御","高级驱鬼","高级偷袭"}
}
Qubaobao["泡泡灵仙·杀破狼"]={
	bbs_1 = 0
	,bbs_2 = 960
	,bbs_3 = 960
	,bbs_4 = 3600
	,bbs_5 = 1200
	,bbs_6 = 840
	,bbs_7 = 1320
	,bbs_8 = {0.882,0.891,0.9,0.909,0.918}
	,bbs_9 = {"高级连击","高级防御","高级驱鬼","高级偷袭"}
}
Qubaobao["泡泡灵仙·羽灵神"]={
	bbs_1 = 0
	,bbs_2 = 960
	,bbs_3 = 960
	,bbs_4 = 3600
	,bbs_5 = 1200
	,bbs_6 = 840
	,bbs_7 = 1320
	,bbs_8 = {0.882,0.891,0.9,0.909,0.918}
	,bbs_9 = {"高级连击","高级防御","高级驱鬼","高级偷袭"}
}



















function 取宝宝(bb,类型,物法,dingzhi)
	local bbs = {}--------兑换神兽资质
	if 类型=="神兽" then
		bbs[1] = 0
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5000
		bbs[5] = 3000
		bbs[6] = 1400
		bbs[7] = 1400
		bbs[8] = {1.25,1.25,1.25,1.25,1.25}
		bbs[9] = 取神兽技能(bb,物法,dingzhi)
		return bbs
	end
	if Qubaobao[bb] then
		for i=1,10 do
			if Qubaobao[bb]["bbs_"..i] then
				bbs[i]=Qubaobao[bb]["bbs_"..i]
			end
		end
	end
	return table.copy(bbs)
end

function 取天生(ac)
	local acs = {}
	if ac == "大海龟" then
		acs = {"水属性吸收","防御"}
	elseif ac == "巨蛙" then
		acs = {"弱点火"}
	elseif ac == "海星" then
		acs = {"弱点火","水属性吸收"}
	elseif ac == "章鱼" then
		acs = {"弱点火"}
	elseif ac == "海毛虫" then
		acs = {"弱点火","驱鬼"}
	elseif ac == "树怪" then
		acs = {"弱点火","迟钝"}
	elseif ac == "浣熊" then
		acs = {"招架"}
	elseif ac == "大蝙蝠" then
		acs = {"弱点水","高级夜战","飞行"}
	elseif ac == "花妖" then
		acs = {"水属性吸收"}
	elseif ac == "黑熊" then
		acs = {"迟钝"}
	elseif ac == "狐狸精" then
		acs = {"弱点雷","驱鬼"}
	elseif ac == "骷髅怪" then
		acs = {"弱点雷","鬼魂术"}
	elseif ac == "蟹将" then
		acs = {"水属性吸收"}
	elseif ac == "虾兵" then
		acs = {"水属性吸收"}
	elseif ac == "小龙女" then
		acs = {"高级水属性吸收"}
	elseif ac == "狼" then
		acs = {"连击","偷袭","驱鬼"}
	elseif ac == "野鬼" then
		acs = {"鬼魂术","驱鬼"}
	elseif ac == "僵尸" then
		acs = {"鬼魂术","驱鬼"}
	elseif ac == "黑熊精" then
		acs = {"弱点雷"}
	elseif ac == "兔子怪" then
		acs = {"弱点土"}
	elseif ac == "牛头" then
		acs = {"高级鬼魂术","驱鬼"}
	elseif ac == "马面" then
		acs = {"高级鬼魂术","驱鬼"}
	elseif ac == "白熊" then
		acs = {"迟钝"}
	elseif ac == "雷鸟人" then
		acs = {"弱点土","雷击","飞行"}
	elseif ac == "蝴蝶仙子" then
		acs = {"弱点水","飞行"}
	elseif ac == "鲛人" then
		acs = {"敏捷"}
	elseif ac == "蚌精" then
		acs = {"冥思"}
	elseif ac == "雨师" then
		acs = {"水攻"}
	elseif ac == "蛟龙" then
		acs = {"感知"}
	elseif ac == "凤凰" then
		acs = {"飞行"}
	elseif ac == "如意仙子" then
		acs = {"烈火"}
	elseif ac == "星灵仙子" then
		acs = {"雷击"}
	elseif ac == "鼠先锋" then
		acs = {"敏捷"}
	elseif ac == "百足将军" then
		acs = {"弱点水"}
	elseif ac == "犀牛将军人形" then
		acs = {"再生"}
	elseif ac == "犀牛将军兽形" then
		acs = {"落岩"}
	elseif ac == "锦毛貂精" then
		acs = {"敏捷"}
	elseif ac == "吸血鬼" then
		acs = {"弱点水","夜战","鬼魂术"}
	elseif ac == "幽灵" then
		acs = {"鬼魂术"}
	elseif ac == "灵符女蜗" then
		acs = {"落岩"}
	elseif ac == "画魂" then
		acs = {"高级鬼魂术","地狱烈火"}
	elseif ac == "幽萤娃娃" then
		acs = {"高级鬼魂术"}
	elseif ac == "鬼将" then
		acs = {"鬼魂术"}
	elseif ac == "净瓶女娲" then
		acs = {"感知"}
	elseif ac == "炎魔神" then
		acs = {"地狱烈火"}
	elseif ac == "机关人人形" then
		acs = {"高级招架"}
	elseif ac == "机关人" then
		acs = {"高级招架"}
	elseif ac == "龙龟" then
		acs = {"水攻"}
	elseif ac == "猫灵兽形" then
		acs = {"弱点水"}
	elseif ac == "蝎子精" then
		acs = {"毒"}
	elseif ac == "葫芦宝贝" then
		acs = {"魔之心"}
	elseif ac == "踏云兽" then
		acs = {"弱点土"}
	elseif ac == "巴蛇" then
		acs = {"再生"}
	elseif ac == "机关兽" then
		acs = {"烈火"}
	elseif ac == "连弩车" then
		acs = {"迟钝"}
	elseif ac == "机关鸟" then
		acs = {"飞行"}
	elseif ac == "蜃气妖" then
		acs = {"雷击"}
	elseif ac == "藤蔓妖花" then
		acs = {"高级法术连击"}
	elseif ac == "长眉灵猴" then
		acs = {"奔雷咒"}
	elseif ac == "修罗傀儡鬼" then
		acs = {"嗜血追击"}
	elseif ac == "巨力猿猴" then
		acs = {"敏捷"}
	elseif ac == "混沌兽" then
		acs = {"奔雷咒"}
	elseif ac == "狂豹人形" then
		acs = {"吸血","偷袭"}
	elseif ac == "猫灵人形" then
		acs = {"敏捷"}
	elseif ac == "曼珠沙华" then
		acs = {"高级再生"}
	elseif ac == "金身罗汉" then
		acs = {"高级敏捷"}
	elseif ac == "修罗傀儡妖" then
		acs = {"高级连击"}
	elseif ac == "毗舍童子" then
		acs = {"连击","神迹"}
	elseif ac == "月魅" then
		acs = {"高级招架","法术连击"}
	elseif ac == "云游火" then
		acs = {"敏捷","高级合纵"}
	elseif ac == "狐不归" then
		acs = {"高级水属性吸收","进击必杀"}
	elseif ac == "蜃气妖" then
		acs = {"上古灵符"}
	elseif ac == "独角鬼王" then
		acs = {"进击法暴","鬼魂术"}
	elseif ac == "无常鬼差" then
		acs = {"鬼魂术"}
	elseif ac == "巨石守卫" then
		acs = {"落岩"}
	elseif ac == "执音" then
		acs = {"飞行","地狱烈火"}
	elseif ac == "花铃" then
		acs = {"敏捷"}
	elseif ac == "月影仙" then
		acs = {"必杀","弱点火"}
	elseif ac == "龙鲤" then
		acs = {"必杀","高级幸运"}
	elseif ac == "泪妖" then
		acs = {"法术暴击","弱点土"}
	elseif ac == "镜妖" then
		acs = {"雷击"}
	elseif ac == "灵灯侍者" then
		acs = {"高级慧根"}
	elseif ac == "涂山瞳" then
		acs = {"高级慧根","进击法暴"}
	elseif ac == "雷龙" then
		acs = {"高级神迹"}
	elseif ac == "超级鲲鹏" then
		acs = {"北冥之渊", "水击三千", "逍遥游", "扶摇万里"}
	elseif ac == "超级神龙" then
		acs = {"龙魂"}
	-- elseif ac == "超级红孩儿" then
	-- 	acs = {"诸天正法", "水击三千", "虎虎生风", "桀骜自恃", "超级三昧真火", "圣婴大王"}
	elseif ac == "超级猪小戒" then
		acs = {"食指大动"}
	elseif ac == "超级土地公公" then
		acs = {"天降灵葫"}
	elseif ac == "超级神鸡" then
		acs = {"从天而降"}
	elseif ac == "超级神猴" then
		acs = {"大快朵颐"}
	elseif ac == "超级玉兔" then
		acs = {"月光"}
	elseif ac == "超级神马" then
		acs = {"浮云神马"}
	elseif ac == "超级神羊" then
		acs = {"千钧一怒"}
	elseif ac == "超级神猪" then
		acs = {"津津有味"}
	elseif ac == "超级神鼠" then
		acs = {"昼伏夜出", "溜之大吉", "神出鬼没"}
	elseif ac == "超级小白龙" then
		acs = {"津津有味"}
	elseif ac == "超级神猪" then
		acs = {"叱咤风云"}
	elseif ac == "超级腾蛇" then
		acs = {"灵能激发"}
	elseif ac == "超级赤焰兽" then
		acs = {"八凶法阵"}
	elseif ac == "超级神狗" then
		acs = {"高级独行", "理直气壮"}
	elseif ac == "超级神虎" then
		acs = {"虎虎生风"}
	elseif ac == "超级神蛇" then
		acs = {"灵能激发"}
	elseif ac == "超级青鸾" then
		acs = {"苍鸾怒击"}
	elseif ac == "超级飞廉" then
		acs = {"迅风出击"}
	elseif ac == "超级神柚" then
		acs = {"超级神柚复生"}
	elseif ac == "超级红孩儿" then
		acs = {"圣婴大王", "超级三昧真火"}
	elseif ac == "超级鲲鹏" then
		acs = {"北冥之渊", "逍遥游", "扶摇万里"}
	end
	return acs
end

function 排序技能(技能组)
	local 排序技能 = {}
	local 返回技能 = {}
	for i=1,#技能组 do
		排序技能[#排序技能+1] = {系数=取技能加成(技能组[i]),名称=技能组[i]}
	end
	table.sort(排序技能,function(a,b) return a.系数<b.系数 end)
	for i=1,#排序技能 do
		返回技能[i] = 排序技能[i].名称
	end
	return 返回技能
end

function 取技能加成(名称)
	local 技能组 = {"高级必杀","法术波动","高级法术暴击","高级幸运","高级法术波动","高级精神集中","高级招架","永恒","敏捷","否定信仰","魔之心","高级神迹","高级永恒","偷袭","高级敏捷","法术防御","死亡召唤",
	"高级偷袭","惊心一剑","雷击","落岩","烈火","水攻","上古灵符","高级魔之心","雷属性吸收","土属性吸收","水属性吸收","火属性吸收","善恶有报","夜舞倾城","奔雷咒","泰山压顶","地狱烈火","高级雷属性吸收","高级土属性吸收",
	"高级水属性吸收","高级火属性吸收","夜战","强力","反击","高级夜战","防御","反震","吸血","高级强力","连击","高级反击","飞行","高级反震","高级防御","壁垒击破","隐身","高级吸血","高级连击","高级法术抵抗","法术抵抗",
	"感知","高级飞行","高级隐身","须弥真言","净台妙谛","灵山禅语","嗜血追击","高级再生","再生","冥思","弱点水","弱点土","弱点雷","弱点火","高级感知","鬼魂术","驱鬼","高级鬼魂术","剑荡四方","高级冥思","迟钝","毒","神佑","力劈华山","高级神佑复生","高级否定信仰",
	"必杀","慧根","高级驱鬼","幸运","高级慧根","高级毒","法术连击","高级法术连击","法术暴击","精神集中","神迹","超级三昧真火","桀骜自恃","圣婴大王"}
	for i=1,#技能组 do
		if 技能组[i] == 名称 then
			return i
		end
	end
	return 取随机数(1,100)
end