-- @Author: baidwwy
-- @Date:   2023-11-28 22:56:30
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2023-12-17 10:08:13
--======================================================================--
-- @作者: GGE研究群: 342119466
-- @创建时间:   2018-03-03 02:34:19
-- @Last Modified time: 2022-10-11 19:03:51
-- 梦幻西游游戏资源破解 baidwwy@vip.qq.com(313738139) 老毕   和 C++PrimerPlus 717535046 这俩位大神破解所以资源
--======================================================================--
function 取随机法术(数量)
	local 法术={"荆棘舞","水攻","雷击","烈火","落岩","奔雷咒","碎星诀","推气过宫","金刚护体","落叶萧萧","裂石","地涌金莲","推拿","夺魄令","地涌金莲","催眠符","失心符","含情脉脉","似玉生香","横扫千军","唧唧歪歪","金刚护法","五雷咒","龙卷雨击","浪涌","龙吟","龙腾","天雷斩","烟雨剑法","五雷轰顶","飞砂走石","三昧真火","狮搏","鹰击","连环击"}
	local 返回组={}
	for n=1,数量 do
		返回组[n]=法术[取随机数(1,#法术)]
	end
	return 返回组
end

function 取随机法术1(数量)
	local 法术={"横扫千军","唧唧歪歪","金刚护法","五雷咒","雨落寒沙","龙卷雨击","龙吟","龙腾","天雷斩","苍茫树","地裂火","靛沧海","日光华","紧箍咒","烟雨剑法","五雷轰顶","飞砂走石","三昧真火","狮搏","鹰击","连环击","天罗地网","阎罗令","判官令","尸腐毒"}
	local 返回组={}
	for n=1,数量 do
		返回组[n]=法术[取随机数(1,#法术)]
	end
	return 返回组
end

function 取法术技能(jn)
	local jns = {}
	for k,v in pairs(技能信息) do
		if 技能信息[k].名称==jn and 技能信息[k].门派 ~= "子女" then
			jns[1] =技能信息[k].功效
			jns[3] =技能信息[k].使用类型
			jns[4] =技能信息[k].消耗
		end
	end
	return jns
end
