

function 糖果产出物品计算(name) --还差个yuanxiao
	if name["装备特效宝珠"] and math.random(100)<=name["装备特效宝珠"] then
	    return "装备特效宝珠"
	elseif name["灵饰特效宝珠"] and math.random(100)<=name["灵饰特效宝珠"]  then
	    return "灵饰特效宝珠"
	elseif name["神兜兜"] and math.random(100)<=name["神兜兜"] then
	    return "神兜兜",取随机数(1,3)
	end
	local zgl = 0
	for _, rate in pairs(name) do
		zgl = zgl + rate
	end
	local num = math.random(zgl) --设置为100时 会有nil
	local lj = 0
	for item, rate in pairs(name) do
		lj = lj + rate
		if num <= lj then
			return item
		end
	end
end

function 糖果生成产出(name,hd) --名称,数量,参数
	if __Funfa[name] then
		return __Funfa[name](name,hd)
	end
	return name,1
end

function 生成产出(name,参数,id) --名称,参数
	if __Funfa[name] then
		if (name=="宝石"or name=="星辉石") and 参数 and type(参数)~="table" and tonumber(参数) then
			local 最大=tonumber(参数)
			local 最小=tonumber(参数)-2
			if 最小<1 then
				最小=1
			end
			参数={最小,tonumber(参数)}
		elseif (name=="钨金"or name=="附魔宝珠") and 参数 and type(参数)~="table" and tonumber(参数) then
			local 最大=tonumber(参数)
			local 最小=tonumber(参数)-10
			if 最小<120 then
				最小=120
			end
			参数={最小,tonumber(参数)}
		end
		return __Funfa[name](name,参数,id)
	end
	return name
end

__Funfa={}
__Funfa["宝石"]=function(name,hd)
	return 取宝石(),取随机数(HDPZ[hd]["宝石"][1],HDPZ[hd]["宝石"][2])
end

__Funfa["强化石"]=function(name,hd)
	return 取强化石(),1
end
__Funfa["五宝"]=function(name,hd) --玩家数据[id].道具:给予道具(id,取五宝())
	return 取五宝()
end
__Funfa["未激活的符石"]=function(name,hd)
	return name,取随机数(1,3)
end
QJBBWP={"水晶糕","芝麻沁香元宵","桂花酒酿元宵","细磨豆沙元宵","蜜糖腰果元宵","山楂拔丝元宵","如意丹","滑玉莲蓉元宵","蜜糖腰果元宵","芝麻沁香元宵","桂花酒酿元宵","细磨豆沙元宵","蜜糖腰果元宵","山楂拔丝元宵","滑玉莲蓉元宵","蜜糖腰果元宵","炼兽真经","炼兽真经"}
__Funfa["元宵"]=function(name,hd)
	return QJBBWP[取随机数(1,#QJBBWP)],1
end

__Funfa["钨金"]=function(name,hd)
	return name,取随机数(qz(HDPZ[hd]["宝珠钨金珍珠"][1]),qz(HDPZ[hd]["宝珠钨金珍珠"][2]))
end
__Funfa["附魔宝珠"]=function(name,hd)
	return name,取随机数(qz(HDPZ[hd]["宝珠钨金珍珠"][1]),qz(HDPZ[hd]["宝珠钨金珍珠"][2]))
end
__Funfa["珍珠"]=function(name,hd)
	return name,取随机数(qz(HDPZ[hd]["宝珠钨金珍珠"][1]),qz(HDPZ[hd]["宝珠钨金珍珠"][2]))
end

WP={"归墟悟空","归墟共生","归墟激战","归墟应变"}
__Funfa["归墟"]=function(name,hd)
	return WP[取随机数(1,#WP)],1
end

__Funfa["高级摄灵珠"]=function(name,参数)
	参数 = 参数 or {10,10}
	return name,nil,取随机数(参数[1],参数[2] or 参数[1])
end
__Funfa["修炼果礼包1"]=function(name,hd)
	return "修炼果",取随机数(1,3)
end
__Funfa["九转金丹"]=function(name,hd)
	return name,取随机数(HDPZ[hd]["金丹"][1],HDPZ[hd]["金丹"][2])
end
__Funfa["怪物卡片"]=function(name,hd)
	-- 统一限制活动掉落变身卡等级：仅7-9级
	return name,取随机数(7,9)
end

__Funfa["装备书铁"]=function(name,hd)
	local mc="制造指南书"
	if 取随机数()<50 then
		mc="百炼精铁"
	end
	local 书铁等级=取随机数(qz(HDPZ[hd]["书铁"][1]/10),qz(HDPZ[hd]["书铁"][2]/10))*10 --{150,150} 书铁
	local 书铁种类=取随机数(1,#书铁范围)
	if 取随机数()<=40 then
		书铁种类=取随机数(19,#书铁范围)
	end
	书铁等级=math.floor(书铁等级/10)*10
	return mc,书铁等级,书铁种类

end
__Funfa["百炼精铁"]=function(name,hd)
	local mc="百炼精铁"
	local 书铁等级=取随机数(qz(HDPZ[hd]["书铁"][1]/10),qz(HDPZ[hd]["书铁"][2]/10))*10 --{150,150} 书铁
	local 书铁种类=取随机数(1,#书铁范围)
	if 取随机数()<=40 then
		书铁种类=取随机数(19,#书铁范围)
	end
	书铁等级=math.floor(书铁等级/10)*10
	return mc,书铁等级,书铁种类
end
__Funfa["制造指南书"]=function(name,hd)
	local mc="制造指南书"
	local 书铁等级=取随机数(qz(HDPZ[hd]["书铁"][1]/10),qz(HDPZ[hd]["书铁"][2]/10))*10 --{150,150} 书铁
	local 书铁种类=取随机数(1,#书铁范围)
	if 取随机数()<=40 then
		书铁种类=取随机数(19,#书铁范围)
	end
	书铁等级=math.floor(书铁等级/10)*10
	return mc,书铁等级,书铁种类
end

__Funfa["灵饰书铁"]=function(name,hd) --等级无需自己设置
	if 取随机数()<=55 then
	            return "元灵晶石"
	else
		return "灵饰指南书"
	end

end
__Funfa["宝宝书铁"]=function(name,hd) --等级无需自己设置
	if 取随机数()<=70 then
	            return "炼妖石"
	else
		return "上古锻造图策"
	end
end


function 取暗器(等级)
	local 名称="飞刀"
	if 等级==1 then
		名称="飞刀"
	elseif 等级==2 then
		名称="飞蝗石"
	elseif 等级==3 then
		名称="铁蒺黎"
	elseif 等级==4 then
		名称="无影神针"
	elseif 等级==5 then
		名称="孔雀翎"
	elseif 等级==6 then
		名称="含沙射影"
	elseif 等级==7 then
		名称="回龙摄魂标"
	elseif 等级==8 then
		名称="寸阴若梦"
	elseif 等级==9 then
		名称="魔睛子"
	elseif 等级==10 then
		名称="顺逆神针"
	end
	return 名称
end
__Funfa["暗器"]=function(name,hd)
	return 取暗器(取随机数(3,8))
end

书铁范围 = {"枪矛","斧钺","剑","双短剑","飘带","爪刺","扇","魔棒","锤","鞭","环圈","刀","法杖","弓弩","宝珠","巨剑","伞","灯笼","头盔","发钗","项链","女衣","男衣","腰带","鞋子"}
function 开始生成环装(lv,id)
	local 临时等级=lv
	local 临时参数=取随机数(1,#书铁范围)
	if 取随机数()<=40 then
		临时参数=取随机数(19,#书铁范围)
	end
	local 临时序列=临时参数
	if 临时序列==25 then
		临时序列=23
	elseif 临时序列==24 then
		临时序列=22
	elseif 临时序列==23 or 临时序列==22 then
		临时序列=21
	elseif 临时序列==21 then
		临时序列=20
	elseif 临时序列==20 or 临时序列==19 then
		临时序列=19
	end
	-- local 临时等级=玩家数据[id].道具.数据[制造格子].子类/10
	-- 计算武器值
	if 临时序列<=18 and 临时等级>=9 then --是武器 10-12是普通光武
		临时等级=取随机数(10,12)
	else
		if 临时等级>=12 then
			临时等级=10
		end
	end
	local 临时类型=装备处理类.打造物品[临时序列][临时等级+1]
	if type(临时类型)=="table" then
		if 临时参数 ==23 then
		 临时类型=临时类型[2]
		elseif 临时参数 ==22 then
		 临时类型=临时类型[1]
		elseif 临时参数 ==20 then
		 临时类型=临时类型[2]
		elseif 临时参数 ==19 then
		 临时类型=临时类型[1]
		else
			临时类型=临时类型[取随机数(1,2)]
		end
	end
	return 装备处理类:生成环装(id,临时等级*10,临时序列,临时类型,"系统产出") --所有系统产出的都给他未鉴定，让他自己鉴定去
end

-- 玩家数据[cyid].道具:取随机装备(cyid,取随机数(5,8))
__Funfa["环装"]=function(name,hd,id)
	return 开始生成环装(取随机数(5,8),id),9999
end

local 迭代数 =0
local function 迭代数量()
	迭代数=迭代数+1
	return 迭代数
end


HDPZ={}
if f函数.文件是否存在([[全局bl.txt]])==false then
	HDPZ={
	决战大雁塔={难度=1,经验=1.2,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},--怪物卡片={1,8},
	 排序=迭代数量(),
		ITEM={
		   金柳露=20,
			超级金柳露=5,
			召唤兽内丹=4,
			高级召唤兽内丹=2,
			魔兽要诀=5,
			高级魔兽要诀=1,
			五宝盒=2,
			神兜兜=5,
			强化石=15,
			特效宝珠=1,
			陨铁=1,
			宝石=10,
			摇钱树苗=2,
			超简易宝珠=1,
			彩果=10,
			门票=10,

	},},
	地煞：星级1={
			难度=1,
			经验=1,
			银子=1,
			爆率=30,
			书铁={150,150},
			宝珠钨金珍珠={150,160},
			宝石={1,1},
			金丹={100,200},
			怪物卡片={1,8},
			排序=迭代数量(),
			ITEM={
				装备书铁=8,
				怪物卡片=8,
				神兜兜=1,
				召唤兽内丹=10,
				未激活的星石=5,
				高级召唤兽内丹=1,
				宝石=10,
				特殊兽诀·碎片=1,
				钨金=4,
				----未激活的符石=5,
				附魔宝珠=2,
				储灵袋=13,
				高级魔兽要诀=1,
				符石卷轴=10,
				元宵=20,
			},
		},
		地煞：星级2={
			难度=1,
			经验=1,
			银子=1,
			爆率=30,
			书铁={150,150},
			宝珠钨金珍珠={150,160},
			宝石={1,1},
			金丹={100,200},
			怪物卡片={1,8},
			排序=迭代数量(),
			ITEM={
				装备书铁=8,
				怪物卡片=8,
				神兜兜=2,
				召唤兽内丹=10,
				未激活的星石=5,
				高级召唤兽内丹=1,
				宝石=10,
				特殊兽诀·碎片=1,
				钨金=4,
				----未激活的符石=5,
				附魔宝珠=2,
				储灵袋=13,
				高级魔兽要诀=1,
				符石卷轴=10,
				元宵=20,
			},
		},
		地煞：星级3={
			难度=1,
			经验=1,
			银子=1,
			爆率=35,
			书铁={150,150},
			宝珠钨金珍珠={150,160},
			宝石={1,1},
			金丹={100,200},
			怪物卡片={1,8},
			排序=迭代数量(),
			ITEM={
				装备书铁=8,
				怪物卡片=8,
				神兜兜=3,
				召唤兽内丹=10,
				未激活的星石=5,
				高级召唤兽内丹=2,
				宝石=10,
				特殊兽诀·碎片=1,
				钨金=4,
				--未激活的符石=5,
				附魔宝珠=2,
				储灵袋=13,
				高级魔兽要诀=2,
				符石卷轴=10,
				元宵=20,
			},
		},
		地煞：星级4={
			难度=1,
			经验=1,
			银子=1,
			爆率=45,
			书铁={150,150},
			宝珠钨金珍珠={150,160},
			宝石={1,1},
			金丹={100,200},
			怪物卡片={1,8},
			排序=迭代数量(),
			ITEM={
				装备书铁=8,
				怪物卡片=8,
				神兜兜=4,
				召唤兽内丹=10,
				未激活的星石=6,
				高级召唤兽内丹=2,
				宝石=10,
				特殊兽诀·碎片=1,
				钨金=4,
				--未激活的符石=5,
				附魔宝珠=3,
				储灵袋=13,
				高级魔兽要诀=3,
				符石卷轴=10,
				元宵=20,
			},
		},
		地煞：星级5={
			难度=1,
			经验=1,
			银子=1,
			爆率=60,
			书铁={150,150},
			宝珠钨金珍珠={150,160},
			宝石={3,4},
			金丹={100,200},
			怪物卡片={1,8},
			排序=迭代数量(),
			ITEM={
				装备书铁=8,
				怪物卡片=8,
				特效宝珠=10,
				超简易宝珠=10,
				神兜兜=10,
				战魄=1,
				召唤兽内丹=10,
				未激活的星石=6,
				高级召唤兽内丹=4,
				宝石=10,
				特殊兽诀·碎片=2,
				钨金=6,
				--未激活的符石=5,
				附魔宝珠=3,
				储灵袋=13,
				高级魔兽要诀=5,
				符石卷轴=10,
				元宵=20,
			},
		},
		地煞：星级6={
			难度=1,
			经验=1,
			银子=1,
			爆率=100,
			书铁={150,150},
			宝珠钨金珍珠={150,160},
			宝石={3,4},
			金丹={100,200},
			怪物卡片={1,8},
			排序=迭代数量(),
			ITEM={
				装备书铁=8,
				怪物卡片=8,
				特效宝珠=20,
				超简易宝珠=20,
				神兜兜=20,
				战魄=1,
				召唤兽内丹=10,
				未激活的星石=6,
				高级召唤兽内丹=4,
				宝石=10,
				特殊兽诀·碎片=5,
				钨金=6,
				--未激活的符石=5,
				附魔宝珠=3,
				储灵袋=13,
				高级魔兽要诀=10,
				符石卷轴=10,
				元宵=20,
			},
		},
	地煞：星级7={
			难度=1,
			经验=1,
			银子=1,
			爆率=100,
			书铁={150,150},
			宝珠钨金珍珠={150,160},
			宝石={3,4},
			金丹={100,200},
			怪物卡片={1,8},
			排序=迭代数量(),
			ITEM={
				装备书铁=8,
				怪物卡片=8,
				特效宝珠=20,
				超简易宝珠=20,
				神兜兜=20,
				战魄=1,
				召唤兽内丹=10,
				未激活的星石=6,
				高级召唤兽内丹=4,
				宝石=10,
				特殊兽诀·碎片=5,
				钨金=6,
				--未激活的符石=5,
				附魔宝珠=3,
				储灵袋=13,
				高级魔兽要诀=10,
				符石卷轴=10,
				元宵=20,
			},
		},

	天罡：星级1={
			难度=1,
			经验=1,
			银子=1,
			爆率=20,
			书铁={150,150},
			宝珠钨金珍珠={150,160},
			宝石={1,1},
			金丹={100,200},
			怪物卡片={1,8},
			排序=迭代数量(),
			ITEM={
				装备书铁=8,
				怪物卡片=8,
				暗淡的星辰碎片=10,
				微光的星辰碎片=10,
				发光的星辰碎片=10,
				耀眼的星辰碎片=10,
				奇异的星辰碎片=10,
			},
		},
		天罡：星级2={
			难度=1,
			经验=1,
			银子=1,
			爆率=30,
			书铁={150,150},
			宝珠钨金珍珠={150,160},
			宝石={1,1},
			金丹={100,200},
			怪物卡片={1,8},
			排序=迭代数量(),
			ITEM={
				装备书铁=8,
				怪物卡片=8,
				暗淡的星辰碎片=10,
				微光的星辰碎片=10,
				发光的星辰碎片=10,
				耀眼的星辰碎片=10,
				奇异的星辰碎片=10,
			},
		},
		天罡：星级3={
			难度=1,
			经验=1,
			银子=1,
			爆率=35,
			书铁={150,150},
			宝珠钨金珍珠={150,160},
			宝石={1,1},
			金丹={100,200},
			怪物卡片={1,8},
			排序=迭代数量(),
			ITEM={
				装备书铁=8,
				怪物卡片=8,
				暗淡的星辰碎片=10,
				微光的星辰碎片=10,
				发光的星辰碎片=10,
				耀眼的星辰碎片=10,
				奇异的星辰碎片=10,
			},
		},
		天罡：星级4={
			难度=1,
			经验=1,
			银子=1,
			爆率=45,
			书铁={150,150},
			宝珠钨金珍珠={150,160},
			宝石={1,1},
			金丹={100,200},
			怪物卡片={1,8},
			排序=迭代数量(),
			ITEM={
				装备书铁=8,
				怪物卡片=8,
				暗淡的星辰碎片=10,
				微光的星辰碎片=10,
				发光的星辰碎片=10,
				耀眼的星辰碎片=10,
				奇异的星辰碎片=10,
			},
		},
		天罡：星级5={
			难度=1,
			经验=1,
			银子=1,
			爆率=60,
			书铁={150,150},
			宝珠钨金珍珠={150,160},
			宝石={1,1},
			金丹={100,200},
			怪物卡片={1,8},
			排序=迭代数量(),
			ITEM={
				装备书铁=8,
				怪物卡片=8,
				暗淡的星辰碎片=10,
				微光的星辰碎片=10,
				发光的星辰碎片=10,
				耀眼的星辰碎片=10,
				奇异的星辰碎片=10,
			},
		},
		天罡：星级6={
			难度=1,
			经验=1,
			银子=1,
			爆率=100,
			书铁={150,150},
			宝珠钨金珍珠={150,160},
			宝石={1,1},
			金丹={100,200},
			怪物卡片={1,8},
			排序=迭代数量(),
			ITEM={
				装备书铁=8,
				怪物卡片=8,
				暗淡的星辰碎片=10,
				微光的星辰碎片=10,
				发光的星辰碎片=10,
				耀眼的星辰碎片=10,
				奇异的星辰碎片=10,
			},
		},


	生肖1星={
			难度=1,
			经验=1,
			银子=1,
			爆率=30,
			书铁={150,150},
			宝珠钨金珍珠={150,160},
			宝石={1,1},
			金丹={100,200},
			怪物卡片={1,8},
			排序=迭代数量(),
			ITEM={
				装备书铁=8,
				怪物卡片=8,
				神兜兜=1,
				召唤兽内丹=10,
				未激活的星石=5,
				高级召唤兽内丹=1,
				宝石=10,
				特殊兽诀·碎片=1,
				钨金=4,
				--未激活的符石=5,
				附魔宝珠=2,
				储灵袋=13,
				高级魔兽要诀=1,
				符石卷轴=10,
				元宵=20,
			},
		},

	生肖2星={
			难度=1,
			经验=1,
			银子=1,
			爆率=30,
			书铁={150,150},
			宝珠钨金珍珠={150,160},
			宝石={1,1},
			金丹={100,200},
			怪物卡片={1,8},
			排序=迭代数量(),
			ITEM={
				装备书铁=8,
				怪物卡片=8,
				神兜兜=1,
				召唤兽内丹=10,
				未激活的星石=5,
				高级召唤兽内丹=1,
				宝石=10,
				特殊兽诀·碎片=1,
				钨金=4,
				--未激活的符石=5,
				附魔宝珠=2,
				储灵袋=13,
				高级魔兽要诀=1,
				符石卷轴=10,
				元宵=20,
			},
		},
	生肖3星={
			难度=1,
			经验=1,
			银子=1,
			爆率=30,
			书铁={150,150},
			宝珠钨金珍珠={150,160},
			宝石={1,1},
			金丹={100,200},
			怪物卡片={1,8},
			排序=迭代数量(),
			ITEM={
				装备书铁=8,
				怪物卡片=8,
				神兜兜=1,
				召唤兽内丹=10,
				未激活的星石=5,
				高级召唤兽内丹=1,
				宝石=10,
				特殊兽诀·碎片=1,
				钨金=4,
				--未激活的符石=5,
				附魔宝珠=2,
				储灵袋=13,
				高级魔兽要诀=1,
				符石卷轴=10,
				元宵=20,
			},
		},
	生肖4星={
			难度=1,
			经验=1,
			银子=1,
			爆率=30,
			书铁={150,150},
			宝珠钨金珍珠={150,160},
			宝石={1,1},
			金丹={100,200},
			怪物卡片={1,8},
			排序=迭代数量(),
			ITEM={
				装备书铁=8,
				怪物卡片=8,
				神兜兜=1,
				召唤兽内丹=10,
				未激活的星石=5,
				高级召唤兽内丹=1,
				宝石=10,
				特殊兽诀·碎片=1,
				钨金=4,
				--未激活的符石=5,
				附魔宝珠=2,
				储灵袋=13,
				高级魔兽要诀=1,
				符石卷轴=10,
				元宵=20,
			},
		},
	生肖5星={
			难度=1,
			经验=1,
			银子=1,
			爆率=30,
			书铁={150,150},
			宝珠钨金珍珠={150,160},
			宝石={1,1},
			金丹={100,200},
			怪物卡片={1,8},
			排序=迭代数量(),
			ITEM={
				装备书铁=8,
				怪物卡片=8,
				神兜兜=1,
				召唤兽内丹=10,
				未激活的星石=5,
				高级召唤兽内丹=1,
				宝石=10,
				特殊兽诀·碎片=1,
				钨金=4,
				--未激活的符石=5,
				附魔宝珠=2,
				储灵袋=13,
				高级魔兽要诀=1,
				符石卷轴=10,
				元宵=20,
			},
		},
	中秋逐月={
			难度=1,
			经验=1,
			银子=5,
			爆率=100,
			书铁={150,150},
			宝珠钨金珍珠={150,160},
			宝石={1,2},
			金丹={100,200},
			--怪物卡片={1,4},
			排序=迭代数量(),
			ITEM={
				金柳露=10,
				彩果=4,
				强化石=15,
				分解符=10,
				--怪物卡片=5,
				未激活的符石=3,
				符石卷轴=1,
				储灵袋=3,
				元宵=5,
				净瓶玉露=3,
				高级召唤兽内丹=10,
				高级魔兽要诀=10,
				特殊兽诀·碎片=2,
			},
			},



	}
	写出文件([[全局bl.txt]],table.tostring(HDPZ))
else
	HDPZ=table.loadstring(读入文件([[全局bl.txt]]))
end






