
--======================================================================--
制造装备={}
制造装备.戒指={[60]="枫华戒",[80]="芙蓉戒",[100]="金麟绕",[120]="悦碧水",[140]="九曜光华",[160]="太虚渺云",[170]="武神戒"}
制造装备.手镯={[60]="香木镯",[80]="翡玉镯",[100]="墨影扣",[120]="花映月",[140]="金水菩提",[160]="浮雪幻音"}
制造装备.耳饰={[60]="翠叶环",[80]="明月珰",[100]="玉蝶翩",[120]="点星芒",[140]="凤羽流苏",[160]="焰云霞珠"}
制造装备.佩饰={[60]="芝兰佩",[80]="逸云佩",[100]="莲音玦",[120]="相思染",[140]="玄龙苍珀",[160]="碧海青天"}
-- 制造装备.戒指={[60]="枫华戒",[80]="芙蓉戒",[100]="金麟绕",[120]="悦碧水",[140]="九曜光华"}
-- 制造装备.手镯={[60]="香木镯",[80]="翡玉镯",[100]="墨影扣",[120]="花映月",[140]="金水菩提"}
-- 制造装备.耳饰={[60]="翠叶环",[80]="明月珰",[100]="玉蝶翩",[120]="点星芒",[140]="凤羽流苏"}
-- 制造装备.佩饰={[60]="芝兰佩",[80]="逸云佩",[100]="莲音玦",[120]="相思染",[140]="玄龙苍珀"}
灵饰随机特性={"血气方刚","通真达灵","心无旁骛","健步如飞","163","心源","回春之术","风雨不动","固若金汤","自我陶醉","气壮山河","锐不可当"}

五宝名称={"金刚石","定魂珠","夜光珠","避水珠","龙鳞"}
随机灵饰={"手镯","佩饰","戒指","耳饰"}
幻化属性值={"伤害","防御","气血","速度","法术伤害","抗封印等级","法术伤害结果","法术暴击等级","抗法术暴击等级","治疗能力","抗物理暴击等级","格挡值","气血回复效果","封印命中等级","固定伤害","狂暴等级","穿刺等级","物理暴击等级"}
幻化战斗属性={"抗封印等级","法术伤害","法术伤害结果","法术暴击等级","抗法术暴击等级","治疗能力","抗物理暴击等级","格挡值","气血回复效果","封印命中等级","固定伤害","狂暴等级","穿刺等级","物理暴击等级"}
灵饰属性={}
-- 灵饰属性.手镯={主属性={"封印命中等级","抵抗封印等级"},副属性={"气血回复效果","气血","防御","抗法术暴击等级","格挡值","法术防御","抗物理暴击等级"}}
-- 灵饰属性.佩饰={主属性={"速度"},副属性={"气血回复效果","气血","防御","抗法术暴击等级","格挡值","法术防御","抗物理暴击等级"}}

灵饰属性.手镯={主属性={"封印命中等级","抵抗封印等级"},副属性={"气血","防御","格挡值","法术防御","气血回复效果","抵抗封印等级","抗法术暴击等级","抗物理暴击等级"}}
灵饰属性.佩饰={主属性={"速度"},副属性={"气血","防御","格挡值","法术防御","气血回复效果","抵抗封印等级","抗法术暴击等级","抗物理暴击等级"}}
灵饰属性.戒指={主属性={"伤害","防御"},副属性={"固定伤害","法术伤害","伤害","封印命中等级","法术暴击等级","物理暴击等级","狂暴等级","穿刺等级","法术伤害结果","治疗能力","速度"}}
灵饰属性.耳饰={主属性={"法术伤害","法术防御"},副属性={"固定伤害","法术伤害","伤害","封印命中等级","法术暴击等级","物理暴击等级","狂暴等级","穿刺等级","法术伤害结果","治疗能力","速度"}}




灵饰战斗属性={"气血回复效果","抗法术暴击等级","格挡值","法术防御","抗物理暴击等级","封印命中等级","抵抗封印等级","固定伤害","法术伤害","法术暴击等级","物理暴击等级","狂暴等级","穿刺等级","法术伤害结果","物理伤害结果","物伤结果","法伤结果","治疗能力"}
灵饰正常属性={"伤害","防御","气血","速度"}
灵饰进阶属性={"敏捷","耐力","力量","魔力","体质"}
锦衣技能={"手到擒来","变化莫测","神谋魔道","言出法随","撼海狂龙"
,"涤瑕蹈隙","八攻八克","避实击虚","力大无穷","半济而击"
,"自在逍遥","月明如昼","自我疗愈","兵贵神速"
,"护体如磐","以牙还牙","洞察一切","坚如磐石","鹰击长空"
,"除邪惩恶","妖魔鬼怪","鸿运当头","后发制人","苦思冥想"
}

-- 锦衣技能={
-- "自在逍遥"
-- }

灵饰属性["上古玉魄·阳"]={主属性={"伤害","速度","法术伤害","治疗能力","狂暴等级","物理暴击等级","法术暴击等级","封印命中等级","法术伤害结果"},副属性={"伤害","速度","法术伤害","治疗能力","狂暴等级","物理暴击等级","法术暴击等级","封印命中等级","法术伤害结果"}}
灵饰属性["上古玉魄·阴"]={主属性={"气血","防御","法术防御","抗物理暴击等级","抗法术暴击等级","抵抗封印等级","格挡值","气血回复效果"},副属性={"气血","防御","法术防御","抗物理暴击等级","抗法术暴击等级","抵抗封印等级","格挡值","气血回复效果"}}


灵饰主属性={
	封印命中等级={[160]={a=32,b=48},[140]={a=28,b=42},[120]={a=24,b=36},[100]={a=20,b=30},[80]={a=16,b=24},[60]={a=12,b=18}}
	,抵抗封印等级={[160]={a=32,b=48},[140]={a=28,b=42},[120]={a=24,b=36},[100]={a=20,b=30},[80]={a=16,b=24},[60]={a=12,b=18}}
	,防御={[160]={a=32,b=48},[140]={a=28,b=42},[120]={a=24,b=36},[100]={a=20,b=30},[80]={a=16,b=24},[60]={a=12,b=18}}
	,法术防御={[160]={a=32,b=48},[140]={a=28,b=42},[120]={a=24,b=36},[100]={a=20,b=30},[80]={a=16,b=24},[60]={a=12,b=18}}
	,速度={[160]={a=22,b=33},[140]={a=20,b=30},[120]={a=18,b=27},[100]={a=16,b=24},[80]={a=14,b=21},[60]={a=12,b=18}}
	,伤害={[160]={a=32,b=48},[140]={a=28,b=42},[120]={a=24,b=36},[100]={a=20,b=30},[80]={a=16,b=24},[60]={a=12,b=18}}
	,法术伤害={[160]={a=32,b=48},[140]={a=28,b=42},[120]={a=24,b=36},[100]={a=20,b=30},[80]={a=16,b=24},[60]={a=12,b=18}},
            ---------玉魄新增
            治疗能力={[160]={a=22,b=33},[140]={a=20,b=30},[120]={a=18,b=27},[100]={a=16,b=24},[80]={a=14,b=21},[60]={a=12,b=18}},
            狂暴等级={[160]={a=32,b=48},[140]={a=28,b=42},[120]={a=24,b=36},[100]={a=20,b=30},[80]={a=16,b=24},[60]={a=12,b=18}},
            物理暴击等级={[160]={a=32,b=48},[140]={a=28,b=42},[120]={a=24,b=36},[100]={a=20,b=30},[80]={a=16,b=24},[60]={a=12,b=18}},
            法术暴击等级={[160]={a=32,b=48},[140]={a=28,b=42},[120]={a=24,b=36},[100]={a=20,b=30},[80]={a=16,b=24},[60]={a=12,b=18}},
            法术伤害结果={[160]={a=32,b=48},[140]={a=28,b=42},[120]={a=24,b=36},[100]={a=20,b=30},[80]={a=16,b=24},[60]={a=12,b=18}},
            气血={[160]={a=112,b=168},[140]={a=98,b=147},[120]={a=84,b=126},[100]={a=70,b=105},[80]={a=56,b=84},[60]={a=42,b=63}},
            抗物理暴击等级={[160]={a=32,b=48},[140]={a=28,b=42},[120]={a=24,b=36},[100]={a=20,b=30},[80]={a=16,b=24},[60]={a=12,b=18}},
            抗法术暴击等级={[160]={a=32,b=48},[140]={a=28,b=42},[120]={a=24,b=36},[100]={a=20,b=30},[80]={a=16,b=24},[60]={a=12,b=18}},
            格挡值={[160]={a=32,b=48},[140]={a=28,b=42},[120]={a=24,b=36},[100]={a=20,b=30},[80]={a=16,b=24},[60]={a=12,b=18}},
            气血回复效果={[160]={a=32,b=48},[140]={a=28,b=42},[120]={a=24,b=36},[100]={a=20,b=30},[80]={a=16,b=24},[60]={a=12,b=18}}

}

灵饰副属性={
	封印命中等级={[160]={a=32,b=48},[140]={a=14,b=21},[120]={a=12,b=18},[100]={a=10,b=15},[80]={a=8,b=12},[60]={a=6,b=9}}
	,固定伤害={[160]={a=16,b=24},[140]={a=14,b=21},[120]={a=12,b=18},[100]={a=10,b=15},[80]={a=8,b=12},[60]={a=6,b=9}}
	,法术伤害={[160]={a=16,b=24},[140]={a=14,b=21},[120]={a=12,b=18},[100]={a=10,b=15},[80]={a=8,b=12},[60]={a=6,b=9}}
	,伤害={[160]={a=16,b=24},[140]={a=14,b=21},[120]={a=12,b=18},[100]={a=10,b=15},[80]={a=8,b=12},[60]={a=6,b=9}}
	,法术暴击等级={[160]={a=16,b=24},[140]={a=14,b=21},[120]={a=12,b=18},[100]={a=10,b=15},[80]={a=8,b=12},[60]={a=6,b=9}}
	,物理暴击等级={[160]={a=16,b=24},[140]={a=14,b=21},[120]={a=12,b=18},[100]={a=10,b=15},[80]={a=8,b=12},[60]={a=6,b=9}}
	,治疗能力={[160]={a=11,b=16},[140]={a=10,b=15},[120]={a=9,b=13},[100]={a=8,b=12},[80]={a=8,b=10},[60]={a=6,b=9}}
	,速度={[160]={a=11,b=16},[140]={a=10,b=15},[120]={a=9,b=13},[100]={a=8,b=12},[80]={a=7,b=10},[60]={a=6,b=9}}
	,法术伤害结果={[160]={a=11,b=16},[140]={a=10,b=15},[120]={a=9,b=13},[100]={a=8,b=12},[80]={a=7,b=10},[60]={a=6,b=9}}
	,狂暴等级={[160]={a=11,b=16},[140]={a=10,b=15},[120]={a=9,b=13},[100]={a=8,b=12},[80]={a=7,b=10},[60]={a=6,b=9}}
	,穿刺等级={[160]={a=1,b=16},[140]={a=10,b=15},[120]={a=9,b=13},[100]={a=8,b=12},[80]={a=7,b=10},[60]={a=6,b=9}}
	,抵抗封印等级={[160]={a=32,b=48},[140]={a=28,b=42},[120]={a=24,b=36},[100]={a=20,b=30},[80]={a=16,b=24},[60]={a=12,b=18}}
	,防御={[160]={a=32,b=48},[140]={a=28,b=42},[120]={a=24,b=36},[100]={a=20,b=30},[80]={a=16,b=24},[60]={a=12,b=18}}
	,气血回复效果={[160]={a=16,b=24},[140]={a=14,b=21},[120]={a=12,b=18},[100]={a=10,b=15},[80]={a=8,b=12},[60]={a=6,b=9}}
	,气血={[160]={a=112,b=168},[140]={a=98,b=147},[120]={a=84,b=126},[100]={a=70,b=105},[80]={a=56,b=84},[60]={a=42,b=63}}
	,抗法术暴击等级={[160]={a=32,b=48},[140]={a=28,b=42},[120]={a=24,b=36},[100]={a=20,b=30},[80]={a=16,b=24},[60]={a=12,b=18}}
	,格挡值={[160]={a=32,b=48},[140]={a=28,b=42},[120]={a=24,b=36},[100]={a=20,b=30},[80]={a=16,b=24},[60]={a=12,b=18}}
	,法术防御={[160]={a=32,b=48},[140]={a=28,b=42},[120]={a=24,b=36},[100]={a=20,b=30},[80]={a=16,b=24},[60]={a=12,b=18}}
	,抗物理暴击等级={[160]={a=32,b=48},[140]={a=28,b=42},[120]={a=24,b=36},[100]={a=20,b=30},[80]={a=16,b=24},[60]={a=12,b=18}}
}

一级符石 = {"冰符石","土符石","雷符石","电符石","风符石","炎符石","火符石"}
二级符石 = {"红云符石","碧玉符石","金光符石","天神符石","飘渺符石","天仙符石","霞光符石","逍遥符石"}
三级符石 = {"虹珀符石","陌影符石","北冥符石","灵月符石","锦瑟符石","银光符石","清心符石","星辰符石","雪月符石","玄魂符石","乾坤符石","珍珀符石",
      "银竹符石","神川符石","玲珑符石","暮影符石","天珍符石","九影符石","百冥符石","莫念符石","醉魂符石","玄羽符石","霸风符石","无相符石",
      "无极符石","紫晶符石","圣火符石","昔光符石","子蚀符石","流风符石","地炎符石","素影符石","燕灵符石","降龙符石","苍玉符石","流魂符石",
      "九凤符石","墨陀符石","南夕符石","引幽符石","波涛符石","铃星符石","狂念符石","乱花符石","幽月符石","两仪符石","七情符石","召影符石"}
新三级符石 = {"太极符石","阴仪符石","阳仪符石","太阴符石","少阴符石","少阳符石","太阳符石"}


PropertyData = {}
PropertyData["金石之坚"] = {类型 = "五行"
    , 戒指 = {pro = "速度", rate = 1, status = 1}
    , 耳饰 = {pro = "速度", rate = 1, status = 1}
    , 佩饰 = {pro = "速度", rate = 1, status = 1}
    , 手镯 = {pro = "速度", rate = 1, status = 1}
    , 套装 = {pro = "对五行为金的召唤兽提升%d%%比例伤害（测试中暂不生效）", status = 2}
, 套装1 = 1, 套装2 = 2, 套装3 = 3, 套装4 = 4, 套装5 = 5, 套装6 = 6, 套装7 = 7, 套装8 = 8, 套装9 = 9, 套装10 = 10}
PropertyData["参天古木"] = {类型 = "五行"
    , 戒指 = {pro = "速度", rate = 1, status = 1}
    , 耳饰 = {pro = "速度", rate = 1, status = 1}
    , 佩饰 = {pro = "速度", rate = 1, status = 1}
    , 手镯 = {pro = "速度", rate = 1, status = 1}
    , 套装 = {pro = "对五行为木的召唤兽增加%d%%伤害（测试中暂不生效）", status = 2}
, 套装1 = 1, 套装2 = 2, 套装3 = 3, 套装4 = 4, 套装5 = 5, 套装6 = 6, 套装7 = 7, 套装8 = 8, 套装9 = 9, 套装10 = 10}
PropertyData["波浪滔天"] = {类型 = "五行"
    , 戒指 = {pro = "速度", rate = 1, status = 1}
    , 耳饰 = {pro = "速度", rate = 1, status = 1}
    , 佩饰 = {pro = "速度", rate = 1, status = 1}
    , 手镯 = {pro = "速度", rate = 1, status = 1}
    , 套装 = {pro = "对五行为水的召唤兽增加%d%%伤害（测试中暂不生效）", status = 2}
, 套装1 = 1, 套装2 = 2, 套装3 = 3, 套装4 = 4, 套装5 = 5, 套装6 = 6, 套装7 = 7, 套装8 = 8, 套装9 = 9, 套装10 = 10}
PropertyData["烈火燎原"] = {类型 = "五行"
    , 戒指 = {pro = "速度", rate = 1, status = 1}
    , 耳饰 = {pro = "速度", rate = 1, status = 1}
    , 佩饰 = {pro = "速度", rate = 1, status = 1}
    , 手镯 = {pro = "速度", rate = 1, status = 1}
    , 套装 = {pro = "对五行为火的召唤兽增加%d%%伤害（测试中暂不生效）", status = 2}
, 套装1 = 1, 套装2 = 2, 套装3 = 3, 套装4 = 4, 套装5 = 5, 套装6 = 6, 套装7 = 7, 套装8 = 8, 套装9 = 9, 套装10 = 10}
PropertyData["水来土掩"] = {类型 = "五行"
    , 戒指 = {pro = "速度", rate = 1, status = 1}
    , 耳饰 = {pro = "速度", rate = 1, status = 1}
    , 佩饰 = {pro = "速度", rate = 1, status = 1}
    , 手镯 = {pro = "速度", rate = 1, status = 1}
    , 套装 = {pro = "对五行为土的召唤兽增加%d%%伤害（测试中暂不生效）", status = 2}
, 套装1 = 1, 套装2 = 2, 套装3 = 3, 套装4 = 4, 套装5 = 5, 套装6 = 6, 套装7 = 7, 套装8 = 8, 套装9 = 9, 套装10 = 10}
PropertyData["血气方刚"] = {类型 = "属性"
    , 戒指 = {pro = "气血", rate = 7, status = 1}
    , 耳饰 = {pro = "气血", rate = 7, status = 1}
    , 佩饰 = {pro = "气血", rate = 7, status = 1}
    , 手镯 = {pro = "气血", rate = 7, status = 1}
    , 套装 = {pro = "增加%d%%比例的气血上限", status = 2}
, 套装1 = 1, 套装2 = 1.5, 套装3 = 2, 套装4 = 2.5, 套装5 = 3, 套装6 = 3.5, 套装7 = 4, 套装8 = 4.5, 套装9 = 5, 套装10 = 6}
PropertyData["通真达灵"] = {类型 = "属性"
    , 戒指 = {pro = "法术防御", rate = 2, status = 1}
    , 耳饰 = {pro = "法术防御", rate = 2, status = 1}
    , 佩饰 = {pro = "法术防御", rate = 2, status = 1}
    , 手镯 = {pro = "法术防御", rate = 2, status = 1}
    , 套装 = {pro = "增加%d%%的法术防御", status = 2}
, 套装1 = 1, 套装2 = 2, 套装3 = 3, 套装4 = 3.5, 套装5 = 4, 套装6 = 5, 套装7 = 6, 套装8 = 7, 套装9 = 8, 套装10 = 9}
PropertyData["心无旁骛"] = {类型 = "属性"
    , 戒指 = {pro = "抵抗封印等级", rate = 2, status = 1}
    , 耳饰 = {pro = "抵抗封印等级", rate = 2, status = 1}
    , 佩饰 = {pro = "抵抗封印等级", rate = 2, status = 1}
    , 手镯 = {pro = "抵抗封印等级", rate = 2, status = 1}
    , 套装 = {pro = "增加%d点抵抗封印等级", status = 2}
, 套装1 = 10, 套装2 = 20, 套装3 = 30, 套装4 = 40, 套装5 = 50, 套装6 = 60, 套装7 = 70, 套装8 = 80, 套装9 = 90, 套装10 = 100}
PropertyData["健步如飞"] = {类型 = "属性"
    , 戒指 = {pro = "速度", rate = 1, status = 1}
    , 耳饰 = {pro = "速度", rate = 1, status = 1}
    , 佩饰 = {pro = "速度", rate = 1, status = 1}
    , 手镯 = {pro = "速度", rate = 1, status = 1}
    , 套装 = {pro = "增加%d点速度", status = 2}
, 套装1 = 5, 套装2 = 10, 套装3 = 15, 套装4 = 20, 套装5 = 25, 套装6 = 30, 套装7 = 35, 套装8 = 40, 套装9 = 45, 套装10 = 50}
PropertyData["回春之术"] = {类型 = "属性"
    , 戒指 = {pro = "治疗能力", rate = 1, status = 1}
    , 耳饰 = {pro = "治疗能力", rate = 1, status = 1}
    , 佩饰 = {pro = "治疗能力", rate = 1, status = 1}
    , 手镯 = {pro = "治疗能力", rate = 1, status = 1}
    , 套装 = {pro = "增加%d点治疗能力", status = 2}
, 套装1 = 5, 套装2 = 10, 套装3 = 15, 套装4 = 20, 套装5 = 25, 套装6 = 30, 套装7 = 35, 套装8 = 40, 套装9 = 45, 套装10 = 50}
PropertyData["风雨不动"] = {类型 = "属性"
    , 戒指 = {pro = "抗法术暴击等级", rate = 2, status = 1}
    , 耳饰 = {pro = "抗法术暴击等级", rate = 2, status = 1}
    , 佩饰 = {pro = "抗法术暴击等级", rate = 2, status = 1}
    , 手镯 = {pro = "抗法术暴击等级", rate = 2, status = 1}
    , 套装 = {pro = "增加%d点抗法术暴击等级", status = 2}
, 套装1 = 10, 套装2 = 20, 套装3 = 30, 套装4 = 40, 套装5 = 50, 套装6 = 60, 套装7 = 70, 套装8 = 80, 套装9 = 90, 套装10 = 100}
PropertyData["固若金汤"] = {类型 = "属性"
    , 戒指 = {pro = "抗物理暴击等级", rate = 2, status = 1}
    , 耳饰 = {pro = "抗物理暴击等级", rate = 2, status = 1}
    , 佩饰 = {pro = "抗物理暴击等级", rate = 2, status = 1}
    , 手镯 = {pro = "抗物理暴击等级", rate = 2, status = 1}
    , 套装 = {pro = "增加%d点抗物理暴击等级", status = 2}
, 套装1 = 10, 套装2 = 20, 套装3 = 30, 套装4 = 40, 套装5 = 50, 套装6 = 60, 套装7 = 70, 套装8 = 80, 套装9 = 90, 套装10 = 100}
PropertyData["气壮山河"] = {类型 = "属性"
    , 戒指 = {pro = "气血回复效果", rate = 1, status = 1}
    , 耳饰 = {pro = "气血回复效果", rate = 1, status = 1}
    , 佩饰 = {pro = "气血回复效果", rate = 1, status = 1}
    , 手镯 = {pro = "气血回复效果", rate = 1, status = 1}
    , 套装 = {pro = "增加%d点气血回复效果", status = 2}
, 套装1 = 5, 套装2 = 10, 套装3 = 15, 套装4 = 20, 套装5 = 25, 套装6 = 30, 套装7 = 35, 套装8 = 40, 套装9 = 45, 套装10 = 50}
PropertyData["锐不可当"] = {类型 = "属性"
    , 戒指 = {pro = "固定伤害", rate = 1, status = 1}
    , 耳饰 = {pro = "固定伤害", rate = 1, status = 1}
    , 佩饰 = {pro = "固定伤害", rate = 1, status = 1}
    , 手镯 = {pro = "固定伤害", rate = 1, status = 1}
    , 套装 = {pro = "增加%d点固定伤害", status = 2}
, 套装1 = 5, 套装2 = 10, 套装3 = 15, 套装4 = 20, 套装5 = 25, 套装6 = 30, 套装7 = 35, 套装8 = 40, 套装9 = 45, 套装10 = 50}

PropertyData["法术吸收"] = {类型 = "战斗效果"
    , 戒指 = {pro = "雷属性吸收", rate = 1, status = 1}
    , 耳饰 = {pro = "土属性吸收", rate = 1, status = 1}
    , 佩饰 = {pro = "水属性吸收", rate = 1, status = 1}
    , 手镯 = {pro = "火属性吸收", rate = 1, status = 1}
    , 套装 = {pro = "气血低于百分之30的时候，额外增加%d%%的法术吸收能力（测试中暂不生效）", status = 2}
, 套装1 = 2, 套装2 = 4, 套装3 = 6, 套装4 = 8, 套装5 = 10, 套装6 = 12, 套装7 = 14, 套装8 = 16, 套装9 = 18, 套装10 = 20}

PropertyData["心狠手辣"] = {类型 = "战斗效果"
    , 戒指 = {pro = "对召唤兽忽视防御", rate = 2, status = 1}
    , 耳饰 = {pro = "对召唤兽忽视防御", rate = 2, status = 1}
    , 佩饰 = {pro = "对召唤兽忽视防御", rate = 2, status = 1}
    , 手镯 = {pro = "对召唤兽忽视防御", rate = 2, status = 1}
    , 套装 = {pro = "忽视召唤兽%d点防御与法术防御（测试中暂不生效）", status = 2}
, 套装1 = 1, 套装2 = 2, 套装3 = 3, 套装4 = 4, 套装5 = 5, 套装6 = 6, 套装7 = 7, 套装8 = 8, 套装9 = 9, 套装10 = 10}
PropertyData["御兽之道"] = {类型 = "战斗效果"
    , 戒指 = {pro = "对召唤兽气血", rate = 7, status = 1}
    , 耳饰 = {pro = "对召唤兽防御", rate = 2, status = 1}
    , 佩饰 = {pro = "对召唤兽法防", rate = 2, status = 1}
    , 手镯 = {pro = "对召唤兽魔法", rate = 7, status = 1}
    , 套装 = {pro = "召唤兽被击飞时，增加%d点愤怒（测试中暂不生效）", status = 2}
, 套装1 = 5, 套装2 = 10, 套装3 = 15, 套装4 = 20, 套装5 = 25, 套装6 = 30, 套装7 = 35, 套装8 = 40, 套装9 = 45, 套装10 = 50}
PropertyData["无懈可击"] = {类型 = "战斗效果"
    , 戒指 = {pro = "防御时，恢复气血", rate = 7, status = 1}
    , 耳饰 = {pro = "防御时，恢复气血", rate = 7, status = 1}
    , 佩饰 = {pro = "防御时，恢复气血", rate = 7, status = 1}
    , 手镯 = {pro = "防御时，恢复气血", rate = 7, status = 1}
    , 套装 = {pro = "防御时，受到法术伤害降低%d%%（测试中暂不生效）", status = 2}
, 套装1 = 2, 套装2 = 4, 套装3 = 6, 套装4 = 8, 套装5 = 10, 套装6 = 12, 套装7 = 14, 套装8 = 16, 套装9 = 18, 套装10 = 20}
PropertyData["宿敌·大唐官府"] = {类型 = "宿敌"
    , 戒指 = {pro = "气血", rate = 6, status = 1}
    , 耳饰 = {pro = "气血", rate = 6, status = 1}
    , 佩饰 = {pro = "气血", rate = 6, status = 1}
    , 手镯 = {pro = "气血", rate = 6, status = 1}
    , 套装 = {pro = "增加对大唐官府%d%%的伤害（测试中暂不生效）", status = 2}
, 套装1 = 2, 套装2 = 4, 套装3 = 6, 套装4 = 8, 套装5 = 10, 套装6 = 12, 套装7 = 14, 套装8 = 16, 套装9 = 18, 套装10 = 20}
PropertyData["宿敌·化生寺"] = {类型 = "宿敌"
    , 戒指 = {pro = "气血", rate = 6, status = 1}
    , 耳饰 = {pro = "气血", rate = 6, status = 1}
    , 佩饰 = {pro = "气血", rate = 6, status = 1}
    , 手镯 = {pro = "气血", rate = 6, status = 1}
    , 套装 = {pro = "增加对化生寺%d%%的伤害（测试中暂不生效）", status = 2}
, 套装1 = 2, 套装2 = 4, 套装3 = 6, 套装4 = 8, 套装5 = 10, 套装6 = 12, 套装7 = 14, 套装8 = 16, 套装9 = 18, 套装10 = 20}
PropertyData["宿敌·女儿村"] = {类型 = "宿敌"
    , 戒指 = {pro = "气血", rate = 6, status = 1}
    , 耳饰 = {pro = "气血", rate = 6, status = 1}
    , 佩饰 = {pro = "气血", rate = 6, status = 1}
    , 手镯 = {pro = "气血", rate = 6, status = 1}
    , 套装 = {pro = "增加对女儿村%d%%的伤害（测试中暂不生效）", status = 2}
, 套装1 = 2, 套装2 = 4, 套装3 = 6, 套装4 = 8, 套装5 = 10, 套装6 = 12, 套装7 = 14, 套装8 = 16, 套装9 = 18, 套装10 = 20}
PropertyData["宿敌·神木林"] = {类型 = "宿敌"
    , 戒指 = {pro = "气血", rate = 6, status = 1}
    , 耳饰 = {pro = "气血", rate = 6, status = 1}
    , 佩饰 = {pro = "气血", rate = 6, status = 1}
    , 手镯 = {pro = "气血", rate = 6, status = 1}
    , 套装 = {pro = "增加对神木林%d%%的伤害（测试中暂不生效）", status = 2}
, 套装1 = 2, 套装2 = 4, 套装3 = 6, 套装4 = 8, 套装5 = 10, 套装6 = 12, 套装7 = 14, 套装8 = 16, 套装9 = 18, 套装10 = 20}
PropertyData["宿敌·方寸山"] = {类型 = "宿敌"
    , 戒指 = {pro = "气血", rate = 6, status = 1}
    , 耳饰 = {pro = "气血", rate = 6, status = 1}
    , 佩饰 = {pro = "气血", rate = 6, status = 1}
    , 手镯 = {pro = "气血", rate = 6, status = 1}
    , 套装 = {pro = "增加对方寸山%d%%的伤害（测试中暂不生效）", status = 2}
, 套装1 = 2, 套装2 = 4, 套装3 = 6, 套装4 = 8, 套装5 = 10, 套装6 = 12, 套装7 = 14, 套装8 = 16, 套装9 = 18, 套装10 = 20}
PropertyData["宿敌·天宫"] = {类型 = "宿敌"
    , 戒指 = {pro = "气血", rate = 6, status = 1}
    , 耳饰 = {pro = "气血", rate = 6, status = 1}
    , 佩饰 = {pro = "气血", rate = 6, status = 1}
    , 手镯 = {pro = "气血", rate = 6, status = 1}
    , 套装 = {pro = "增加对天宫%d%%的伤害（测试中暂不生效）", status = 2}
, 套装1 = 2, 套装2 = 4, 套装3 = 6, 套装4 = 8, 套装5 = 10, 套装6 = 12, 套装7 = 14, 套装8 = 16, 套装9 = 18, 套装10 = 20}
PropertyData["宿敌·龙宫"] = {类型 = "宿敌"
    , 戒指 = {pro = "气血", rate = 6, status = 1}
    , 耳饰 = {pro = "气血", rate = 6, status = 1}
    , 佩饰 = {pro = "气血", rate = 6, status = 1}
    , 手镯 = {pro = "气血", rate = 6, status = 1}
    , 套装 = {pro = "增加对龙宫%d%%的伤害（测试中暂不生效）", status = 2}
, 套装1 = 2, 套装2 = 4, 套装3 = 6, 套装4 = 8, 套装5 = 10, 套装6 = 12, 套装7 = 14, 套装8 = 16, 套装9 = 18, 套装10 = 20}
PropertyData["宿敌·五庄观"] = {类型 = "宿敌"
    , 戒指 = {pro = "气血", rate = 6, status = 1}
    , 耳饰 = {pro = "气血", rate = 6, status = 1}
    , 佩饰 = {pro = "气血", rate = 6, status = 1}
    , 手镯 = {pro = "气血", rate = 6, status = 1}
    , 套装 = {pro = "增加对五庄观%d%%的伤害（测试中暂不生效）", status = 2}
, 套装1 = 2, 套装2 = 4, 套装3 = 6, 套装4 = 8, 套装5 = 10, 套装6 = 12, 套装7 = 14, 套装8 = 16, 套装9 = 18, 套装10 = 20}
PropertyData["宿敌·凌波城"] = {类型 = "宿敌"
    , 戒指 = {pro = "气血", rate = 6, status = 1}
    , 耳饰 = {pro = "气血", rate = 6, status = 1}
    , 佩饰 = {pro = "气血", rate = 6, status = 1}
    , 手镯 = {pro = "气血", rate = 6, status = 1}
    , 套装 = {pro = "增加对凌波城%d%%的伤害（测试中暂不生效）", status = 2}
, 套装1 = 2, 套装2 = 4, 套装3 = 6, 套装4 = 8, 套装5 = 10, 套装6 = 12, 套装7 = 14, 套装8 = 16, 套装9 = 18, 套装10 = 20}
PropertyData["宿敌·普陀山"] = {类型 = "宿敌"
    , 戒指 = {pro = "气血", rate = 6, status = 1}
    , 耳饰 = {pro = "气血", rate = 6, status = 1}
    , 佩饰 = {pro = "气血", rate = 6, status = 1}
    , 手镯 = {pro = "气血", rate = 6, status = 1}
    , 套装 = {pro = "增加对普陀山%d%%的伤害（测试中暂不生效）", status = 2}
, 套装1 = 2, 套装2 = 4, 套装3 = 6, 套装4 = 8, 套装5 = 10, 套装6 = 12, 套装7 = 14, 套装8 = 16, 套装9 = 18, 套装10 = 20}
PropertyData["宿敌·阴曹地府"] = {类型 = "宿敌"
    , 戒指 = {pro = "气血", rate = 6, status = 1}
    , 耳饰 = {pro = "气血", rate = 6, status = 1}
    , 佩饰 = {pro = "气血", rate = 6, status = 1}
    , 手镯 = {pro = "气血", rate = 6, status = 1}
    , 套装 = {pro = "增加对阴曹地府%d%%的伤害（测试中暂不生效）", status = 2}
, 套装1 = 2, 套装2 = 4, 套装3 = 6, 套装4 = 8, 套装5 = 10, 套装6 = 12, 套装7 = 14, 套装8 = 16, 套装9 = 18, 套装10 = 20}
PropertyData["宿敌·盘丝洞"] = {类型 = "宿敌"
    , 戒指 = {pro = "气血", rate = 6, status = 1}
    , 耳饰 = {pro = "气血", rate = 6, status = 1}
    , 佩饰 = {pro = "气血", rate = 6, status = 1}
    , 手镯 = {pro = "气血", rate = 6, status = 1}
    , 套装 = {pro = "增加对盘丝洞%d%%的伤害（测试中暂不生效）", status = 2}
, 套装1 = 2, 套装2 = 4, 套装3 = 6, 套装4 = 8, 套装5 = 10, 套装6 = 12, 套装7 = 14, 套装8 = 16, 套装9 = 18, 套装10 = 20}
PropertyData["宿敌·狮驼岭"] = {类型 = "宿敌"
    , 戒指 = {pro = "气血", rate = 6, status = 1}
    , 耳饰 = {pro = "气血", rate = 6, status = 1}
    , 佩饰 = {pro = "气血", rate = 6, status = 1}
    , 手镯 = {pro = "气血", rate = 6, status = 1}
    , 套装 = {pro = "增加对狮驼岭%d%%的伤害（测试中暂不生效）", status = 2}
, 套装1 = 2, 套装2 = 4, 套装3 = 6, 套装4 = 8, 套装5 = 10, 套装6 = 12, 套装7 = 14, 套装8 = 16, 套装9 = 18, 套装10 = 20}
PropertyData["宿敌·魔王寨"] = {类型 = "宿敌"
    , 戒指 = {pro = "气血", rate = 6, status = 1}
    , 耳饰 = {pro = "气血", rate = 6, status = 1}
    , 佩饰 = {pro = "气血", rate = 6, status = 1}
    , 手镯 = {pro = "气血", rate = 6, status = 1}
    , 套装 = {pro = "增加对魔王寨%d%%的伤害（测试中暂不生效）", status = 2}
, 套装1 = 2, 套装2 = 4, 套装3 = 6, 套装4 = 8, 套装5 = 10, 套装6 = 12, 套装7 = 14, 套装8 = 16, 套装9 = 18, 套装10 = 20}
PropertyData["宿敌·无底洞"] = {类型 = "宿敌"
    , 戒指 = {pro = "气血", rate = 6, status = 1}
    , 耳饰 = {pro = "气血", rate = 6, status = 1}
    , 佩饰 = {pro = "气血", rate = 6, status = 1}
    , 手镯 = {pro = "气血", rate = 6, status = 1}
    , 套装 = {pro = "增加对无底洞%d%%的伤害（测试中暂不生效）", status = 2}
, 套装1 = 2, 套装2 = 4, 套装3 = 6, 套装4 = 8, 套装5 = 10, 套装6 = 12, 套装7 = 14, 套装8 = 16, 套装9 = 18, 套装10 = 20}
PropertyData["自我陶醉"] = {类型 = "属性"
    , 戒指 = {pro = "全属性", rate = 1, status = 1}
    , 耳饰 = {pro = "全属性", rate = 1, status = 1}
    , 佩饰 = {pro = "全属性", rate = 1, status = 1}
    , 手镯 = {pro = "全属性", rate = 1, status = 1}
    , 套装 = {pro = "全属性增加%d%%", status = 2}
, 套装1 = 1, 套装2 = 2, 套装3 = 3, 套装4 = 4, 套装5 = 5, 套装6 = 6, 套装7 = 7, 套装8 = 8, 套装9 = 9, 套装10 = 10}
PropertyData["傲娇海星"] = {类型 = "属性"
    , 戒指 = {pro = "傲娇海星", rate = 1, status = 1}
    , 耳饰 = {pro = "傲娇海星", rate = 1, status = 1}
    , 佩饰 = {pro = "傲娇海星", rate = 1, status = 1}
    , 手镯 = {pro = "傲娇海星", rate = 1, status = 1}
    , 套装 = {pro = "释放技能触发双倍伤害，几率%d%%", status = 2}
, 套装1 = 1, 套装2 = 2, 套装3 = 3, 套装4 = 4, 套装5 = 5, 套装6 = 6, 套装7 = 7, 套装8 = 8, 套装9 = 9, 套装10 = 10}



PropertyData["心源"]={类型="属性"
,戒指={pro="心源",rate=1,status=1}
,耳饰={pro="心源",rate=1,status=1}
,佩饰={pro="心源",rate=1,status=1}
,手镯={pro="心源",rate=1,status=1}
-- ,套装={pro="增加%d%%比例的气血上限",status=2}
,套装={pro="每回合开始有0.25概率触发心源，当前回合造成的伤害增加%d%%的伤害结果",status=2}
,套装1=12,套装2=24,套装3=36,套装4=48,套装5=60,套装6=68,套装7=75,套装8=80,套装9=85,套装10=90}




PropertyData["163"]={类型="属性"
,戒指={pro="无属性",rate=1,status=1}
,耳饰={pro="无属性",rate=1,status=1}
,佩饰={pro="无属性",rate=1,status=1}
,手镯={pro="无属性",rate=1,status=1}
-- ,套装={pro="增加%d%%比例的气血上限",status=2}
,套装={pro="每次角色死亡时候有%d%%几率复活并恢复163点气血,每次复活概率降低20%，当玩家气血刚好为163时，则造成的所有伤害提升%d%%",status=2}
,套装1=20,套装2=30,套装3=40,套装4=45,套装5=50,套装6=55,套装7=60,套装8=70,套装9=80,套装10=90}
function 取随机星石()
	local xsfw={"头盔","饰物","武器","衣甲","腰带","靴子"}
	return xsfw[取随机数(1,#xsfw)]
end

function 取单双加属性(lv)
	if lv==10 then
		return 4,5
	elseif lv==20 then
        return 6,8
    elseif lv==30 then
        return 10,12
    elseif lv==40 then
        return 12,16
    elseif lv==50 then
        return 16,20
    elseif lv==60 then
        return 22,28
    elseif lv==70 then
        return 24,32
    elseif lv==80 then
        return 28,38
    elseif lv==90 then
        return 30,42
    elseif lv==100 then
        return 34,48
    elseif lv==110 then
        return 35,52
    elseif lv==120 then
        return 39,56
    elseif lv==130 then
        return 42,62
    elseif lv==140 then
        return 45,66
    elseif lv==150 then
        return 48,72
    elseif lv==160 then
        return 61,86
    end
end

function 取五行()
	local 五行_ = {"金","木","水","火","土"}
	return 五行_[取随机数(1,5)]
end

function 取灵犀玉特性() --61个
	local 特性_ = {"蔓延","无","无","无","无","无","无","天平","无","无","无","无","相生","无","无","无","无","相克","无","无","无","无","金耀","无","无","无","木耀","无","无","无","无","水耀","无","无","无","火耀","无","无","无","土耀","无","利金","无","无","无","利木","无","无","无","利水","无","无","无","利火","无","无","无","利土","无","无","无"}
	return 特性_[取随机数(1,#特性_)]
end

function 取礼包灵犀玉特性() --61个
	local 特性_ = {"蔓延","天平","相生","相克","金耀","木耀","水耀","火耀","土耀","金耀","木耀","水耀","火耀","土耀","利金","利木","利水","利火","利土","利金","利木","利水","利火","利土"}
	return 特性_[取随机数(1,#特性_)]
end

function 取五宝()
	return 五宝名称[取随机数(1,5)]
end

function 取宝石()
	local 宝石 = {"红玛瑙","太阳石","舍利子","黑宝石","精魄灵石","月亮石","星辉石","光芒石","星辉石","精魄灵石"}--,"神秘石"
	return 宝石[取随机数(1,#宝石)]
end
------------------------------
function 取宝石2()
    local 宝石 = {"红玛瑙","太阳石","舍利子","黑宝石","月亮石","光芒石"}
    return 宝石[取随机数(1,#宝石)]
end
function 取宝石3()
    local 宝石 = {"星辉石"}
    return 宝石[取随机数(1,#宝石)]
end
function 取宝石4()
    local 宝石 = {"精魄灵石"}
    return 宝石[取随机数(1,#宝石)]
end
---------------------------------
function 取强化石()
	local 宝石 = {"青龙石","白虎石","朱雀石","玄武石"}
	return 宝石[取随机数(1,#宝石)]
end

function 取掉落道具()
	local 道具 = {"琉璃护腕","镂空银镯","笼玉镯","嵌宝金腕","玳瑁护腕","七星宝腕","琉璃环","九曲环","笼玉环","嵌宝金环","玳瑁环","七星宝环","琉璃罩甲","连环铠甲","笼玉甲","嵌宝金甲","玳瑁衣","七星宝甲"}
	return 道具[取随机数(1,#道具)]
end

function 取掉落道具2()
	local 道具 = {"圣兽丹","金刚石","定魂珠","避水珠","夜光珠","龙鳞"}
	return 道具[取随机数(1,#道具)]
end

function 取随机灵宝()
	local lb = {"断穹巨剑","静心禅珠","宁心道符","相思寒针","风舞心经","锢魂命谱","青狮獠牙","冥火炼炉","缚仙蛛丝","煞魂冥灯","九霄龙锥","化怨清莲","真阳令旗",
	"天雷音鼓","寒霜盾戟","乾坤金卷","乾坤木卷","乾坤水卷","乾坤火卷","乾坤土卷","定神仙琴","赤炎战笛","护体灵盾","惊兽云尺","战神宝典"}
	return lb[取随机数(1,#lb)]
end

function 取掉落法宝材料()
	local 道具 = {"天蚕丝","玄龟板","阴沉木","麒麟血","内丹","金凤羽","补天石","龙之筋"}
	return 道具[取随机数(1,#道具)]
end
function 秘制食谱子类()
	return {"红罗羹","绿芦羹","玉露羹","百岁香","神仙饮","八珍玉液","五味露","福灵沙","千金露"}
end

function 取暗淡掉落()
    local 道具 = {"五宝盒","宝石袋","九转金丹","高级魔兽要诀","修炼果","摇钱树苗","强化石","三界悬赏令","称号材料礼包","神兜兜","特技书"}
    return 道具[取随机数(1,#道具)]
end
function 取微光掉落()
    local 道具 = {"五宝盒","宝石袋","九转金丹","高级魔兽要诀","修炼果","摇钱树苗","强化石","三界悬赏令","称号材料礼包","神兜兜","特技书"}
    return 道具[取随机数(1,#道具)]
end
function 取发光掉落()
    local 道具 = {"五宝盒","宝石袋","九转金丹","特殊兽诀·碎片","修炼果","摇钱树苗","强化石","三界悬赏令","称号材料礼包","特效宝珠","神兜兜","法宝精华礼包10","特技书"}
    return 道具[取随机数(1,#道具)]
end
function 取耀眼掉落()
    local 道具 ={"五宝盒","宝石袋","九转金丹","特殊兽诀·碎片","修炼果","词条洗练石","摇钱树苗","强化石","三界悬赏令","称号材料礼包","特效宝珠","神兜兜","装备词条石","法宝精华礼包20","特技书"}
    return 道具[取随机数(1,#道具)]
end
function 取奇异掉落()
    local 道具 = {"五宝盒","宝石袋","九转金丹","超级兽诀·碎片","修炼果","装备词条石","摇钱树苗","强化石","属性洗练石","词条洗练石","称号材料礼包","特效宝珠","神兜兜","法宝精华礼包20","特技书"}
    return 道具[取随机数(1,#道具)]
end

function 秘制食谱消耗()
	local lsb = {
	红罗羹={材料=100,活力=25,银子=15000,次数=50},
	绿芦羹={材料=125,活力=25,银子=15000,次数=50},
	玉露羹={材料=150,活力=35,银子=20000,次数=50},
	百岁香={材料=200,活力=35,银子=20000,次数=50},
	神仙饮={材料=250,活力=45,银子=25000,次数=50},
	八珍玉液={材料=275,活力=45,银子=25000,次数=50},
	福灵沙={材料=300,活力=55,银子=30000,次数=50},
	五味露={材料=325,活力=55,银子=30000,次数=50},
	千金露={材料=350,活力=65,银子=40000,次数=50},
	-- 同心肉脯={材料=375,活力=65,银子=40000,次数=5},
	-- 忠义肉脯={材料=1000,活力=75,银子=100000,次数=2},
}
	return lsb
end

function 绑定等级物品()
	local n = {}
	n[1] = {"红缨枪","曲尖枪","锯齿矛","乌金三叉戟","火焰枪","墨杆金钩","玄铁矛","金蛇信","丈八点钢矛","暗夜","梨花","霹雳","刑天之逆","五虎断魂","飞龙在天","天龙破城","弑皇"}
	n[2] = {"青铜斧","开山斧","双面斧","双弦钺","精钢禅钺","黄金钺","乌金鬼头镰","狂魔镰","恶龙之齿","破魄","肃魂","无敌","五丁开山","元神禁锢","护法灭魔","碧血干戚","裂天"}
	n[3] = {"青铜短剑","铁齿剑","吴越剑","青锋剑","龙泉剑","黄金剑","游龙剑","北斗七星剑","碧玉剑","鱼肠","倚天","湛卢","魏武青虹","灵犀神剑","四法青云","霜冷九州","擒龙"}
	n[4] = {"双短剑","镔铁双剑","龙凤双剑","竹节双剑","狼牙双剑","鱼骨双剑","赤焰双剑","墨玉双剑","梅花双剑","阴阳","月光双剑","灵蛇","金龙双剪","连理双树","祖龙对剑","紫电青霜","浮犀"}
	n[5] = {"五色缎带","幻彩银纱","金丝彩带","无极丝","天蚕丝带","云龙绸带","七彩罗刹","缚神绫","九天仙绫","彩虹","流云","碧波","秋水落霞","晃金仙绳","此最相思","揽月摘星","九霄"}
	n[6] = {"铁爪","天狼爪","幽冥鬼爪","青龙牙","勾魂爪","玄冰刺","青刚刺","华光刺","龙鳞刺","撕天","毒牙","胭脂","九阴勾魂","雪蚕之刺","贵霜之牙","忘川三途","离钩"}
	n[7] = {"折扇","铁骨扇","精钢扇","铁面扇","百折扇","劈水扇","神火扇","阴风扇","风云雷电","太极","玉龙","秋风","画龙点睛","秋水人家","逍遥江湖","浩气长舒","星瀚"}
	n[8] = {"细木棒","金丝魔棒","玉如意","点金棒","云龙棒","幽路引魂","满天星","水晶棒","日月光华","沧海","红莲","盘龙","降魔玉杵","青藤玉树","墨玉骷髅","丝萝乔木","醍醐"}
	n[9] = {"松木锤","镔铁锤","八棱金瓜","狼牙锤","烈焰锤","破甲战锤","震天锤","巨灵神锤","天崩地裂","八卦","鬼牙","雷神","混元金锤","九瓣莲花","鬼王蚀日","狂澜碎岳","碎寂"}
	n[10] = {"牛皮鞭","牛筋鞭","乌龙鞭","钢结鞭","蛇骨鞭","玉竹金铃","青藤柳叶鞭","雷鸣嗜血鞭","混元金钩","龙筋","百花","吹雪","游龙惊鸿","仙人指路","血之刺藤","牧云清歌","霜陨"}
	n[11] = {"黄铜圈","精钢日月圈","离情环","金刺轮","风火圈","赤炎环","蛇形月","子母双月","斜月狼牙","如意","乾坤","月光双环","别情离恨","金玉双环","九天金线","无关风月","朝夕"}
	n[12] = {"柳叶刀","苗刀","夜魔弯刀","金背大砍刀","雁翅刀","破天宝刀","狼牙刀","龙鳞宝刀","黑炎魔刀","冷月","屠龙","血刃","偃月青龙","晓风残月","斩妖泣血","业火三灾","鸣鸿"}
	n[13] = {"曲柳杖","红木杖","白椴杖","墨铁拐","玄铁牛角杖","鹰眼法杖","腾云杖","引魂杖","碧玺杖","业焰","玉辉","鹿鸣","庄周梦蝶","凤翼流珠","雪蟒霜寒","碧海潮生","弦月"}
	n[14] = {"硬木弓","铁胆弓","紫檀弓","宝雕长弓","錾金宝弓","玉腰弯弓","连珠神弓","游鱼戏珠","灵犀望月","非攻","幽篁","百鬼","冥火薄天","龙鸣寒水","太极流光","九霄风雷","若木"}
	n[15] = {"琉璃珠","水晶珠","珍宝珠","翡翠珠","莲华珠","夜灵珠","如意宝珠","沧海明珠","无量玉璧","离火","飞星","月华","回风舞雪","紫金葫芦","裂云啸日","云雷万里","赤明"}
	n[16] = {"钝铁重剑","桃印铁刃","赭石巨剑","壁玉长铗","青铜古剑","金错巨刃","惊涛雪","醉浮生","沉戟天戊","鸦九","昆吾","弦歌","墨骨枯麟","腾蛇郁刃","秋水澄流","百辟镇魂","长息"}
	n[18] = {"素纸灯","竹骨灯","红灯笼","鲤鱼灯","芙蓉花灯","如意宫灯","玲珑盏","玉兔盏","冰心盏","蟠龙","云鹤","风荷","金风玉露","凰火燎原","月露清愁","夭桃秾李","荒尘"}
	n[17] = {"油纸伞","红罗伞","紫竹伞","锦绣椎","幽兰帐","琳琅盖","孔雀羽","金刚伞","落梅伞","鬼骨","云梦","枕霞","碧火琉璃","雪羽穿云","月影星痕","浮生归梦","晴雪"}
	n[19] = {{"方巾","簪子"},{"布帽","玉钗",},{"面具","梅花簪子"},{"纶巾","珍珠头带"},{"缨络丝带","凤头钗"},{"羊角盔","媚狐头饰"},{"水晶帽","玉女发冠"},{"乾坤帽","魔女发冠"},{"黑魔冠","七彩花环"},{"白玉龙冠","凤翅金翎"},{"水晶夔帽","寒雉霜蚕"},{"翡翠曜冠","曜月嵌星"},{"金丝黑玉冠","郁金流苏簪"},{"白玉琉璃冠","玉翼附蝉翎"},{"兽鬼珐琅面","鸾羽九凤冠"},{"紫金磐龙冠","金珰紫焰冠"},{"浑天玄火盔","乾元鸣凤冕"}}
	n[20] = {"护身符","五色飞石","珍珠链",{"骷髅吊坠","苍魂珠"},{"江湖夜雨","九宫坠"},{"荧光坠子","高速之星"},{"风月宝链","八卦坠"},{"碧水青龙","鬼牙攫魂"},{"万里卷云","疾风之铃"},"七彩玲珑","黄玉琉佩","鸾飞凤舞","衔珠金凤佩","七璜珠玉佩","鎏金点翠佩","紫金碧玺佩","落霞陨星坠"}
	n[21] = {{"布裙","布衣"},{"丝绸长裙","皮衣"},{"五彩裙","鳞甲"},{"龙鳞羽衣","锁子甲"},{"天香披肩","紧身衣"},{"金缕羽衣","钢甲"},{"霓裳羽衣","夜魔披风"},{"流云素裙","龙骨甲"},{"七宝天衣","死亡斗篷"},{"飞天羽衣","神谕披风"},{"穰花翠裙","珊瑚玉衣"},{"金蚕丝裙","金蚕披风"},{"紫香金乌裙","乾坤护心甲"},{"碧霞彩云衣","蝉翼金丝甲"},{"金丝蝉翼衫","金丝鱼鳞甲"},{"五彩凤翅衣","紫金磐龙甲"},{"鎏金浣月衣","混元一气甲"}}
	n[22] = {"腰带","缎带","银腰带",{"水晶腰带","玉树腰带"},{"琥珀腰链","白面狼牙"},{"乱牙咬","魔童大牙"},{"攫魂铃","双魂引"},{"兽王腰带","百窜云"},{"八卦锻带","圣王坠"},"幻彩玉带","珠翠玉环","金蟾含珠","乾坤紫玉带","琉璃寒玉带","蝉翼鱼佩带","磐龙凤翔带","紫霄云芒带"}
	n[23] = {"布鞋","牛皮靴","马靴","侠客履","神行靴","绿靴","追星踏月","九州履","万里追云履","踏雪无痕","平步青云","追云逐电","乾坤天罡履","七星逐月靴","碧霞流云履","金丝逐日履","辟尘分光履"}
	n[24] = {"竹编护腕","皮腕","针腕","骨镯","青铜护腕","玛瑙护腕","琉璃护腕","镂空银镯","笼玉镯","嵌宝金腕","玳瑁护腕","七星宝腕","缚龙筋","凤翎护腕","织锦彩带","冰蚕丝带"}
	n[25] = {"竹编脖环","钢圈","荆棘环","骨环","青铜颈环","玛瑙石环","琉璃环","九曲环","笼玉环","嵌宝金环","玳瑁环","七星宝环","缚龙圈","鸾尾环","织锦颈圈","冰蚕丝圈"}
	n[26] = {"竹藤甲","皮甲","刺甲","骨排甲","青铜披甲","玛瑙软甲","琉璃罩甲","连环铠甲","笼玉甲","嵌宝金甲","玳瑁衣","七星宝甲","缚龙甲","凤凰彩衣","织锦软褡","冰蚕织甲"}
	n[27] = {"顽石双斧(乾)","镔铁双斧(乾)","黑曜双斧(乾)","枭首双斧(乾)","破军双斧(乾)","隳城双戚(乾)","飞头蛮(乾)","竹叶青(乾)","鲛煞(乾)","啖月(乾)","义战(乾)","恶来(乾)","烬世野火(乾)","九州海沸(乾)","八狱末劫(乾)","罗喉计都(乾)","非天(乾)"} --九黎城7.15
            n[28] = {"顽石双斧(坤)","镔铁双斧(坤)","黑曜双斧(坤)","枭首双斧(坤)","破军双斧(坤)","隳城双戚(坤)","飞头蛮(坤)","竹叶青(坤)","鲛煞(坤)","啖月(坤)","义战(坤)","恶来(坤)","烬世野火(坤)","九州海沸(坤)","八狱末劫(坤)","罗喉计都(坤)","非天(坤)"} --九黎城7.15
    return n
end

function 取装备序列(名称)
    local 装备表 = 绑定等级物品()
    for i, 装备组 in ipairs(装备表) do
        for n, 装备子组 in ipairs(装备组) do
            if type(装备子组) == "table" then
                for _, 装备 in ipairs(装备子组) do
                    if 装备 == 名称 then
                        return i
                    end
                end
            else
                if 装备子组 == 名称 then
                    return i
                end
            end
        end
    end
end
function 取装备序列1(名称)----C改
    local 装备表=绑定等级物品()
    for i=1,#装备表 do
        for n=1,#装备表[i] do
            if type(装备表[i][n])=="table" then
                for s=1,#装备表[i][n] do
                    if 装备表[i][n][s] == 名称  then
                        return i
                    end
                end
            elseif 装备表[i][n] == 名称  then
                return i
            end
        end
    end
end

function 取可佩带武器名称(模型,等级)
  local n={}
  local 子类 = 角色武器类型[模型]
  -- print(模型)
  --table.print(子类)
  local 佩戴 = 子类[取随机数(1,#子类)]
  local 序列 = 0
  if 等级<=99 then
    序列=9
  elseif 等级<=109 then
    序列=11
  elseif 等级<=119 then
    序列=12
  elseif 等级<=129 then
    序列=13
  elseif 等级<=139 then
    序列=14
  elseif 等级<=149 then
    序列=15
  elseif 等级<=159 then
    序列=16
  else
    序列=17
  end
  n[1] = {"红缨枪","曲尖枪","锯齿矛","乌金三叉戟","火焰枪","墨杆金钩","玄铁矛","金蛇信","丈八点钢矛","暗夜","梨花","梨花","刑天之逆","五虎断魂","飞龙在天","天龙破城","弑皇"}
  n[2] = {"青铜斧","开山斧","双面斧","双弦钺","精钢禅钺","黄金钺","乌金鬼头镰","狂魔镰","恶龙之齿","破魄","肃魂","无敌","五丁开山","元神禁锢","护法灭魔","碧血干戚","裂天"}
  n[3] = {"青铜短剑","铁齿剑","吴越剑","青锋剑","龙泉剑","黄金剑","游龙剑","北斗七星剑","碧玉剑","鱼肠","倚天","湛卢","魏武青虹","灵犀神剑","四法青云","霜冷九州","擒龙"}
  n[4] = {"双短剑","镔铁双剑","龙凤双剑","竹节双剑","狼牙双剑","鱼骨双剑","赤焰双剑","墨玉双剑","梅花双剑","阴阳","月光双剑","灵蛇","金龙双剪","连理双树","祖龙对剑","紫电青霜","浮犀"}
  n[5] = {"五色缎带","幻彩银纱","金丝彩带","无极丝","天蚕丝带","云龙绸带","七彩罗刹","缚神绫","九天仙绫","彩虹","流云","碧波","秋水落霞","晃金仙绳","此最相思","揽月摘星","九霄"}
  n[6] = {"铁爪","天狼爪","幽冥鬼爪","青龙牙","勾魂爪","玄冰刺","青刚刺","华光刺","龙鳞刺","撕天","毒牙","胭脂","九阴勾魂","雪蚕之刺","贵霜之牙","忘川三途","离钩"}
  n[7] = {"折扇","铁骨扇","精钢扇","铁面扇","百折扇","劈水扇","神火扇","阴风扇","风云雷电","太极","玉龙","秋风","画龙点睛","秋水人家","逍遥江湖","浩气长舒","星瀚"}
  n[8] = {"细木棒","金丝魔棒","玉如意","点金棒","云龙棒","幽路引魂","满天星","水晶棒","日月光华","沧海","红莲","盘龙","降魔玉杵","青藤玉树","墨玉骷髅","丝萝乔木","醍醐"}
  n[9] = {"松木锤","镔铁锤","八棱金瓜","狼牙锤","烈焰锤","破甲战锤","震天锤","巨灵神锤","天崩地裂","八卦","鬼牙","雷神","混元金锤","九瓣莲花","鬼王蚀日","狂澜碎岳","碎寂"}
  n[10] = {"牛皮鞭","牛筋鞭","乌龙鞭","钢结鞭","蛇骨鞭","玉竹金铃","青藤柳叶鞭","雷鸣嗜血鞭","混元金钩","龙筋","百花","吹雪","游龙惊鸿","仙人指路","血之刺藤","牧云清歌","霜陨"}
  n[11] = {"黄铜圈","精钢日月圈","离情环","金刺轮","风火圈","赤炎环","蛇形月","子母双月","斜月狼牙","如意","乾坤","月光双环","别情离恨","金玉双环","九天金线","无关风月","朝夕"}
  n[12] = {"柳叶刀","苗刀","夜魔弯刀","金背大砍刀","雁翅刀","破天宝刀","狼牙刀","龙鳞宝刀","黑炎魔刀","冷月","屠龙","血刃","偃月青龙","晓风残月","斩妖泣血","业火三灾","鸣鸿"}
  n[13] = {"曲柳杖","红木杖","白椴杖","墨铁拐","玄铁牛角杖","鹰眼法杖","腾云杖","引魂杖","碧玺杖","业焰","玉辉","鹿鸣","庄周梦蝶","凤翼流珠","雪蟒霜寒","碧海潮生","弦月"}
  n[14] = {"硬木弓","铁胆弓","紫檀弓","宝雕长弓","錾金宝弓","玉腰弯弓","连珠神弓","游鱼戏珠","灵犀望月","非攻","幽篁","百鬼","冥火薄天","龙鸣寒水","太极流光","九霄风雷","若木"}
  n[15] = {"琉璃珠","水晶珠","珍宝珠","翡翠珠","莲华珠","夜灵珠","如意宝珠","沧海明珠","无量玉璧","离火","飞星","月华","回风舞雪","紫金葫芦","裂云啸日","云雷万里","赤明"}
  n[16] = {"钝铁重剑","桃印铁刃","赭石巨剑","壁玉长铗","青铜古剑","金错巨刃","惊涛雪","醉浮生","沉戟天戊","鸦九","昆吾","弦歌","墨骨枯麟","腾蛇郁刃","秋水澄流","百辟镇魂","长息"}
  n[17] = {"油纸伞","红罗伞","紫竹伞","锦绣椎","幽兰帐","琳琅盖","孔雀羽","金刚伞","落梅伞","鬼骨","云梦","枕霞","碧火琉璃","雪羽穿云","月影星痕","浮生归梦","晴雪"}
  n[18] = {"素纸灯","竹骨灯","红灯笼","鲤鱼灯","芙蓉花灯","如意宫灯","玲珑盏","玉兔盏","冰心盏","蟠龙","云鹤","风荷","金风玉露","凰火燎原","月露清愁","夭桃秾李","荒尘"}
  return {n[佩戴][序列],(序列-1)*10}
end


function 取真随机装备名称(等级,类型)-------C改
    -- local 书铁范围 = {"枪矛","斧钺","剑","双短剑","飘带","爪刺","扇","魔棒","锤","鞭","环圈","刀","法杖","弓弩","宝珠","巨剑","伞","灯笼","头盔","发钗","项链","女衣","男衣","腰带","鞋子"}
    local 随机装备=绑定等级物品()
    local 临时等级=等级
    local 临时参数=取随机数(1,#书铁范围)
    if 取随机数()<=30 then
        临时参数=取随机数(19,#书铁范围)
    end
    if 类型 then
        临时参数 = 类型
    end
    local 临时序列=临时参数
    if 临时序列==25 then
     临时序列=23
    elseif 临时序列==24 then
     临时序列=22
    elseif 临时序列==23 or 临时序列==22 then
     临时序列=21
    elseif 临时序列==21 then
     临时序列=20
    elseif 临时序列==20 or 临时序列==19 then
     临时序列=19
    end

    local 临时类型=随机装备[临时序列][临时等级+1]
    if type(临时类型)=="table" then
       if 临时参数 ==23 then
         临时类型=临时类型[2]
        elseif 临时参数 ==22 then
         临时类型=临时类型[1]
        elseif 临时参数 ==20 then
         临时类型=临时类型[2]
        elseif 临时参数 ==19 then
         临时类型=临时类型[1]
        else
          临时类型=临时类型[取随机数(1,2)]
        end
     end
 return 临时类型
end

function 取随机装备名称(等级,类型)
	-- local 书铁范围 = {"枪矛","斧钺","剑","双短剑","飘带","爪刺","扇","魔棒","锤","鞭","环圈","刀","法杖","弓弩","宝珠","巨剑","伞","灯笼","头盔","发钗","项链","女衣","男衣","腰带","鞋子"}
	local 随机装备=绑定等级物品()
	local 临时等级=等级
	local 临时参数=取随机数(1,#书铁范围)
	if 取随机数()<=40 then
	    临时参数=取随机数(19,#书铁范围)
	end
	if 类型 then
		临时参数 = 类型
	end
	local 临时序列=临时参数
	if 临时序列==25 then
	 临时序列=23
	elseif 临时序列==24 then
	 临时序列=22
	elseif 临时序列==23 or 临时序列==22 then
	 临时序列=21
	elseif 临时序列==21 then
	 临时序列=20
	elseif 临时序列==20 or 临时序列==19 then
	 临时序列=19
	end
	if 临时序列<=18 and 临时等级>=9 then --是武器 10-12是普通光武
	 临时等级=取随机数(10,12)
	else
	  if 临时等级>=12 then
		 临时等级=10
		end
	end
	local 临时类型=随机装备[临时序列][临时等级+1]
	if type(临时类型)=="table" then
	   if 临时参数 ==23 then
		 临时类型=临时类型[2]
		elseif 临时参数 ==22 then
		 临时类型=临时类型[1]
		elseif 临时参数 ==20 then
		 临时类型=临时类型[2]
		elseif 临时参数 ==19 then
		 临时类型=临时类型[1]
		else
		  临时类型=临时类型[取随机数(1,2)]
		end
	 end
 return 临时类型
end

function 取官职任务物品(id)
	local 物品名称=装备处理类.打造物品[取随机数(1,23)][取随机数(5,9)]
	if type(物品名称)=="table" then
		物品名称=物品名称[取随机数(1,#物品名称)]
	end
 return 物品名称
end

function 取武器数据(名称,级别)
	if 名称==nil or 级别==nil then return  end
	local 道具 = 物品类()
	道具:置对象(名称)
	道具.等级 = 级别
	return {名称=名称,等级=级别,子类=道具.子类}
end

function 法宝公式(内丹,材料1,材料2,法宝,天珠)
	if 材料1 =="天蚕丝金" and 材料2=="金凤羽土"  and 内丹=="内丹水"  and 法宝 == nil and 天珠== nil then
		return {"碧玉葫芦","风袋","幽灵珠"}
	elseif 材料1 =="天蚕丝金" and 材料2=="玄龟板水"  and 内丹=="内丹土"  and 法宝 == nil and 天珠== nil then
	 	return {"金甲仙衣","鬼脸面具","玄冰面具"}
	elseif 材料1 =="天蚕丝金" and 材料2=="阴沉木木"  and 内丹=="内丹水"  and 法宝 == nil and 天珠== nil then
	 	return {"缚妖索","清心咒","五色旗盒","迷魂灯","现形符","断线木偶","混元伞"}
	elseif 材料1 =="天蚕丝金" and 材料2=="麒麟血水"  and 内丹=="内丹土"  and 法宝 == nil and 天珠== nil then
	 	return {"嗜血幡","织女扇","雷兽","定风珠","万鬼幡","五彩娃娃"}
	elseif 材料1 =="玄龟板水" and 材料2=="补天石土"  and 内丹=="内丹木"  and 法宝 == nil and 天珠== nil then
	 	return {"飞剑","九黎战鼓","盘龙壁","神行飞剑","汇灵盏"}
	elseif 材料1 =="麒麟血水" and 材料2=="补天石土"  and 内丹=="内丹木"  and 法宝 == nil and 天珠== nil then
	 	return {"拭剑石","金钱镖","天师符"}
	elseif 材料1 =="麒麟血水" and 材料2=="阴沉木木"  and 内丹=="内丹火"  and 法宝 == nil and 天珠== nil then
	 	return {"发瘟匣","影蛊"}
	elseif 材料1 =="麒麟血火" and 材料2=="补天石土"  and 内丹=="内丹水"  and 法宝 == nil and 天珠== nil then
	 	return {"聚妖铃","番天印"}
	elseif 材料1 =="阴沉木木" and 材料2=="补天石土"  and 内丹=="内丹火"  and 法宝 == nil and 天珠== nil then
	 	return{"惊魂铃"}
	elseif 材料1 =="龙之筋金" and 材料2=="金凤羽土"  and 内丹=="内丹水"  and 法宝 == nil and 天珠== nil then
	 	return {"捆仙绳"}
	elseif 材料1 =="补天石土" and 材料2=="阴沉木木"  and 内丹=="内丹火"  and 法宝 == nil and 天珠== nil then
	 	return {"缩地尺"}
	elseif 材料1 =="龙之筋金" and 材料2=="麒麟血水"  and 内丹=="内丹土"  and 法宝 == nil and 天珠== "三眼天珠木" then
	 	return {"七杀"}
	elseif 材料1 =="天蚕丝金" and 材料2=="阴沉木木"  and 内丹=="内丹水"  and 法宝 == nil and 天珠== "三眼天珠火" then
	 	return {"罗汉珠"}
	 elseif 材料1 =="麒麟血火" and 材料2=="补天石土"  and 内丹=="内丹水"  and 法宝 == nil and 天珠== "三眼天珠金" then
	 	return {"分水"}
	elseif 材料1 =="金凤羽土" and 材料2=="玄龟板水"  and 内丹=="内丹木"  and 法宝 == nil and 天珠== "三眼天珠金" then
	 	return {"赤焰"}
	elseif 材料1 =="补天石土" and 材料2=="金凤羽木"  and 内丹=="内丹火"  and 法宝 == nil and 天珠== "三眼天珠金" then
	 	return {"金刚杵"}
	elseif 材料1 =="麒麟血水" and 材料2=="阴沉木木"  and 内丹=="内丹火"  and 法宝 == nil and 天珠== "三眼天珠金" then
	 	return {"兽王令"}
	elseif 材料1 =="补天石木" and 材料2=="金凤羽土"  and 内丹=="内丹火"  and 法宝 == nil and 天珠== "三眼天珠金" then
	 	return {"摄魂","降魔斗篷"}
	 elseif 材料1 =="阴沉木木" and 材料2=="金凤羽土"  and 内丹=="内丹火"  and 法宝 == nil and 天珠== "三眼天珠金" then
	 	return{"附灵玉"}
	elseif 材料1 =="补天石土" and 材料2=="麒麟血水"  and 内丹=="内丹木"  and 法宝 == "飞剑金" and 天珠== "九眼天珠火" then
	 	return {"干将莫邪"}
	elseif 材料1 =="补天石土" and 材料2=="玄龟板水"  and 内丹=="内丹木"  and 法宝 == "碧玉葫芦金" and 天珠== "九眼天珠火"  then
	 	return {"慈悲"}
	elseif 材料1 =="金凤羽金" and 材料2=="玄龟板水"  and 内丹=="内丹土"  and 法宝 ==  "织女扇木" and 天珠== "九眼天珠火"  then
	 	return {"曼陀罗"}
	elseif 材料1 =="天蚕丝金" and 材料2=="麒麟血水"  and 内丹=="内丹土"  and 法宝 == "风袋火" and 天珠== "九眼天珠木"  then
	 	return {"救命毫毛"}
	elseif 材料1 =="麒麟血火" and 材料2=="补天石土"  and 内丹=="内丹水"  and 法宝 == "雷兽木" and 天珠== "九眼天珠金"  then
	 	return {"伏魔天书"}
	elseif 材料1 =="补天石土" and 材料2=="阴沉木木"  and 内丹=="内丹火"  and 法宝 ==  "碧玉葫芦金" and 天珠== "九眼天珠水"  then
	 	return {"普渡"}
	elseif 材料1 =="玄龟板木" and 材料2=="麒麟血火"  and 内丹=="内丹水"  and 法宝 ==  "飞剑金" and 天珠== "九眼天珠土"  then
	 	return {"镇海珠"}
	elseif 材料1 =="天蚕丝金" and 材料2=="金凤羽水"  and 内丹=="内丹土"  and 法宝 ==  "定风珠木" and 天珠== "九眼天珠火"  then
	 	return {"奇门五行令"}
	elseif 材料1 =="麒麟血火" and 材料2=="补天石土"  and 内丹=="内丹水"  and 法宝 ==  "惊魂铃金" and 天珠== "九眼天珠木"  then
	 	return {"失心钹"}
	elseif 材料1 =="金凤羽金" and 材料2=="玄龟板水"  and 内丹=="内丹土"  and 法宝 ==  "清心咒木" and 天珠== "九眼天珠火"  then
	 	return {"五火神焰印"}
	elseif 材料1 =="麒麟血金" and 材料2=="补天石水"  and 内丹=="内丹土"  and 法宝 == "金钱镖木" and 天珠== "九眼天珠火"  then
	 	return {"九幽"}
	elseif 材料1 =="天蚕丝金" and 材料2=="金凤羽水"  and 内丹=="内丹土"  and 法宝 == "迷魂灯木"  and 天珠== "九眼天珠火" then
	 	return {"忘情"}
	elseif 材料1 =="补天石土" and 材料2=="麒麟血水"  and 内丹=="内丹木"  and 法宝 == "金钱镖火"  and 天珠== nil then
	 	return {"落雨金钱","落宝金钱"}
	elseif 材料1 =="补天石土" and 材料2=="玄龟板水"  and 内丹=="内丹木"  and 法宝 == "金钱镖火"  and 天珠== nil then
	 	return {"聚宝盆"}
	elseif 材料1 =="天蚕丝金" and 材料2=="阴沉木木"  and 内丹=="内丹木"  and 法宝 == "风袋火"  and 天珠== nil then
	 	return {"无魂傀儡"}
	elseif 材料1 =="天蚕丝金" and 材料2=="麒麟血水"  and 内丹=="内丹土"  and 法宝 == "风袋木"  and 天珠== nil then
	 	return {"苍白纸人"}
	elseif 材料1 =="天蚕丝金" and 材料2=="龙之筋木"  and 内丹=="内丹土"  and 法宝 == "缚妖索水"  and 天珠== nil then
	 	return {"缚龙索"}
	elseif 材料1 =="阴沉木木" and 材料2=="补天石土"  and 内丹=="内丹火"  and 法宝 == "缚妖索金"  and 天珠== nil then
	 	return {"照妖镜"}
	elseif 材料1 =="龙之筋金" and 材料2=="阴沉木木"  and 内丹=="内丹水"  and 法宝 == "缚妖索火"  and 天珠== nil then
	 	return {"鬼泣"}
	elseif 材料1 =="补天石土" and 材料2=="麒麟血水"  and 内丹=="内丹土"  and 法宝 == "嗜血幡火"  and 天珠== nil then
	 	return {"乾坤玄火塔"}
	elseif 材料1 =="补天石土" and 材料2=="阴沉木木"  and 内丹=="内丹火"  and 法宝 == "嗜血幡金"  and 天珠== nil then
	 	return {"无字经"}
	elseif 材料1 =="天蚕丝金" and 材料2=="阴沉木木"  and 内丹=="内丹水"  and 法宝 == "嗜血幡火"  and 天珠== nil then
	 	return {"无尘扇"}
	elseif 材料1 =="补天石土" and 材料2=="玄龟板水"  and 内丹=="内丹木"  and 法宝 == "碧玉葫芦火"  and 天珠== nil then
	 	return {"通灵宝玉"}
	elseif 材料1 =="补天石土" and 材料2=="阴沉木木"  and 内丹=="内丹火"  and 法宝 == "鬼脸面具金"  and 天珠== nil then
	 	return{"神木面具"}
	elseif 材料1 =="补天石土" and 材料2=="玄龟板水"  and 内丹=="内丹木"  and 法宝 == "飞剑火"  and 天珠== nil then
	 	return {"月光宝盒"}
	elseif 材料1 =="天蚕丝金" and 材料2=="阴沉木木"  and 内丹=="内丹水"  and 法宝 == "清心咒火"  and 天珠== nil then
	 	return{"七宝玲珑灯"}
	elseif 材料1 =="补天石土" and 材料2=="天蚕丝金"  and 内丹=="内丹木"  and 法宝 == "飞剑木"  and 天珠== nil then
	 	return {"月影"}
	elseif 材料1 =="阴沉木木" and 材料2=="麒麟血金"  and 内丹=="内丹木"  and 法宝 == "迷魂灯金"  and 天珠== nil then
	 	return {"神木宝鼎"}
	elseif 材料1 =="玄龟板水" and 材料2=="补天石土"  and 内丹=="内丹木"  and 法宝 == "飞剑金"  and 天珠== nil then
	 	return {"斩魔"}
	elseif 材料1 =="阴沉木木" and 材料2=="天蚕丝金"  and 内丹=="内丹火"  and 法宝 == "迷魂灯金"  and 天珠== nil then
	 	return {"天煞"}
	elseif 材料1 =="补天石土" and 材料2=="玄龟板木"  and 内丹=="内丹金"  and 法宝 == "迷魂灯木"  and 天珠== nil then
	 	return {"金蟾"}
	elseif 材料1 =="补天石土" and 材料2=="阴沉木木"  and 内丹=="内丹火"  and 法宝 == "迷魂灯火"  and 天珠== nil then
	 	return {"宝烛"}
	elseif 材料1 =="补天石土" and 材料2=="麒麟血火"  and 内丹=="内丹土"  and 法宝 == "迷魂灯火"  and 天珠== nil then
	 	return {"天煞"}

	elseif 材料1 =="金凤羽金" and 材料2=="玄龟板水"  and 内丹=="内丹土"  and 法宝 ==  "九黎战鼓木" and 天珠== "九眼天珠火"  then
	 	return {"重明战鼓"}
	elseif 材料1 =="补天石土" and 材料2=="玄龟板水"  and 内丹=="内丹木"  and 法宝 == "金甲仙衣金" and 天珠== "九眼天珠火"  then
	 	return {"梦云幻甲"}
	elseif 材料1 =="补天石土" and 材料2=="麒麟血水"  and 内丹=="内丹木"  and 法宝 == "清心咒金" and 天珠== "九眼天珠火" then
	 	return {"河图洛书"}
	elseif 材料1 =="天蚕丝金" and 材料2=="麒麟血水"  and 内丹=="内丹土"  and 法宝 == "定风珠火" and 天珠== "九眼天珠木"  then
	 	return {"炽焰丹珠"}
	elseif 材料1 =="麒麟血火" and 材料2=="补天石土"  and 内丹=="内丹水"  and 法宝 == "盘龙壁木" and 天珠== "九眼天珠金"  then
	 	return {"翡翠芝兰"}
	elseif 材料1 =="补天石土" and 材料2=="阴沉木木"  and 内丹=="内丹火"  and 法宝 ==  "汇灵盏金" and 天珠== "九眼天珠水"  then
	 	return {"太虚玉液"}
	elseif 材料1 =="玄龟板木" and 材料2=="麒麟血火"  and 内丹=="内丹水"  and 法宝 ==  "盘龙壁金" and 天珠== "九眼天珠土"  then
	 	return {"蟠龙玉璧"}
	elseif 材料1 =="天蚕丝金" and 材料2=="金凤羽水"  and 内丹=="内丹土"  and 法宝 ==  "碧玉葫芦木" and 天珠== "九眼天珠火"  then
	 	return {"九梵清莲"}
	elseif 材料1 =="麒麟血火" and 材料2=="补天石土"  and 内丹=="内丹水"  and 法宝 ==  "织女扇金" and 天珠== "九眼天珠木"  then
	 	return {"苍灵雪羽"}
	elseif 材料1 =="金凤羽金" and 材料2=="玄龟板水"  and 内丹=="内丹土"  and 法宝 ==  "天师符木" and 天珠== "九眼天珠火"  then
	 	return {"烽火狼烟"}
	elseif 材料1 =="麒麟血金" and 材料2=="补天石水"  and 内丹=="内丹土"  and 法宝 == "织女扇木" and 天珠== "九眼天珠火"  then
	 	return {"舞雪冰蝶"}
	elseif 材料1 =="天蚕丝金" and 材料2=="金凤羽水"  and 内丹=="内丹土"  and 法宝 == "天师符木"  and 天珠== "九眼天珠火" then
	 	return {"紫火如意"}

	elseif 材料1 =="金凤羽金" and 材料2=="玄龟板水"  and 内丹=="内丹土"  and 法宝 ==  "天师符木" and 天珠== "九眼天珠火"  then
	 	return {"凌波仙符"}
	elseif 材料1 =="补天石土" and 材料2=="玄龟板水"  and 内丹=="内丹木"  and 法宝 == "雷兽金" and 天珠== "九眼天珠火"  then
	 	return {"归元圣印"}
	elseif 材料1 =="补天石土" and 材料2=="麒麟血水"  and 内丹=="内丹木"  and 法宝 == "飞剑金" and 天珠== "九眼天珠火" then
	 	return {"落星飞鸿"}
	elseif 材料1 =="天蚕丝金" and 材料2=="麒麟血水"  and 内丹=="内丹土"  and 法宝 == "拭剑石火" and 天珠== "九眼天珠木"  then
	 	return {"流影云笛"}
	elseif 材料1 =="麒麟血火" and 材料2=="补天石土"  and 内丹=="内丹水"  and 法宝 == "风袋木" and 天珠== "九眼天珠金"  then
	 	return {"软烟罗锦"}
	elseif 材料1 =="补天石土" and 材料2=="阴沉木木"  and 内丹=="内丹火"  and 法宝 ==  "盘龙壁金" and 天珠== "九眼天珠水"  then
	 	return {"谷玄星盘"}
	elseif 材料1 =="玄龟板木" and 材料2=="麒麟血火"  and 内丹=="内丹水"  and 法宝 ==  "九黎战鼓金" and 天珠== "九眼天珠土"  then
	 	return {"千斗金樽"}
	elseif 材料1 =="天蚕丝金" and 材料2=="金凤羽水"  and 内丹=="内丹土"  and 法宝 ==  "飞剑木" and 天珠== "九眼天珠火"  then
	 	return {"宿幕星河"}
	elseif 材料1 =="麒麟血火" and 材料2=="补天石土"  and 内丹=="内丹水"  and 法宝 ==  "金甲仙衣金" and 天珠== "九眼天珠木"  then
	 	return {"北冥巨鳞"}
	elseif 材料1 =="金凤羽金" and 材料2=="玄龟板水"  and 内丹=="内丹土"  and 法宝 ==  "嗜血幡木" and 天珠== "九眼天珠火"  then
	 	return {"血魄元幡"}
	elseif 材料1 =="麒麟血金" and 材料2=="补天石水"  and 内丹=="内丹土"  and 法宝 == "拭剑石木" and 天珠== "九眼天珠火"  then
	 	return {"冷龙石磐"}
	elseif 材料1 =="天蚕丝金" and 材料2=="金凤羽水"  and 内丹=="内丹土"  and 法宝 == "风袋木"  and 天珠== "九眼天珠火" then
	 	return {"琉璃云罩"}
	elseif 材料1 =="金凤羽金" and 材料2=="玄龟板水"  and 内丹=="内丹土"  and 法宝 ==  "金甲仙衣木" and 天珠== "九眼天珠火"  then
	 	return {"璞玉灵钵"}
	end
	return  {}
end
指定叠加={
	符石卷轴=1,
}
function 检测叠加规则(道具,道具1)--
	if 道具 and 道具1 and 道具.名称 and 道具1.名称 and 道具.名称==道具1.名称  and 指定叠加[道具.名称] then
	 return true
	end
   if not 道具 or not 道具1 or not 道具.名称 or not 道具1.名称 or 道具.名称~=道具1.名称 then
	 return false
	end


	if not  道具 or 道具.总类 == "元身"  or not 道具1 or 道具1.总类 == "元身" or 道具.加锁  or 道具1.加锁 or 道具.总类==2 or  道具1.总类==2 or  道具.总类=="法宝" or  道具.总类==891 or  道具.总类==889 or  道具1.总类==891 or  道具1.总类==889  or  道具1.总类=="法宝" or  道具1.总类=="灵宝"  or  道具.总类=="灵宝" then
	    return false
	end
	if 道具1.专用 and not 道具.专用 then
             return false
	elseif 道具.专用 and not 道具1.专用 then
	  return false
	end
	return true
end
function 取物品数据(wd)
	local wds={}
	if ItemData[wd] then
	    for i=1,22 do
	    	if ItemData[wd]["wp_"..i] then
	    	    wds[i]=ItemData[wd]["wp_"..i]
	    	end
	    end
	end
	return table.copy(wds)
end

function 获取__物品数据()
    ItemData=ReadExcel1("物品数据","")

ItemData["五色灵尘袋"]={
        wp_1 = "右键使用可获得一枚1级五色灵尘。"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 0x10000092
        ,wp_13 = 0x10000088
        }
    ItemData["五色灵尘"]={
        wp_1 = "五色蕴灵，万物再生。女娲一族赐予的圣物，将其嵌入上古玉魄，可强化其附加属性。"
        ,wp_2 = "五色灵尘"
        ,wp_3 = 6
        ,wp_4 = 8
        ,wp_8 = "玉魄"
        ,wp_9 = "提高20点躲避力"
        ,wp_11 = "月卡.wdf"
        ,wp_12 = 0x10000092
        ,wp_13 = 0x10000088
        }
     ItemData["上古玉魄·阳"]={
        wp_1 = "神玉遗世待天命，固命魂兮御阴阳。女娲一族所打造，其内蕴藏着圣玉之灵魂，可用来激活命魂之玉的阳性灵气。"
        ,wp_2 = "上古玉魄"
        ,wp_3 = 10
        ,wp_4 = 1
        ,wp_5 = 160
        ,wp_11 = "月卡.wdf"
        ,wp_12 = 0x10000102
        ,wp_13 = 0x10000100
        --新增玉魄
        }
    ItemData["上古玉魄·阴"]={
        wp_1 = "神玉遗世待天命，固命魂兮御阴阳。女娲一族所打造，其内蕴藏着圣玉之灵魂，可用来激活命魂之玉的阳性灵气。"
        ,wp_2 = "上古玉魄"
        ,wp_3 = 11
        ,wp_4 = 2
        ,wp_5 = 160
        ,wp_11 = "月卡.wdf"
        ,wp_12 = 0x10000105
        ,wp_13 = 0x10000101
        --新增玉魄
        }
    ItemData["女娲祝符"]={
        wp_1 = "娲黄施慧，明心秒手。蕴含女娲福力的符篆，将其福力嵌入上古玉魄，可在战斗中通过“奇袭”指令使用该物品。"
        ,wp_2 = "玉魄镶嵌"
        ,wp_3 = 11
        ,wp_4 = 2
        ,wp_5 = 160
        ,wp_11 = "月卡.wdf"
        ,wp_12 = 0x10000091
        ,wp_13 = 0x10000095
        --新增玉魄
        }
    ItemData["女娲灵契"]={
        wp_1 = "娲黄施慧，技定乾坤。蕴含女娲福力的法印，将其灵力嵌入上古玉魄，可在战斗中通过“奇袭”指令使用该技能。"
        ,wp_2 = "玉魄镶嵌"
        ,wp_3 = 11
        ,wp_4 = 2
        ,wp_5 = 160
        ,wp_11 = "月卡.wdf"
        ,wp_12 = 0x10000093
        ,wp_13 = 0x10000097
        --新增玉魄
        }

    ItemData["炫彩ID"]={
        wp_1 = "可以改变ID特效，用以展示实力！"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wd2"
        ,wp_12 = 3050410398 --小
        ,wp_13 = 95070066
        }


        ItemData["玄天残卷·上卷"]={
        wp_1 = "上古神力编撰而成的玄天卷法了凑齐上中下三卷可以到宠物仙子那里兑换一颗圣兽丹。"
        ,wp_2 = 681
        ,wp_11=""
        ,wp_12 = 0xC3AF882B
        ,wp_13 = 0xCFB770DD
        }
    ItemData["玄天残卷·中卷"]={
        wp_1 = "上古神力编撰而成的玄天卷法了凑齐上中下三卷可以到宠物仙子那里兑换一颗圣兽丹。"
        ,wp_2 = 681
        ,wp_11=""
        ,wp_12 = 0x559D05B9
        ,wp_13 = 0x95C4E6EC
        }
    ItemData["玄天残卷·下卷"]={
        wp_1 = "上古神力编撰而成的玄天卷法了凑齐上中下三卷可以到宠物仙子那里兑换一颗圣兽丹。"
        ,wp_2 = 681
        ,wp_11=""
        ,wp_12 = 0xF91379E1
        ,wp_13 = 0xEC1B5658
        }

    ItemData["星虹蝶影"]={
        wp_1 = "嘈嘈切切错杂弹，大珠小珠落玉盘。"
        ,wp_3 = 17
        ,wp_2 = 2
        ,wp_4 = 3
        ,wp_5 = 0
        ,wp_12 = 0xDAE844A8
        ,wp_13= 0x9134A488
        }
    ItemData["蛙蛙落泪"]={
        wp_1 = "嘈嘈切切错杂弹，大珠小珠落玉盘。"
        ,wp_3 = 17
        ,wp_2 = 2
        ,wp_4 = 3
        ,wp_5 = 0
        ,wp_12 = 0xDAE844A8
        ,wp_13= 0x9134A488
        }
    ItemData["龙游鱼跃"]={
        wp_1 = "嘈嘈切切错杂弹，大珠小珠落玉盘。"
        ,wp_3 = 17
        ,wp_2 = 2
        ,wp_4 = 3
        ,wp_5 = 0
        ,wp_12 = 0xDAE844A8
        ,wp_13= 0x9134A488
        }
        ----------------------灵饰
    ItemData["翠叶环"]={
        wp_1 = "以翠色欲滴的嫩叶为耳饰，似乎可见盎然春意。"
        ,wp_2 = 2
        ,wp_3 = 10
        ,wp_4 = 1
        ,wp_5 = 60
        ,wp_11 = "item.wd1"
        ,wp_12 = 0x447CB949
        ,wp_13 = 0x841B1A0B
        }
    ItemData["明月珰"]={
        wp_1 = "珍珠如明月，盈盈有辉光；故名为明月珰。"
        ,wp_2 = 2
        ,wp_3 = 10
        ,wp_4 = 1
        ,wp_5 = 80
        ,wp_11 = "item.wd1"
        ,wp_12 = 0xD99DA265
        ,wp_13 = 0xED4BFC24
        }
    ItemData["玉蝶翩"]={
        wp_1 = "彩蝶成双，翩然而舞；有双蝶偶然停驻于灵泉之畔，感其气息，化而为此玉饰。"
        ,wp_2 = 2
        ,wp_3 = 10
        ,wp_4 = 1
        ,wp_5 = 100
        ,wp_11 = "item.wd1"
        ,wp_12 = 0xDC6E80FB
        ,wp_13 = 0x0890D479
        }
    ItemData["点星芒"]={
        wp_1 = "福禄寿三星以自身星芒点化而成的异石，紫芒莹然，贵不可言。"
        ,wp_2 = 2
        ,wp_3 = 10
        ,wp_4 = 1
        ,wp_5 = 120
        ,wp_11 = "item.wd1"
        ,wp_12 = 0x97353053
        ,wp_13 = 0x718C161F
        }
    ItemData["凤羽流苏"]={
        wp_1 = "灵凤舞九霄，振翼遗金羽；仙人偶得，以火元培之、以仙气养之，又缀以流苏，成一耳饰。静心而听，有凤鸣隐隐，奏大道之声。"
        ,wp_2 = 2
        ,wp_3 = 10
        ,wp_4 = 1
        ,wp_5 = 140
        ,wp_11 = "item.wd1"
        ,wp_12 = 0x32534D07
        ,wp_13 = 0xC855E37F
        }
    ItemData["焰云霞珠"]={
        wp_1 = "后羿射日，十去其九；三足金乌之血化为丹霞，灼烈而烧，火光冲天。许久之后，其血方凝为此珠，赤光熠然。"
        ,wp_2 = 2
        ,wp_3 = 10
        ,wp_4 = 1
        ,wp_5 = 160
        ,wp_11 = "item.wd1"
        ,wp_12 = 0xED104336
        ,wp_13 = 0xF36D99FC
        --新增灵饰配饰
        }
    ItemData["芝兰佩"]={
        wp_1 = "玉树芝兰生于其中，良才美质现于其外。"
        ,wp_2 = 2
        ,wp_3 = 11
        ,wp_4 = 2
        ,wp_5 = 60
        ,wp_11 = "item.wd1"
        ,wp_12 = 0xE07ABFDD
        ,wp_13 = 0x0B70B0FC
        }
    ItemData["逸云佩"]={
        wp_1 = "飘逸如云，洒脱如风；君子之行也。"
        ,wp_2 = 2
        ,wp_3 = 11
        ,wp_4 = 2
        ,wp_5 = 80
        ,wp_11 = "item.wd1"
        ,wp_12 = 0x44B729A2
        ,wp_13 = 0x8B0683BC
        }
    ItemData["莲音玦"]={
        wp_1 = "仙池清莲所化的玉玦，隐隐可闻其中仙音缭绕，长佩于身，有助修行。"
        ,wp_2 = 2
        ,wp_3 = 11
        ,wp_4 = 2
        ,wp_5 = 100
        ,wp_11 = "item.wd1"
        ,wp_12 = 0x09A1563F
        ,wp_13 = 0x9AD70885
        }
    ItemData["相思染"]={
        wp_1 = "一寸相思一寸灰，牛郎织女分离之时滴落相思血泪，遇相思灰而化为鸳鸯之形，故名为“相思染”。"
        ,wp_2 = 2
        ,wp_3 = 11
        ,wp_4 = 2
        ,wp_5 = 120
        ,wp_11 = "item.wd1"
        ,wp_12 = 0x59D5C544
        ,wp_13 = 0x3AB4C90B
        }
    ItemData["玄龙苍珀"]={
        wp_1 = "潜龙出世，纵情一啸，声震凌霄宝殿；玉帝罪之，命天将封其龙气入苍珀之中，以为惩罚；又将玄龙苍珀送入红尘，以待有缘人。"
        ,wp_2 = 2
        ,wp_3 = 11
        ,wp_4 = 2
        ,wp_5 = 140
        ,wp_11 = "item.wd1"
        ,wp_12 = 0x20FA6A66
        ,wp_13 = 0x5E226429
        }
    ItemData["碧海青天"]={
        wp_1 = "鲲鹏破海而出，水浪滔天，排空怒卷；其化形之蜕则凝为一明玉，聚海中灵气而成奇宝，名曰“碧海青天”。"
        ,wp_2 = 2
        ,wp_3 = 11
        ,wp_4 = 2
        ,wp_5 = 160
        ,wp_11 = "item.wd1"
        ,wp_12 = 0x91E363E8
        ,wp_13 = 0xBB4BFFCB
        --新增灵饰戒指
        }
    ItemData["枫华戒"]={
        wp_1 = "以红枫饰于梧桐木上，炼以为戒。"
        ,wp_2 = 2
        ,wp_3 = 12
        ,wp_4 = 3
        ,wp_5 = 60
        ,wp_11 = "item.wd1"
        ,wp_12 = 0x8245870F
        ,wp_13 = 0xBB24BAC3
        }
    ItemData["芙蓉戒"]={
        wp_1 = "涉江采芙蓉，饰于白玉之上，是为芙蓉戒。"
        ,wp_2 = 2
        ,wp_3 = 12
        ,wp_4 = 3
        ,wp_5 = 80
        ,wp_11 = "item.wd1"
        ,wp_12 = 0x9D1BB8EC
        ,wp_13 = 0x4694CB26
        }
    ItemData["金麟绕"]={
        wp_1 = "金麒麟之影投于其上，使得此戒有护主之能，故名之“金麟绕”。"
        ,wp_2 = 2
        ,wp_3 = 12
        ,wp_4 = 3
        ,wp_5 = 100
        ,wp_11 = "item.wd1"
        ,wp_12 = 0x629A6E47
        ,wp_13 = 0x33446FE4
        }
    ItemData["悦碧水"]={
        wp_1 = "智者乐水，观音于水边有所悟，故以佛力凝碧水以为戒。迎光观之，清波荡漾。"
        ,wp_2 = 2
        ,wp_3 = 12
        ,wp_4 = 3
        ,wp_5 = 120
        ,wp_11 = "item.wd1"
        ,wp_12 = 0x81A29179
        ,wp_13 = 0x92E3D4EB
        }
    ItemData["九曜光华"]={
        wp_1 = "九曜星君为谢王母娘娘蟠桃会之请，特凝聚九曜光华，成此宝戒；戒中聚星辰之力，华彩耀目，仙气袅然。"
        ,wp_2 = 2
        ,wp_3 = 12
        ,wp_4 = 3
        ,wp_5 = 140
        ,wp_11 = "item.wd1"
        ,wp_12 = 0x3EC26F1F
        ,wp_13 = 0x215BBE3E
        }
    ItemData["太虚渺云"]={
        wp_1 = "九霄云气飘渺无踪，自在逍遥；太上老君采撷七七四十九缕云气，以道法凝练九九八十一回，终成此戒，名为“太虚渺云”。"
        ,wp_2 = 2
        ,wp_3 = 12
        ,wp_4 = 3
        ,wp_5 = 160
        ,wp_11 = "item.wd1"
        ,wp_12 = 0x86693F55
        ,wp_13 = 0xC416CB3D
        }
    ItemData["武神戒"]={
        wp_1 = "三界英雄受天命于武神坛决战邪灵蚩尤，共护三界平安；功成之时，三界善念聚为龙形，吐珠炼瑞，成此“武神戒”，以谢侠士壮举。"
        ,wp_2 = 2
        ,wp_3 = 12
        ,wp_4 = 3
        ,wp_5 = 140
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 0x4dc1acdc
        ,wp_13 = 0x229e5e97
        --新增灵饰手镯
        }
    ItemData["香木镯"]={
        wp_1 = "楠木所制，可辟邪护身。"
        ,wp_2 = 2
        ,wp_3 = 13
        ,wp_4 = 4
        ,wp_5 = 60
        ,wp_11 = "item.wd1"
        ,wp_12 = 0x5B5A5A7B
        ,wp_13 = 0xBA5B693B
        }
    ItemData["翡玉镯"]={
        wp_1 = "山灵水秀，方出璞石；翡玉镯以翡翠打造而成，自有光华。"
        ,wp_2 = 2
        ,wp_3 = 13
        ,wp_4 = 4
        ,wp_5 = 80
        ,wp_11 = "item.wd1"
        ,wp_12 = 0x59E948D9
        ,wp_13 = 0x243475F0
        }
    ItemData["墨影扣"]={
        wp_1 = "仙人绘山水，留影玉石中；巧匠采墨影仙石制为手镯，形制奇巧，内蕴仙力。"
        ,wp_2 = 2
        ,wp_3 = 13
        ,wp_4 = 4
        ,wp_5 = 100
        ,wp_11 = "item.wd1"
        ,wp_12 = 0xFF46F65C
        ,wp_13 = 0xCF27B111
        }
    ItemData["花映月"]={
        wp_1 = "嫦娥于广寒宫内观月照花、花映月，思念人间冷暖，故凝月华而成此手镯。"
        ,wp_2 = 2
        ,wp_3 = 13
        ,wp_4 = 4
        ,wp_5 = 120
        ,wp_11 = "item.wd1"
        ,wp_12 = 0x39BFA707
        ,wp_13 = 0x9630B1CE
        }
    ItemData["金水菩提"]={
        wp_1 = "佛于西天观芸芸众生，有感于凡间诸般喜怒哀乐，故以纯净佛力凝为金水菩提，愿渡红尘之苦。佩戴此镯者，可得佛力为护，趋吉避凶。"
        ,wp_2 = 2
        ,wp_3 = 13
        ,wp_4 = 4
        ,wp_5 = 140
        ,wp_11 = "item.wd1"
        ,wp_12 = 0xD7A907DD
        ,wp_13 = 0xCF3E45BF
        }
    ItemData["浮雪幻音"]={
        wp_1 = "混沌初开，天地生成；其时也，有初生霜雪自天而降。此雪遇混沌清气后凝而不化，成一奇物，静听则有天地玄音。"
        ,wp_2 = 2
        ,wp_3 = 13
        ,wp_4 = 4
        ,wp_5 = 160
        ,wp_11 = "item.wd1"
        ,wp_12 = 0xB2326701
        ,wp_13 = 0xFB5EEB41
        }

        ----------------------灵饰
    ItemData["60自选灵饰礼包"]={
        wp_1 = "可选取5套80级灵饰书铁。\n#R可自选"
        ,wp_2 = 135
        ,wp_3 = 9999
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 2650955991 --小
        ,wp_13 = 2817725067
        }
    ItemData["80自选灵饰礼包"]={
        wp_1 = "可选取5套80级灵饰书铁。\n#R可自选"
        ,wp_2 = 135
        ,wp_3 = 9999
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 2650955991 --小
        ,wp_13 = 2817725067
        }
    ItemData["100自选灵饰礼包"]={
        wp_1 = "可选取5套100级随机灵饰书铁。\n#R可自选"
        ,wp_2 = 135
        ,wp_3 = 9999
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 2650955991 --小
        ,wp_13 = 2817725067
        }
    ItemData["120自选灵饰礼包"]={
        wp_1 = "可选取5套120级随机灵饰书铁。\n#R可自选"
        ,wp_2 = 135
        ,wp_3 = 9999
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 2650955991 --小
        ,wp_13 = 2817725067
        }
    ItemData["140自选灵饰礼包"]={
        wp_1 = "可选取5套140级随机灵饰书铁。\n#R可自选"
        ,wp_2 = 135
        ,wp_3 = 9999
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 2650955991 --小
        ,wp_13 = 2817725067
        }
     ItemData["160自选灵饰礼包"]={
        wp_1 = "可选取5套160级随机灵饰书铁。\n#R可自选"
        ,wp_2 = 135
        ,wp_3 = 9999
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 2650955991 --小
        ,wp_13 = 2817725067
        }

    ItemData["140级灵饰戒指礼包"]={
        wp_1 = "礼包内含有一整套自选装备礼包。"
        ,wp_2 = 120
        ,wp_3 = 1
        ,wp_4 = 1
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 0xd6363dd6
        ,wp_13 = 0x5fbab8dc
        }
        ItemData["140级灵饰手镯礼包"]={
        wp_1 = "礼包内含有一整套自选装备礼包。"
        ,wp_2 = 120
        ,wp_3 = 1
        ,wp_4 = 1
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 0xd6363dd6
        ,wp_13 = 0x5fbab8dc
        }
        ItemData["140级灵饰佩饰礼包"]={
        wp_1 = "礼包内含有一整套自选装备礼包。"
        ,wp_2 = 120
        ,wp_3 = 1
        ,wp_4 = 1
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 0xd6363dd6
        ,wp_13 = 0x5fbab8dc
        }
        ItemData["140级灵饰耳饰礼包"]={
        wp_1 = "礼包内含有一整套自选装备礼包。"
        ,wp_2 = 120
        ,wp_3 = 1
        ,wp_4 = 1
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 0xd6363dd6
        ,wp_13 = 0x5fbab8dc
        }


        ItemData["120级灵饰戒指礼包"]={
        wp_1 = "礼包内含有一整套自选装备礼包。"
        ,wp_2 = 120
        ,wp_3 = 1
        ,wp_4 = 1
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 0xd6363dd6
        ,wp_13 = 0x5fbab8dc
        }
        ItemData["120级灵饰手镯礼包"]={
        wp_1 = "礼包内含有一整套自选装备礼包。"
        ,wp_2 = 120
        ,wp_3 = 1
        ,wp_4 = 1
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 0xd6363dd6
        ,wp_13 = 0x5fbab8dc
        }
        ItemData["120级灵饰佩饰礼包"]={
        wp_1 = "礼包内含有一整套自选装备礼包。"
        ,wp_2 = 120
        ,wp_3 = 1
        ,wp_4 = 1
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 0xd6363dd6
        ,wp_13 = 0x5fbab8dc
        }
        ItemData["120级灵饰耳饰礼包"]={
        wp_1 = "礼包内含有一整套自选装备礼包。"
        ,wp_2 = 120
        ,wp_3 = 1
        ,wp_4 = 1
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 0xd6363dd6
        ,wp_13 = 0x5fbab8dc
        }


        ItemData["100级灵饰戒指礼包"]={
        wp_1 = "礼包内含有一整套自选装备礼包。"
        ,wp_2 = 120
        ,wp_3 = 1
        ,wp_4 = 1
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 0xd6363dd6
        ,wp_13 = 0x5fbab8dc
        }
        ItemData["100级灵饰手镯礼包"]={
        wp_1 = "礼包内含有一整套自选装备礼包。"
        ,wp_2 = 120
        ,wp_3 = 1
        ,wp_4 = 1
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 0xd6363dd6
        ,wp_13 = 0x5fbab8dc
        }
        ItemData["100级灵饰佩饰礼包"]={
        wp_1 = "礼包内含有一整套自选装备礼包。"
        ,wp_2 = 120
        ,wp_3 = 1
        ,wp_4 = 1
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 0xd6363dd6
        ,wp_13 = 0x5fbab8dc
        }
        ItemData["100级灵饰耳饰礼包"]={
        wp_1 = "礼包内含有一整套自选装备礼包。"
        ,wp_2 = 120
        ,wp_3 = 1
        ,wp_4 = 1
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 0xd6363dd6
        ,wp_13 = 0x5fbab8dc
        }
        ItemData["80级灵饰戒指礼包"]={
        wp_1 = "礼包内含有一整套自选装备礼包。"
        ,wp_2 = 120
        ,wp_3 = 1
        ,wp_4 = 1
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 0xd6363dd6
        ,wp_13 = 0x5fbab8dc
        }
        ItemData["80级灵饰手镯礼包"]={
        wp_1 = "礼包内含有一整套自选装备礼包。"
        ,wp_2 = 120
        ,wp_3 = 1
        ,wp_4 = 1
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 0xd6363dd6
        ,wp_13 = 0x5fbab8dc
        }
        ItemData["80级灵饰佩饰礼包"]={
        wp_1 = "礼包内含有一整套自选装备礼包。"
        ,wp_2 = 120
        ,wp_3 = 1
        ,wp_4 = 1
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 0xd6363dd6
        ,wp_13 = 0x5fbab8dc
        }
        ItemData["80级灵饰耳饰礼包"]={
        wp_1 = "礼包内含有一整套自选装备礼包。"
        ,wp_2 = 120
        ,wp_3 = 1
        ,wp_4 = 1
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 0xd6363dd6
        ,wp_13 = 0x5fbab8dc
        }

        ItemData["测试礼包"]={
        wp_1 = "测试礼包\n#Y【使用方式】鼠标右键使用"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 959572106 --小
        ,wp_13 = 2953344867
        }
        ItemData["双龙之战会员"]={
        wp_1 = "双龙之战会员\n#Y【使用方式】鼠标右键使用"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 959572106 --小
        ,wp_13 = 2953344867
        }
        ItemData["自动抓鬼年卡"]={
        wp_1 = "右键使用后：可以找地府幻境(98，27)钟馗分身进行自动抓鬼。"
        ,wp_2 = 100
        ,wp_3 = 1
        ,wp_4 = 1
        ,wp_11 = "item.wdf"
        ,wp_12 = 0xB914F9E5 --小
        ,wp_13 = 0xFEF0147A
        }
ItemData["五彩神石"]={
                wp_1 = "五中光芒坠向人间。\n#Y【使用】用于召唤兽进化\n#Y【效果】每次进化所有资质+50,成长+0.05,可进化5次,第5次可改变宠物类型#R(神兽-特殊神兽)"
                ,wp_2 = 99999
                ,wp_3 = 3
                ,wp_4 = 0
                ,wp_11 = "item.wdf"
                ,wp_12 = 0x2EA1E8D7
                ,wp_13 = 0x27F9F964
                }

    ItemData["焕彩石"]={
        wp_1 = "焕彩石，可为锦衣提升对应品质的等级"
        ,wp_2 = 190
        ,wp_3 = 1
        ,wp_4 = 0
        , wp_11 = "item.wd1"
        , wp_12 = 0x4EFB0BE7 --小
        , wp_13 = 0xBA2F77D4 --大
        }
    ItemData["善恶棋盘"]={
        wp_1 = "叶法善制造的棋盘，可以反映鬼魂心中的善恶之心。右键使用"
        ,wp_2 = 667
        ,wp_3 = 1
        ,wp_4 = 0
        ,wp_8 = 3
        , wp_11 = "item.wdf"
        , wp_12 = 1675600755 --小
        , wp_13 = 1862557990 --大
        }

        ItemData["夺宝令牌"]={
        wp_1 = "界面左上角可使用"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 0x3DD12EF3
        ,wp_13 = 0x8F8DC4AF
        ,wp_14 = 80
        }
    ItemData["奖池抽奖"]={
        wp_1 = "右键使用可以开启大转盘抽奖一次，可能获得神兜兜等珍稀道具"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 0x3DD12EF3
        ,wp_13 = 0x8F8DC4AF
        ,wp_14 = 80
        }
        ItemData["玉魄积分礼包"]={
        wp_1 = "玉魄积分\n#Y使用获得9999积分"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 959572106 --小
        ,wp_13 = 2953344867
        }
        ItemData["双龙积分礼包"]={
        wp_1 = "双龙积分\n#Y使用获得9999活跃积分1000贡献值"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 959572106 --小
        ,wp_13 = 2953344867
        }

        ItemData["嘉年华积分"]={
        wp_1 = "嘉年华积分\n#Y使用获得10000积分"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 959572106 --小
        ,wp_13 = 2953344867
        }

        ItemData["打造熟练度礼包"]={
        wp_1 = "打造熟练度礼包\n#Y使用获得打造、裁缝、炼金、淬灵熟练度9999"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 959572106 --小
        ,wp_13 = 2953344867
        }

    ItemData["80灵饰自选"]={
        wp_1 = "80灵饰自选"
        ,wp_2 = 886
        ,wp_3 = 0
        ,wp_4 = 0
        ,wp_11 = "xinui.wdf"
        ,wp_12 = 0x00001412 --小
        ,wp_13 = 0x00001413
        }
        ItemData["100灵饰自选"]={
        wp_1 = "100灵饰自选"
        ,wp_2 = 886
        ,wp_3 = 0
        ,wp_4 = 0
        ,wp_11 = "xinui.wdf"
        ,wp_12 = 0x00001412 --小
        ,wp_13 = 0x00001413
        }
        ItemData["120灵饰自选"]={
        wp_1 = "120灵饰自选"
        ,wp_2 = 886
        ,wp_3 = 0
        ,wp_4 = 0
        ,wp_11 = "xinui.wdf"
        ,wp_12 = 0x00001412 --小
        ,wp_13 = 0x00001413
        }
        ItemData["140灵饰自选"]={
        wp_1 = "140灵饰自选"
        ,wp_2 = 886
        ,wp_3 = 0
        ,wp_4 = 0
        ,wp_11 = "xinui.wdf"
        ,wp_12 = 0x00001412 --小
        ,wp_13 = 0x00001413
        }
---新增自选灵饰自选礼包
        ItemData["80灵饰自选礼包"]={
        wp_1 = "右键使用可获得4个80级自选灵饰"
        ,wp_2 = 113
        ,wp_3 = 2
        ,wp_4 = 0
        ,wp_11 = "xinui.wdf"
        ,wp_12 = 0x00001412 --小
        ,wp_13 = 0x00001413
        }

        ItemData["100灵饰自选礼包"]={
        wp_1 = "右键使用可获得4个100级自选灵饰"
        ,wp_2 = 113
        ,wp_3 = 2
        ,wp_4 = 0
        ,wp_11 = "xinui.wdf"
        ,wp_12 = 0x00001412 --小
        ,wp_13 = 0x00001413
        }

        ItemData["120灵饰自选礼包"]={
        wp_1 = "右键使用可获得4个120级自选灵饰"
        ,wp_2 = 113
        ,wp_3 = 2
        ,wp_4 = 0
        ,wp_11 = "xinui.wdf"
        ,wp_12 = 0x00001412 --小
        ,wp_13 = 0x00001413
        }

        ItemData["140灵饰自选礼包"]={
        wp_1 = "右键使用可获得4个140级自选灵饰"
        ,wp_2 = 113
        ,wp_3 = 2
        ,wp_4 = 0
        ,wp_11 = "xinui.wdf"
        ,wp_12 = 0x00001412 --小
        ,wp_13 = 0x00001413
        }

        ItemData["160灵饰自选礼包"]={
        wp_1 = "右键使用可获得4个160级自选灵饰"
        ,wp_2 = 113
        ,wp_3 = 2
        ,wp_4 = 0
        ,wp_11 = "xinui.wdf"
        ,wp_12 = 0x00001412 --小
        ,wp_13 = 0x00001413
        }

        ItemData["140灵饰指南书"]={
        wp_1 = "记载各种灵饰制造方法的古老书卷"
        ,wp_2 = 5
        ,wp_3 = 20
        ,wp_4 = 0
        ,wp_11 = "item.wd1"
        ,wp_12 = 0xAEB5E00E
        ,wp_13 = 0xD7E29586
        }
    ItemData["140元灵晶石"]={
        wp_1 = "灵山晶石经千锤百炼而成，为灵饰淬灵所必须的材料。"
        ,wp_2 = 5
        ,wp_3 = 21
        ,wp_4 = 0
        ,wp_11 = "item.wd1"
        ,wp_12 = 0x321116AF
        ,wp_13 = 0x13A717B5
        }
        ItemData["160灵饰指南书"]={
        wp_1 = "记载各种灵饰制造方法的古老书卷"
        ,wp_2 = 5
        ,wp_3 = 20
        ,wp_4 = 0
        ,wp_11 = "item.wd1"
        ,wp_12 = 0xAEB5E00E
        ,wp_13 = 0xD7E29586
        }
    ItemData["160元灵晶石"]={
        wp_1 = "灵山晶石经千锤百炼而成，为灵饰淬灵所必须的材料。"
        ,wp_2 = 5
        ,wp_3 = 21
        ,wp_4 = 0
        ,wp_11 = "item.wd1"
        ,wp_12 = 0x321116AF
        ,wp_13 = 0x13A717B5
        }

        ItemData["灵饰洗练石"]={
        wp_1 = "灵饰词条不变，随机改变数值（概率失败）。"
        ,wp_2 = 101
        ,wp_3 = 3
        ,wp_4 = 8
        ,wp_11 = "item.wd1"
        ,wp_12 = 0xF7C5B98F
        ,wp_13 = 0xB4F6909B
        }
    ItemData["灵饰洗练石碎片"]={
        wp_1 = "50个碎片可以兑换一个灵饰洗练石"
        ,wp_2 = 101
        ,wp_3 = 3
        ,wp_4 = 8
        ,wp_11 = "item.wd1"
        ,wp_12 = 0xF7C5B98F
        ,wp_13 = 0xB4F6909B
        }

        ItemData["特性宝珠"]={
        wp_1 = "蕴含天地精华的宝珠，可为一件人物装备随机附加一种额外属性。"
        ,wp_2 = 101
        ,wp_3 = 3
        ,wp_4 = 11
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 2407705715  --1907775503
        ,wp_13 = 578046564
        }
        ----------佬伍修改（增加种族秘境时空之钥）
    ItemData["人族时空之钥"]={
    wp_1 = "用于打开人族境界之门。可前往长安城(235,129)人族秘境使者处开启时空秘境副本。"
    ,wp_2 = 9996
    ,wp_3 = 1
    ,wp_11 = "商城素材.wdf"
    ,wp_12 = 0x7e36645d
    ,wp_13 = 0xe8f20ec5
        }
ItemData["魔族时空之钥"]={
    wp_1 = "用于打开魔族境界之门。可前往长安城(243,126)魔族秘境使者处开启时空秘境副本。"
    ,wp_2 = 9996
    ,wp_3 = 1
    ,wp_11 = "商城素材.wdf"
    ,wp_12 = 0x55b02cdc
    ,wp_13 = 0x7de210ce
        }
ItemData["仙族时空之钥"]={
    wp_1 = "用于打开仙族境界之门。可前往长安城(249,123)仙族秘境使者处开启时空秘境副本。"
    ,wp_2 = 9996
    ,wp_3 = 1
    ,wp_11 = "商城素材.wdf"
    ,wp_12 = 0xe682fd37
    ,wp_13 = 0x4f430561
        }
  ItemData["四神石礼包"]={
        wp_1 = "打开能获得#G某种强化石5个\n【使用方式】鼠标右键使用"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 2650955991 --小
        ,wp_13 = 2817725067
        }
ItemData["阵营礼物包"]={
        wp_1 = "右键使用可获得随机种类的阵营礼物1-3个"
        ,wp_2 = 113
        ,wp_3 = 2
        ,wp_4 = 0
        ,wp_11 = "item.wdf"
        ,wp_12 = 2650955991 --小
        ,wp_13 = 2817725067
        }

    ItemData["海妖的贡品"] = {
        wp_1 = "海妖的贡品\n#Y/双龙之战玩法专属物品，可用于上交阵营或出售给阵营，以获得本方阵营的贡献值与活动积分。"
        , wp_2 = 206
        , wp_3 = 1
        , wp_4 = 1
        , wp_11 = "item.wd1"
        , wp_12 = 0xADE9E51F
        , wp_13 = 0x13FF213A
    }
    ItemData["海妖精气"] = {
        wp_1 = "海妖精气\n#Y/双龙之战玩法专属物品，可用于上交阵营或出售给阵营，以获得本方阵营的贡献值与活动积分。"
        , wp_2 = 206
        , wp_3 = 1
        , wp_4 = 1
        , wp_11 = "item.wd1"
        , wp_12 = 0x75C819F9
        , wp_13 = 0xE5238C23
    }
    ItemData["海妖精魄"] = {
        wp_1 = "海妖精魄\n#Y/双龙之战玩法专属物品，可用于上交阵营或出售给阵营，以获得本方阵营的贡献值与活动积分。"
        , wp_2 = 206
        , wp_3 = 1
        , wp_4 = 1
        , wp_11 = "item.wd1"
        , wp_12 = 0x57FBB583
        , wp_13 = 0xF56E689A
    }
    ItemData["海妖灵兵"] = {
        wp_1 = "海妖灵兵\n#Y/双龙之战玩法专属物品，可用于上交阵营或出售给阵营，以获得本方阵营的贡献值与活动积分。"
        , wp_2 = 206
        , wp_3 = 1
        , wp_4 = 1
        , wp_11 = "common/item.wdf"
        , wp_12 = 0x51105074
        , wp_13 = 0x976BFD27
    }

    ItemData["海妖王的灵元"] = {
        wp_1 = "海妖王的灵元\n#Y/双龙之战玩法专属物品，可用于上交阵营或出售给阵营，以获得本方阵营的贡献值与活动积分。"
        , wp_2 = 206
        , wp_3 = 1
        , wp_4 = 1
        , wp_11 = "item.wd1"
        , wp_12 = 0x8E128374
        , wp_13 = 0x346DBC25
    }
ItemData["阵营-牡丹花"] = {
        wp_1 = "阵营-牡丹花\n#Y/双龙之战玩法专属物品，可用于赠送阵营内NPC，增加NPC的好感度，以获得NPC的祝福，获得属性提升。"
        , wp_2 = 206
        , wp_3 = 1
        , wp_4 = 1
        , wp_11 = "item.wdf"
        , wp_12 = 0xFFF1B4CE
        , wp_13 = 0xCFD3A149
    }
    ItemData["阵营-桃运花"] = {
        wp_1 = "阵营-桃运花\n#Y/双龙之战玩法专属物品，可用于赠送阵营内NPC，增加NPC的好感度，以获得NPC的祝福，获得属性提升。"
        , wp_2 = 206
        , wp_3 = 1
        , wp_4 = 1
        , wp_11 = "item.wdf"
        , wp_12 = 0x07870048
        , wp_13 = 0xAAB0BA1D
    }
    ItemData["阵营-紫兰花"] = {
        wp_1 = "阵营-紫兰花\n#Y/双龙之战玩法专属物品，可用于赠送阵营内NPC，增加NPC的好感度，以获得NPC的祝福，获得属性提升。"
        , wp_2 = 206
        , wp_3 = 1
        , wp_4 = 1
        , wp_11 = "item.wdf"
        , wp_12 = 0xF26A689A
        , wp_13 = 0xBEAE27D0
    }
    ItemData["阵营-百合花"] = {
        wp_1 = "阵营-百合花\n#Y/双龙之战玩法专属物品，可用于赠送阵营内NPC，增加NPC的好感度，以获得NPC的祝福，获得属性提升。"
        , wp_2 = 206
        , wp_3 = 1
        , wp_4 = 1
        , wp_11 = "item.wdf"
        , wp_12 = 0x206394EF
        , wp_13 = 0xCE65E9FA
    }
    ItemData["阵营-玫瑰花"] = {
        wp_1 = "阵营-玫瑰花\n#Y/双龙之战玩法专属物品，可用于赠送阵营内NPC，增加NPC的好感度，以获得NPC的祝福，获得属性提升。"
        , wp_2 = 206
        , wp_3 = 1
        , wp_4 = 1
        , wp_11 = "item.wdf"
        , wp_12 = 0x3944ABFA
        , wp_13 = 0x614A5011
    }
    ItemData["扫荡卡"]={
    wp_1 = "会员用户可在副本扫荡界面消耗此副本直接通关副本。"
    ,wp_2 = 9992
    ,wp_3 = 1
    ,wp_11 = "qh.npk"
    ,wp_12 = 0xABBBA014
    ,wp_13 = 0xABBBA015
        }
        ---------佬伍修改（增加种族秘境时空之钥）
    ItemData["斩妖帖"] = {
        wp_1 = "挑战各路妖王的通行证，斩妖使者所需。",
        wp_3 = 3,
        wp_11 = "item.wdf",
        wp_12 = 3040004711.0,
        wp_13 = 3494094318.0,
        wp_2 = "银票",
        wp_4 = 1
    }

    ItemData["噬魔神壶"]={
        wp_1 = "曾经吞噬了无数魔灵的神壶，无人知晓其真实来历，是九黎城门派不可外传的稀世灵宝。"
        ,wp_2 = 1002
        ,wp_3 = 1
        ,wp_4 = 1
        ,wp_5 = 1
        ,wp_6 = "九黎城"
        ,wp_11 = "mxsc.map"
        ,wp_12 = 0xAA201142
        ,wp_13 = 0xAA201141
        ,wp_15 = "对敌方(1,2,3)个目标连续发动6次攻击，每次攻击造成（伤害力*3.5）点气血流失，同时获得(6,12,18)点连击值，伤害结果会有10%上下浮动。"
        }
    ItemData["召唤兽通用饰品"]={
    wp_1 = "召唤兽通用饰品增加召唤兽各项资质百分之10"
    ,wp_2 = 1
    ,wp_3 = 11
    ,wp_4 = 0
    ,wp_8 = 3
    ,wp_11 = "item.wdf"
    ,wp_12 = 2102013932 --小
    ,wp_13 =712875724
    }
    ItemData["玉灵果"]={
      wp_1 = "比较少见的果子，生长在山野之中，味道甘甜\n 【提升召唤兽的某项资质】"
    ,wp_2 = 118
    ,wp_3 = 2
    ,wp_4 = 1
    ,wp_11 = "item.wdf"
    ,wp_12 = 0x2351EC3B
    ,wp_13 = 0x9B1BF142

    }
 ItemData["蕴灵礼包小"] = {
        wp_1 = "蕴灵礼包\n内含蕴灵晶体*5个！"
        , wp_2 = 1
        , wp_3 = 11
        , wp_4 = 0
        , wp_8 = 3
        , wp_11 = "common/item.wdf"
        , wp_12 = 0xd6363dd6
        , wp_13 = 0x5fbab8dc
    }
    ItemData["黑麒麟"]={
       wp_1 = "锦衣。"
        ,wp_2 = 2
        ,wp_3 = 15
        ,wp_4 = 1
        ,wp_5 = 0
        ,wp_11 = "item.wdf"
        ,wp_12 = 0x60FB6A8C --小
        ,wp_13 = 0x331BA7B1
    }
     ItemData["九尾冰狐"]={
        wp_1 = "普通坐骑,额外附加属性"
        ,wp_2 = 113
        ,wp_3 = 2
        ,wp_4 = 0
        ,wp_11 = "item.wdf"
        ,wp_12 = 0x60FB6A8C --小
        ,wp_13 = 0x331BA7B1
    }
    ---==================攻击特效========================---

    ItemData["野蛮冲撞（金）"]={
        wp_1 = "锦衣。"
        ,wp_2 = 2
        ,wp_3 = 19
        ,wp_4 = 5
        ,wp_5 = 0
        ,wp_11 ="r3d.dll"
        ,wp_12 ="青花瓷小"
        ,wp_13 ="青花瓷大"
        }
    ItemData["野蛮冲撞（白）"]={
        wp_1 = "锦衣。"
        ,wp_2 = 2
        ,wp_3 = 19
        ,wp_4 = 5
        ,wp_5 = 0
        ,wp_11 ="r3d.dll"
        ,wp_12 ="青花瓷小"
        ,wp_13 ="青花瓷大"
        }
    ItemData["野蛮冲撞（黑）"]={
        wp_1 = "锦衣。"
        ,wp_2 = 2
        ,wp_3 = 19
        ,wp_4 = 5
        ,wp_5 = 0
        ,wp_11 ="r3d.dll"
        ,wp_12 ="青花瓷小"
        ,wp_13 ="青花瓷大"
        }
    ItemData["牛气冲天"]={
        wp_1 = "锦衣。"
        ,wp_2 = 2
        ,wp_3 = 19
        ,wp_4 = 5
        ,wp_5 = 0
        ,wp_11 ="r3d.dll"
        ,wp_12 ="青花瓷小"
        ,wp_13 ="青花瓷大"
        }
    ItemData["虎威一震（白）"]={
        wp_1 = "锦衣。"
        ,wp_2 = 2
        ,wp_3 = 19
        ,wp_4 = 5
        ,wp_5 = 0
        ,wp_11 ="r3d.dll"
        ,wp_12 ="青花瓷小"
        ,wp_13 ="青花瓷大"
        }
    ItemData["虎威一震（金）"]={
        wp_1 = "锦衣。"
        ,wp_2 = 2
        ,wp_3 = 19
        ,wp_4 = 5
        ,wp_5 = 0
        ,wp_11 ="r3d.dll"
        ,wp_12 ="青花瓷小"
        ,wp_13 ="青花瓷大"
        }
    ItemData["虎威一震（黑）"]={
        wp_1 = "锦衣。"
        ,wp_2 = 2
        ,wp_3 = 19
        ,wp_4 = 5
        ,wp_5 = 0
        ,wp_11 ="r3d.dll"
        ,wp_12 ="青花瓷小"
        ,wp_13 ="青花瓷大"
        }

    ItemData["耀炎麒麟（白）"]={
        wp_1 = "锦衣。"
        ,wp_2 = 2
        ,wp_3 = 19
        ,wp_4 = 5
        ,wp_5 = 0
        ,wp_11 ="r3d.dll"
        ,wp_12 ="青花瓷小"
        ,wp_13 ="青花瓷大"
        }
    ItemData["耀炎麒麟（黑）"]={
        wp_1 = "锦衣。"
        ,wp_2 = 2
        ,wp_3 = 19
        ,wp_4 = 5
        ,wp_5 = 0
        ,wp_11 ="r3d.dll"
        ,wp_12 ="青花瓷小"
        ,wp_13 ="青花瓷大"
        }
    ItemData["耀炎麒麟（金）"]={
        wp_1 = "锦衣。"
        ,wp_2 = 2
        ,wp_3 = 19
        ,wp_4 = 5
        ,wp_5 = 0
        ,wp_11 ="r3d.dll"
        ,wp_12 ="青花瓷小"
        ,wp_13 ="青花瓷大"
        }
    ItemData["星火燎原"]={
        wp_1 = "锦衣。"
        ,wp_2 = 2
        ,wp_3 = 19
        ,wp_4 = 5
        ,wp_5 = 0
        ,wp_11 ="r3d.dll"
        ,wp_12 ="青花瓷小"
        ,wp_13 ="青花瓷大"
        }
    ItemData["天火焚城"]={
        wp_1 = "锦衣。"
        ,wp_2 = 2
        ,wp_3 = 19
        ,wp_4 = 5
        ,wp_5 = 0
        ,wp_11 ="r3d.dll"
        ,wp_12 ="青花瓷小"
        ,wp_13 ="青花瓷大"
        }
    ItemData["扶摇九霄（攻）"]={
        wp_1 = "攻击特效"
        ,wp_2 = 2
        ,wp_3 = 19
        ,wp_4 = 5
        ,wp_5 = 0
        ,wp_11 ="r3d.dll"
        ,wp_12 =0x4716AB21
        ,wp_13 =0xCE120C93
        }
    ---==================攻击特效========================---
    ---==================施法特效========================---
    ItemData["万物生长（白）"]={
        wp_1 = "锦衣。"
        ,wp_2 = 2
        ,wp_3 = 17
        ,wp_4 = 6
        ,wp_5 = 0
        ,wp_11 ="r3d.dll"
        ,wp_12 ="青花瓷小"
        ,wp_13 ="青花瓷大"
        }

    ItemData["比翼飞（粉）"]={
        wp_1 = "施法特效"
        ,wp_2 = 2
        ,wp_3 = 17
        ,wp_4 = 6
        ,wp_5 = 0
        ,wp_11 ="r3d.dll"
        ,wp_12 =0x4716AB21
        ,wp_13 =0xCE120C93
        }
    ItemData["比翼飞（蓝）"]={
        wp_1 = "施法特效"
        ,wp_2 = 2
        ,wp_3 = 17
        ,wp_4 = 6
        ,wp_5 = 0
        ,wp_11 ="r3d.dll"
        ,wp_12 =0x4716AB21
        ,wp_13 =0xCE120C93
        }
    ItemData["万物生长（白）"]={
        wp_1 = "施法特效"
        ,wp_2 = 2
        ,wp_3 = 17
        ,wp_4 = 6
        ,wp_5 = 0
        ,wp_11 ="r3d.dll"
        ,wp_12 =0x4716AB21
        ,wp_13 =0xCE120C93
        }
    ItemData["万物生长（黑）"]={
        wp_1 = "施法特效"
        ,wp_2 = 2
        ,wp_3 = 17
        ,wp_4 = 6
        ,wp_5 = 0
        ,wp_11 ="r3d.dll"
        ,wp_12 =0x4716AB21
        ,wp_13 =0xCE120C93
        }
    ItemData["万物生长（绿）"]={
        wp_1 = "施法特效"
        ,wp_2 = 2
        ,wp_3 = 17
        ,wp_4 = 6
        ,wp_5 = 0
        ,wp_11 ="r3d.dll"
        ,wp_12 =0x4716AB21
        ,wp_13 =0xCE120C93
        }
    ItemData["虎啸生风（黑）"]={
        wp_1 = "施法特效"
        ,wp_2 = 2
        ,wp_3 = 17
        ,wp_4 = 6
        ,wp_5 = 0
        ,wp_11 ="r3d.dll"
        ,wp_12 =0x4716AB21
        ,wp_13 =0xCE120C93
        }
    ItemData["虎啸生风（金）"]={
        wp_1 = "施法特效"
        ,wp_2 = 2
        ,wp_3 = 17
        ,wp_4 = 6
        ,wp_5 = 0
        ,wp_11 ="r3d.dll"
        ,wp_12 =0x4716AB21
        ,wp_13 =0xCE120C93
        }
    ItemData["巫山曲（原）"]={
        wp_1 = "施法特效"
        ,wp_2 = 2
        ,wp_3 = 17
        ,wp_4 = 6
        ,wp_5 = 0
        ,wp_11 ="r3d.dll"
        ,wp_12 =0x4716AB21
        ,wp_13 =0xCE120C93
        }
    ItemData["扶摇九霄（法）"]={
        wp_1 = "锦衣。"
        ,wp_2 = 2
        ,wp_3 = 17
        ,wp_4 = 6
        ,wp_5 = 0
        ,wp_11 ="r3d.dll"
        ,wp_12 ="青花瓷小"
        ,wp_13 ="青花瓷大"
        }
    ---==================施法特效========================---
        --=================武器装扮=============
    ItemData["凤羽吉光"]={
        wp_1 = "锦衣。"
        ,wp_2 = 2
        ,wp_3 = 16
        ,wp_4 = 2
        ,wp_5 = 0
        --,wp_6 = "男"
        ,wp_11 ="r3d.dll"
        ,wp_12 ="青花瓷小"
        ,wp_13 ="青花瓷大"
        }
    ItemData["凤羽吉光·月白"]={
        wp_1 = "锦衣。"
        ,wp_2 = 2
        ,wp_3 = 16
        ,wp_4 = 2
        ,wp_5 = 0
        --,wp_6 = "男"
        ,wp_11 ="r3d.dll"
        ,wp_12 ="青花瓷小"
        ,wp_13 ="青花瓷大"
        }
    ItemData["恶魔棘刺"]={
        wp_1 = "锦衣。"
        ,wp_2 = 2
        ,wp_3 = 16
        ,wp_4 = 2
        ,wp_5 = 0
        --,wp_6 = "男"
        ,wp_11 ="r3d.dll"
        ,wp_12 ="青花瓷小"
        ,wp_13 ="青花瓷大"
        }

        --=================武器装扮=============

     ItemData["胖胖龙"]={
        wp_1 = "锦衣。"
        ,wp_2 = 2
        ,wp_3 = 15
        ,wp_4 = 1
        ,wp_5 = 0
        ,wp_11 = "item.wdf"
        ,wp_12 = 0x60FB6A8C --小
        ,wp_13 = 0x331BA7B1
    }
    ItemData["浮生绡·点黛"]={
        wp_1 = "锦衣。"
        ,wp_2 = 2
        ,wp_3 = 15
        ,wp_4 = 1
        ,wp_5 = 0
        ,wp_11 ="r3d.dll"
        ,wp_12 ="青花瓷小"
        ,wp_13 ="青花瓷大"
        }
    ItemData["春日宴"]={
        wp_1 = "锦衣。"
        ,wp_2 = 2
        ,wp_3 = 15
        ,wp_4 = 1
        ,wp_5 = 0
        ,wp_11 ="r3d.dll"
        ,wp_12 ="青花瓷小"
        ,wp_13 ="青花瓷大"
        }

    ItemData["小福兔·月白"]={
        wp_1 = "锦衣。"
        ,wp_2 = 2
        ,wp_3 = 15
        ,wp_4 = 1
        ,wp_5 = 0
        ,wp_11 ="r3d.dll"
        ,wp_12 ="青花瓷小"
        ,wp_13 ="青花瓷大"
        }
    ItemData["旃檀香·墨黑"]={
        wp_1 = "锦衣。"
        ,wp_2 = 2
        ,wp_3 = 15
        ,wp_4 = 1
        ,wp_5 = 0
        ,wp_11 ="r3d.dll"
        ,wp_12 ="青花瓷小"
        ,wp_13 ="青花瓷大"
        }
    ItemData["浮生"]={
        wp_1 = "锦衣。"
        ,wp_2 = 2
        ,wp_3 = 15
        ,wp_4 = 1
        ,wp_5 = 0
        ,wp_11 ="r3d.dll"
        ,wp_12 ="青花瓷小"
        ,wp_13 ="青花瓷大"
        }
    ItemData["萌龙咆哮"]={
        wp_1 = "锦衣。"
        ,wp_2 = 2
        ,wp_3 = 15
        ,wp_4 = 1
        ,wp_5 = 0
        --,wp_6 = "男"
        ,wp_11 ="r3d.dll"
        ,wp_12 ="青花瓷小"
        ,wp_13 ="青花瓷大"
        }
    ItemData["龙行玉泽"]={
        wp_1 = "锦衣。"
        ,wp_2 = 2
        ,wp_3 = 15
        ,wp_4 = 1
        ,wp_5 = 0
        --,wp_6 = "男"
        ,wp_11 ="r3d.dll"
        ,wp_12 ="青花瓷小"
        ,wp_13 ="青花瓷大"
        }
     ItemData["青花瓷月白"]={
        wp_1 = "锦衣。"
        ,wp_2 = 2
        ,wp_3 = 15
        ,wp_4 = 1
        ,wp_5 = 0
        ,wp_11 = "item.wdf"
        ,wp_12 = 0x60FB6A8C --小
        ,wp_13 = 0x331BA7B1
    }
     ItemData["青花瓷月黑"]={
        wp_1 = "锦衣。"
        ,wp_2 = 2
        ,wp_3 = 15
        ,wp_4 = 1
        ,wp_5 = 0
        ,wp_11 = "item.wdf"
        ,wp_12 = 0x60FB6A8C --小
        ,wp_13 = 0x331BA7B1
    }
     ItemData["齐天大圣月白"]={
        wp_1 = "锦衣。"
        ,wp_2 = 2
        ,wp_3 = 15
        ,wp_4 = 1
        ,wp_5 = 0
        ,wp_11 = "item.wdf"
        ,wp_12 = 0x60FB6A8C --小
        ,wp_13 = 0x331BA7B1
    }
      ItemData["齐天大圣月黑"]={
        wp_1 = "锦衣。"
        ,wp_2 = 2
        ,wp_3 = 15
        ,wp_4 = 1
        ,wp_5 = 0
        ,wp_11 = "item.wdf"
        ,wp_12 = 0x60FB6A8C --小
        ,wp_13 = 0x331BA7B1
    }
      ItemData["灼灼韶华"]={
        wp_1 = "锦衣。"
        ,wp_2 = 2
        ,wp_3 = 15
        ,wp_4 = 1
        ,wp_5 = 0
        ,wp_11 = "item.wdf"
        ,wp_12 = 0x60FB6A8C --小
        ,wp_13 = 0x331BA7B1
    }
     ItemData["锦鲤"]={
        wp_1 = "锦衣。"
        ,wp_2 = 2
        ,wp_3 = 15
        ,wp_4 = 1
        ,wp_5 = 0
        ,wp_11 = "item.wdf"
        ,wp_12 = 0x60FB6A8C --小
        ,wp_13 = 0x331BA7B1
    }

ItemData["青花瓷锦衣"]={
          wp_1 = "#G召唤兽锦衣，青花瓷\n#Y(鬼将,持国巡守,\n#Y谛听,画魂,\n#Y狂豹人形,猫灵人形,\n#Y雷鸟人,龙鲤,\n#Y毗舍童子,日游神,\n#Y涂山瞳,涂山雪,\n#Y吸血鬼,月魅)"
          ,wp_2 = 1
          ,wp_3 = 12
          ,wp_4 = 0
          ,wp_11 = "item.wdf"
          ,wp_12 = 0x0832E678 --小
          ,wp_13 =0x49758E77
          }
  ItemData["青花瓷锦衣·碎片"]={
        wp_1 ="集齐50个碎片右键可以兑换一个召唤兽锦衣，青花瓷系列"
        ,wp_2 = 1
        ,wp_3 = 12
        ,wp_4 = 0
        ,wp_11 = "item.wdf"
        ,wp_12 = 0x0832E678 --小
        ,wp_13 =0x49758E77
        }

        ItemData["称谓碎片"]={
        wp_1 = "300个碎片可以兑换一个属性称谓"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "pw.npk"
        ,wp_12 = 0xBF000002 --小
        ,wp_13 = 0xBF000001
        }
    ItemData["比武大会称谓礼包"]={
        wp_1 = "打开可获得特效称谓：各组比武冠亚季称号。"
        ,wp_2 = "称谓礼包"
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "pw.npk"
        ,wp_12 = 0xBF000002 --小
        ,wp_13 = 0xBF000001
        }
     ItemData["苍茫三界主沉浮称谓礼包"]={
        wp_1 = "打开可获得特效称谓：苍茫三界主沉浮。"
        ,wp_2 = "称谓礼包"
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "pw.npk"
        ,wp_12 = 0xBF000002 --小
        ,wp_13 = 0xBF000001
        }
     ItemData["独步西游若等闲称谓礼包"]={
        wp_1 = "打开可获得特效称谓：独步西游若等闲。"
        ,wp_2 = "称谓礼包"
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "pw.npk"
        ,wp_12 = 0xBF000002 --小
        ,wp_13 = 0xBF000001
        }
     ItemData["一举成名天下惊称谓礼包"]={
        wp_1 = "打开可获得特效称谓：一举成名天下惊。"
        ,wp_2 = "称谓礼包"
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "pw.npk"
        ,wp_12 = 0xBF000002 --小
        ,wp_13 = 0xBF000001
        }
     ItemData["神豪称谓礼包"]={
        wp_1 = "打开可获得特效称谓：神豪。"
        ,wp_2 = "称谓礼包"
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "pw.npk"
        ,wp_12 = 0xBF000002 --小
        ,wp_13 = 0xBF000001
        }
    ItemData["威震天下称谓礼包"]={
        wp_1 = "打开可获得特效称谓：威震天下。\n限时7天"
        ,wp_2 = "称谓礼包"
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "pw.npk"
        ,wp_12 = 0xBF000002 --小
        ,wp_13 = 0xBF000001
        }
    ItemData["傲视群雄唯我独尊称谓礼包"]={
        wp_1 = "打开可获得特效称谓：傲视群雄唯我独尊。"
        ,wp_2 = "称谓礼包"
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "pw.npk"
        ,wp_12 = 0xBF000002 --小
        ,wp_13 = 0xBF000001
        }
    ItemData["九天揽月称谓礼包"]={
        wp_1 = "打开可获得特效称谓：九天揽月。"
        ,wp_2 = "称谓礼包"
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "pw.npk"
        ,wp_12 = 0xBF000002 --小
        ,wp_13 = 0xBF000001
        }
    --------足迹
    -- ItemData["南瓜足迹"]={
    --     wp_1 = "甜蜜的糖果，满载着我对你的爱意。"
    --     ,wp_3 = 18
    --     ,wp_2 = "足迹"
    --     ,wp_4 = 4
    --     ,wp_5 = 0
    --     ,wp_12 = 0x061EAC67
    --     ,wp_13= 0x2F18CFD6
    --     }

    --------足迹

    ItemData["灵箓"] = {
        wp_1 = "拥有灵力的符箓，可点化灵饰，附加随机类型的特性效果\n【功效】给灵饰附加特性\n#Y【限制】灵饰"
        , wp_2 = 188
        , wp_3 = 1
        , wp_4 = 1
        , wp_11 = "物品图标.wdf"
        , wp_12 = 0x14577FB6--小
        , wp_13 = 0x6B665BCC
        }
    ItemData["钟灵石"] = {
        wp_1 = "拥有灵力的石头，可点化灵饰，附加特性效果\n【功效】给灵饰附加特性\n#Y【限制】灵饰"
        , wp_2 = 5
        , wp_3 = 7
        , wp_4 = 1
        , wp_11 = "物品图标.wdf"
        , wp_12 = 0x01000001--小
        , wp_13 = 0x01000002
        }
    ItemData["自我陶醉钟灵石"] = {
        wp_1 = "拥有自我陶醉灵力的石头，可点化灵饰，附加自我陶醉特性\n【功效】给灵饰附加特性\n#Y【限制】灵饰"
        , wp_2 = 5
        , wp_3 = 7
        , wp_4 = 1
        , wp_11 = "物品图标.wdf"
        , wp_12 = 0x01000001
        , wp_13 = 0x01000002
        }
    ItemData["心源钟灵石"] = {
        wp_1 = "拥有心源灵力的石头，可点化灵饰，附加心源特性\n【功效】给灵饰附加特性\n#Y【限制】灵饰"
        , wp_2 = 5
        , wp_3 = 7
        , wp_4 = 1
        , wp_11 = "物品图标.wdf"
        , wp_12 = 0x01000001
        , wp_13 = 0x01000002
        }
    ItemData["163钟灵石"] = {
        wp_1 = "拥有163灵力的石头，可点化灵饰，附加163特性\n【功效】给灵饰附加特性\n#Y【限制】灵饰"
        , wp_2 = 5
        , wp_3 = 7
        , wp_4 = 1
        , wp_11 = "物品图标.wdf"
        , wp_12 = 0x01000001
        , wp_13 = 0x01000002
        }
    ItemData["健步如飞钟灵石"] = {
        wp_1 = "拥有健步如飞灵力的石头，可点化灵饰，附加健步如飞特性\n【功效】给灵饰附加特性\n#Y【限制】灵饰"
        , wp_2 = 5
        , wp_3 = 7
        , wp_4 = 1
        , wp_11 = "物品图标.wdf"
        , wp_12 = 0x01000001
        , wp_13 = 0x01000002
        }
    ItemData["血气方刚钟灵石"] = {
        wp_1 = "拥有血气方刚灵力的石头，可点化灵饰，附加血气方刚特性\n【功效】给灵饰附加特性\n#Y【限制】灵饰"
        , wp_2 = 5
        , wp_3 = 7
        , wp_4 = 1
        , wp_11 = "物品图标.wdf"
        , wp_12 = 0x01000001
        , wp_13 = 0x01000002
        }
    ItemData["回春之术钟灵石"] = {
        wp_1 = "拥有回春之术灵力的石头，可点化灵饰，附加回春之术特性\n【功效】给灵饰附加特性\n#Y【限制】灵饰"
        , wp_2 = 5
        , wp_3 = 7
        , wp_4 = 1
        , wp_11 = "物品图标.wdf"
        , wp_12 = 0x01000001
        , wp_13 = 0x01000002
        }
    ItemData["锐不可当钟灵石"] = {
        wp_1 = "拥有锐不可当灵力的石头，可点化灵饰，附加锐不可当特性\n【功效】给灵饰附加特性\n#Y【限制】灵饰"
        , wp_2 = 5
        , wp_3 = 7
        , wp_4 = 1
        , wp_11 = "物品图标.wdf"
        , wp_12 = 0x01000001
        , wp_13 = 0x01000002
        }
    ItemData["淬灵石"] = {
        wp_1 = "神器的灵符，可吸取灵饰上已经附加的特性。\n【功效】吸取灵饰特性，获得钟灵石\n#Y【限制】灵饰"
        , wp_2 = 189
        , wp_3 = 1
        , wp_4 = 1
        , wp_11 = "item.wdf"
        , wp_12 = 0x085E4AEB--小
        , wp_13 = 0x7F55487B
        }
        ItemData["月饼"]={
        wp_1 = "中秋节活动的奖品，食用后可以增加人物1点潜能（不可以对召唤兽使用），但每个人物最多食用1000个月饼"
        ,wp_2 = "潜力"
        ,wp_3 = 10
        ,wp_4 = 1
        ,wp_8 = 1
        ,wp_11 = "item.wdf"
        ,wp_12 = 0x846AD205
        ,wp_13 = 0x49B4F6DC
        }
      ItemData["归墟共生"]={
        wp_1 = "开启轮回之虚的凭证，可以隐隐感觉到其中蕴含着深不可测的法力(5人组队可以开启队员的轮回之虚，完成后会获得大量奖励)\n#Y副本·共生  难度★★★"
        ,wp_2 = 103
        ,wp_3 = 3
        ,wp_4 = 1
        ,wp_7 = {"【说明】:右键使用"}
        ,wp_11 = "xr.rpk"
        ,wp_12 = "归墟小"
        ,wp_13 = "归墟大"
        }
        ItemData["归墟激战"]={
        wp_1 = "开启轮回之虚的凭证，可以隐隐感觉到其中蕴含着深不可测的法力(5人组队可以开启队员的轮回之虚，完成后会获得大量奖励)\n#Y副本·激战  难度★★★"
        ,wp_2 = 103
        ,wp_3 = 3
        ,wp_4 = 1
        ,wp_7 = {"【说明】:右键使用"}
        ,wp_11 = "xr.rpk"
        ,wp_12 = "归墟小"
        ,wp_13 = "归墟大"
        }
        ItemData["归墟应变"]={
        wp_1 = "开启轮回之虚的凭证，可以隐隐感觉到其中蕴含着深不可测的法力(5人组队可以开启队员的轮回之虚，完成后会获得大量奖励)\n#Y副本·应变  难度★★★"
        ,wp_2 = 103
        ,wp_3 = 3
        ,wp_4 = 1
        ,wp_7 = {"【说明】:右键使用"}
        ,wp_11 = "xr.rpk"
        ,wp_12 = "归墟小"
        ,wp_13 = "归墟大"
        }
        ItemData["归墟悟空"]={
        wp_1 = "开启轮回之虚的凭证，可以隐隐感觉到其中蕴含着深不可测的法力(5人组队可以开启队员的轮回之虚，完成后会获得大量奖励)\n#Y副本·悟空  难度★★★"
        ,wp_2 = 103
        ,wp_3 = 3
        ,wp_4 = 1
        ,wp_7 = {"【说明】:右键使用"}
        ,wp_11 = "xr.rpk"
        ,wp_12 = "归墟小"
        ,wp_13 = "归墟大"
        }

     ItemData["至尊强化石"]={
        wp_1 = "消耗强化石强化"
        ,wp_2 = 101
        ,wp_3 = 3
        ,wp_4 = 4
        ,wp_11 = "UI.wdf"
        ,wp_12 = 0xAABB0007
        ,wp_13 = 0xAABB0006
        }
    ItemData["护符"]={
        wp_1 = "消耗护符,强化失败装备不降级"
        ,wp_2 = 101
        ,wp_3 = 3
        ,wp_4 = 1
        ,wp_11 = "item.wdf"
        ,wp_12 = 0x8FA84829
        ,wp_13 = 0x2DFD9D18
        ,wp_14 = 80
        }
     ItemData["小马"]={
        wp_1 = "普通坐骑,额外附加属性"
        ,wp_2 = 113
        ,wp_3 = 2
        ,wp_4 = 0
        ,wp_11 = "item.wdf"
        ,wp_12 = 0x60FB6A8C --小
        ,wp_13 = 0x331BA7B1
    }

     ItemData["长耳兔"]={
        wp_1 = "普通坐骑,额外附加属性"
        ,wp_2 = 113
        ,wp_3 = 2
        ,wp_4 = 0
        ,wp_11 = "item.wdf"
        ,wp_12 = 0x60FB6A8C --小
        ,wp_13 = 0x331BA7B1
    }
ItemData["特殊元宵礼包"] = {
        wp_1 = "右击打开随机各种特殊元宵，增加召唤兽资质"
        , wp_2 = 1
        , wp_3 = 11
        , wp_4 = 0
        , wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 0x522C3747
        ,wp_13 = 0xF04964D3
    }
ItemData["特殊元宵_攻"] = {
        wp_1 = ""
        ,wp_2 = 1
        ,wp_3 = 10
        ,wp_4 = 2
        , wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 0x522C3747
        ,wp_13 = 0xF04964D3
    }
ItemData["特殊元宵_防"] = {
        wp_1 = ""
        ,wp_2 = 1
        ,wp_3 = 10
        ,wp_4 = 2
        , wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 0x522C3747
        ,wp_13 = 0xF04964D3
    }
    ItemData["特殊元宵_躲"] = {
        wp_1 = ""
        ,wp_2 = 1
        ,wp_3 = 10
        ,wp_4 = 2
        , wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 0x522C3747
        ,wp_13 = 0xF04964D3
    }
ItemData["特殊元宵_法"] = {
        wp_1 = ""
        ,wp_2 = 1
        ,wp_3 = 10
        ,wp_4 = 2
        , wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 0x522C3747
        ,wp_13 = 0xF04964D3
    }
    ItemData["特殊元宵_速"] = {
        wp_1 = ""
        ,wp_2 = 1
        ,wp_3 = 10
        ,wp_4 = 2
        , wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 0x522C3747
        ,wp_13 = 0xF04964D3
    }
    ItemData["特殊元宵_体"] = {
        wp_1 = ""
        ,wp_2 = 1
        ,wp_3 = 10
        ,wp_4 = 2
        , wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 0x522C3747
        ,wp_13 = 0xF04964D3
    }
    ItemData["特殊元宵_成长"] = {
        wp_1 = ""
        ,wp_2 = 1
        ,wp_3 = 10
        ,wp_4 = 2
        , wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 0x522C3747
        ,wp_13 = 0xF04964D3
    }

    ItemData["BB装备65级礼包"]={
        wp_1 = "开启可获得相应等级随机宝宝装备\n【等级】65"
        ,wp_2 = 113
        ,wp_3 = 2
        ,wp_4 = 0
        ,wp_11 = "各类礼包图标.wdf"--"item.wdf"
        ,wp_12 = 0x10003400--2650955991 --小
        ,wp_13 = 0x10002200--2817725067
    }
    ItemData["BB装备75级礼包"]={
        wp_1 = "开启可获得相应等级随机宝宝装备\n【等级】75"
        ,wp_2 = 113
        ,wp_3 = 2
        ,wp_4 = 0
        ,wp_11 = "各类礼包图标.wdf"--"item.wdf"
        ,wp_12 = 0x10003400--2650955991 --小
        ,wp_13 = 0x10002200--2817725067
    }
    ItemData["BB装备85级礼包"]={
        wp_1 = "开启可获得相应等级随机宝宝装备\n【等级】85"
        ,wp_2 = 113
        ,wp_3 = 2
        ,wp_4 = 0
        ,wp_11 = "各类礼包图标.wdf"--"item.wdf"
        ,wp_12 = 0x10003400--2650955991 --小
        ,wp_13 = 0x10002200--2817725067
    }
    ItemData["BB装备95级礼包"]={
        wp_1 = "开启可获得相应等级随机宝宝装备\n【等级】95"
        ,wp_2 = 113
        ,wp_3 = 2
        ,wp_4 = 0
        ,wp_11 = "各类礼包图标.wdf"--"item.wdf"
        ,wp_12 = 0x10003400--2650955991 --小
        ,wp_13 = 0x10002200--2817725067
    }
    ItemData["BB装备105级礼包"]={
        wp_1 = "开启可获得相应等级随机宝宝装备\n【等级】105"
        ,wp_2 = 113
        ,wp_3 = 2
        ,wp_4 = 0
        ,wp_11 = "各类礼包图标.wdf"--"item.wdf"
        ,wp_12 = 0x10003400--2650955991 --小
        ,wp_13 = 0x10002200--2817725067
    }
    ItemData["BB装备115级礼包"]={
        wp_1 = "开启可获得相应等级随机宝宝装备\n【等级】115"
        ,wp_2 = 113
        ,wp_3 = 2
        ,wp_4 = 0
        ,wp_11 = "各类礼包图标.wdf"--"item.wdf"
        ,wp_12 = 0x10003400--2650955991 --小
        ,wp_13 = 0x10002200--2817725067
    }
    ItemData["BB装备125级礼包"]={
        wp_1 = "开启可获得相应等级随机宝宝装备\n【等级】125"
        ,wp_2 = 113
        ,wp_3 = 2
        ,wp_4 = 0
        ,wp_11 = "各类礼包图标.wdf"--"item.wdf"
        ,wp_12 = 0x10003400--2650955991 --小
        ,wp_13 = 0x10002200--2817725067
    }
    ItemData["BB装备135级礼包"]={
        wp_1 = "开启可获得相应等级随机宝宝装备\n【等级】135"
        ,wp_2 = 113
        ,wp_3 = 2
        ,wp_4 = 0
        ,wp_11 = "各类礼包图标.wdf"--"item.wdf"
        ,wp_12 = 0x10003400--2650955991 --小
        ,wp_13 = 0x10002200--2817725067
    }
    ItemData["BB装备145级礼包"]={
        wp_1 = "开启可获得相应等级随机宝宝装备\n【等级】145"
        ,wp_2 = 113
        ,wp_3 = 2
        ,wp_4 = 0
        ,wp_11 = "各类礼包图标.wdf"--"item.wdf"
        ,wp_12 = 0x10003400--2650955991 --小
        ,wp_13 = 0x10002200--2817725067
    }
    ItemData["BB装备155级礼包"]={
        wp_1 = "开启可获得相应等级随机宝宝装备\n【等级】155"
        ,wp_2 = 113
        ,wp_3 = 2
        ,wp_4 = 0
        ,wp_11 = "各类礼包图标.wdf"--"item.wdf"
        ,wp_12 = 0x10003400--2650955991 --小
        ,wp_13 = 0x10002200--2817725067
    }

    ItemData["机缘宝箱"]={
        wp_1 = "右键点击能开启抽奖"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 3424199175 --小
        ,wp_13 = 3708724141
        }
    ItemData["秘宝宝箱"]={
        wp_1 = "右键使用可以开启大转盘抽奖一次，可能获得神兜兜等珍稀道具"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 3424199175 --小
        ,wp_13 = 3708724141
        }

         ItemData["祈愿宝箱"]={
        wp_1 = "外表华贵的宝箱，蕴含祈愿之力，是迷宫主人的专属宝箱\n【使用】右键点击开始祈愿"
        ,wp_2 = 164
        ,wp_3 = 1
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 0xaf9d4681
        ,wp_13 = 0xd57c766
        }
    ItemData["神秘宝箱"]={
        wp_1 = "神秘的宝箱，上古神仙遗留下来的宝物打开宝箱可随机获得宝箱内的一件物品，打开宝箱需要一把神秘钥匙"
        ,wp_2 = 145
        ,wp_3 = 1
        ,wp_4 = 1
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 0xaf9d4681
        ,wp_13 = 0xd57c766
        }
    ItemData["神秘钥匙"]={
        wp_1 = "神秘的宝箱钥匙，可打开上古遗留下来的各类神秘宝箱"
        ,wp_2 = 146
        ,wp_3 = 1
        ,wp_4 = 1
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 0x63ec1458
        ,wp_13 = 0x69978a40
        }
    ItemData["铜钥匙"]={
        wp_1 = "铜制钥匙，能打开对应类型的宝箱"
        ,wp_2 = 148
        ,wp_3 = 1
        ,wp_4 = 1
        ,wp_11 = "item.wdf"
        ,wp_12 = 0xf5f06b0
        ,wp_13 = 0xafddad30
        }
    ItemData["银钥匙"]={
        wp_1 = "银制钥匙，能打开对应类型的宝箱"
        ,wp_2 = 148
        ,wp_3 = 2
        ,wp_4 = 1
        ,wp_11 = "item.wdf"
        ,wp_12 = 0x51e52f58
        ,wp_13 = 0xd65c5b3d
        }
    ItemData["金钥匙"]={
        wp_1 = "金制钥匙，能打开对应类型的宝箱"
        ,wp_2 = 148
        ,wp_3 = 3
        ,wp_4 = 1
        ,wp_11 = "item.wdf"
        ,wp_12 = 0x21ad8898
        ,wp_13 = 0x1d70abbd
        }

    ItemData["翻一番"]={
        wp_1 = "用于抵扣翻一番首次消耗的仙玉!\n右键使用增加 翻一番次数：1"
         ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
         ,wp_11 = "item.wd1"
         ,wp_12 = 0xfd5df2c1
         ,wp_13 = 0x445e4462
        }

    ItemData["法宝精华"] = {
        wp_1 = "蕴含法宝精华灵气，使用后可增加1点法宝精华"
        , wp_2 = 193
        , wp_3 = 1
        , wp_4 = 2
        , wp_11 = "item.wdf"
        , wp_12 = 0xa7b4fe9
        , wp_13 = 0x34fb2cd2
    }
    ItemData["本命法宝门派秘籍"] = {
        wp_1 = "本命法宝秘籍，每个秘籍都对应不同的属性，可为本命法宝共计附加3本秘籍\n#G/【用法】鉴定后在本命法宝页面镶嵌即可#P/【特殊】直接出售可获得法宝精华*1"
        , wp_2 = 193
        , wp_3 = 1
        , wp_4 = 2
        , wp_11 = "item.wdf"
        , wp_12 = 0x1e716ea3
        , wp_13 = 0xf2ee33bf
    }
    ItemData["本命法宝礼包"] = {
        wp_1 = "本命法宝材料礼包，内含法宝精华*99，未鉴定本命法宝门派秘籍*1本"
        , wp_2 = 193
        , wp_3 = 1
        , wp_4 = 2
        , wp_11 = "item.wdf"
        , wp_12 = 0xa7b4fe9
        , wp_13 = 0x34fb2cd2
    }
     ItemData["120无级别礼包"] = {
        wp_1 = ""
        , wp_2 = "无级别礼包"
        , wp_3 = 1
        , wp_4 = 2
        , wp_11 = "item.wdf"
        , wp_12 = 0xa7b4fe9
        , wp_13 = 0x34fb2cd2
    }
    ItemData["130无级别礼包"]={
        wp_1 = "为您量身定制的一套装备礼包\n【等级】130"
        ,wp_2 = 113
        ,wp_3 = 2
        ,wp_4 = 0
        ,wp_11 = "item.wdf"
        ,wp_12 = 1687078938--0x65AE0DFF
        ,wp_13 = 4188923289--0x2CE03BE9
        }
    ItemData["140无级别礼包"]={
        wp_1 = "为您量身定制的一套装备礼包\n【等级】140"
        ,wp_2 = 113
        ,wp_3 = 2
        ,wp_4 = 0
        ,wp_11 = "item.wdf"
        ,wp_12 = 1687078938--0x65AE0DFF
        ,wp_13 = 4188923289--0x2CE03BE9
    }
    ItemData["150无级别礼包"] = {
        wp_1 = ""
        , wp_2 = "无级别礼包"
        , wp_3 = 1
        , wp_4 = 2
        , wp_11 = "item.wdf"
        , wp_12 = 0xa7b4fe9
        , wp_13 = 0x34fb2cd2

    }ItemData["160无级别礼包"] = {
        wp_1 = ""
        , wp_2 = "无级别礼包"
        , wp_3 = 1
        , wp_4 = 2
        , wp_11 = "item.wdf"
        , wp_12 = 0xa7b4fe9
        , wp_13 = 0x34fb2cd2
    }
 ItemData["160随机装备"]={
        wp_1 = "随机一件160装备\n【等级】160"
        ,wp_2 = 113
        ,wp_3 = 2
        ,wp_4 = 0
        ,wp_11 = "item.wdf"
        ,wp_12 = 1687078938--0x65AE0DFF
        ,wp_13 = 4188923289--0x2CE03BE9
    }
    ItemData["随机140无级别装备"]={
        wp_1 = "随机一件140无级别装备\n【等级】140"
        ,wp_2 = 113
        ,wp_3 = 2
        ,wp_4 = 0
        ,wp_11 = "item.wdf"
        ,wp_12 = 1687078938--0x65AE0DFF
        ,wp_13 = 4188923289--0x2CE03BE9
    }
    ItemData["随机150无级别装备"]={
        wp_1 = "随机一件150无级别装备\n【等级】150"
        ,wp_2 = 113
        ,wp_3 = 2
        ,wp_4 = 0
        ,wp_11 = "item.wdf"
        ,wp_12 = 1687078938--0x65AE0DFF
        ,wp_13 = 4188923289--0x2CE03BE9
    }
    ItemData["随机160无级别装备"]={
        wp_1 = "随机一件160无级别装备\n【等级】160"
        ,wp_2 = 113
        ,wp_3 = 2
        ,wp_4 = 0
        ,wp_11 = "item.wdf"
        ,wp_12 = 1687078938--0x65AE0DFF
        ,wp_13 = 4188923289--0x2CE03BE9
    }
    -- ItemData["随机160灵饰箱"] = {
    --     wp_1 = "打开随机获得一个部位的160级灵饰！带无级别特效,无法洗练属性"
    --     , wp_2 = "随机"
    --     , wp_3 = 11
    --     , wp_4 = 0
    --     , wp_8 = 3
    --     , wp_11 = "xinui.wdf"
    --     , wp_12 = 0xA1FE6647
    --     , wp_13 = 0xA1FE6648
    -- }
    ItemData["160随机灵饰箱"] = {
        wp_1 = "打开随机获得一个部位的160级灵饰！带无级别特效,无法洗练属性"
        , wp_2 = "随机"
        , wp_3 = 11
        , wp_4 = 0
        , wp_8 = 3
        , wp_11 = "xinui.wdf"
        , wp_12 = 0xA1FE6647
        , wp_13 = 0xA1FE6648
    }
    ItemData["会员卡"] = {
        wp_1 = ""
        , wp_2 = "会员卡"
        , wp_3 = 1
        , wp_4 = 2
        , wp_11 = "item.wdf"
        , wp_12 = 0xa7b4fe9
        , wp_13 = 0x34fb2cd2
    }

    ItemData["玄灵珠·回春礼包"] = {
        wp_1 = "玄灵珠礼包\n开启可获得对应玄灵珠1-10级各一个"
        , wp_2 = 1
        , wp_3 = 11
        , wp_4 = 0
        , wp_8 = 3
        , wp_11 = "jiandan.dll"
        , wp_12 = "玄灵珠破军小"
        , wp_13 = "玄灵珠破军大"
    }

    ItemData["玄灵珠·破军礼包"] = {
        wp_1 = "玄灵珠礼包\n开启可获得对应玄灵珠1-10级各一个"
        , wp_2 = 1
        , wp_3 = 11
        , wp_4 = 0
        , wp_8 = 3
        , wp_11 = "jiandan.dll"
        , wp_12 = "玄灵珠破军小"
        , wp_13 = "玄灵珠破军大"
    }

    ItemData["玄灵珠·空灵礼包"] = {
        wp_1 = "玄灵珠礼包\n开启可获得对应玄灵珠1-10级各一个"
        , wp_2 = 1
        , wp_3 = 11
        , wp_4 = 0
        , wp_8 = 3
        , wp_11 = "jiandan.dll"
        , wp_12 = "玄灵珠破军小"
        , wp_13 = "玄灵珠破军大"
    }

    ItemData["玄灵珠·噬魂礼包"] = {
        wp_1 = "玄灵珠礼包\n开启可获得对应玄灵珠1-10级各一个"
        , wp_2 = 1
        , wp_3 = 11
        , wp_4 = 0
        , wp_8 = 3
        , wp_11 = "jiandan.dll"
        , wp_12 = "玄灵珠破军小"
        , wp_13 = "玄灵珠破军大"
    }

    ItemData["五色灵尘礼包"]={
        wp_1 = "右键使用可获得1-10级五色灵尘各一个。"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "yp.wdf"
        ,wp_12 = 0x10000092
        ,wp_13 = 0xFFF92026
        }

    ItemData["高级宝石袋"]={
        wp_1 = "散发出夺目的光芒，强大的发力在四周环绕。随机获得一颗10-20级宝石"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 0xB8B99DFD --小
        ,wp_13 = 0xFE37E4E0
        }
        ItemData["星辉石袋"]={
        wp_1 = "散发出夺目的光芒，强大的发力在四周环绕。随机获得一颗5-15级星辉石"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 0xB8B99DFD --小
        ,wp_13 = 0xFE37E4E0
        }
        ItemData["精魄灵石袋"]={
        wp_1 = "散发出夺目的光芒，强大的发力在四周环绕。随机获得一颗1-10级精魄灵石"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 0xB8B99DFD --小
        ,wp_13 = 0xFE37E4E0
        }

        ItemData["1级宝石礼包"]={
        wp_1 = "装着一代珠宝，散发着宝石的光华"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 830397566 --小
        ,wp_13 = 452924612
        }
    ItemData["2级宝石礼包"]={
        wp_1 = "装着一代珠宝，散发着宝石的光华"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 830397566 --小
        ,wp_13 = 452924612
        }
    ItemData["3级宝石礼包"]={
        wp_1 = "装着一代珠宝，散发着宝石的光华"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 830397566 --小
        ,wp_13 = 452924612
        }
    ItemData["4级宝石礼包"]={
        wp_1 = "装着一代珠宝，散发着宝石的光华"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 830397566 --小
        ,wp_13 = 452924612
        }
    ItemData["5级宝石礼包"]={
        wp_1 = "装着一代珠宝，散发着宝石的光华"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 830397566 --小
        ,wp_13 = 452924612
        }
    ItemData["6级宝石礼包"]={
        wp_1 = "装着一代珠宝，散发着宝石的光华"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 830397566 --小
        ,wp_13 = 452924612
        }
    ItemData["7级宝石礼包"]={
        wp_1 = "装着一代珠宝，散发着宝石的光华"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 830397566 --小
        ,wp_13 = 452924612
        }
    ItemData["8级宝石礼包"]={
        wp_1 = "装着一代珠宝，散发着宝石的光华"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 830397566 --小
        ,wp_13 = 452924612
        }

        ItemData["9级宝石礼包"]={
        wp_1 = "装着一代珠宝，散发着宝石的光华"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 830397566 --小
        ,wp_13 = 452924612
        }

        ItemData["10级宝石礼包"]={
        wp_1 = "装着一代珠宝，散发着宝石的光华"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 830397566 --小
        ,wp_13 = 452924612
        }

        ItemData["11级宝石礼包"]={
        wp_1 = "装着一代珠宝，散发着宝石的光华"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 830397566 --小
        ,wp_13 = 452924612
        }

        ItemData["12级宝石礼包"]={
        wp_1 = "装着一代珠宝，散发着宝石的光华"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 830397566 --小
        ,wp_13 = 452924612
        }

        ItemData["13级宝石礼包"]={
        wp_1 = "装着一代珠宝，散发着宝石的光华"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 830397566 --小
        ,wp_13 = 452924612
        }

        ItemData["14级宝石礼包"]={
        wp_1 = "装着一代珠宝，散发着宝石的光华"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 830397566 --小
        ,wp_13 = 452924612
        }

        ItemData["15级宝石礼包"]={
        wp_1 = "装着一代珠宝，散发着宝石的光华"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 830397566 --小
        ,wp_13 = 452924612
        }

        ItemData["16级宝石礼包"]={
        wp_1 = "装着一代珠宝，散发着宝石的光华"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 830397566 --小
        ,wp_13 = 452924612
        }

        ItemData["17级宝石礼包"]={
        wp_1 = "装着一代珠宝，散发着宝石的光华"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 830397566 --小
        ,wp_13 = 452924612
        }

        ItemData["18级宝石礼包"]={
        wp_1 = "装着一代珠宝，散发着宝石的光华"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 830397566 --小
        ,wp_13 = 452924612
        }

-----召唤兽礼包
 ItemData["神柚礼包"]={
        wp_1 = "神柚礼包\n#Y【使用方式】鼠标右键使用"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 0x9CD7C4A4 --小
        ,wp_13 = 0xAF9AAFB9
        }
        ItemData["飞廉礼包"]={
        wp_1 = "飞廉礼包\n#Y【使用方式】鼠标右键使用"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 0x9CD7C4A4 --小
        ,wp_13 = 0xAF9AAFB9
        }
        ItemData["红孩儿礼包"]={
        wp_1 = "红孩儿礼包\n#Y【使用方式】鼠标右键使用"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 0x9CD7C4A4 --小
        ,wp_13 = 0xAF9AAFB9
        }

        ItemData["进阶雷龙"]={
        wp_1 = "进阶雷龙\n#Y【使用方式】鼠标右键使用"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 959572106 --小
        ,wp_13 = 2953344867
        }
        ItemData["恶魔泡泡礼包"]={
        wp_1 = "恶魔泡泡\n#Y【使用方式】鼠标右键使用"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 0x9CD7C4A4 --小
        ,wp_13 = 0xAF9AAFB9
        }
        ItemData["小白龙礼包"]={
        wp_1 = "小白龙礼包，自选物理或者法术！\n#Y【使用方式】鼠标右键使用"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 0x9CD7C4A4 --小
        ,wp_13 = 0xAF9AAFB9
        }

        ItemData["超级小白龙(物)"]={
        wp_1 = "打开获得一只物理型超级小白龙！\n#Y【使用方式】鼠标右键使用"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 0x9CD7C4A4 --小
        ,wp_13 = 0xAF9AAFB9
        }
        ItemData["超级小白龙(法)"]={
        wp_1 = "打开获得一只法术型超级小白龙！\n#Y【使用方式】鼠标右键使用"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 0x9CD7C4A4 --小
        ,wp_13 = 0xAF9AAFB9
        }

        ItemData["鲲鹏礼包"]={
        wp_1 = "鲲鹏礼包，自选物理或者法术！\n#Y【使用方式】鼠标右键使用"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 0x9CD7C4A4 --小
        ,wp_13 = 0xAF9AAFB9
        }

        ItemData["五福鲲鹏礼包(血)"]={
        wp_1 = "鲲鹏礼包，打开获得一只五福鲲鹏血宠！\n#Y【使用方式】鼠标右键使用"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 0x9CD7C4A4 --小
        ,wp_13 = 0xAF9AAFB9
        }

        ItemData["鲲鹏礼包(物)"]={
        wp_1 = "鲲鹏礼包，打开获得一只物理鲲鹏！\n#Y【使用方式】鼠标右键使用"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 0x9CD7C4A4 --小
        ,wp_13 = 0xAF9AAFB9
        }
        ItemData["鲲鹏礼包(法)"]={
        wp_1 = "鲲鹏礼包，打开获得一只法术鲲鹏！\n#Y【使用方式】鼠标右键使用"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 0x9CD7C4A4 --小
        ,wp_13 = 0xAF9AAFB9
        }
        ItemData["五福鲲鹏礼包"]={
        wp_1 = "五福鲲鹏礼包，自选物理或者法术！\n#Y【使用方式】鼠标右键使用"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 0x9CD7C4A4 --小
        ,wp_13 = 0xAF9AAFB9
        }

        ItemData["五福鲲鹏礼包(法)"]={
        wp_1 = "五福鲲鹏礼包，打开获得一只五福法术鲲鹏！\n#Y【使用方式】鼠标右键使用"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 0x9CD7C4A4 --小
        ,wp_13 = 0xAF9AAFB9
        }
         ItemData["五福鲲鹏礼包(物)"]={
        wp_1 = "五福鲲鹏礼包，打开获得一只五福物理鲲鹏！\n#Y【使用方式】鼠标右键使用"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 0x9CD7C4A4 --小
        ,wp_13 = 0xAF9AAFB9
        }
        ItemData["19技能鲲鹏礼包"]={
        wp_1 = "19技能关照鲲鹏礼包！\n#Y【使用方式】鼠标右键使用"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 0x9CD7C4A4 --小
        ,wp_13 = 0xAF9AAFB9
        }
        ItemData["兽魂技能转换符"]={
                        wp_1 = "可更换原兽魂技能，技能为自选。"
                        ,wp_2 = 101
                        ,wp_3 = 3
                        ,wp_4 = 10
                        ,wp_11 = "common/item.wdf"
                        ,wp_12 = 0x1BDB1D61
                        ,wp_13 = 0x318BE114
            }
        ItemData["技能书"]={
        wp_1 = "和魔兽要诀或高级魔兽要诀一起使用，可以为召唤兽增加一个技能格子\n【说明】：袁天罡处使用\n#Y/【限制】：技能≥12且≤19\n【限制】：进化后最高上限20"
        ,wp_2 = 180
        ,wp_3 = 2
        ,wp_4 = 1
        ,wp_11 = "item.wdf"
        ,wp_12 = 0x69E73895
        ,wp_13 = 0x16127031
        }
        ItemData["指定门派秘籍"] = {
        wp_1 = "本命法宝秘籍，每个秘籍都对应不同的属性，可为本命法宝共计附加3本秘籍\n#G/【用法】鉴定后在本命法宝页面镶嵌即可#P/【特殊】直接出售可获得法宝精华*1"
        , wp_2 = 193
        , wp_3 = 1
        , wp_4 = 2
        , wp_11 = "item.wdf"
        , wp_12 = 0x1e716ea3
        , wp_13 = 0xf2ee33bf
    }
     ItemData["专属大礼包"]={
        wp_1 = "使用邀请码创建账号，专属的礼包！\n#Y【使用方式】鼠标右键使用"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 959572106 --小
        ,wp_13 = 2953344867
        }
    ItemData["月卡"]={
        wp_1 = "使用给予月卡专属炫酷称谓\n#Y【使用方式】鼠标右键使用"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "sjm.wdf"
        ,wp_12 = 0x00000771 --小
        ,wp_13 = 0x00000771
        }
    ItemData["会员周卡"]={
        wp_1 = "使用后激活7天会员"
        ,wp_2 = 100
        ,wp_3 = 1
        ,wp_4 = 1
        ,wp_11 = "sjm.wdf"
        ,wp_12 = 0x00000771 --小
        ,wp_13 = 0x00000772
        }
    ItemData["会员月卡"]={
        wp_1 = "使用后激活30天会员"
        ,wp_2 = 100
        ,wp_3 = 1
        ,wp_4 = 1
        ,wp_11 = "sjm.wdf"
        ,wp_12 = 0x00000771 --小
        ,wp_13 = 0x00000772
        }
      ItemData["会员年卡"]={
        wp_1 = "使用后激活365天会员"
        ,wp_2 = 100
        ,wp_3 = 1
        ,wp_4 = 1
        ,wp_11 = "sjm.wdf"
        ,wp_12 = 0x00000771 --小
        ,wp_13 = 0x00000772
        }

   ItemData["一级符石礼包"]={
        wp_1 = "打开能获得1个#G一级未激活的符石\n【使用方式】鼠标右键使用"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 2650955991 --小
        ,wp_13 = 2817725067
        }
    ItemData["二级符石礼包"]={
        wp_1 = "打开能获得1个#G二级未激活的符石\n【使用方式】鼠标右键使用"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 2650955991 --小
        ,wp_13 = 2817725067
        }
    ItemData["三级符石礼包"]={
        wp_1 = "打开能获得1个#G三级未激活的符石\n【使用方式】鼠标右键使用"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 2650955991 --小
        ,wp_13 = 2817725067
        }
        ItemData["新三级符石礼包"]={
        wp_1 = "打开能获得1个#G新三级未激活的符石\n【使用方式】鼠标右键使用"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 0xB39A2CAB
        ,wp_13 = 0x2675DF2C
        }

        -----------------------即时对战-------------------
    ItemData["沸涌炎海的信标"]={--XXXX挑战怪
        wp_1 = "可传送至未知空间,挑战难度:★★★.\n\n#G难度单独计算不同于日常活动.\n\n#R炼狱难度挑战."
        ,wp_2 = 1
        ,wp_3 = 1
        ,wp_4 = 2
        ,wp_8 = 1
        ,wp_11 = "common/item.wdf"
        ,wp_12 =0xC97D2B11
        ,wp_13 =0xC8389D67
        }
    ItemData["钢铁炼境的信标"]={--XXXX挑战怪
        wp_1 = "可传送至未知空间,挑战难度:★★★★.\n\n#G难度单独计算不同于日常活动.\n\n#R炼狱难度挑战."
        ,wp_2 = 1
        ,wp_3 = 1
        ,wp_4 = 2
        ,wp_8 = 1
        ,wp_11 = "common/item.wdf"
        ,wp_12 =0xE142454C
        ,wp_13 =0xE058C0DC
        }
    ItemData["雷鸣废土的信标"]={--XXXX挑战怪
        wp_1 = "可传送至未知空间,挑战难度:★★★★★.\n\n#G难度单独计算不同于日常活动.\n\n#R炼狱难度挑战."
        ,wp_2 = 1
        ,wp_3 = 1
        ,wp_4 = 2
        ,wp_8 = 1
        ,wp_11 = "common/item.wdf"
        ,wp_12 =0x2C726C89
        ,wp_13 =0xCC1C23CC
        }
    ItemData["幽夜暗域的信标"]={--XXXX挑战怪
        wp_1 = "可传送至未知空间,挑战难度:★★★★★★.\n\n#G难度单独计算不同于日常活动.\n\n#R炼狱难度挑战."
        ,wp_2 = 1
        ,wp_3 = 1
        ,wp_4 = 2
        ,wp_8 = 1
        ,wp_11 = "common/item.wdf"
        ,wp_12 =0x542B8C3E
        ,wp_13 =0xC5C979B0
        }
    ItemData["混乱终末的信标"]={--XXXX挑战怪
        wp_1 = "可传送至未知空间,挑战难度:★★★★★★★★.\n\n#G难度单独计算不同于日常活动.\n\n#R炼狱难度挑战."
        ,wp_2 = 1
        ,wp_3 = 1
        ,wp_4 = 2
        ,wp_8 = 1
        ,wp_11 = "common/item.wdf"
        ,wp_12 =0x6215BD66
        ,wp_13 =0x93B5E4
        }
    ItemData["伟大虚空的信标"]={--XXXX挑战怪
        wp_1 = "可传送至未知空间,挑战难度:★★★★★★★★.\n\n#G难度单独计算不同于日常活动.\n\n#R炼狱难度挑战."
        ,wp_2 = 1
        ,wp_3 = 1
        ,wp_4 = 2
        ,wp_8 = 1
        ,wp_11 = "common/item.wdf"
        ,wp_12 =0x647D0CF8
        ,wp_13 =0x3BEE567D
        }
    ItemData["巅峰领域的信标"]={--XXXX挑战怪
        wp_1 = "可传送至未知空间,挑战难度:★★★★★★★★★.\n\n#G难度单独计算不同于日常活动.\n\n#R炼狱难度挑战."
        ,wp_2 = 1
        ,wp_3 = 1
        ,wp_4 = 2
        ,wp_8 = 1
        ,wp_11 = "common/item.wdf"
        ,wp_12 =0xD5C45384
        ,wp_13 =0xD5951E2E
        }
-----------------------即时对战-------------------
-------------新增
        ItemData["星石礼包"]={
        wp_1 = "打开能获得1个#G未激活的星石\n【使用方式】鼠标右键使用"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 959572106 --小
        ,wp_13 = 2953344867
        }
-----------------------------------------
ItemData["魔兽要诀"]={
        wp_1 = "记载着上古普通魔兽特技，可供你的召唤兽学习。"
        ,wp_2 = 3
        ,wp_3 = 1
        ,wp_4 = 0
        ,wp_11 = "item.wdf"
        ,wp_12 = 1241924823
        ,wp_13 = 2950829831
        }
    ItemData["超级魔兽要诀"]={
        wp_1 = "记载着上古超级魔兽特技，可供你的召唤兽学习。"
        ,wp_2 = 3
        ,wp_3 = 1
        ,wp_4 = 0
        ,wp_11 = "pw.npk"
        ,wp_12 = 0xBF000007
        ,wp_13 = 0xBF000006
        }
    ItemData["特殊魔兽要诀"]={
        wp_1 = "记载着上古特殊魔兽特技，可供你的召唤兽学习。"
        ,wp_2 = 3
        ,wp_3 = 1
        ,wp_4 = 0
        ,wp_11 = "item.wdf"
        ,wp_12 = 0x04694A50
        ,wp_13 = 0xC3A8BEA9
        }
    ItemData["高级魔兽要诀"]={
        wp_1 = "记载着上古高级魔兽特技，可供你的召唤兽学习。"
        ,wp_2 = 3
        ,wp_3 = 1
        ,wp_4 = 0
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 0x6cad36e8
        ,wp_13 = 0xd86d89b8
        }
    ItemData["高级兽诀"]={
     wp_1 = "记载着上古魔兽特技，可供你的召唤兽学习。"
     ,wp_2 = 3
     ,wp_3 = 1
     ,wp_4 = 0
     ,wp_11 = "common/item.wdf"
     ,wp_12 = 0x6cad36e8
     ,wp_13 = 0xd86d89b8
     }
     ItemData["上古玉魄·碎片"]={
        wp_1 = "神玉遗世待天命，固命魂兮御阴阳。随机获得阴阳中的一种。\n#Y【特别说明】获得30个碎片后，右键可以进行合成。"
        ,wp_2 = 0
        ,wp_3 = 0
        ,wp_4 = 0
        ,wp_11 = "item.wd1"
        ,wp_12 = 0x278346C1 --小
        ,wp_13 = 0xE2497CA3
        }

    ItemData["特殊兽诀·碎片"]={
        wp_1 = "外形很像某种兽决，上面依稀记载着上古魔兽特技。\n#Y【特别说明】获得50个碎片后，右键可以进行合成。"
        ,wp_2 = 3
        ,wp_3 = 99
        ,wp_4 = 0
        ,wp_11 = "item.wdf"
        ,wp_12 = 1241924823
        ,wp_13 = 2950829831
        }
     ItemData["超级兽诀·碎片"]={
        wp_1 = "外形很像某种兽决，上面依稀记载着上古魔兽特技。\n#Y【特别说明】获得50个碎片后，右键可以进行合成。"
        ,wp_2 = 3
        ,wp_3 = 1
        ,wp_4 = 0
        ,wp_11 = "aaa.wdf"
        ,wp_12 = 0x46432311
        ,wp_13 = 0x45432311
        }
        ItemData["圣婴大王碎片"]={
        wp_1 = "集齐30个右键使用即可获得“圣婴大王”魔兽要诀"
        ,wp_2 = 9
        ,wp_3 = 1
        ,wp_4 = 1
        ,wp_11 = "item.wdf"
        ,wp_12 = 1241924823
        ,wp_13 = 2950829831
        }
    ItemData["观照万象碎片"]={
        wp_1 = "集齐30个右键使用即可获得“观照万象”魔兽要诀"
        ,wp_2 = 9
        ,wp_3 = 1
        ,wp_4 = 1
        ,wp_11 = "item.wdf"
        ,wp_12 = 1241924823
        ,wp_13 = 2950829831
        }
        ItemData["超级否定信仰碎片"]={
        wp_1 = "集齐50个右键使用即可获得“超级否定信仰”魔兽要诀"
        ,wp_2 = 9
        ,wp_3 = 1
        ,wp_4 = 1
        ,wp_11 = "item.wdf"
        ,wp_12 = 1241924823
        ,wp_13 = 2950829831
        }

    ItemData["自选特殊兽决"]={
        wp_1 = "特殊兽决（宠物特殊技能，不包括超级鲲鹏携带的技能）"
        ,wp_2 =  "__自选"
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "sucai.wdf"
        ,wp_12 = 0x00000214
        ,wp_13 = 0x00000223
    }
    ItemData["自选超级兽决"]={
        wp_1 = "超级魔兽要决（宠物特殊技能，不包括超级鲲鹏携带的技能）"
        ,wp_2 =  "__自选"
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "sucai.wdf"
        ,wp_12 = 0x00000214
        ,wp_13 = 0x00000223
    }
    ItemData["自选钟灵石"]={
        wp_1 = "超级魔兽要诀（宠物特殊技能，不包括超级鲲鹏携带的技能）"
        ,wp_2 =  "__自选"
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "sucai.wdf"
        ,wp_12 = 0x00000214
        ,wp_13 = 0x00000223
    }
 ItemData["160附魔宝珠礼包"]={
            wp_1 = "打开能获得10个#G160级附魔宝珠\n【使用方式】鼠标右键使用"
            ,wp_2 = 1
            ,wp_3 = 11
            ,wp_4 = 0
            ,wp_8 = 3
            ,wp_11 = "item.wdf"
            ,wp_12 = 2650955991 --小
            ,wp_13 = 2817725067
        }
    ItemData["一级法宝礼包"]={
            wp_1 = "打开能获得随机#G一级法宝\n【使用方式】鼠标右键使用"
            ,wp_2 = 1
            ,wp_3 = 11
            ,wp_4 = 0
            ,wp_8 = 3
            ,wp_11 = "item.wdf"
            ,wp_12 = 2650955991 --小
            ,wp_13 = 2817725067
        }
    ItemData["二级法宝礼包"]={
        wp_1 = "打开能获得随机#G二级法宝\n【使用方式】鼠标右键使用"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 2650955991 --小
        ,wp_13 = 2817725067
        }
    ItemData["三级法宝礼包"]={
        wp_1 = "打开能获得随机#G三级法宝\n【使用方式】鼠标右键使用"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 2650955991 --小
        ,wp_13 = 2817725067
        }
    ItemData["特效宝珠礼包"]={
        wp_1 = "打开能获得10个#G特效宝珠\n【使用方式】鼠标右键使用"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 2650955991 --小
        ,wp_13 = 2817725067
        }
    ItemData["法宝精华礼包5"] = {
        wp_1 = "法宝精华*5个"
        , wp_2 = 193
        , wp_3 = 1
        , wp_4 = 2
        , wp_11 = "item.wdf"
        , wp_12 = 0xa7b4fe9
        , wp_13 = 0x34fb2cd2
    }
    ItemData["法宝精华礼包10"] = {
        wp_1 = "法宝精华*10个"
        , wp_2 = 193
        , wp_3 = 1
        , wp_4 = 2
        , wp_11 = "item.wdf"
        , wp_12 = 0xa7b4fe9
        , wp_13 = 0x34fb2cd2
    }
    ItemData["法宝精华礼包20"] = {
        wp_1 = "法宝精华*20个"
        , wp_2 = 193
        , wp_3 = 1
        , wp_4 = 2
        , wp_11 = "item.wdf"
        , wp_12 = 0xa7b4fe9
        , wp_13 = 0x34fb2cd2
    }

    ItemData["法宝精华礼包30"] = {
        wp_1 = "法宝精华*20个"
        , wp_2 = 193
        , wp_3 = 1
        , wp_4 = 2
        , wp_11 = "item.wdf"
        , wp_12 = 0xa7b4fe9
        , wp_13 = 0x34fb2cd2
    }

      ItemData["蕴灵礼包大"] = {
        wp_1 = "蕴灵礼包\n内含蕴灵晶体*10个！"
        , wp_2 = 1
        , wp_3 = 11
        , wp_4 = 0
        , wp_8 = 3
        , wp_11 = "common/item.wdf"
        , wp_12 = 0xd6363dd6
        , wp_13 = 0x5fbab8dc
    }

    ItemData["神兽涎"]={
        wp_1 ="源自神兽同感极致之时的珍惜涎液，内含纯净的生命能量。" --150W 5~6
        ,wp_2 = 110
        ,wp_3 = 1
        ,wp_4 = 1
        ,wp_7 = {"【用途】在长安城云来酒店可用于制作仙露丸子"}
        ,wp_11 = "wzcf.npk"
        ,wp_12 = "神兽涎小"--0x00FB2F4A
        ,wp_13 = "神兽涎大"--0x00F95A15
        }
    ItemData["仙露小丸子"]={
        wp_1 ="嫦娥严选，玉兔手作，月宫驰名。一口尽享清甜！是超级神柚钟爱的甜品。" --15W 20~30？
        ,wp_2 = 110
        ,wp_3 = 2
        ,wp_4 = 1
        ,wp_7 = {"【用途】在长安城云来酒店可用于制作仙露丸子"}
        ,wp_11 = "wzcf.npk"
        ,wp_12 = "仙露小丸子小"--0x00FFE220
        ,wp_13 = "仙露小丸子大"--0x00FB291A
        }
    ItemData["仙露丸子"]={
         wp_1 ="用于召唤兽赐福超级技能，长安天台下找到超级神柚NPC" --15W 20~30？
        ,wp_2 = 110
        ,wp_3 = 3
        ,wp_4 = 1
        ,wp_7 = {"【用途】交给长安城(0,0)超级神柚，可用于赐福召唤兽"}
        ,wp_11 = "audio/1238.mp3"
        ,wp_12 = 0xABCD1003--0x0A1F51BF --小
        ,wp_13 = 0xABCD1002--0x0A0B2531 --大
        }

    ItemData["耀眼的星辰碎片"]={
        wp_1 = "天罡星幻影遗留下来的星辰碎片，散发出夺目的光芒，强大的发力在四周环绕\n#Y【使用后可以点亮天书中天罪星】"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 3376148133 --小
        ,wp_13 = 970939530
        }
    ItemData["奇异的星辰碎片"]={
        wp_1 = "天罡星幻影遗留下来的星辰碎片，虽然没有耀眼的光芒，单其法力远非碎片可以比拟，是无尚的至宝\n#Y战胜神威难度天罡星获得"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 3376148133 --小
        ,wp_13 = 970939530
        }
    ItemData["发光的星辰碎片"]={
        wp_1 = "天罡星幻影遗留下来的星辰碎片，散发出明亮的光芒，可以明显感受到其中蕴含的法力。\n#Y【使用后可以点亮天书中天雄星】"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 3376148133 --小
        ,wp_13 = 970939530
        }
    ItemData["暗淡的星辰碎片"]={
        wp_1 = "天罡星幻影遗留下来的星辰碎片，散发出明亮的光芒，可以明显感受到其中蕴含的法力。\n#Y【使用后可以点亮天书中天雄星】"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 3376148133 --小
        ,wp_13 = 970939530
        }
    ItemData["微光的星辰碎片"]={
        wp_1 = "天罡星幻影遗留下来的星辰碎片，散发出明亮的光芒，可以明显感受到其中蕴含的法力。\n#Y【使用后可以点亮天书中天雄星】"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 3376148133 --小
        ,wp_13 = 970939530
        }

    ItemData["新春飞行符"]={
        wp_1 = "看起来像是平常的飞行符，但效果却不同凡响。\n#Y使用次数：永久"
        ,wp_2 = 99
        ,wp_3 = 1
        ,wp_4 = 1
        ,wp_11 = "ceshi.wdf"
        ,wp_12 = 4199546886
        ,wp_13 = 4199546885
        ,wp_14 = 500
        }

    ItemData["破镜坠礼包"] = {
        wp_1 = "破镜坠礼包\n右键打开可获取随机破境吊坠*1个（白虎几率，朱雀几率，玄武几率，青龙几率）"
        , wp_2 = 1
        , wp_3 = 11
        , wp_4 = 0
        , wp_8 = 3
        , wp_11 = "common/item.wdf"
        , wp_12 = 0xd6363dd6
        , wp_13 = 0x5fbab8dc
    }
     ItemData["锦红彩笺"] = {
        wp_1 = "锦红彩笺，古代纪予\n#Y【用处】可凭彩笺前往#R辰年上卿#Y处兑换所需的物品"
        , wp_2 = 194
        , wp_3 = 1
        , wp_11 = "jiandan.dll"
        , wp_12 = "丝带小"
        , wp_13 = "丝带大"
    }

    ItemData["随机红包"] = {
        wp_1 = "随机获得平安、多福、进财红包中的一个，此赞助包含VIP积分与仙玉"
        , wp_2 = 194
        , wp_3 = 1
        , wp_11 = "jiandan.dll"
        , wp_12 = "红包小3"
        , wp_13 = "红包大3"
    }

    ItemData["平安红包"] = {
        wp_1 = "手指高低钱串串，朝堂上下乐融融。眼观春色人人醉，脚踏青云路路通。\n#Y【内容】获得#G1-10元#Y赞助，此赞助包含VIP积分与仙玉\n#G【特殊】白嫖赞助除了VIP1的抓鬼卡外其他均可正常获取"
        , wp_2 = 194
        , wp_3 = 1
        , wp_11 = "jiandan.dll"
        , wp_12 = "红包小3"
        , wp_13 = "红包大3"
    }
    ItemData["多福红包"] = {
        wp_1 = "年年岁岁红包来，点滴心意倍关怀。\n#Y【内容】获得#G5-20元#Y赞助，此赞助包含VIP积分与仙玉\n#G【特殊】白嫖赞助除了VIP1的抓鬼卡外其他均可正常获取"
        , wp_2 = 194
        , wp_3 = 1
        , wp_11 = "jiandan.dll"
        , wp_12 = "红包小2"
        , wp_13 = "红包大2"
    }
    ItemData["进财红包"] = {
        wp_1 = "岁岁红包送君来，龙神庇佑幸福排。\n#Y【内容】获得#G18-66元#Y赞助，此赞助包含VIP积分与仙玉\n#G【特殊】白嫖赞助除了VIP1的抓鬼卡外其他均可正常获取"
        , wp_2 = 194
        , wp_3 = 1
        , wp_11 = "jiandan.dll"
        , wp_12 = "红包小1"
        , wp_13 = "红包大1"
    }
    ItemData["驱赶烟花"] = {-- 三周年
        wp_1 = "可以驱赶年兽、神兽的烟花，\n【特殊】右键物品可直接传送至辰年上卿任务官处"
        , wp_2 = 139
        , wp_3 = 2
        , wp_4 = 3
        , wp_11 = "item.wdf"
        , wp_12 = 0xB0EA71D1
        , wp_13 = 0x8DF15790
    }
    ItemData["随机玄灵珠"] = {
        wp_1 = "随机玄灵珠礼包\n开启可获得玄灵珠一个"
        , wp_2 = 1
        , wp_3 = 11
        , wp_4 = 0
        , wp_8 = 3
        , wp_11 = "common/item.wdf"
        , wp_12 = 0xd6363dd6
        , wp_13 = 0x5fbab8dc
    }
ItemData["称号材料礼包"] = {
        wp_1 = "称号材料礼包\n内含蕴灵晶体*20个，随机破境吊坠*1个（白虎几率30%，朱雀几率30%，玄武几率20%，青龙几率20%）"
        , wp_2 = 1
        , wp_3 = 11
        , wp_4 = 0
        , wp_8 = 3
        , wp_11 = "common/item.wdf"
        , wp_12 = 0xd6363dd6
        , wp_13 = 0x5fbab8dc
    }
	ItemData["蕴灵晶体"] = {
        wp_1 = "蕴灵晶体\n#Y【特殊】用于称谓系统修炼玩法，每次可增加10点称号修炼经验"
        , wp_2 = 195
        , wp_3 = 1
        , wp_4 = 1
        , wp_11 = "sucai.wdf"
        , wp_12 = 0x00000180
        , wp_13 = 0x00000181
    }
    ItemData["恩典钥匙"] = {
        wp_1 = "恩典钥匙\n#Y【特殊】用于参加皇恩恩典，单车换摩托"
        , wp_2 = 195
        , wp_3 = 1
        , wp_4 = 1
        , wp_11 = "sucai.wdf"
        , wp_12 = 0x00000352
        , wp_13 = 0x00000353
    }
    ItemData["破境·白虎坠"] = {
        wp_1 = "破境·白虎坠\n#Y【特殊】用于称谓突破中，额外增加#G/5%#Y/点突破成功率"
        , wp_2 = 195
        , wp_3 = 1
        , wp_4 = 1
        , wp_11 = "sucai.wdf"
        , wp_12 = 0x00000228
        , wp_13 = 0x00000229
    }
    ItemData["破境·朱雀坠"] = {
        wp_1 = "破境·朱雀坠\n#Y【特殊】用于称谓突破中，额外增加#G/8%#Y/点突破成功率"
        , wp_2 = 195
        , wp_3 = 1
        , wp_4 = 1
        , wp_11 = "sucai.wdf"
        , wp_12 = 0x00000226
        , wp_13 = 0x00000227
    }
    ItemData["破境·玄武坠"] = {
        wp_1 = "破境·玄武坠\n#Y【特殊】用于称谓突破中，额外增加#G/12%#Y/点突破成功率"
        , wp_2 = 195
        , wp_3 = 1
        , wp_4 = 1
        , wp_11 = "sucai.wdf"
        , wp_12 = 0x00000212
        , wp_13 = 0x00000213
    }
    ItemData["破境·青龙坠"] = {
        wp_1 = "破境·青龙坠\n#Y【特殊】用于称谓突破中，额外增加#G/20%#Y/点突破成功率"
        , wp_2 = 195
        , wp_3 = 1
        , wp_4 = 1
        , wp_11 = "sucai.wdf"
        , wp_12 = 0x00000170
        , wp_13 = 0x00000171
    }
    ItemData["凤纹灵坠"] = {
        wp_1 = "凤纹灵坠，传闻上面附带着上古应龙的神圣法力，对灵饰物品使用，可为其附加神奇的效果"
        , wp_2 = 196
        , wp_3 = 1
        , wp_4 = 1
        , wp_11 = "item.wdf"
        , wp_12 = 0xA8D17C1B
        , wp_13 = 0x883DE325
    }
    ItemData["玄灵珠"] = {
        wp_1 = "看起来和玄珠灵仙的珠子有些相似，不知道是什么材料制成。可以在坐骑界面镶嵌，获得额外的“召唤”效果"
        , wp_2 = 197
        , wp_3 = 1
        , wp_4 = 1
        , wp_11 = "jiandan.dll"
        , wp_12 = "玄灵珠破军小"
        , wp_13 = "玄灵珠破军大"
    }
    ItemData["玄灵珠·破军"] = {
        wp_1 = "看起来和玄珠灵仙的珠子有些相似，不知道是什么材料制成。可以在坐骑界面镶嵌，获得额外的“召唤”效果"
        , wp_2 = 197
        , wp_3 = 9
        , wp_4 = 1
        , wp_11 = "jiandan.dll"
        , wp_12 = "玄灵珠破军小"
        , wp_13 = "玄灵珠破军大"
    }
    ItemData["玄灵珠·空灵"] = {
        wp_1 = "看起来和玄珠灵仙的珠子有些相似，不知道是什么材料制成。可以在坐骑界面镶嵌，获得额外的“佩戴”效果"

        , wp_2 = 197
        , wp_3 = 6
        , wp_4 = 1
        , wp_11 = "jiandan.dll"
        , wp_12 = "玄灵珠破军小"
        , wp_13 = "玄灵珠破军大"
    }
    ItemData["玄灵珠·回春"] = {
        wp_1 = "看起来和玄珠灵仙的珠子有些相似，不知道是什么材料制成。可以在坐骑界面镶嵌，获得额外的“召唤”效果"
        , wp_2 = 197
        , wp_3 = 8
        , wp_4 = 1
        , wp_11 = "jiandan.dll"
        , wp_12 = "玄灵珠回春小"
        , wp_13 = "玄灵珠回春大"
    }
    ItemData["玄灵珠·噬魂"] = {
        wp_1 = "看起来和玄珠灵仙的珠子有些相似，不知道是什么材料制成。可以在坐骑界面镶嵌，获得额外的“佩戴”效果"
        , wp_2 = 197
        , wp_3 = 7
        , wp_4 = 1
        , wp_11 = "jiandan.dll"
        , wp_12 = "玄灵珠回春小"
        , wp_13 = "玄灵珠回春大"
    }

    ItemData["青龙石"]={
        wp_1 = "带有灵气的石头，是强化装备所需的原料之一"
        ,wp_2 = 5
        ,wp_3 = 4
        ,wp_4 = 1
        ,wp_11 = "item.wdf"
        ,wp_12 = 2289281503
        ,wp_13 = 603616920
         ,wp_22 = "打造"
        }








end
function 复制物品(物品)
	local 道具数据 = 物品类()
	道具数据:置对象(物品.名称)
	道具数据.总类 = 物品.总类
	道具数据.分类 = 物品.分类
	道具数据.子类 = 物品.子类
	if 物品.伤害 ~= nil then
		道具数据.伤害 = 物品.伤害
	end
	if 物品.气血 ~= nil then
		道具数据.气血 = 物品.气血
	end
	if 物品.魔法 ~= nil then
		道具数据.魔法 = 物品.魔法
	end
	if 物品.愤怒 ~= nil then
		道具数据.愤怒 = 物品.愤怒
	end
	if 物品.体力 ~= nil then
		道具数据.体力 = 物品.体力
	end
	if 物品.活力 ~= nil then
		道具数据.活力 = 物品.活力
	end
	if 物品.命中 ~= nil then
		道具数据.命中 = 物品.命中
	end
	if 物品.伤害 ~= nil then
		道具数据.伤害 = 物品.伤害
	end
	if 物品.防御 ~= nil then
		道具数据.防御 = 物品.防御
	end
	if 物品.速度 ~= nil then
		道具数据.速度 = 物品.速度
	end
	if 物品.躲避 ~= nil then
		道具数据.躲避 = 物品.躲避
	end
	if 物品.灵力 ~= nil then
		道具数据.灵力 = 物品.灵力
	end
	if 物品.体质 ~= nil then
		道具数据.体质 = 物品.体质
	end
	if 物品.魔力 ~= nil then
		道具数据.魔力 = 物品.魔力
	end
	if 物品.力量 ~= nil then
		道具数据.力量 = 物品.力量
	end
	if 物品.耐力 ~= nil then
		道具数据.耐力 = 物品.耐力
	end
	if 物品.敏捷 ~= nil then
		道具数据.敏捷 = 物品.敏捷
	end
	if 物品.品质 ~= nil then
		道具数据.品质 = 物品.品质
	end
	if 物品.附带技能 ~= nil then
		道具数据.附带技能 = 物品.附带技能
	end
	if 物品.锻炼等级 ~= nil then
		道具数据.锻炼等级 = 物品.锻炼等级
	end
	if 物品.镶嵌宝石 ~= nil then
		道具数据.镶嵌宝石 = 物品.镶嵌宝石
	end
	if 物品.等级 ~= nil then
		道具数据.等级 = 物品.等级
	end
	if 物品.特效 ~= nil then
		道具数据.特效 = 物品.特效
	end
	if 物品.特技 ~= nil then
		道具数据.特技 = 物品.特技
	end
	if 物品.价格 ~= nil then
		道具数据.价格 = 物品.价格
	end
	if 物品.五行 ~= nil then
		道具数据.五行 = 物品.五行
	end
	if 物品.数量 ~= nil and 物品.可叠加 then
		道具数据.数量 = 物品.数量
	end
	if 物品.制造者 ~= nil then
		道具数据.制造者 = 物品.制造者
	end
	if 物品.耐久  ~= nil then
		道具数据.耐久 = 物品.耐久
	end
	return 道具数据
end
