--======================================================================--
-- @作者: GGE研究群: 342119466
-- @创建时间:   2018-03-03 02:34:19
-- @Last Modified time: 2022-12-07 16:33:07
-- 梦幻西游游戏资源破解 baidwwy@vip.qq.com(313738139) 老毕   和 C++PrimerPlus 717535046 这俩位大神破解所以资源
--======================================================================--
local Dismay = class()

function Dismay:初始化(id,内容)
    强化数据= 取csv数据("sql/强化数据.csv")
end
function Dismay:数据处理(id,内容)
    if 内容.事件=="升星" then
   	  self:升星处理(id,内容)
   end
end

function Dismay:升星处理(id,内容)
    if 内容.事项=="装备进阶打开" then
    	发送数据(玩家数据[id].连接id,394,玩家数据[id].角色:取装备数据())
    elseif 内容.事项=="灵饰进阶打开" then
      发送数据(玩家数据[id].连接id,394.1,玩家数据[id].角色:取灵饰数据())
    elseif  内容.事项=="装备升星" then
    	 local 编号=内容.编号
      if  玩家数据[id].角色.装备[编号] and   玩家数据[id].道具.数据[玩家数据[id].角色.装备[编号]] then
      	local 等级=玩家数据[id].道具.数据[玩家数据[id].角色.装备[编号]].升星 or 0
      	local  数据=强化数据[等级+1]
      	if  not 数据 then
      		return  常规提示(id,"当前已经是最搞等级")
      	end
      	-- local 锻炼等级=玩家数据[id].道具.数据[玩家数据[id].角色.装备[编号]].锻炼等级 or 0
      	-- if  锻炼等级<等级 then
      	-- 	 常规提示(id, "强化等级不能超过锻炼等级")
      	-- 	return
      	-- end
      	local 银子=数据.银子
      	local 经验=数据.经验
      	local 强化材料=分割文本(数据.强化消耗,"*")[1]
      	local 强化数量=分割文本(数据.强化消耗,"*")[2]+0
      	local 保护材料=分割文本(数据.保护,"*")[1]
      	local 保护数量=分割文本(数据.保护,"*")[2]+0
      	local 成功几率=数据.强化几率+0
      	if 玩家数据[id].角色.银子<银子 then

               	  常规提示(id, "银子不足")
      		return
      	end
      	if 玩家数据[id].角色.当前经验<经验 then
               	  常规提示(id, "经验不足")
      		return
      	end
      	if  not  self:消耗背包道具(id,强化材料,强化数量)  then

               	  常规提示(id, 强化材料.."不足"..强化数量.."个")
      		return
      	end
      	玩家数据[id].角色:扣除银子(银子,0,0,"强化",1)
      	玩家数据[id].角色:扣除经验(经验)
      	local 保护=内容.保护
      	if  保护 and self:消耗背包道具(id,保护材料,保护数量) then
      	  保护=true
      	else
      	   保护=false
      	end
      	if  取随机数()<成功几率 then

      	    玩家数据[id].道具.数据[玩家数据[id].角色.装备[编号]].升星=(玩家数据[id].道具.数据[玩家数据[id].角色.装备[编号]].升星 or 0)+1


      	     玩家数据[id].角色:刷新信息()
      	     发送数据(玩家数据[id].连接id,394,{成功=2})
      	     发送数据(玩家数据[id].连接id,394,玩家数据[id].角色:取装备数据())
      	 else
      	   if  保护 then
               	  常规提示(id, "强化失败,保护不降级")
           else
               	 if  玩家数据[id].道具.数据[玩家数据[id].角色.装备[编号]].升星 and 玩家数据[id].道具.数据[玩家数据[id].角色.装备[编号]].升星>0 then

               	     玩家数据[id].道具.数据[玩家数据[id].角色.装备[编号]].升星= 玩家数据[id].道具.数据[玩家数据[id].角色.装备[编号]].升星-1
               	     消息提示(id, "强化失败,等级-1")
               	       玩家数据[id].角色:刷新信息()

               	      发送数据(玩家数据[id].连接id,394,玩家数据[id].角色:取装备数据())
               	  end
               	   发送数据(玩家数据[id].连接id,394,{成功=1})


      	   end

      	end
      else
      	常规提示(id,"未找到指定装备,请重新打开界面尝试")
      end
    elseif  内容.事项=="灵饰升星" then
      local 编号=内容.编号
      local 道具id =玩家数据[id].道具.数据[玩家数据[id].角色.灵饰[编号]]
      local wpfl = 道具id.分类
      local wpzl = 道具id.总类
      if wpfl == 13 and 道具id.体质== nil then--手镯
        道具id.体质=1
      elseif wpfl == 10 and 道具id.敏捷== nil then--耳饰
        道具id.敏捷=1
      elseif wpfl == 11 and 道具id.耐力== nil then--耳饰
        道具id.耐力=1
      elseif wpfl == 12 and 道具id.力量== nil and 道具id.魔力==nil then--耳饰
        道具id.力量=1
        道具id.魔力=1
      end

      if  玩家数据[id].角色.灵饰[编号] and   玩家数据[id].道具.数据[玩家数据[id].角色.灵饰[编号]] then
        local 等级=玩家数据[id].道具.数据[玩家数据[id].角色.灵饰[编号]].升星 or 0
        local  数据=强化数据[等级+1]
        if  not 数据 then
          return  常规提示(id,"当前已经是最搞等级")
        end
        local 银子=数据.银子
        local 经验=数据.经验
        local 强化材料=分割文本(数据.强化消耗,"*")[1]
        local 强化数量=分割文本(数据.强化消耗,"*")[2]+0
        local 保护材料=分割文本(数据.保护,"*")[1]
        local 保护数量=分割文本(数据.保护,"*")[2]+0
        local 成功几率=数据.强化几率+0
        if 玩家数据[id].角色.银子<银子 then
                  常规提示(id, "银子不足")
          return
        end
        if 玩家数据[id].角色.当前经验<经验 then
                  常规提示(id, "经验不足")
          return
        end
        if  not  self:消耗背包道具(id,强化材料,强化数量)  then

                  常规提示(id, 强化材料.."不足"..强化数量.."个")
          return
        end
        玩家数据[id].角色:扣除银子(银子,0,0,"强化",1)
        玩家数据[id].角色:扣除经验(经验)
        local 保护=内容.保护
        if  保护 and self:消耗背包道具(id,保护材料,保护数量) then
          保护=true
        else
           保护=false
        end
        if  取随机数()<成功几率 then
            玩家数据[id].道具.数据[玩家数据[id].角色.灵饰[编号]].升星=(玩家数据[id].道具.数据[玩家数据[id].角色.灵饰[编号]].升星 or 0)+1
             玩家数据[id].角色:刷新信息()
             发送数据(玩家数据[id].连接id,394.1,{成功=2})
             发送数据(玩家数据[id].连接id,394.1,玩家数据[id].角色:取灵饰数据())
         else
           if  保护 then
                  常规提示(id, "强化失败,保护不降级")
           else
                 if  玩家数据[id].道具.数据[玩家数据[id].角色.灵饰[编号]].升星 and 玩家数据[id].道具.数据[玩家数据[id].角色.灵饰[编号]].升星>0 then

                     玩家数据[id].道具.数据[玩家数据[id].角色.灵饰[编号]].升星= 玩家数据[id].道具.数据[玩家数据[id].角色.灵饰[编号]].升星-1
                     消息提示(id, "强化失败,等级-1")
                       玩家数据[id].角色:刷新信息()

                      发送数据(玩家数据[id].连接id,394.1,玩家数据[id].角色:取灵饰数据())
                  end
                   发送数据(玩家数据[id].连接id,394.1,{成功=1})


           end

        end
      else
        常规提示(id,"未找到指定装备,请重新打开界面尝试")
      end


    end
end
function Dismay:消耗背包道具(id,名称,数量)
  local 连接id=玩家数据[id].连接id
  local 扣除数量 = 数量
  local 扣除数据={}
  local 已扣除=0
  for n=1,80 do
    if 玩家数据[id].角色.道具[n]~=nil and 玩家数据[id].道具.数据[玩家数据[id].角色.道具[n]]~=nil and 玩家数据[id].道具.数据[玩家数据[id].角色.道具[n]].名称==名称 and 已扣除<扣除数量 then
      if 玩家数据[id].道具.数据[玩家数据[id].角色.道具[n]].数量 == nil then
        已扣除=已扣除+1
        扣除数据[#扣除数据+1]={格子=n,id=玩家数据[id].角色.道具[n],数量=1}
      else
        if 玩家数据[id].道具.数据[玩家数据[id].角色.道具[n]].数量>=扣除数量-已扣除 then
          扣除数据[#扣除数据+1]={格子=n,id=玩家数据[id].角色.道具[n],数量=扣除数量-已扣除}
          已扣除=已扣除+(扣除数量-已扣除)
        else
          已扣除=已扣除+玩家数据[id].道具.数据[玩家数据[id].角色.道具[n]].数量
          扣除数据[#扣除数据+1]={格子=n,id=玩家数据[id].角色.道具[n],数量=玩家数据[id].道具.数据[玩家数据[id].角色.道具[n]].数量}
        end
      end
    end
  end
  if 已扣除<扣除数量 then
    if 玩家数据[id].zhandou==0 then
      常规提示(id,"你没有那么多的"..名称)
    else
      发送数据(连接id, 38, {内容 = "你没有那么多的"..名称})
    end
    return false
  else
    local tp_格子={}
    for n=1,#扣除数据 do
      tp_格子[#tp_格子+1]=扣除数据[n].格子
      玩家数据[id].道具:删除道具(连接id,id,"道具",扣除数据[n].id,扣除数据[n].格子,扣除数据[n].数量)
    end
    发送数据(连接id,3699)
   --self:更新指定格子(id,tp_格子)
    return true
  end
  return false
end

return Dismay