
local 地图处理类 = class()
--地图数据存储={}
function 地图处理类:初始化()
	self.地图编号={1001,1002,1003,1004,1005,1006,1007,1008,1009,1012,1013,1014,1015,1016,1017,1018,1019,1020,1021,
	1022,1023,1024,1025,1026,1028,1029,1030,1031,1032,1033,1034,1035,1036,1037,1038,1040,1041,1042,1043,1044,1046,
	1049,1050,1051,1052,1054,1056,1057,1070,1072,1075,1077,1078,1079,1080,1081,1082,1083,1085,1087,1090,1091,1092,
	1093,1094,1095,1098,1099,1100,1101,1103,1104,1105,1106,1107,1110,1111,1112,1113,1114,1115,1116,1117,1118,1119,
	1120,1121,1122,1123,1124,1125,1126,1127,1128,1129,1130,1131,1132,1133,1134,1135,1137,1138,1139,1140,1141,1142,
	1143,1144,1145,1146,1147,1149,1150,1152,1153,1154,1155,1156,1165,1167,1168,1170,1171,1173,1174,1175,1177,1178,
	1179,1180,1181,1182,1183,1186,1187,1188,1189,1190,1191,1192,1193,1197,1198,1201,1202,1203,1204,1205,1206,1207,
	1208,1209,1210,1211,1212,1213,1214,1215,1216,1217,1218,1219,1220,1221,1222,1223,1224,1225,1226,1227,1228,1229,
	1230,1231,1232,1233,1234,1235,1236,1237,1238,1239,1241,1242,1243,1245,1246,1248,1249,1250,1251,1252,1253,1256,
	1257,1258,1259,1272,1273,1306,1310,1311,1312,1313,1314,1315,1316,1317,1318,1319,1320,1321,1322,1323,1324,1325,
	1326,1327,1328,1329,1330,1331,1332,1333,1334,1335,1336,1337,1338,1339,1340,1341,1342,1343,1380,1382,1400,1401,
	1402,1403,1404,1405,1406,1407,1408,1409,1410,1411,1412,1413,1414,1415,1416,1417,1418,1420,1421,1422,1424,1425,
	1426,1427,1428,1429,1430,1446,1447,1501,1502,1503,1504,1505,1506,1507,1508,1509,1511,1512,1513,1514,1523,1524,
	1525,1526,1527,1528,1529,1531,1532,1533,1534,1535,1536,1537,1605,1606,1607,1608,1810,1811,1812,1813,1814,1815,
	1820,1821,1822,1823,1824,1825,1830,1831,1832,1833,1834,1835,1840,1841,1842,1843,1844,1845,1850,1851,1852,1853,
	1854,1855,1860,1861,1862,1863,1864,1865,1870,1871,1872,1873,1874,1875,1876,1885,1886,1887,1888,1890,1891,1892,
	1910,1911,1912,1913,1914,1915,1916,1920,1930,1931,1932,1933,1934,1935,1936,1937,1938,1939,1940,1941,1942,1943,
	1944,1945,1946,1947,1948,1949,1950,1951,1952,1953,1954,1955,1958,1959,1960,1961,1962,1963,1964,1965,1966,1967,
	1968,1969,1970,1971,2000,5136,5137,5138,5139,1580,1284,1375,1359,1360,2514,1574,1573,2574}
	-- self.地图编号={1284,1375,1350,1359,1360,1574,1588,1589,1272,1285,12066,1001,1002,1003,1004,1005,1006,1007,1008,1009,1012,1013,1014,
	-- 1015,1016,1017,1018,1019,1020,1021,1022,1023,1024,1025,1026,1028,1029,1030,1031,1032,1033,1034,1035,1036,1037,1038,1040,1041,1042,1043,
	-- 1044,1046,1049,1050,1051,1052,1054,1056,1057,1070,1072,1075,1077,1078,1079,1080,1081,1082,1083,1085,1087,1090,1091,1092,1093,1094,1095,
	-- 1098,1099,1100,1101,1103,1104,1105,1106,1107,1110,1111,1112,1113,1114,1115,1116,1117,1118,1119,1120,1121,1122,1123,1124,1125,1126,1127,
	-- 1128,1129,1130,1131,1132,1133,1134,1135,1137,1138,1139,1140,1141,1142,1143,1144,1145,1146,1147,1149,1150,1152,1153,1154,1155,1156,1165,
	-- 1167,1168,1170,1171,1173,1174,1175,1177,1178,1179,1180,1181,1182,1183,1186,1187,1188,1189,1190,1191,1192,1193,1197,1198,1201,1202,1203,
	-- 1204,1205,1206,1207,1208,1209,1210,1211,1212,1213,1214,1215,1216,1217,1218,1219,1220,1221,1222,1223,1224,1225,1226,1227,1228,1229,1230,
	-- 1231,1232,1233,1234,1235,1236,1237,1238,1239,1241,1242,1243,1245,1246,1248,1249,1250,1251,1252,1253,1256,1257,1258,1259,1272,1273,1306,
	-- 1310,1311,1312,1313,1314,1315,1316,1317,1318,1319,1320,1321,1322,1323,1324,1325,1326,1327,1328,1329,1330,1331,1332,1333,1334,1335,1336,
	-- 1337,1338,1339,1340,1341,1342,1343,1380,1382,1400,1401,1402,1403,1404,1405,1406,1407,1408,1409,1410,1411,1412,1413,1414,1415,1416,1417,
	-- 1418,1420,1421,1422,1424,1425,1426,1427,1428,1429,1430,1446,1447,1501,1502,1503,1504,1505,1506,1507,1508,1509,1511,1512,1513,1514,1523,
	-- 1524,1525,1526,1527,1528,1529,1531,1532,1533,1534,1535,1536,1537,1605,1606,1607,1608,1810,1811,1812,1813,1814,1815,1820,1821,1822,1823,
	-- 1824,1825,1830,1831,1832,1833,1834,1835,1840,1841,1842,1843,1844,1845,1850,1851,1852,1853,1854,1855,1860,1861,1862,1863,1864,1865,1870,
	-- 1871,1872,1873,1874,1875,1876,1885,1886,1887,1888,1890,1891,1892,1910,1911,1912,1913,1914,1915,1916,1920,1930,1931,1932,1933,1934,1935,
	-- 1936,1937,1938,1939,1940,1941,1942,1943,1944,1945,1946,1947,1948,1949,1950,1951,1952,1953,1954,1955,1958,1959,1960,1961,1962,1963,1964,
	-- 1965,1966,1967,1968,1969,1970,1971,2000,5136,5137,5138,5139,1580}

	self.地图数据={}
	self.地图玩家={}
	self.地图单位={}
	self.队伍距离=50
	self.地图坐标={}
	self.单位编号={}
	self.遇怪地图={}
	for n=1,#self.地图编号 do
		self.地图数据[self.地图编号[n]]={npc={},单位={},传送圈={}}
		self.地图玩家[self.地图编号[n]]={}
		self.地图坐标[self.地图编号[n]]=地图坐标类(self.地图编号[n])
		self.地图单位[self.地图编号[n]]={}
		self.单位编号[self.地图编号[n]]=1000
		if 取场景等级(self.地图编号[n])~=nil then
			self.遇怪地图[self.地图编号[n]]=true
		end
	end
	for n=5136,5139 do
		self.地图数据[n]={npc={},单位={},传送圈={}}
		self.地图玩家[n]={}
		self.地图坐标[n]=地图坐标类(1197)
		self.地图单位[n]={}
		self.单位编号[n]=1000
	end
	--加载迷宫地图
	for n=1600,1620 do
		self.地图数据[n]={npc={},单位={},传送圈={}}
		self.地图玩家[n]={}
		self.地图坐标[n]=地图坐标类(1514)
		self.地图单位[n]={}
		self.单位编号[n]=1000
	end

	local 地图=10041   --
	self.地图数据[地图]={npc={},单位={},传送圈={}}
	self.地图玩家[地图]={}
	self.地图坐标[地图]=地图坐标类(1004)
	self.地图单位[地图]={}
	self.单位编号[地图]=1000
	local 地图=10051   --
	self.地图数据[地图]={npc={},单位={},传送圈={}}
	self.地图玩家[地图]={}
	self.地图坐标[地图]=地图坐标类(1005)
	self.地图单位[地图]={}
	self.单位编号[地图]=1000
	local 地图=10061   --
	self.地图数据[地图]={npc={},单位={},传送圈={}}
	self.地图玩家[地图]={}
	self.地图坐标[地图]=地图坐标类(1006)
	self.地图单位[地图]={}
	self.单位编号[地图]=1000
	local 地图=10071   --
	self.地图数据[地图]={npc={},单位={},传送圈={}}
	self.地图玩家[地图]={}
	self.地图坐标[地图]=地图坐标类(1007)
	self.地图单位[地图]={}
	self.单位编号[地图]=1000
	local 地图=10081   --
	self.地图数据[地图]={npc={},单位={},传送圈={}}
	self.地图玩家[地图]={}
	self.地图坐标[地图]=地图坐标类(1008)
	self.地图单位[地图]={}
	self.单位编号[地图]=1000
	local 地图=10901   --
	self.地图数据[地图]={npc={},单位={},传送圈={}}
	self.地图玩家[地图]={}
	self.地图坐标[地图]=地图坐标类(1090)
	self.地图单位[地图]={}
	self.单位编号[地图]=1000
	local 地图=10091   --
	self.地图数据[地图]={npc={},单位={},传送圈={}}
	self.地图玩家[地图]={}
	self.地图坐标[地图]=地图坐标类(1009)
	self.地图单位[地图]={}
	self.单位编号[地图]=1000

	------------------------------C改双龙
	local 地图=11181--地府幻境
	self.地图数据[地图]={npc={},单位={},传送圈={}}
	self.地图玩家[地图]={}
	self.地图坐标[地图]=地图坐标类(1118)
	self.地图单位[地图]={}
	self.单位编号[地图]=1000
	local 地图=11191--地府幻境
	self.地图数据[地图]={npc={},单位={},传送圈={}}
	self.地图玩家[地图]={}
	self.地图坐标[地图]=地图坐标类(1119)
	self.地图单位[地图]={}
	self.单位编号[地图]=1000
	local 地图=11201--地府幻境
	self.地图数据[地图]={npc={},单位={},传送圈={}}
	self.地图玩家[地图]={}
	self.地图坐标[地图]=地图坐标类(1120)
	self.地图单位[地图]={}
	self.单位编号[地图]=1000
	local 地图=11211--地府幻境
	self.地图数据[地图]={npc={},单位={},传送圈={}}
	self.地图玩家[地图]={}
	self.地图坐标[地图]=地图坐标类(1121)
	self.地图单位[地图]={}
	self.单位编号[地图]=1000
	local 地图=15321--地府幻境
	self.地图数据[地图]={npc={},单位={},传送圈={}}
	self.地图玩家[地图]={}
	self.地图坐标[地图]=地图坐标类(1532)
	self.地图单位[地图]={}
	self.单位编号[地图]=1000
	local 地图=11261   --
	self.地图数据[地图]={npc={},单位={},传送圈={}}
	self.地图玩家[地图]={}
	self.地图坐标[地图]=地图坐标类(1126)
	self.地图单位[地图]={}
	self.单位编号[地图]=1000
	------------------------------C改双龙


	local 地图=6005   -- 车迟斗法 三清道观
	self.地图数据[地图]={npc={},单位={},传送圈={}}
	self.地图玩家[地图]={}
	self.地图坐标[地图]=地图坐标类(1204)
	self.地图单位[地图]={}
	self.单位编号[地图]=1000
	 local 地图=6006   -- 车迟斗法 道观大殿
	self.地图数据[地图]={npc={},单位={},传送圈={}}
	self.地图玩家[地图]={}
	self.地图坐标[地图]=地图坐标类(1137)
	self.地图单位[地图]={}
	self.单位编号[地图]=1000
	local 地图=6007   -- 车迟斗法 九霄云外
	self.地图数据[地图]={npc={},单位={},传送圈={}}
	self.地图玩家[地图]={}
	self.地图坐标[地图]=地图坐标类(1111)
	self.地图单位[地图]={}
	self.单位编号[地图]=1000
	local 地图=7035   -- 经合龙王
	self.地图数据[地图]={npc={},单位={},传送圈={}}
	self.地图玩家[地图]={}
	self.地图坐标[地图]=地图坐标类(1116)
	self.地图单位[地图]={}
	self.单位编号[地图]=1000
	local 地图=7036   -- 经合龙王
	self.地图数据[地图]={npc={},单位={},传送圈={}}
	self.地图玩家[地图]={}
	self.地图坐标[地图]=地图坐标类(1118)
	self.地图单位[地图]={}
	self.单位编号[地图]=1000
	local 地图=7026   -- 红孩儿 六百里钻头号山
	self.地图数据[地图]={npc={},单位={},传送圈={}}
	self.地图玩家[地图]={}
	self.地图坐标[地图]=地图坐标类(1211)
	self.地图单位[地图]={}
	self.单位编号[地图]=1000
	local 地图=7027   -- 红孩儿 六百里钻头号山
	self.地图数据[地图]={npc={},单位={},传送圈={}}
	self.地图玩家[地图]={}
	self.地图坐标[地图]=地图坐标类(1210)
	self.地图单位[地图]={}
	self.单位编号[地图]=1000
	local 地图=6008   -- 七绝山 驼罗庄
	self.地图数据[地图]={npc={},单位={},传送圈={}}
	self.地图玩家[地图]={}
	self.地图坐标[地图]=地图坐标类(1142)
	self.地图单位[地图]={}
	self.单位编号[地图]=1000
	local 地图=6009   -- 七绝山 北斗七星阵
	self.地图数据[地图]={npc={},单位={},传送圈={}}
	self.地图玩家[地图]={}
	self.地图坐标[地图]=地图坐标类(1213)
	self.地图单位[地图]={}
	self.单位编号[地图]=1000
	local 地图=6010   -- 七绝山 七绝山山洞
	self.地图数据[地图]={npc={},单位={},传送圈={}}
	self.地图玩家[地图]={}
	self.地图坐标[地图]=地图坐标类(1126)
	self.地图单位[地图]={}
	self.单位编号[地图]=1000
	local 地图=6011   -- 七绝山 七绝山路
	self.地图数据[地图]={npc={},单位={},传送圈={}}
	self.地图玩家[地图]={}
	self.地图坐标[地图]=地图坐标类(1211)
	self.地图单位[地图]={}
	self.单位编号[地图]=1000
	local 地图=6012   -- 四季 春意盎然
	self.地图数据[地图]={npc={},单位={},传送圈={}}
	self.地图玩家[地图]={}
	self.地图坐标[地图]=地图坐标类(1207)
	self.地图单位[地图]={}
	self.单位编号[地图]=1000
	local 地图=6013   -- 四季 盛夏炎炎
	self.地图数据[地图]={npc={},单位={},传送圈={}}
	self.地图玩家[地图]={}
	self.地图坐标[地图]=地图坐标类(1070)
	self.地图单位[地图]={}
	self.单位编号[地图]=1000
	local 地图=6014   -- 四季 秋高气爽
	self.地图数据[地图]={npc={},单位={},传送圈={}}
	self.地图玩家[地图]={}
	self.地图坐标[地图]=地图坐标类(1210)
	self.地图单位[地图]={}
	self.单位编号[地图]=1000
	local 地图=6015   -- 四季 冬日浓情
	self.地图数据[地图]={npc={},单位={},传送圈={}}
	self.地图玩家[地图]={}
	self.地图坐标[地图]=地图坐标类(1174)
	self.地图单位[地图]={}
	self.单位编号[地图]=1000
	local 地图=6016   -- 胡姬琵琶行 润芳厅
	self.地图数据[地图]={npc={},单位={},传送圈={}}
	self.地图玩家[地图]={}
	self.地图坐标[地图]=地图坐标类(1197)
	self.地图单位[地图]={}
	self.单位编号[地图]=1000
	local 地图=6017   -- 泾河龙王2 幽森洞
	self.地图数据[地图]={npc={},单位={},传送圈={}}
	self.地图玩家[地图]={}
	self.地图坐标[地图]=地图坐标类(2007)
	self.地图单位[地图]={}
	self.单位编号[地图]=1000
	local 地图=6018   -- 泾河龙王2 太宗寝宫
	self.地图数据[地图]={npc={},单位={},传送圈={}}
	self.地图玩家[地图]={}
	self.地图坐标[地图]=地图坐标类(1046)
	self.地图单位[地图]={}
	self.单位编号[地图]=1000
	local 地图=6019   -- 泾河龙王2 阎罗书房
	self.地图数据[地图]={npc={},单位={},传送圈={}}
	self.地图玩家[地图]={}
	self.地图坐标[地图]=地图坐标类(1124)
	self.地图单位[地图]={}
	self.单位编号[地图]=1000
	local 地图=6020   -- 泾河龙王2 回忆长安城
	self.地图数据[地图]={npc={},单位={},传送圈={}}
	self.地图玩家[地图]={}
	self.地图坐标[地图]=地图坐标类(1001)
	self.地图单位[地图]={}
	self.单位编号[地图]=1000
	local 地图=6021   -- 五庄观 万寿山福地
	self.地图数据[地图]={npc={},单位={},传送圈={}}
	self.地图玩家[地图]={}
	self.地图坐标[地图]=地图坐标类(1146)
	self.地图单位[地图]={}
	self.单位编号[地图]=1000
	local 地图=6022   -- 五庄观 民宅
	self.地图数据[地图]={npc={},单位={},传送圈={}}
	self.地图玩家[地图]={}
	self.地图坐标[地图]=地图坐标类(1044)
	self.地图单位[地图]={}
	self.单位编号[地图]=1000
	local 地图=6023   -- 五庄观 五行法阵
	self.地图数据[地图]={npc={},单位={},传送圈={}}
	self.地图玩家[地图]={}
	self.地图坐标[地图]=地图坐标类(1914)
	self.地图单位[地图]={}
	self.单位编号[地图]=1000
	local 地图=6024   -- 五庄观 紫竹林
	self.地图数据[地图]={npc={},单位={},传送圈={}}
	self.地图玩家[地图]={}
	self.地图坐标[地图]=地图坐标类(1140)
	self.地图单位[地图]={}
	self.单位编号[地图]=1000
	-- local 地图=2000   -- 自在天魔 无名城
	-- self.地图数据[地图]={npc={},单位={},传送圈={}}
	-- self.地图玩家[地图]={}
	-- self.地图坐标[地图]=地图坐标类(2000)
	-- self.地图单位[地图]={}
	-- self.单位编号[地图]=1000
	local 地图=5001--宝藏山
	self.地图数据[地图]={npc={},单位={},传送圈={}}
	self.地图玩家[地图]={}
	self.地图坐标[地图]=地图坐标类(1042)
	self.地图单位[地图]={}
	self.单位编号[地图]=1000
	local 地图=5002--神兽乐园
	self.地图数据[地图]={npc={},单位={},传送圈={}}
	self.地图玩家[地图]={}
	self.地图坐标[地图]=地图坐标类(1231)
	self.地图单位[地图]={}
	self.单位编号[地图]=1000
	-- local 地图=5004--雪趣
	-- self.地图数据[地图]={npc={},单位={},传送圈={}}
	-- self.地图玩家[地图]={}
	-- self.地图坐标[地图]=地图坐标类(1174)
	-- self.地图单位[地图]={}
	-- self.单位编号[地图]=1000
	local 地图=5005--昆仑仙境
	self.地图数据[地图]={npc={},单位={},传送圈={}}
	self.地图玩家[地图]={}
	self.地图坐标[地图]=地图坐标类(1212)
	self.地图单位[地图]={}
	self.单位编号[地图]=1000
	local 地图=5006--蟠桃盛会
	self.地图数据[地图]={npc={},单位={},传送圈={}}
	self.地图玩家[地图]={}
	self.地图坐标[地图]=地图坐标类(1231)
	self.地图单位[地图]={}
	self.单位编号[地图]=1000
	local 地图=5958--地府幻境
	self.地图数据[地图]={npc={},单位={},传送圈={}}
	self.地图玩家[地图]={}
	self.地图坐标[地图]=地图坐标类(1122)
	self.地图单位[地图]={}
	self.单位编号[地图]=1000
	local 地图=5959--地府幻境
	self.地图数据[地图]={npc={},单位={},传送圈={}}
	self.地图玩家[地图]={}
	self.地图坐标[地图]=地图坐标类(1122)
	self.地图单位[地图]={}
	self.单位编号[地图]=1000
	local 地图=5960--地府幻境
	self.地图数据[地图]={npc={},单位={},传送圈={}}
	self.地图玩家[地图]={}
	self.地图坐标[地图]=地图坐标类(1122)
	self.地图单位[地图]={}
	self.单位编号[地图]=1000
	 --加载副本地图
end

function 地图处理类:补充地图(n)--地图处理类:补充地图(1231)
	self.地图数据[n]={npc={},单位={},传送圈={}}
	self.地图玩家[n]={}
	self.地图坐标[n]=地图坐标类(n)
	self.地图单位[n]={}
	self.单位编号[n]=1000
	if 取场景等级(n)~=nil then
		self.遇怪地图[n]=true
	end
end

function 地图处理类:npc传送(id,m,x,y)
	if 玩家数据[id].队伍~=0 and 玩家数据[id].队长==false then
		常规提示(id,"只有队长才可使用此项功能！")
		return
	end
	self:跳转地图(id,m,x,y)-- 玩家数据[id].角色.门派="无"
end

function 地图处理类:门派传送(id,m)
	if 玩家数据[id].队伍~=0 and 玩家数据[id].队长==false then
		常规提示(id,"只有队长才可使用此项功能！")
		return
	end
	local cs --检查门派传送条件
	if m == "方寸山" then
		cs = {1135,72,63}
	elseif m == "女儿村" then
		cs = {1142,37,37}
	elseif m == "神木林" then
		cs = {1138,46,121}
	elseif m == "大唐官府" then
		cs = {1198,131,82}
	elseif m == "化生寺" then
		cs = {1002,7,88}
	elseif m == "阴曹地府" then
		cs = {1122,34,56}
	elseif m == "盘丝洞" then
		cs = {1513,174,31}
	elseif m == "无底洞" then
		cs = {1139,61,125}
	elseif m == "狮驼岭" then
		cs = {1131,109,77}
	elseif m == "魔王寨" then
		cs = {1512,76,29}
	elseif m == "普陀山" then
		cs = {1140,20,18}
	elseif m == "天宫" then
		cs = {1111,175,122}
	elseif m == "凌波城" then
		cs = {1150,33,67}
	elseif m == "五庄观" then
		cs = {1146,26,55}
	elseif m == "龙宫" then
		cs = {1116,71,77}
	elseif m == "花果山" then
		cs = {1251,66,33}
	elseif m == "九黎城" then
		cs = {1580,57,117}
	end
	if cs==nil then
		return
	else
		self:跳转地图(id,cs[1],cs[2],cs[3])
	end
end

function 地图处理类:明雷遇怪处理(连接id,id,内容)
	local 标识=内容.标识
	local 序列=内容.序列
	if 取队长权限(id)==false then
		return
	elseif 任务数据[标识]==nil then
		return
	elseif 玩家数据[id].zhandou~=0 or 任务数据[标识].zhandou~=nil then
		return
	else
		if 任务数据[标识].类型==103 or 任务数据[标识].类型==6677 then --大雁塔
			战斗准备类:创建战斗(id,100007,标识)
			任务数据[标识].zhandou=true
		elseif 任务数据[标识].类型==202 then
			战斗准备类:创建战斗(id,100019,标识)
			任务数据[标识].zhandou=true
		-----------------------------------------
		elseif 任务数据[标识].类型==6667 then --女儿村
			if 任务数据[标识].名称=="普通山猴" then
				战斗准备类:创建战斗(id,130002,标识)
			else
				战斗准备类:创建战斗(id,130003,标识)
			end
			任务数据[标识].zhandou=true
		elseif 任务数据[标识].类型==6668 then
			if 任务数据[标识].名称=="普通护卫者" then
				战斗准备类:创建战斗(id,130004,标识)
			else
				战斗准备类:创建战斗(id,130005,标识)
			end
			任务数据[标识].zhandou=true
		elseif 任务数据[标识].类型==6669 then
			if 任务数据[标识].名称=="普通守卫者" then
				战斗准备类:创建战斗(id,130006,标识)
			else
				战斗准备类:创建战斗(id,130007,标识)
			end
			任务数据[标识].zhandou=true
		elseif 任务数据[标识].类型==6670 then
			if 任务数据[标识].名称=="普通机器人" or 任务数据[标识].名称=="普通战车" then
				战斗准备类:创建战斗(id,130008,标识)
			else
				战斗准备类:创建战斗(id,130009,标识)
			end
			任务数据[标识].zhandou=true
		elseif 任务数据[标识].类型==6671 then
			if 任务数据[标识].名称=="普通小野猪" then
				战斗准备类:创建战斗(id,130010,标识)
			else
				战斗准备类:创建战斗(id,130011,标识)
			end
			任务数据[标识].zhandou=true
		elseif 任务数据[标识].类型==6672 then
			if 任务数据[标识].名称=="普通守护伞" then
				战斗准备类:创建战斗(id,130012,标识)
			else
				战斗准备类:创建战斗(id,130013,标识)
			end
			任务数据[标识].zhandou=true
		elseif 任务数据[标识].类型==6673 then
			if 任务数据[标识].名称=="普通月宫兔" then
				战斗准备类:创建战斗(id,130014,标识)
			else
				战斗准备类:创建战斗(id,130015,标识)
			end
			任务数据[标识].zhandou=true
		elseif 任务数据[标识].类型 == 742 then
			if 任务数据[标识].名称 == "蛛丝" then
				战斗准备类:创建战斗(id, 155556, 标识)
			end
			任务数据[标识].zhandou=true
		elseif 任务数据[标识].类型==1209 then
			if 帮派PK.正式开始 and 帮派PK.活动结束==false then
				if 任务数据[标识].归属方=="红方" then
				    if 帮派PK.玩家表["蓝方"].成员[id] then
				    	战斗准备类:创建战斗(id,130085,标识)
				    	任务数据[标识].zhandou=true
				    end
				elseif 任务数据[标识].归属方=="蓝方" then
				    if 帮派PK.玩家表["红方"].成员[id] then
				    	战斗准备类:创建战斗(id,130085,标识)
				    	任务数据[标识].zhandou=true
				    end
				end
			end
		end
	end
end

function 地图处理类:取传送数据(数字id)
	-- if 玩家数据[数字id].角色.地图数据.编号 >= 40000000 then
		-- local fhz = false
		-- for i=1,#房屋数据 do
		-- 	if 房屋数据[i].庭院ID == 玩家数据[数字id].角色.地图数据.编号  then
		-- 		return  取传送点(房屋数据[i].庭院地图)
		-- 	elseif 房屋数据[i].房屋ID == 玩家数据[数字id].角色.地图数据.编号 then
		-- 		return  取传送点(房屋数据[i].房屋地图)
		-- 	elseif 房屋数据[i].阁楼ID == 玩家数据[数字id].角色.地图数据.编号 then
		-- 		return  取传送点(房屋数据[i].阁楼地图)
		-- 	elseif 房屋数据[i].牧场ID == 玩家数据[数字id].角色.地图数据.编号 then
		-- 		return  取传送点(房屋数据[i].牧场地图)
		-- 	end
		-- end
		-- if not fhz then

		-- 	return  取传送点(玩家数据[数字id].角色.地图数据.编号)
		-- end
	-- else
		return  取传送点(玩家数据[数字id].角色.地图数据.编号)
	-- end
end

function 地图处理类:数据处理(id,序号,数字id,内容)
	内容.ip=nil
	if 序号==1001 then
		self:移动请求(id,内容,数字id)

	elseif 序号==1001.1 then
		local 地图编号=玩家数据[数字id].角色.地图数据.编号
		if 玩家数据[内容.玩家id]~=nil and self:取同一地图(地图编号,数字id,内容.玩家id,1)  then
			发送数据(玩家数据[内容.玩家id].连接id,1008,{数字id=数字id,路径=内容})
		end
	elseif 序号==1002 then
		self:移动坐标刷新(id,数字id,内容)
	elseif 序号==1003 then --
		local 现在地图 = self:取传送数据(数字id)
		if 现在地图==nil or (现在地图~=nil and 现在地图[内容.id]==nil ) or (现在地图~=nil and 现在地图[内容.id]~=nil and 现在地图[内容.id].x==nil or 现在地图[内容.id].y==nil ) then
			-- 常规提示(数字id,"#Y/传送阵位置错误")
			return
		end
		local 目标=切换场景(现在地图[内容.id].切换,玩家数据[数字id].角色.地图数据.编号)
		local 角色xy={x=x,y=y}
		local 对方xy={x=0,y=0}
		对方xy.x,对方xy.y=现在地图[内容.id].x,现在地图[内容.id].y
		角色xy.x,角色xy.y=玩家数据[数字id].角色.地图数据.x/20,玩家数据[数字id].角色.地图数据.y/20
		if 取两点距离(对方xy,角色xy)>=15 then
			常规提示(数字id,"#Y/传送阵和你的距离太远了吧")
			return
		else
			self:跳转地图(数字id,目标[1],目标[2].x,目标[2].y)
		end
	elseif 序号==1004 then
		local 现在地图 = 玩家数据[数字id].角色.地图数据.编号
		local 目标=内容.地图
		if 目标==nil or 现在地图==nil or (self.地图单位[内容.地图]~=nil and self.地图单位[内容.地图][内容.编号]==nil) then
			常规提示(数字id,"#Y/你们距离太远了吧")
			return
		elseif 目标~=现在地图 then
			常规提示(数字id,"#Y/你们距离太远了吧")
			return
		end
		local 角色xy={x=x,y=y}
		local 对方xy={x=0,y=0}
		对方xy.x,对方xy.y=self.地图单位[内容.地图][内容.编号].x,self.地图单位[内容.地图][内容.编号].y
		角色xy.x,角色xy.y=玩家数据[数字id].角色.地图数据.x/20,玩家数据[数字id].角色.地图数据.y/20
		-- __S服务:输出(取两点距离(对方xy,角色xy).."#"..对方xy.x.."#"..对方xy.y.."#"..角色xy.x.."#"..角色xy.y)
		if 取两点距离(对方xy,角色xy)<=15 then
			-- 常规提示(数字id,"#Y/怪物和你的距离太远了吧")
		-- 	return
		-- else
			self:明雷遇怪处理(id,数字id,内容)
		end
	elseif 序号==1009 then
		self:跳转地图(数字id,内容.地图,内容.x,内容.y)
	-- elseif 序号==1005 then
	-- 	if 内容.注释 == "庭院" then
	-- 		for i=1,#房屋数据 do
	-- 			if 房屋数据[i].ID == 数字id then
	-- 			房屋数据[i].庭院装饰[内容.编号].x = 内容.x
	-- 			房屋数据[i].庭院装饰[内容.编号].y = 内容.y
	-- 			for n, v in pairs(self.地图玩家[玩家数据[数字id].角色.地图数据.编号]) do--向地图内玩家发送新玩家数据
	-- 				if n~=id and  self:取同一地图(玩家数据[数字id].角色.地图数据.编号,id,n,1) then
	-- 					发送数据(玩家数据[n].连接id,1026,{房屋数据[i].庭院装饰,内容.注释})
	-- 				end
	-- 			end
	-- 			发送数据(玩家数据[数字id].连接id,1026,{房屋数据[i].庭院装饰,内容.注释})
	-- 			end
	-- 		end
	-- 	elseif 内容.注释 == "室内" then
	-- 			for i=1,#房屋数据 do
	-- 				if 房屋数据[i].ID == 数字id then
	-- 				房屋数据[i].室内装饰[内容.编号].x = 内容.x
	-- 				房屋数据[i].室内装饰[内容.编号].y = 内容.y
	-- 				for n, v in pairs(self.地图玩家[玩家数据[数字id].角色.地图数据.编号]) do--向地图内玩家发送新玩家数据
	-- 					if n~=id and  self:取同一地图(玩家数据[数字id].角色.地图数据.编号,id,n,1) then
	-- 						发送数据(玩家数据[n].连接id,1026,{房屋数据[i].室内装饰,内容.注释})
	-- 					end
	-- 				end
	-- 				发送数据(玩家数据[数字id].连接id,1026,{房屋数据[i].室内装饰,内容.注释})
	-- 				end
	-- 			end
	-- 	end
	-- elseif 序号==1006 then
	-- 	if 内容.注释 == "庭院" then
	-- 		for i=1,#房屋数据 do
	-- 			if 房屋数据[i].ID == 数字id then
	-- 			table.remove(房屋数据[i].庭院装饰,内容.编号)
	-- 			for n, v in pairs(self.地图玩家[玩家数据[数字id].角色.地图数据.编号]) do--向地图内玩家发送新玩家数据
	-- 				if n~=id and  self:取同一地图(玩家数据[数字id].角色.地图数据.编号,id,n,1) then
	-- 					发送数据(玩家数据[n].连接id,1026,{房屋数据[i].庭院装饰,内容.注释})
	-- 				end
	-- 			end
	-- 			发送数据(玩家数据[数字id].连接id,1026,{房屋数据[i].庭院装饰,内容.注释})
	-- 			end
	-- 		end
	-- 	elseif 内容.注释 == "室内" then
	-- 		for i=1,#房屋数据 do
	-- 			if 房屋数据[i].ID == 数字id then
	-- 			table.remove(房屋数据[i].室内装饰,内容.编号)
	-- 			for n, v in pairs(self.地图玩家[玩家数据[数字id].角色.地图数据.编号]) do--向地图内玩家发送新玩家数据
	-- 				if n~=id and  self:取同一地图(玩家数据[数字id].角色.地图数据.编号,id,n,1) then
	-- 					发送数据(玩家数据[n].连接id,1026,{房屋数据[i].室内装饰,内容.注释})
	-- 				end
	-- 			end
	-- 			发送数据(玩家数据[数字id].连接id,1026,{房屋数据[i].室内装饰,内容.注释})
	-- 			end
	-- 		end
	-- 	end
	--  elseif 序号==1007 then
	-- 			if 内容.注释 == "庭院" then
	-- 				for i=1,#房屋数据 do
	-- 					if 房屋数据[i].ID == 数字id then
	-- 					房屋数据[i].庭院装饰[内容.编号].方向 = 内容.方向
	-- 					发送数据(玩家数据[数字id].连接id,1027,{房屋数据[i].庭院装饰,内容.注释})
	-- 					end
	-- 				end
	-- 			elseif 内容.注释 == "室内" then
	-- 				for i=1,#房屋数据 do
	-- 						if 房屋数据[i].ID == 数字id then
	-- 						房屋数据[i].室内装饰[内容.编号].方向 = 内容.方向
	-- 						发送数据(玩家数据[数字id].连接id,1027,{房屋数据[i].室内装饰,内容.注释})
	-- 						end
	-- 				end
	-- 			end
	 elseif 序号==1008 then
	 	self:重置坐标(数字id,内容.x,内容.y,内容.方向)
	end
end
function 地图处理类:跳转地图(数字id,地图编号,x,y)
	if 玩家数据[数字id].摊位数据~=nil then return  end
	if 玩家数据[数字id].队伍~=0 and 玩家数据[数字id].队长==false then return 0 end
	if 玩家数据[数字id].zhandou~=0 then
		print("战斗不为0禁止跳转")
		return
	end
	local x1,y1=x*20,y*20
	玩家数据[数字id].角色.地图数据.x,玩家数据[数字id].角色.地图数据.y=x1,y1
	--self:离开地图(数字id,玩家数据[数字id].角色.地图数据.编号)
	self:移除玩家(数字id)
	玩家数据[数字id].角色.地图数据.编号=地图编号
	-- 发送数据(玩家数据[数字id].连接id,1005,{地图编号,x,y,比武大会.阵营[数字id]})
	发送数据(玩家数据[数字id].连接id,1005,{地图编号,x,y})
	self:加入玩家(数字id,地图编号,x1,y1)
	if 玩家数据[数字id].队伍~=0 and 玩家数据[数字id].队长 then
		local 队伍id=玩家数据[数字id].队伍
		for n=2,#队伍数据[队伍id].成员数据 do
			local 队员id=队伍数据[队伍id].成员数据[n]
			玩家数据[队员id].角色.地图数据.x,玩家数据[队员id].角色.地图数据.y=x1,y1
			self:移除玩家(队员id)
			玩家数据[队员id].角色.地图数据.编号=地图编号
			发送数据(玩家数据[队员id].连接id,1005,{地图编号,x,y})
			self:加入玩家(队员id,地图编号,x1,y1)
		end
	end
	self:更新活动称谓(数字id,地图编号)
	return true
end

local hdftcwtab={}
hdftcwtab[1140]=1
hdftcwtab[1003]=1
hdftcwtab[1197]="比武大会"--比武大会
hdftcwtab[1511]="帮派PK"--帮派PK
hdftcwtab[2010]="帮派PK"--帮派PK
hdftcwtab[10000]="彩虹争霸"
hdftcwtab[10002]="彩虹争霸"
hdftcwtab[10003]="彩虹争霸"
hdftcwtab[10004]="彩虹争霸"
hdftcwtab[10005]="彩虹争霸"
hdftcwtab[10006]="彩虹争霸"
hdftcwtab[10007]="彩虹争霸"
hdftcwtab[10008]="彩虹争霸"
hdftcwtab[10009]="彩虹争霸"
hdftcwtab[10001]="彩虹争霸"
hdftcwtab[10012]="彩虹争霸"
hdftcwtab[10013]="彩虹争霸"
hdftcwtab[10014]="彩虹争霸"
hdftcwtab[10015]="彩虹争霸"
hdftcwtab[10016]="彩虹争霸"
hdftcwtab[10017]="彩虹争霸"
hdftcwtab[10018]="彩虹争霸"

function 地图处理类:更新活动称谓(数字id,地图编号)
	if hdftcwtab[地图编号] then
		local 称谓
		if 地图编号==1140  then --feisheng
			local 飞升任务=玩家数据[数字id].角色:取任务(9212)
			if 任务数据[飞升任务] and 任务数据[飞升任务].子类进程==2 then
				战斗准备类:创建战斗(数字id,140001,0)--飞升_黑熊精
			end
		-- elseif 地图编号==1003  then
		-- 	if 玩家数据[数字id].角色.剧情 and 玩家数据[数字id].角色.剧情.主线==1 and 玩家数据[数字id].角色.剧情.进度==1  then
		-- 		剧情交互(玩家数据[数字id].连接id,数字id,{地图=1003,编号=19})
		-- 	end
		-- elseif 地图编号==1197  then
		-- 	if 比武大会.阵营[数字id] then
		-- 		发送数据(玩家数据[数字id].连接id,1036,{比武大会.阵营[数字id],1197})
		-- 	end
		--elseif hdftcwtab[地图编号]=="帮派PK"  then
			--if 帮派PK.玩家表["蓝方"].成员[数字id]then
			--	称谓="蓝方"
			--elseif 帮派PK.玩家表["红方"].成员[数字id]then
				--称谓="红方"
			--end
			--发送数据(玩家数据[数字id].连接id,1036,{称谓})
		--elseif hdftcwtab[地图编号]=="彩虹争霸"  then
			--if 彩虹争霸.云影成员[数字id] then
			--	称谓="云影"
			--elseif 彩虹争霸.虹光成员[数字id] then
				--称谓="虹光"
			--end
			--发送数据(玩家数据[数字id].连接id,1036,{称谓})
		end
	end
end
-- function 地图处理类:跳转地图(数字id,地图编号,x,y)
-- 	if 玩家数据[数字id].摊位数据~=nil then return  end
-- 	if 玩家数据[数字id].队伍~=0 and 玩家数据[数字id].队长==false then return 0 end
-- 	if 玩家数据[数字id].zhandou~=0 then
-- 		if 玩家数据[数字id].zhandou == nil or 战斗准备类.战斗盒子[玩家数据[数字id].zhandou] == nil then
-- 			玩家数据[数字id].zhandou = 0
-- 		else
-- 			print("战斗不为0禁止跳转",数字id)
-- 			常规提示(数字id,"#Y/当前依然处于战斗状态，请联系管理处理")
-- 			return
-- 		end
-- 	end
-- 	local x1,y1=x*20,y*20
-- 	玩家数据[数字id].角色.地图数据.x,玩家数据[数字id].角色.地图数据.y=x1,y1
-- 	--self:离开地图(数字id,玩家数据[数字id].角色.地图数据.编号)
-- 	self:移除玩家(数字id)
-- 	玩家数据[数字id].角色.地图数据.编号=地图编号
-- 	发送数据(玩家数据[数字id].连接id,1005,{地图编号,x,y})
-- 	self:加入玩家(数字id,地图编号,x1,y1)
-- 	if 玩家数据[数字id].队伍~=0 and 玩家数据[数字id].队长 then
-- 		local 队伍id=玩家数据[数字id].队伍
-- 		for n=2,#队伍数据[队伍id].成员数据 do
-- 			local 队员id=队伍数据[队伍id].成员数据[n]
-- 			if 玩家数据[队员id] == nil or 玩家数据[队员id].角色 == nil then return end
-- 			玩家数据[队员id].角色.地图数据.x,玩家数据[队员id].角色.地图数据.y=x1,y1
-- 			self:移除玩家(队员id)
-- 			玩家数据[队员id].角色.地图数据.编号=地图编号
-- 			发送数据(玩家数据[队员id].连接id,1005,{地图编号,x,y})
-- 			self:加入玩家(队员id,地图编号,x1,y1)
-- 		end
-- 	end

-- 	if 地图编号==1140  then --feisheng
-- 			local 飞升任务=玩家数据[数字id].角色:取任务(9212)
-- 			if 任务数据[飞升任务] and 任务数据[飞升任务].子类进程==2 then
-- 				战斗准备类:创建战斗(数字id,140001,0)--飞升_黑熊精
-- 			end
-- 		end
-- end
function 地图处理类:更改模型(id,模型,类型)
	local 地图编号=玩家数据[id].角色.地图数据.编号
	for n, v in pairs(self.地图玩家[地图编号]) do
		if n~=id and self:取同一地图(地图编号,id,n,1) then
			发送数据(玩家数据[n].连接id,1030,{id=id,变身数据=模型})
		end
	end
end

function 地图处理类:重置坐标(id,x,y,方向)
	玩家数据[id].角色.地图数据.x,玩家数据[id].角色.地图数据.y,玩家数据[id].角色.地图数据.方向=x,y,方向
	发送数据(玩家数据[id].连接id,1011,{x=x,y=y})
	local 地图编号=玩家数据[id].角色.地图数据.编号
	for i, v in pairs(self.地图玩家[地图编号]) do
		if i~=id and 玩家数据[i] then
			发送数据(玩家数据[i].连接id,1012,{id=id,x=x,y=y,方向=方向})
		end
	end
end
function 地图处理类:取消玩家摊位(id)
	local 地图编号=玩家数据[id].角色.地图数据.编号
	for n, v in pairs(self.地图玩家[地图编号]) do
		if n~=id and self:取同一地图(地图编号,id,n,1) then
			发送数据(玩家数据[n].连接id,3519,{id=id})
		end
	end
end
function 地图处理类:移动坐标刷新(id,数字id,内容)
	if not 玩家数据[数字id] then
	    return
	end
	--local 角色xxy={x=内容.x,y=内容.y}
	--local 对方xxy={x=玩家数据[数字id].角色.地图数据.x,y=玩家数据[数字id].角色.地图数据.y}
	--if 取两点距离(角色xxy,对方xxy)>=100 then
	--	print(数字id)
	--end
	玩家数据[数字id].角色.地图数据.x,玩家数据[数字id].角色.地图数据.y,玩家数据[数字id].角色.地图数据.方向=内容.x,内容.y,内容.方向
	if 内容.类型 == "行走" then
		-- 玩家数据[数字id].角色.行走监测.行走 = true
		-- 玩家数据[数字id].角色.行走监测.时间 = os.time()
		local 地图=玩家数据[数字id].角色.地图数据.编号
		if 玩家数据[数字id].队伍~=0 and 玩家数据[数字id].队长 then
			local 角色xy={x=内容.x,y=内容.y}
			local 对方xy={x=0,y=0}
			for n=2,#队伍数据[玩家数据[数字id].队伍].成员数据 do
				local 队员id=队伍数据[玩家数据[数字id].队伍].成员数据[n]
				if 玩家数据[队员id] == nil or 玩家数据[队员id].角色 == nil then return end
			    对方xy.x,对方xy.y=玩家数据[队员id].角色.地图数据.x,玩家数据[队员id].角色.地图数据.y
				if 取两点距离(角色xy,对方xy)>=self.队伍距离*n+500 then --超出五倍距离重置坐标
					玩家数据[数字id].移动数据[n]=false
					self:重置坐标(队员id,内容.x,内容.y,内容.方向)
					return
				end
				if 取两点距离(角色xy,对方xy)>=self.队伍距离*n-self.队伍距离 and  玩家数据[数字id].移动数据.移动目标  then
					--玩家数据[数字id].移动数据[n]==false or
					玩家数据[数字id].移动数据[n]=true
					local 临时数据={x=玩家数据[数字id].移动数据.移动目标.x,y=玩家数据[数字id].移动数据.移动目标.y,距离=self.队伍距离*n-self.队伍距离,数字id=队员id}
					发送数据(玩家数据[队员id].连接id,1001,临时数据)
					local 地图编号=玩家数据[数字id].角色.地图数据.编号
					for i, v in pairs(self.地图玩家[地图]) do
						if i~=队员id and 玩家数据[i] and self:取同一地图(地图,队员id,i,1) then
							发送数据(玩家数据[i].连接id,1008,{数字id=队员id,路径=临时数据})
						end
					end
				end
			end
		end
		if 玩家数据[数字id].角色.战斗开关==false and (玩家数据[数字id].zhandou==nil or 玩家数据[数字id].zhandou==0) and 取队长权限(数字id) then
		    self:暗雷遇怪检测(数字id,地图)
		end
	else
		-- 玩家数据[数字id].角色.行走监测.行走 = false
		-- if 队伍数据[玩家数据[数字id].队伍] then
		-- 	for n=2,#队伍数据[玩家数据[数字id].队伍].成员数据 do
		-- 		local 队员id=队伍数据[玩家数据[数字id].队伍].成员数据[n]
		-- 		if 玩家数据[队员id].连接id == "招募" then
		-- 			玩家数据[队员id].角色.地图数据.x,玩家数据[队员id].角色.地图数据.y,玩家数据[队员id].角色.地图数据.方向=内容.x,内容.y,内容.方向
		-- 		end
		-- 	end
		-- end
	end
end

function 地图处理类:更换假人模型数据(任务id)
	if 任务数据[任务id]==nil then return end
	local 地图=任务数据[任务id].地图编号
	local 编号=任务数据[任务id].单位编号
	self.地图单位[地图][编号].名称=任务数据[任务id].名称
	self.地图单位[地图][编号].模型=任务数据[任务id].模型
	if 任务数据[任务id].称谓 then
		self.地图单位[地图][编号].称谓=任务数据[任务id].称谓
	end
	if 任务数据[任务id].武器 then
		self.地图单位[地图][编号].武器=任务数据[任务id].武器
	end
	if 任务数据[任务id].副武器 then
		self.地图单位[地图][编号].副武器=任务数据[任务id].副武器
	end

	if 任务数据[任务id].锦衣 then
		self.地图单位[地图][编号].锦衣=任务数据[任务id].锦衣
	end
	if 任务数据[任务id].光环 then
		self.地图单位[地图][编号].光环=任务数据[任务id].光环
	end
	for n, v in pairs(self.地图玩家[地图]) do
		if self:取同一地图(地图,v,self.地图单位[地图][编号],2) then
			发送数据(玩家数据[v].连接id,1038,self.地图单位[地图][编号])
		end
	end
end

function 地图处理类:暗雷遇怪检测(数字id,地图)
    if self.遇怪地图[地图]~=nil then
		if os.time()>=玩家数据[数字id].遇怪时间 and self:遇怪条件检测(地图,数字id) then
			战斗准备类:创建战斗(数字id,100001,0)
		else
			self:官职情报收集检测(地图,数字id)
		end
	end
	if 玩家数据[数字id].角色:取任务(111)~=0 and 任务数据[玩家数据[数字id].角色:取任务(111)].分类==2 and 取门派巡逻地图(玩家数据[数字id].角色.门派,地图) and 取随机数()<=10 then --门派巡逻
		战斗准备类:创建战斗(数字id,100015,玩家数据[数字id].角色:取任务(111))
		return
		--------------------------C改大闹
	elseif 玩家数据[数字id].角色:取任务(82)~=0 and os.time()>=玩家数据[数字id].遇怪时间 and 取随机数()<=25 and 玩家数据[数字id].角色.地图数据.编号==6018  then
	    	战斗准备类:创建战斗(数字id,155066,玩家数据[数字id].角色:取任务(82))
	elseif 玩家数据[数字id].角色:取任务(72)~=0 and os.time()>=玩家数据[数字id].遇怪时间 and 取随机数()<=25 and 玩家数据[数字id].角色.地图数据.编号==6033  then
	    	战斗准备类:创建战斗(数字id,155584,玩家数据[数字id].角色:取任务(72))
		--------------------------C改大闹

	-- elseif 玩家数据[数字id].角色:取任务(82)~=0 and os.time()>=玩家数据[数字id].遇怪时间 and 取随机数()<=25 and 玩家数据[数字id].角色.地图数据.编号 == 6018  then
 --    	战斗准备类:创建战斗(数字id,155572,玩家数据[数字id].角色:取任务(82))
 --    	return
 --  	elseif 玩家数据[数字id].角色:取任务(72)~=0 and os.time()>=玩家数据[数字id].遇怪时间 and 取随机数()<=25 and 玩家数据[数字id].角色.地图数据.编号 == 6033  then
 --    	战斗准备类:创建战斗(数字id,155580,玩家数据[数字id].角色:取任务(72))
 --    	return
	elseif 地图~=1001 and 玩家数据[数字id].角色:取任务(1163)~=0 and 取随机数()<=10 then
		local 任务id=玩家数据[数字id].角色:取任务(1163)
		if 任务数据[任务id].分类==2 then
			if 地图==1050 and 任务数据[任务id].巡逻地点=="长安衙门" then
				战斗准备类:创建战斗(数字id,130036,任务id)
			elseif 地图==1537 and 任务数据[任务id].巡逻地点=="建邺衙门" then
				战斗准备类:创建战斗(数字id,130036,任务id)
			elseif 地图==1026 and 任务数据[任务id].巡逻地点=="国子监书库" then
				战斗准备类:创建战斗(数字id,130036,任务id)
			end
		elseif 任务数据[任务id].分类==3 then
			if 任务数据[任务id].子类==2 then --护送西域使者
			    战斗准备类:创建战斗(数字id,130037,任务id)
			end
		elseif 任务数据[任务id].分类==6 and 任务数据[任务id].已跳转==nil and 地图~=任务数据[任务id].SX.跳转[1] then
			任务数据[任务id].已跳转=true
			self:跳转地图(数字id,任务数据[任务id].SX.跳转[1],任务数据[任务id].SX.跳转[2],任务数据[任务id].SX.跳转[3])
			常规提示(数字id,"刚打了一个瞌睡，居然就到了"..取地图名称(任务数据[任务id].SX.跳转[1]).."。")
		end
		return
	end
end

function 地图处理类:取野外等级差(地图等级,玩家等级)
	local 等级=math.abs(地图等级-玩家等级)
	if 等级<=5 then
		return 1
	elseif 等级<=10 then
		return 0.8
	elseif 等级<=20 then
		return 0.5
	else
		return 0.2
	end
end

function 地图处理类:官职情报收集检测(地图,id)
	if 地图==1110 or 地图==1514 or 地图==1174 or 地图==1091 or 地图==1173 then
		local 随机值=取随机数()
		if   玩家数据[id].角色:取任务(110)~=0 and 任务数据[玩家数据[id].角色:取任务(110)].分类==3 and 任务数据[玩家数据[id].角色:取任务(110)].情报==false and 随机值<=20 then
			战斗准备类:创建战斗(id,100014,玩家数据[id].角色:取任务(110))
		end
	end
end

function 地图处理类:遇怪条件检测(地图,id)
	if 地图>=1004 and 地图<=1009 then
		return false
	elseif 地图==1090 then
		return false
	elseif 玩家数据[id].角色:取任务(17)~=0 and 任务数据[玩家数据[id].角色:取任务(17)].分类==3 then
		return false
	elseif 玩家数据[id].角色:取任务(110)~=0 and 任务数据[玩家数据[id].角色:取任务(110)].分类==3 then
		return false
	elseif 玩家数据[id].角色:取任务(111)~=0 and 任务数据[玩家数据[id].角色:取任务(111)].分类==2 then
		return false
	end
	local 场景等级=取场景等级(地图)
	if 场景等级==nil then
		return false
	elseif 辅助内挂类:是否挂机中(id) then --挂机
		return false
	elseif 玩家数据[id].角色:取任务(9)~=0 and 玩家数据[id].角色.等级+10>=场景等级 then
		return false
	end
	return true
end

function 地图处理类:比较距离(id,对方id,距离)
	if 玩家数据[id].角色.地图数据.编号~=玩家数据[对方id].角色.地图数据.编号 then
		return false
	elseif 取两点距离(玩家数据[id].角色.地图数据,玩家数据[对方id].角色.地图数据)>距离 then
		return false
	end
	return true
end

function 地图处理类:取移动限制(id)
	if id==nil or 玩家数据[id]==nil then
		return true
	end
	if 玩家数据[id].队伍~=0 and 玩家数据[id].队长==false then
		return true
	elseif 玩家数据[id].摊位数据~=nil then
		return  true
	elseif 收购数据[id]~=nil then
		return  true
	-- elseif 玩家数据[id].勾魂索中 then
	-- 	return  true
	end
	return false
end

function 地图处理类:移动请求(id,内容,数字id)
	if self:取移动限制(数字id) then --移动限制
		return
	else
		内容.距离=0
		-- 发送数据(id,1001,内容)--主角移动请求
	end
	if 玩家数据[数字id].队伍~=0 then
		玩家数据[数字id].移动数据={}
		for n=1,#队伍数据[玩家数据[数字id].队伍].成员数据 do
			玩家数据[数字id].移动数据[n]=false
		end
		玩家数据[数字id].移动数据.移动目标=内容
	end
	local 地图编号=玩家数据[数字id].角色.地图数据.编号
	for n, v in pairs(self.地图玩家[地图编号]) do
		if n~=数字id and 玩家数据[n]~=nil and self:取同一地图(地图编号,数字id,n,1)  then
			发送数据(玩家数据[n].连接id,1008,{数字id=数字id,路径=内容})
		end
	end
end
function 地图处理类:更新(dt) end

function 地图处理类:移除玩家(id)
	local 地图编号=玩家数据[id].角色.地图数据.编号
	for n, v in pairs(self.地图玩家[地图编号]) do
		if n~=id and self:取同一地图(地图编号,id,n,1)  then
			发送数据(玩家数据[n].连接id,1007,{id=id})
		end
	end
	self.地图玩家[地图编号][id]=nil
end
function 地图处理类:更改染色(id,染色组,方案)
	local 地图编号=玩家数据[id].角色.地图数据.编号
	for n, v in pairs(self.地图玩家[地图编号]) do
		if n~=id and 玩家数据[n]~=nil and self:取同一地图(地图编号,id,n,1)  then
			发送数据(玩家数据[n].连接id,1013,{id=id,染色组=染色组,染色方案=方案})
		end
	end
end

function 地图处理类:更改炫彩(id,xc,xcz)
	local 地图编号=玩家数据[id].角色.地图数据.编号
	for n, v in pairs(self.地图玩家[地图编号]) do
		if n~=id and 玩家数据[n]~=nil and self:取同一地图(地图编号,id,n,1)  then
			发送数据(玩家数据[n].连接id,1031,{id=id,炫彩=xc,炫彩组=xcz})
		end
	end
end

function 地图处理类:更新武器(id,武器,副武器)
	local 地图编号=玩家数据[id].角色.地图数据.编号
	local 副武器 = nil

	if 玩家数据[id].角色.模型 == "影精灵" and 玩家数据[id].角色.装备 ~= nil and 玩家数据[id].角色.装备[4] ~= nil and 玩家数据[id].道具.数据[玩家数据[id].角色.装备[4]].子类 == 911 then
		副武器 = 玩家数据[id].道具.数据[玩家数据[id].角色.装备[4]]
	end

	for n, v in pairs(self.地图玩家[地图编号]) do
		if n~=id and 玩家数据[n]~=nil and self:取同一地图(地图编号,id,n,1) then
			发送数据(玩家数据[n].连接id,1009,{id=id,武器=武器,副武器 = 副武器})
		end
	end
end

function 地图处理类:更新锦衣(id,名称,序号)
	local 地图编号=玩家数据[id].角色.地图数据.编号
	for n, v in pairs(self.地图玩家[地图编号]) do
		if n~=id and 玩家数据[n]~=nil and self:取同一地图(地图编号,id,n,1) then
			发送数据(玩家数据[n].连接id,1032,{id=id,锦衣=名称,序号=序号})
		end
	end
end

function 地图处理类:更新坐骑(id,坐骑)
	local 地图编号=玩家数据[id].角色.地图数据.编号
	for n, v in pairs(self.地图玩家[地图编号]) do
		if n~=id and 玩家数据[n]~=nil and self:取同一地图(地图编号,id,n,1)  then
			发送数据(玩家数据[n].连接id,1019,{id=id,坐骑=坐骑})
		end
	end
end





function 地图处理类:系统更新称谓(id,称谓)
    local 地图编号=玩家数据[id].角色.地图数据.编号
    玩家数据[id].角色.当前称谓=称谓
    发送数据(玩家数据[id].连接id,1029,{当前称谓=玩家数据[id].角色.当前称谓})
    -- 广播给其他玩家头顶变化
    for n, v in pairs(self.地图玩家[地图编号]) do
        if n~=id and 玩家数据[n]~=nil and self:取同一地图(地图编号,id,n,1) then
            发送数据(玩家数据[n].连接id,1020,{id=id,当前称谓=玩家数据[id].角色.当前称谓})
        end
    end
    -- 注意：这里不再重复调用刷新信息，因为添加称谓那边已经做了
end






function 地图处理类:更新称谓(id,称谓ID)
	local 地图编号=玩家数据[id].角色.地图数据.编号
	if 玩家数据[id].角色.称谓~=nil and 玩家数据[id].角色.称谓[math.ceil(称谓ID)]~=nil then
		玩家数据[id].角色.当前称谓=玩家数据[id].角色.称谓[math.ceil(称谓ID)]
	else
		玩家数据[id].角色.当前称谓=""
	end
	for n, v in pairs(self.地图玩家[地图编号]) do
		if n~=id and 玩家数据[n]~=nil and self:取同一地图(地图编号,id,n,1)  then
			发送数据(玩家数据[n].连接id,1020,{id=id,当前称谓=玩家数据[id].角色.当前称谓})
		end
	end
	-- 刷新属性以更新称谓加成
	玩家数据[id].角色:刷新信息()
	发送数据(玩家数据[id].连接id, 31, 玩家数据[id].角色:取总数据())  -- 发送完整属性数据
end



function 地图处理类:设置战斗开关(id,逻辑)
	local 地图编号=玩家数据[id].角色.地图数据.编号
	for n, v in pairs(self.地图玩家[地图编号]) do
		if n~=id and 玩家数据[n]~=nil and self:取同一地图(地图编号,id,n,1)  then
			发送数据(玩家数据[n].连接id,4014,{id=id,逻辑=逻辑})
		end
	end
end

function 地图处理类:更改队伍图标(id,逻辑)
	local 地图编号=玩家数据[id].角色.地图数据.编号
	for n, v in pairs(self.地图玩家[地图编号]) do
		if n~=id and 玩家数据[n]~=nil and self:取同一地图(地图编号,id,n,1)   then
			发送数据(玩家数据[n].连接id,4007,{id=id,逻辑=逻辑})
		end
	end
end

function 地图处理类:更改队伍样式(id,逻辑)
	local 地图编号=玩家数据[id].角色.地图数据.编号
	发送数据(玩家数据[id].连接id,4019,{逻辑=逻辑})
	for n, v in pairs(self.地图玩家[地图编号]) do
		if n~=id and 玩家数据[n]~=nil and self:取同一地图(地图编号,id,n,1)   then
			发送数据(玩家数据[n].连接id,4016,{id=id,逻辑=逻辑})
		end
	end
end

function 地图处理类:更改帮战旗帜(id,逻辑)
	local 地图编号=玩家数据[id].角色.地图数据.编号
	发送数据(玩家数据[id].连接id,6573,{逻辑=逻辑})
	for n, v in pairs(self.地图玩家[地图编号]) do
		if n~=id and 玩家数据[n]~=nil and self:取同一地图(地图编号,id,n,1)   then
			发送数据(玩家数据[n].连接id,6574,{id=id,逻辑=逻辑})
		end
	end
end

function 地图处理类:玩家是否飞行(id,逻辑)
    local 地图编号=玩家数据[id].角色.地图数据.编号
    发送数据(玩家数据[id].连接id,4020,{逻辑=逻辑})
	for n, v in pairs(self.地图玩家[地图编号]) do
		if n~=id and 玩家数据[n]~=nil and self:取同一地图(地图编号,id,n,1) then
			发送数据(玩家数据[n].连接id,4009,{id=id,逻辑=逻辑})
		end
	end
end

-- function 地图处理类:刷新玩家队伍(id,逻辑)
--     local 地图编号=玩家数据[id].角色.地图数据.编号
-- 	for n, v in pairs(self.地图玩家[地图编号]) do
-- 		if self:取同一地图(地图编号,id,n,1)  then
-- 			发送数据(玩家数据[n].连接id,4017,{id=id,逻辑=逻辑})
-- 		end
-- 	end
-- end

function 地图处理类:加入动画(id,地图编号,x,y,类型)
	--local 地图编号=玩家数据[id].角色.地图数据.编号
	local 角色xy={x=x,y=y}
	local 对方xy={x=0,y=0}
	for n, v in pairs(self.地图玩家[地图编号]) do
		if n~=id and self:取同一地图(地图编号,id,n,1)  then
			对方xy.x,对方xy.y=玩家数据[n].角色.地图数据.x,玩家数据[n].角色.地图数据.y
			if 取两点距离(角色xy,对方xy)<=800 then
				发送数据(玩家数据[n].连接id,1010,{id=id,类型=类型,坐标=角色xy角色xy})
			end
		end
	end
end
function 地图处理类:删除单位(地图,编号)
	if self.地图单位[地图]==nil then
		if 地图==nil then
			地图="异常地图"
		end
		错误日志[#错误日志]={时间=os.time(),记录="地图异常数据:"..地图}
		return
	end
	-- if not 任务处理类:删除任务单位检测(地图,编号,self.地图单位[地图][编号].id) then return end
	self.地图单位[地图][编号]=nil
	if 编号==nil then
		print("删除单位编号为空")
		return
	end
	for n, v in pairs(self.地图玩家[地图]) do
		if 玩家数据[v] and 玩家数据[v].连接id then
		    发送数据(玩家数据[v].连接id,1016,{编号=编号})
		end
	end
end

function 地图处理类:npc炫彩(地图,编号,炫彩,炫彩组)
	if self.地图单位[地图][编号] then
		self.地图单位[地图][编号].炫彩=取染色id(炫彩)
		self.地图单位[地图][编号].炫彩组=取炫彩染色(炫彩组)
		for n, v in pairs(self.地图玩家[地图]) do
			if 玩家数据[v] and self:取同一地图(地图,v,self.地图单位[地图][编号],2) then
				发送数据(玩家数据[v].连接id,1034,{编号=编号,炫彩=self.地图单位[地图][编号].炫彩,炫彩组=self.地图单位[地图][编号].炫彩组})
			end
		end
	end
end

function 地图处理类:npc行走(地图,编号,x,y,喊话)
	if 编号==nil then
	    return
	end
	if self.地图单位[地图]==nil then
		if 地图==nil then
			地图="异常地图"
		end
		错误日志[#错误日志]={时间=os.time(),记录="地图异常数据:"..地图}
		return
	end
	self.地图单位[地图][编号].行走间隔 = os.time() + 20
	self.地图单位[地图][编号].x = x
	self.地图单位[地图][编号].y = y
	for n, v in pairs(self.地图玩家[地图]) do
		if 玩家数据[v] and self:取同一地图(地图,v,self.地图单位[地图][编号],2) then
			发送数据(玩家数据[v].连接id,1033,{编号=编号,坐标x=x,坐标y=y,喊话=喊话})
		end
	end
end


function 地图处理类:更换单位模型名称(地图,编号,id,模型,名称)
	if 编号==nil then
	    return
	end
	if self.地图单位[地图]==nil then
		if 地图==nil then
			地图="异常地图"
		end
		错误日志[#错误日志]={时间=os.time(),记录="地图异常数据:"..地图}
		return
	end
	任务数据[id].名称=名称
	任务数据[id].模型=模型
	self.地图单位[地图][编号].名称=名称
	self.地图单位[地图][编号].模型=模型
	for n, v in pairs(self.地图玩家[地图]) do
		if self:取同一地图(地图,v,self.地图单位[地图][编号],2) then
			发送数据(玩家数据[v].连接id,1035,self.地图单位[地图][编号])
		end
	end
end

function 地图处理类:取地图怪物数量(地图,mc)
	local num=0
	for k,v in pairs(self.地图单位[地图]) do
		if v.名称 and v.名称==mc then
		    num=num+1
		end
	end
	return num
end

function 地图处理类:添加单位(id,刷新)
	local 地图=任务数据[id].地图编号
	local 编号=0
	for n, v in pairs(self.地图单位[地图]) do
		if self.地图单位[地图][n]==nil  then 编号=n end
	end
	for n=1000,self.单位编号[地图] do
		if 编号==0 and self.地图单位[地图][n]==nil then
			编号=n
		end
	end
	if 编号==0 then
		self.单位编号[地图]=self.单位编号[地图]+1
		编号=self.单位编号[地图]
	end
	local 染色组=nil
	local 染色方案=nil
	local 炫彩=nil
	local 炫彩组=nil
	if 任务数据[id].变异 and 染色信息[任务数据[id].模型]~=nil then
		染色方案 = 染色信息[任务数据[id].模型].id
		染色组 = 染色信息[任务数据[id].模型].方案
	else
		任务数据[id].变异=false
	end
	if 任务数据[id].炫彩 and 任务数据[id].炫彩组 ~= nil then
		炫彩=任务数据[id].炫彩
		炫彩组=任务数据[id].炫彩组
	elseif 任务数据[id].染色方案 and 任务数据[id].染色组 then
    	染色组=任务数据[id].染色组
		染色方案=任务数据[id].染色方案
	end

	-- if 任务数据[id].类型 >= 507 and 任务数据[id].类型 <= 522 then
	-- 	染色组=任务数据[id].染色组
	-- 	染色方案=任务数据[id].染色方案
	-- elseif 任务数据[id].类型 ==6674 or 任务数据[id].类型 ==6676 then
	-- 	染色组=任务数据[id].染色组
	-- 	染色方案=任务数据[id].染色方案
	-- end
	local 领取人的ID = 0
	if 任务数据[id]~=nil and 任务数据[id].领取人id~=nil and #任务数据[id].领取人id>0 then
		领取人的ID=任务数据[id].领取人id
	end
	local x显示饰品 = false
	if 任务数据[id].显示饰品~=nil and 任务数据[id].显示饰品 then
		x显示饰品 = true
	end
	if not 任务数据[id].方向 then
		任务数据[id].方向 = 取随机数(0,3)
	end
	self.地图单位[地图][编号]={
		名称=任务数据[id].名称,
		模型=任务数据[id].模型,
		副本id=任务数据[id].副本id,
		编号=编号,
		x=任务数据[id].x,
		y=任务数据[id].y,
		地图=地图,
		变异=任务数据[id].变异,
		称谓=任务数据[id].称谓,
		染色组=染色组,
		染色方案=染色方案,
		炫彩=炫彩,
		炫彩组=炫彩组,
		事件=任务数据[id].事件,
		武器=任务数据[id].武器,
		方向=任务数据[id].方向,
		小地图名称颜色=任务数据[id].小地图名称颜色,
		行走开关=任务数据[id].行走开关,
		显示饰品=x显示饰品,
		id=id,
		领取人id=领取人的ID,
		置顶层=任务数据[id].置顶层,
		任务显示=任务数据[id].任务显示,
		战斗显示=任务数据[id].战斗显示,
		队伍组=任务数据[id].队伍组 or {},
		武器子类=任务数据[id].武器子类, --新增
		锦衣=任务数据[id].锦衣  --新增
	}
	if self.地图单位[地图][编号].事件==nil then
		self.地图单位[地图][编号].事件="单位"
	end
	任务数据[id].单位编号=编号
	for n, v in pairs(self.地图玩家[地图]) do
		if 玩家数据[v] and self:取同一地图(地图,v,self.地图单位[地图][编号],2) then
			发送数据(玩家数据[v].连接id,1015,self.地图单位[地图][编号])
		end
	end
end

function 地图处理类:更改怪物模型(任务id)
	local 编号 = 0
	local 地图 = 任务数据[任务id].地图编号
	for n, v in pairs(self.地图单位[地图]) do
		if 任务数据[任务id].单位编号 == n then
			self.地图单位[地图][n].名称 = 任务数据[任务id].名称
			self.地图单位[地图][n].模型 = 任务数据[任务id].模型
			for i, v in pairs(self.地图玩家[地图]) do
				if self:取同一地图(地图,v,self.地图单位[地图][编号],2) then
					发送数据(玩家数据[v].连接id,1014,self.地图单位[地图][n])
				end
			end
			return
		end
	end
end

-- function 地图处理类:批量添加单位(id)--修改
-- 	local 地图=任务数据[id].地图编号
-- 	local 编号=0
-- 	for n, v in pairs(self.地图单位[地图]) do
-- 		if  self.地图单位[地图][n]==nil  then 编号=n end
-- 	end
-- 	for n=1000,self.单位编号[地图] do
-- 		if 编号==0 and self.地图单位[地图][n]==nil then
-- 			编号=n
-- 		end
-- 	end
-- 	if 编号==0 then
-- 		self.单位编号[地图]=self.单位编号[地图]+1
-- 		编号=self.单位编号[地图]
-- 	end
-- 	local 染色组=nil
-- 	local 染色方案=nil
-- 	if 任务数据[id].炫彩 and 任务数据[id].炫彩组 ~= nil then
-- 		炫彩=任务数据[id].炫彩
-- 		炫彩组=任务数据[id].炫彩组
-- 	end
-- 	if 任务数据[id].变异 and 染色信息[任务数据[id].模型]~=nil then
-- 		染色方案 = 染色信息[任务数据[id].模型].id
-- 		染色组 = 染色信息[任务数据[id].模型].方案
-- 	else
-- 		任务数据[id].变异=false
-- 	end
-- 	local 领取人的ID = 0
-- 	if 任务数据[id]~=nil and 任务数据[id].领取人id~=nil and #任务数据[id].领取人id>0 then
-- 		领取人的ID=任务数据[id].领取人id
-- 	end
-- 	local x显示饰品 = false
-- 	if 任务数据[id].显示饰品~=nil and 任务数据[id].显示饰品 then
-- 		x显示饰品 = true
-- 	end
-- 	self.地图单位[地图][编号]={
-- 		名称=任务数据[id].名称,
-- 		模型=任务数据[id].模型,
-- 		编号=编号,
-- 		x=任务数据[id].x,
-- 		y=任务数据[id].y,
-- 		地图=地图,
-- 		变异=任务数据[id].变异,
-- 		称谓=任务数据[id].称谓,
-- 		染色组=染色组,
-- 		染色方案=染色方案,
-- 		炫彩=炫彩,
-- 		炫彩组=炫彩组,
-- 		事件=任务数据[id].事件,
-- 		武器=任务数据[id].武器,
-- 		方向=任务数据[id].方向,
-- 		显示饰品=x显示饰品,
-- 		id=id,
-- 		领取人id=领取人的ID,
-- 	}
-- 	if self.地图单位[地图][编号].事件==nil then
-- 		self.地图单位[地图][编号].事件="单位"
-- 	end
-- 	任务数据[id].单位编号=编号
-- 	return self.地图单位[地图][编号]
-- end

function 地图处理类:批量添加单位(id)
	local 地图=任务数据[id].地图编号
	local 编号=0
	for n, v in pairs(self.地图单位[地图]) do
		if  self.地图单位[地图][n]==nil  then 编号=n end
	end
	for n=1000,self.单位编号[地图] do
		if 编号==0 and self.地图单位[地图][n]==nil then
			编号=n
		end
	end
	if 编号==0 then
		self.单位编号[地图]=self.单位编号[地图]+1
		编号=self.单位编号[地图]
	end
	local 染色组=nil
	local 染色方案=nil
	local 炫彩=nil
	local 炫彩组=nil
	if 任务数据[id].变异 and 染色信息[任务数据[id].模型]~=nil then
		染色方案 = 染色信息[任务数据[id].模型].id
		染色组 = 染色信息[任务数据[id].模型].方案
	else
		任务数据[id].变异=false
	end
	if 任务数据[id].炫彩 and 任务数据[id].炫彩组 ~= nil then
		炫彩=任务数据[id].炫彩
		炫彩组=任务数据[id].炫彩组
	end
	if 任务数据[id].类型 >= 507 and 任务数据[id].类型 <= 522 then
		染色组=任务数据[id].染色组
		染色方案=任务数据[id].染色方案
	end
	local 领取人的ID = 0
	if 任务数据[id]~=nil and 任务数据[id].领取人id~=nil and #任务数据[id].领取人id>0 then
		领取人的ID=任务数据[id].领取人id
	end
	local x显示饰品 = false
	if 任务数据[id].显示饰品~=nil and 任务数据[id].显示饰品 then
		x显示饰品 = true
	end
	if not 任务数据[id].方向 then
		任务数据[id].方向 = 取随机数(0,3)
	end
	self.地图单位[地图][编号]={
		名称=任务数据[id].名称,
		模型=任务数据[id].模型,
		副本id=任务数据[id].副本id,
		编号=编号,
		x=任务数据[id].x,
		y=任务数据[id].y,
		地图=地图,
		变异=任务数据[id].变异,
		称谓=任务数据[id].称谓,
		染色组=染色组,
		染色方案=染色方案,
		炫彩=炫彩,
		炫彩组=炫彩组,
		事件=任务数据[id].事件,
		武器=任务数据[id].武器,
		方向=任务数据[id].方向,
		行走开关=任务数据[id].行走开关,
		显示饰品=x显示饰品,
		id=id,
		领取人id=领取人的ID,
		置顶层=任务数据[id].置顶层,
		任务显示=任务数据[id].任务显示,
		战斗显示=任务数据[id].战斗显示,
		队伍组=任务数据[id].队伍组 or {},
		武器子类=任务数据[id].武器子类, --新增
		锦衣=任务数据[id].锦衣  --新增
	}
	if self.地图单位[地图][编号].事件==nil then
		self.地图单位[地图][编号].事件="单位"
	end
	任务数据[id].单位编号=编号
	return self.地图单位[地图][编号]
end

function 地图处理类:设置玩家摊位(id,名称)
	local 地图编号=玩家数据[id].角色.地图数据.编号
	for n, v in pairs(self.地图玩家[地图编号]) do
		if n~=id and self:取同一地图(地图编号,id,n,1)  then
			发送数据(玩家数据[n].连接id,3519,{id=id,名称=名称})
		end
	end
end

function 地图处理类:设置收购摊位(id,名称)
	local 地图编号=玩家数据[id].角色.地图数据.编号
	for n, v in pairs(self.地图玩家[地图编号]) do
		if n~=id and self:取同一地图(地图编号,id,n,1)  then
			发送数据(玩家数据[n].连接id,3537.1,{id=id,名称=名称})
		end
	end
end

function 地图处理类:设置收购摊位(id,名称)
	local 地图编号=玩家数据[id].角色.地图数据.编号
	for n, v in pairs(self.地图玩家[地图编号]) do
		if n~=id and self:取同一地图(地图编号,id,n,1)  then
			发送数据(玩家数据[n].连接id,3537.1,{id=id,名称=名称})
		end
	end
end

function 地图处理类:取消收购摊位(id)
	local 地图编号=玩家数据[id].角色.地图数据.编号
	for n, v in pairs(self.地图玩家[地图编号]) do
		if n~=id and self:取同一地图(地图编号,id,n,1) then
			发送数据(玩家数据[n].连接id,3537.1,{id=id})
		end
	end
end

function 地图处理类:当前消息广播(数据,名称,内容,id,tx)
	内容=添加ID特效(id,内容)

	for n, v in pairs(self.地图玩家[数据.编号]) do
		if self:取同一地图(数据.编号,id,n,1) then
			if 取两点距离(数据,玩家数据[n].角色.地图数据)<=1500 then
				发送数据(玩家数据[n].连接id,38,{内容="qqq|"..玩家数据[id].角色.名称.."*"..玩家数据[id].角色.造型.."*玩家信息*"..id.."/["..名称.."]#"..内容,频道="dq"})
			end
			if n~=id then
				if 取两点距离(数据,玩家数据[n].角色.地图数据)<=1000 then
					发送数据(玩家数据[n].连接id,1018,{id=id,文本=内容,特效=tx})
				end
			end
		end
	end
end

function 地图处理类:清除地图玩家(编号,目标,x,y)
	for n, v in pairs(self.地图玩家[编号]) do
		if 玩家数据[n] and (玩家数据[n].zhandou==nil or 玩家数据[n].zhandou==0) then
			self:跳转地图(n,目标,x,y)
		end
	end
end

function 地图处理类:当前消息广播1(编号,内容)
	for n, v in pairs(self.地图玩家[编号]) do
		发送数据(玩家数据[n].连接id,38,{内容=内容,频道="dq"})
	end
end

function 地图处理类:取地图人数(地图编号)
	local 数量=0
	for n, v in pairs(self.地图玩家[地图编号]) do
		数量=数量+1
	end
	return 数量
end

function 地图处理类:取同一地图(地图,id,id1,类型)
	if 地图>=6000 and 地图<=7500 then--地图<=6050 then
		if 类型==1 then --玩家
			-------------------------C改
			if id and (not 玩家数据[id] or not 玩家数据[id].角色 or not 玩家数据[id].连接id ) then
				return false
			elseif  id1 and (not 玩家数据[id1] or not 玩家数据[id1].角色 or not 玩家数据[id1].连接id ) then
				return false
			end
			-------------------------C改

			if (地图==6001 or 地图==6002) and 玩家数据[id].角色:取任务(120)== 玩家数据[id1].角色:取任务(120) then --乌鸡
				return true
			elseif 地图 ==10030 and 玩家数据[id].角色:取任务(2500)== 玩家数据[id1].角色:取任务(2500) then --人族车迟国
				return true
			elseif 地图 ==10031 and 玩家数据[id].角色:取任务(2507)== 玩家数据[id1].角色:取任务(2507) then --人族九曲神林
				return true
			elseif 地图 ==10032 and 玩家数据[id].角色:取任务(2514)== 玩家数据[id1].角色:取任务(2514) then --人族暗偃禁地
				return true
			elseif 地图 ==10033 and 玩家数据[id].角色:取任务(2521)== 玩家数据[id1].角色:取任务(2521) then --魔族阴府勾魂
				return true
			elseif 地图 ==10034 and 玩家数据[id].角色:取任务(2528)== 玩家数据[id1].角色:取任务(2528) then --魔族九黎魔影
				return true
			elseif 地图 ==10035 and 玩家数据[id].角色:取任务(2535)== 玩家数据[id1].角色:取任务(2535) then --魔族陷空妖洞
				return true
			elseif 地图 ==10036 and 玩家数据[id].角色:取任务(2542)== 玩家数据[id1].角色:取任务(2542) then --仙族金甲天门
				return true
			elseif 地图 ==10037 and 玩家数据[id].角色:取任务(2549)== 玩家数据[id1].角色:取任务(2549) then --仙族万雷神殿
				return true
			elseif 地图 ==10038 and 玩家数据[id].角色:取任务(2556)== 玩家数据[id1].角色:取任务(2556) then --人族女国迷阵
				return true
			elseif 地图 ==10039 and 玩家数据[id].角色:取任务(2563)== 玩家数据[id1].角色:取任务(2563) then --魔族狮驼洞穴
				return true
			elseif 地图 > 10039 and 地图<=10041 and 玩家数据[id].角色:取任务(2570)== 玩家数据[id1].角色:取任务(2570) then --魔族火焰山之子
				return true
			elseif 地图 ==10042 and 玩家数据[id].角色:取任务(2577)== 玩家数据[id1].角色:取任务(2577) then --仙族龙王秘宝
				return true
			elseif 地图 > 10042 and 地图<=10045 and 玩家数据[id].角色:取任务(2584)== 玩家数据[id1].角色:取任务(2584) then --仙族大闹天宫
				return true
			elseif 地图 ==10046 and 玩家数据[id].角色:取任务(2591)== 玩家数据[id1].角色:取任务(2591) then --人族青丘秘辛
				return true
			elseif 地图 ==10047 and 玩家数据[id].角色:取任务(2598)== 玩家数据[id1].角色:取任务(2598) then --仙族沧海狂龙
				return true


			elseif (地图>=8100 and 地图<=8102) and 玩家数据[id].角色:取任务(400)== 玩家数据[id1].角色:取任务(400) then --初出茅庐
				return true
			elseif 地图 ==8555 and 玩家数据[id].角色:取任务(410)== 玩家数据[id1].角色:取任务(410) then --青丘
				return true
			elseif 地图 ==8556 and 玩家数据[id].角色:取任务(420)== 玩家数据[id1].角色:取任务(420) then ----五行斗法
				return true

			elseif (地图>=7001 and 地图<=7005) and 玩家数据[id].角色:取任务(670)== 玩家数据[id1].角色:取任务(670) then --五更寒
				return true
			elseif (地图==6003 or 地图==6004) and 玩家数据[id].角色:取任务(600)== 玩家数据[id1].角色:取任务(600) then
				return true
			elseif (地图==6005 or 地图==6006 or 地图==6007 ) and 玩家数据[id].角色:取任务(610)== 玩家数据[id1].角色:取任务(610) then
				return true
			elseif (地图==6008 or 地图==6009 or 地图==6010 or 地图==6011) and 玩家数据[id].角色:取任务(640)== 玩家数据[id1].角色:取任务(640) then
				return true
			elseif (地图==7026 or 地图==7027)   and 玩家数据[id].角色:取任务(740)== 玩家数据[id1].角色:取任务(740) then
				return true
			elseif (地图==7035 or 地图==7036)   and 玩家数据[id].角色:取任务(900)== 玩家数据[id1].角色:取任务(900) then
				return true




			--归墟
			elseif (地图 >=8200 and 地图<=8202)   and 玩家数据[id].角色:取任务(530)== 玩家数据[id1].角色:取任务(530) then --共生
				return true
			elseif (地图 >=8203 and 地图<=8206)   and 玩家数据[id].角色:取任务(540)== 玩家数据[id1].角色:取任务(540) then --激战
				return true
			elseif (地图 >=8207 and 地图<=8209)   and 玩家数据[id].角色:取任务(550)== 玩家数据[id1].角色:取任务(550) then --悟空
				return true
			elseif (地图 >=8210 and 地图<=8213)   and 玩家数据[id].角色:取任务(560)== 玩家数据[id1].角色:取任务(560) then --应变
				return true


			--神器
			elseif (地图 >= 9500 and 地图<=9503) and 玩家数据[id].角色:取任务(1550)== 玩家数据[id1].角色:取任务(1550) then --神器
                                                   return true
                                    elseif (地图 >= 9504 and 地图<=9509) and 玩家数据[id].角色:取任务(1560)== 玩家数据[id1].角色:取任务(1560) then --神器
                                                   return true
                                    elseif (地图 >= 9510 and 地图<=9516) and 玩家数据[id].角色:取任务(1570)== 玩家数据[id1].角色:取任务(1570) then --神器
                                                   return true
                                    elseif (地图 >= 9517 and 地图<=9521) and 玩家数据[id].角色:取任务(1580)== 玩家数据[id1].角色:取任务(1580) then --神器
                                                   return true
                                    elseif (地图 >= 9522 and 地图<=9527) and 玩家数据[id].角色:取任务(1590)== 玩家数据[id1].角色:取任务(1590) then --神器
                                                   return true
                                    elseif (地图 >= 9528 and 地图<=9533) and 玩家数据[id].角色:取任务(1600)== 玩家数据[id1].角色:取任务(1600) then --神器
                                                   return true
                                    elseif (地图 >= 9534 and 地图<=9538) and 玩家数据[id].角色:取任务(1610)== 玩家数据[id1].角色:取任务(1610) then --神器
                                                   return true
                                    elseif (地图 >= 9539 and 地图<=9542) and 玩家数据[id].角色:取任务(1620)== 玩家数据[id1].角色:取任务(1620) then --神器
                                                   return true
                                    elseif (地图 >= 9543 and 地图<=9547) and 玩家数据[id].角色:取任务(1630)== 玩家数据[id1].角色:取任务(1630) then --神器
                                                   return true
                                    elseif (地图 >= 9548 and 地图<=9550) and 玩家数据[id].角色:取任务(1640)== 玩家数据[id1].角色:取任务(1640) then --神器
                                                   return true
                                    elseif (地图 >= 9551 and 地图<=9552) and 玩家数据[id].角色:取任务(1650)== 玩家数据[id1].角色:取任务(1650) then --神器
                                                   return true
                                    elseif (地图 >= 9553 and 地图<=9556) and 玩家数据[id].角色:取任务(1660)== 玩家数据[id1].角色:取任务(1660) then --神器
                                                   return true
                                    elseif (地图 >= 9557 and 地图<=9558) and 玩家数据[id].角色:取任务(1670)== 玩家数据[id1].角色:取任务(1670) then --神器
                                                   return true
                                    elseif (地图 >= 9559 and 地图<=9560) and 玩家数据[id].角色:取任务(1680)== 玩家数据[id1].角色:取任务(1680) then --神器
                                                   return true
                                    elseif (地图 >= 9561 and 地图<=9563) and 玩家数据[id].角色:取任务(1690)== 玩家数据[id1].角色:取任务(1690) then --神器
                                                   return true




			elseif (地图>= 8503 and 地图<=8506)  and 玩家数据[id].角色:取任务(3010)== 玩家数据[id1].角色:取任务(3010) then --副本_天命石猴
				return true
			elseif (地图>= 8507 and 地图<=8510)  and 玩家数据[id].角色:取任务(3020)== 玩家数据[id1].角色:取任务(3020) then --副本_天命通天
				return true
			elseif (地图>= 8515 and 地图<=8517)  and 玩家数据[id].角色:取任务(3030)== 玩家数据[id1].角色:取任务(3030) then --副本_天命金兜洞
				return true
			elseif (地图>= 8511 and 地图<=8514)  and 玩家数据[id].角色:取任务(3043)== 玩家数据[id1].角色:取任务(3043) then --副本_天命大闹
				return true
			elseif (地图>= 8518 and 地图<=8520)  and 玩家数据[id].角色:取任务(3050)== 玩家数据[id1].角色:取任务(3050) then --副本_天命水陆
				return true
			elseif (地图>= 8521 and 地图<=8522)  and 玩家数据[id].角色:取任务(3060)== 玩家数据[id1].角色:取任务(3060) then --副本_天命红孩儿
				return true
			elseif (地图>= 8501 and 地图<=8502)  and 玩家数据[id].角色:取任务(3070)== 玩家数据[id1].角色:取任务(3070) then --副本_天命乌鸡
				return true
			elseif (地图>= 8523 and 地图<=8533)  and 玩家数据[id].角色:取任务(3080)== 玩家数据[id1].角色:取任务(3080) then --副本_天命秘境
				return true


			-- elseif 地图==2000  and 玩家数据[id].角色:取任务(630)== 玩家数据[id1].角色:取任务(630) then --轮回境
			-- 	return true
			elseif (地图 > 6021 and 地图<=6032) and 玩家数据[id].角色:取任务(90)== 玩家数据[id1].角色:取任务(90) then --秘境降妖
        				return true
			elseif (地图 >=6033 and 地图<=6037) and 玩家数据[id].角色:取任务(70)== 玩家数据[id1].角色:取任务(70) then --大闹天宫
        				return true
			elseif (地图 > 6017 and 地图<=6021) and 玩家数据[id].角色:取任务(80)== 玩家数据[id1].角色:取任务(80) then --黑风山
        				return true
        			elseif (地图 >= 6043 and 地图 <= 6046) and 玩家数据[id].角色:取任务(940)== 玩家数据[id1].角色:取任务(940) then --齐天大圣
				return true
			elseif (地图>=6054 and 地图<=6057) and 玩家数据[id].角色:取任务(960)== 玩家数据[id1].角色:取任务(960) then --天火之殇上
				return true
			elseif (地图>=6047 and 地图<=6053) and 玩家数据[id].角色:取任务(980)== 玩家数据[id1].角色:取任务(980) then --无底洞
				return true
			elseif (地图==7006 or 地图==7007 or 地图==7008 ) and 玩家数据[id].角色:取任务(690)== 玩家数据[id1].角色:取任务(690) then
				return true
			elseif (地图==7017 or 地图==7018 or 地图==7019 or 地图==7020) and 玩家数据[id].角色:取任务(710)== 玩家数据[id1].角色:取任务(710) then --通天河
				return true
			else
				return false
			end
		else --怪物
			if (地图==6001 or 地图==6002) then
				-- local 副本id=任务数据[玩家数据[id].角色:取任务(120)].副本id
				if 任务数据[玩家数据[id].角色:取任务(120)] ~= nil and 任务数据[玩家数据[id].角色:取任务(120)].副本id ==任务数据[id1.id].副本id then
					return true
				else
					return false
				end
			elseif (地图>=7001 and 地图<=7005) then
				if 任务数据[玩家数据[id].角色:取任务(670)] ~= nil and  任务数据[玩家数据[id].角色:取任务(670)].副本id ==任务数据[id1.id].副本id then
					return true
				else
					return false
				end
			elseif (地图==7006 or 地图==7007 or 地图==7008 ) then
				if 任务数据[玩家数据[id].角色:取任务(690)] ~= nil and  任务数据[玩家数据[id].角色:取任务(690)].副本id ==任务数据[id1.id].副本id then
					return true
				else
					return false
				end
			elseif (地图==7017 or 地图==7018 or 地图==7019 or 地图==7020) then
				if 任务数据[玩家数据[id].角色:取任务(710)] ~= nil and 任务数据[玩家数据[id].角色:取任务(710)].副本id== 任务数据[id1.id].副本id then --通天河
					return true
				else
				    return false
				end
			elseif (地图==7021 or 地图==7022 or 地图==7023 or 地图==7024 or 地图==7025) then
				if 任务数据[玩家数据[id].角色:取任务(800)] ~= nil and 任务数据[玩家数据[id].角色:取任务(800)].副本id== 任务数据[id1.id].副本id then --通天河
					return true
				else
				    return false
				end

			elseif (地图==6003 or 地图==6004) then
				if 任务数据[玩家数据[id].角色:取任务(600)] ~= nil and  任务数据[玩家数据[id].角色:取任务(600)].副本id ==任务数据[id1.id].副本id then
					return true
				else
					return false
				end
			elseif (地图==6005 or 地图==6006 or 地图==6007 )  then
				if 任务数据[玩家数据[id].角色:取任务(610)] ~= nil and  任务数据[玩家数据[id].角色:取任务(610)].副本id ==任务数据[id1.id].副本id then
					return true
				else
					return false
				end
			elseif (地图==6008 or 地图==6009 or 地图==6010 or 地图==6011 )  then
				if 任务数据[玩家数据[id].角色:取任务(640)] ~= nil and  任务数据[玩家数据[id].角色:取任务(640)].副本id ==任务数据[id1.id].副本id then
					return true
				else
					return false
				end
			elseif 地图 >= 6033 and 地图<=6037 then
				if 任务数据[玩家数据[id].角色:取任务(70)] ~= nil and  任务数据[玩家数据[id].角色:取任务(70)].副本id ==任务数据[id1.id].副本id then
					return true
				else
					return false
				end
			 elseif (地图>=8100 and 地图<=8102) then
				if 任务数据[玩家数据[id].角色:取任务(400)] ~= nil and  任务数据[玩家数据[id].角色:取任务(400)].副本id ==任务数据[id1.id].副本id then
					return true
				else
					return false
				end
			elseif 地图==8555  then
				if 任务数据[玩家数据[id].角色:取任务(410)] ~= nil and  任务数据[玩家数据[id].角色:取任务(410)].副本id ==任务数据[id1.id].副本id then
					return true
				else
					return false
				end
			elseif 地图==8556  then
				if 任务数据[玩家数据[id].角色:取任务(420)] ~= nil and  任务数据[玩家数据[id].角色:取任务(420)].副本id ==任务数据[id1.id].副本id then
					return true
				else
					return false
				end


			--神器
			elseif (地图>=9500 and 地图<=9503) then
				if 任务数据[玩家数据[id].角色:取任务(1550)] ~= nil and  任务数据[玩家数据[id].角色:取任务(1550)].副本id ==任务数据[id1.id].副本id then
					return true
				else
					return false
				end
			elseif (地图>=9504 and 地图<=9509) then
				if 任务数据[玩家数据[id].角色:取任务(1560)] ~= nil and  任务数据[玩家数据[id].角色:取任务(1560)].副本id ==任务数据[id1.id].副本id then
					return true
				else
					return false
				end
			elseif (地图>=9510 and 地图<=9516) then
				if 任务数据[玩家数据[id].角色:取任务(1570)] ~= nil and  任务数据[玩家数据[id].角色:取任务(1570)].副本id ==任务数据[id1.id].副本id then
					return true
				else
					return false
				end
			elseif (地图>=9517 and 地图<=9521) then
				if 任务数据[玩家数据[id].角色:取任务(1580)] ~= nil and  任务数据[玩家数据[id].角色:取任务(1580)].副本id ==任务数据[id1.id].副本id then
					return true
				else
					return false
				end
			elseif (地图>=9522 and 地图<=9527) then
				if 任务数据[玩家数据[id].角色:取任务(1590)] ~= nil and  任务数据[玩家数据[id].角色:取任务(1590)].副本id ==任务数据[id1.id].副本id then
					return true
				else
					return false
				end
			elseif (地图>=9528 and 地图<=9533) then
				if 任务数据[玩家数据[id].角色:取任务(1600)] ~= nil and  任务数据[玩家数据[id].角色:取任务(1600)].副本id ==任务数据[id1.id].副本id then
					return true
				else
					return false
				end
			elseif (地图>=9534 and 地图<=9538) then
				if 任务数据[玩家数据[id].角色:取任务(1610)] ~= nil and  任务数据[玩家数据[id].角色:取任务(1610)].副本id ==任务数据[id1.id].副本id then
					return true
				else
					return false
				end
			elseif (地图>=9539 and 地图<=9542) then
				if 任务数据[玩家数据[id].角色:取任务(1620)] ~= nil and  任务数据[玩家数据[id].角色:取任务(1620)].副本id ==任务数据[id1.id].副本id then
					return true
				else
					return false
				end
			elseif (地图>=9543 and 地图<=9547) then
				if 任务数据[玩家数据[id].角色:取任务(1630)] ~= nil and  任务数据[玩家数据[id].角色:取任务(1630)].副本id ==任务数据[id1.id].副本id then
					return true
				else
					return false
				end
			elseif (地图>=9548 and 地图<=9550) then
				if 任务数据[玩家数据[id].角色:取任务(1640)] ~= nil and  任务数据[玩家数据[id].角色:取任务(1640)].副本id ==任务数据[id1.id].副本id then
					return true
				else
					return false
				end
			elseif (地图>=9551 and 地图<=9552) then
				if 任务数据[玩家数据[id].角色:取任务(1650)] ~= nil and  任务数据[玩家数据[id].角色:取任务(1650)].副本id ==任务数据[id1.id].副本id then
					return true
				else
					return false
				end
			elseif (地图>=9553 and 地图<=9556) then
				if 任务数据[玩家数据[id].角色:取任务(1660)] ~= nil and  任务数据[玩家数据[id].角色:取任务(1660)].副本id ==任务数据[id1.id].副本id then
					return true
				else
					return false
				end
			elseif (地图>=9557 and 地图<=9558) then
				if 任务数据[玩家数据[id].角色:取任务(1670)] ~= nil and  任务数据[玩家数据[id].角色:取任务(1670)].副本id ==任务数据[id1.id].副本id then
					return true
				else
					return false
				end
			elseif (地图>=9559 and 地图<=9560) then
				if 任务数据[玩家数据[id].角色:取任务(1680)] ~= nil and  任务数据[玩家数据[id].角色:取任务(1680)].副本id ==任务数据[id1.id].副本id then
					return true
				else
					return false
				end
			elseif (地图>=9561 and 地图<=9563) then
				if 任务数据[玩家数据[id].角色:取任务(1690)] ~= nil and  任务数据[玩家数据[id].角色:取任务(1690)].副本id ==任务数据[id1.id].副本id then
					return true
				else
					return false
				end
			--神器




				---------------------------------------------------------天命
			elseif (地图>=8503 and 地图<=8506) then
				if 任务数据[玩家数据[id].角色:取任务(3010)] ~= nil and  任务数据[玩家数据[id].角色:取任务(3010)].副本id ==任务数据[id1.id].副本id then
					return true
				else
					return false
				end
			elseif (地图>=8507 and 地图<=8510) then
				if 任务数据[玩家数据[id].角色:取任务(3020)] ~= nil and  任务数据[玩家数据[id].角色:取任务(3020)].副本id ==任务数据[id1.id].副本id then
					return true
				else
					return false
				end
			elseif (地图>=8515 and 地图<=8517) then
				if 任务数据[玩家数据[id].角色:取任务(3030)] ~= nil and  任务数据[玩家数据[id].角色:取任务(3030)].副本id ==任务数据[id1.id].副本id then
					return true
				else
					return false
				end
			elseif (地图>=8511 and 地图<=8514) then
				if 任务数据[玩家数据[id].角色:取任务(3043)] ~= nil and  任务数据[玩家数据[id].角色:取任务(3043)].副本id ==任务数据[id1.id].副本id then
					return true
				else
					return false
				end
			elseif (地图>=8518 and 地图<=8520) then
				if 任务数据[玩家数据[id].角色:取任务(3050)] ~= nil and  任务数据[玩家数据[id].角色:取任务(3050)].副本id ==任务数据[id1.id].副本id then
					return true
				else
					return false
				end
			elseif (地图>=8521 and 地图<=8522) then
				if 任务数据[玩家数据[id].角色:取任务(3060)] ~= nil and  任务数据[玩家数据[id].角色:取任务(3060)].副本id ==任务数据[id1.id].副本id then
					return true
				else
					return false
				end
			elseif (地图>=8501 and 地图<=8502) then
				if 任务数据[玩家数据[id].角色:取任务(3070)] ~= nil and  任务数据[玩家数据[id].角色:取任务(3070)].副本id ==任务数据[id1.id].副本id then
					return true
				else
					return false
				end
			elseif (地图>=8523 and 地图<=8533) then
				if 任务数据[玩家数据[id].角色:取任务(3080)] ~= nil and  任务数据[玩家数据[id].角色:取任务(3080)].副本id ==任务数据[id1.id].副本id then
					return true
				else
					return false
				end
				---------------------------------------------------------天命
			elseif (地图>=8200 and 地图<=8202) then
				if 任务数据[玩家数据[id].角色:取任务(530)] ~= nil and  任务数据[玩家数据[id].角色:取任务(530)].副本id ==任务数据[id1.id].副本id then
					return true
				else
					return false
				end
			elseif (地图>=8203 and 地图<=8206) then
				if 任务数据[玩家数据[id].角色:取任务(540)] ~= nil and  任务数据[玩家数据[id].角色:取任务(540)].副本id ==任务数据[id1.id].副本id then
					return true
				else
					return false
				end
			elseif (地图>=8207 and 地图<=8209) then
				if 任务数据[玩家数据[id].角色:取任务(550)] ~= nil and  任务数据[玩家数据[id].角色:取任务(550)].副本id ==任务数据[id1.id].副本id then
					return true
				else
					return false
				end
			elseif (地图>=8210 and 地图<=8213) then
				if 任务数据[玩家数据[id].角色:取任务(560)] ~= nil and  任务数据[玩家数据[id].角色:取任务(560)].副本id ==任务数据[id1.id].副本id then
					return true
				else
					return false
				end
				---------------------------------归墟

			elseif 地图 > 6037 and 地图<=6042 then
				if 任务数据[玩家数据[id].角色:取任务(350)] ~= nil and  任务数据[玩家数据[id].角色:取任务(350)].副本id ==任务数据[id1.id].副本id then
					return true
				else
					return false
				end
			elseif 地图 > 6021 and 地图<=6032 then
				if 任务数据[玩家数据[id].角色:取任务(90)] ~= nil and  任务数据[玩家数据[id].角色:取任务(90)].副本id ==任务数据[id1.id].副本id then
					return true
				else
					return false
				end
			elseif 地图 > 6017 and 地图<=6021 then
				if 任务数据[玩家数据[id].角色:取任务(80)] ~= nil and  任务数据[玩家数据[id].角色:取任务(80)].副本id ==任务数据[id1.id].副本id then
					return true
				else
					return false
				end
			elseif 地图 > 6042 and 地图<=6046 then
				if 任务数据[玩家数据[id].角色:取任务(940)] ~= nil and  任务数据[玩家数据[id].角色:取任务(940)].副本id ==任务数据[id1.id].副本id then
					return true
				else
					return false
				end
			elseif 地图 > 6046 and 地图<=6053 then--无底洞
				if 任务数据[玩家数据[id].角色:取任务(980)] ~= nil and  任务数据[玩家数据[id].角色:取任务(980)].副本id ==任务数据[id1.id].副本id then
					return true
				else
					return false
				end
			elseif 地图 > 6053 and 地图<=6057 then--

				if 任务数据[玩家数据[id].角色:取任务(960)] ~= nil and  任务数据[玩家数据[id].角色:取任务(960)].副本id ==任务数据[id1.id].副本id then
					return true
				else
					return false
				end
			elseif (地图==7026 or 地图==7027  )  then
				if 任务数据[玩家数据[id].角色:取任务(740)] ~= nil and  任务数据[玩家数据[id].角色:取任务(740)].副本id ==任务数据[id1.id].副本id then
					return true
				else
					return false
				end
			elseif (地图==7035 or 地图==7036 )  then
				if 任务数据[玩家数据[id].角色:取任务(900)] ~= nil and  任务数据[玩家数据[id].角色:取任务(900)].副本id ==任务数据[id1.id].副本id then
					return true
				else
					return false
				end


			------------------C改（增加种族秘境时空之钥）
			elseif 地图 ==10030 and (任务数据[玩家数据[id].角色:取任务(2500)] or {}).副本id ==(任务数据[id1.id] or {}).副本id then
		        		   return true
		      	    elseif 地图 ==10031 and (任务数据[玩家数据[id].角色:取任务(2507)] or {}).副本id ==(任务数据[id1.id] or {}).副本id then
		        		   return true
		      	    elseif 地图 ==10032 and (任务数据[玩家数据[id].角色:取任务(2514)] or {}).副本id ==(任务数据[id1.id] or {}).副本id then
		        		   return true
		      	    elseif 地图 ==10033 and (任务数据[玩家数据[id].角色:取任务(2521)] or {}).副本id ==(任务数据[id1.id] or {}).副本id then
		        		   return true
		      	    elseif 地图 ==10034 and (任务数据[玩家数据[id].角色:取任务(2528)] or {}).副本id ==(任务数据[id1.id] or {}).副本id then
		        		   return true
		      	    elseif 地图 ==10035 and (任务数据[玩家数据[id].角色:取任务(2535)] or {}).副本id ==(任务数据[id1.id] or {}).副本id then
		        		   return true
		      	    elseif 地图 ==10036 and (任务数据[玩家数据[id].角色:取任务(2542)] or {}).副本id ==(任务数据[id1.id] or {}).副本id then
		        		   return true
		      	    elseif 地图 ==10037 and (任务数据[玩家数据[id].角色:取任务(2549)] or {}).副本id ==(任务数据[id1.id] or {}).副本id then
		        		   return true
		      	    elseif 地图 ==10038 and (任务数据[玩家数据[id].角色:取任务(2556)] or {}).副本id ==(任务数据[id1.id] or {}).副本id then
		        		   return true
		      	    elseif 地图 ==10039 and (任务数据[玩家数据[id].角色:取任务(2563)] or {}).副本id ==(任务数据[id1.id] or {}).副本id then
		        		   return true
		      	    elseif 地图 > 10039 and 地图<=20041 and (任务数据[玩家数据[id].角色:取任务(2570)] or {}).副本id ==(任务数据[id1.id] or {}).副本id then
		        		   return true
		      	    elseif 地图 ==10042 and (任务数据[玩家数据[id].角色:取任务(2577)] or {}).副本id ==(任务数据[id1.id] or {}).副本id then
		        		   return true
		      	    elseif 地图 > 10042 and 地图<=10045 and (任务数据[玩家数据[id].角色:取任务(2584)] or {}).副本id ==(任务数据[id1.id] or {}).副本id then
		        		   return true
		      	    elseif 地图 ==10046 and (任务数据[玩家数据[id].角色:取任务(2591)] or {}).副本id ==(任务数据[id1.id] or {}).副本id then
		        		   return true
		      	    elseif 地图 ==10047 and (任务数据[玩家数据[id].角色:取任务(2598)] or {}).副本id ==(任务数据[id1.id] or {}).副本id then
		        		   return true

        		   ------------------C改（增加种族秘境时空之钥）


			elseif 地图==2000 then
				if 任务数据[玩家数据[id].角色:取任务(630)] ~= nil and  任务数据[玩家数据[id].角色:取任务(630)].副本id ==任务数据[id1.id].副本id then
					return true
				else
					return false
				end
			else
				return false
			end
		end
	elseif (地图==1217 or 地图==1815 or 地图==1825 or 地图==1874 or 地图==1844 or 地图==1854 or 地图==1835 or 地图==1865) then
			if (地图==1217 or 地图==1815 or 地图==1825 or 地图==1874 or 地图==1844 or 地图==1854 or 地图==1835 or 地图==1865) and 玩家数据[id].角色.BPBH== 玩家数据[id1].角色.BPBH then
				return true
			else
				return false
			end
	else
		-- if 地图==1020  then
		-- 	if 玩家数据[id].角色:取任务(11111)~=0 and 玩家数据[id].角色:取任务(11111)== 玩家数据[id1].角色:取任务(11111) then
		-- 		return true
		-- 	end
		-- 	return false
		-- end
		if 类型==1 then --玩家与玩家
			if not 玩家数据[id] or not 玩家数据[id1] or not 玩家数据[id].连接id or not 玩家数据[id1].连接id then
			    return false
			end
		end
		return true
	end
end

function 地图处理类:加入玩家(id,地图编号,x,y)
	id=id+0
	玩家数据[id].遇怪时间=os.time()+取随机数(10,20)
	if not self.地图玩家[地图编号] then
	    地图编号=1001
	    -- 玩家数据[id].角色.地图数据
	    -- 玩家数据[id].角色.地图数据={编号=1001,x=203,y=111,方向=5}
	    print("加入玩家，玩家地图id错误"..地图编号)
	end
	self.地图玩家[地图编号][id]=id
	发送数据(玩家数据[id].连接id,1003,{})--取假人表(玩家数据[id].角色.地图数据.编号)
	-- 发送数据(玩家数据[id].连接id,1004,{})--取传送点(玩家数据[id].角色.地图数据.编号)
	for n, v in pairs(self.地图单位[地图编号]) do--场景活动怪物
		if self:取同一地图(地图编号,id,self.地图单位[地图编号][n],2) then
			发送数据(玩家数据[id].连接id,1015,self.地图单位[地图编号][n])
			-- table.insert(dfs, self.地图单位[地图编号][n])--修改
		end
	end
	local dfs = {}
	dfs["主角"] = {}
	for n, v in pairs(self.地图玩家[地图编号]) do--向地图内玩家发送新玩家数据
		if n~=id and  self:取同一地图(地图编号,id,n,1) then
			-- if 玩家数据[n].连接id ~= "假人" then
				发送数据(玩家数据[n].连接id,1006,玩家数据[id].角色:取地图数据()) --向地图其他玩家发送主角信息
				-- 发送数据(玩家数据[id].连接id,1006,玩家数据[n].角色:取地图数据())--修改
			-- end
			-- if 玩家数据[id].连接id ~= "假人" then
				table.insert(dfs["主角"], 玩家数据[n].角色:取地图数据())
				if #dfs["主角"] == 20 then --100  发送数量
					发送数据(玩家数据[id].连接id,1022,dfs["主角"]) --向主角发送地图内其他玩家的信息
					dfs["主角"] = {}
				end
			-- end
		end
	end
	if #dfs["主角"] >= 1 then
		发送数据(玩家数据[id].连接id,1022,dfs["主角"])
	end
	dfs = {}
end


function 地图处理类:重连加入(id,地图编号,x,y)
	id=id+0
	local dfs = {}
	self.地图玩家[地图编号][id]=id
	发送数据(玩家数据[id].连接id,1003,{})--取假人表(玩家数据[id].角色.地图数据.编号)
	-- 发送数据(玩家数据[id].连接id,1004,{})--取传送点(玩家数据[id].角色.地图数据.编号)
	for n, v in pairs(self.地图单位[地图编号]) do--场景活动怪物
		if self:取同一地图(地图编号,id,self.地图单位[地图编号][n],2) then
			发送数据(玩家数据[id].连接id,1015,self.地图单位[地图编号][n])
			-- table.insert(dfs, self.地图单位[地图编号][n])--修改
		end
	end
	-- 发送数据(玩家数据[id].连接id,1021,dfs)
	-- dfs = {}
	dfs["主角"] = {}
	for n, v in pairs(self.地图玩家[地图编号]) do--向地图内玩家发送新玩家数据
		if n~=id and  self:取同一地图(地图编号,id,n,1) then
			-- 发送数据(玩家数据[id].连接id,1006,玩家数据[n].角色:取地图数据())
			table.insert(dfs["主角"], 玩家数据[n].角色:取地图数据())--修改
			if #dfs["主角"] == 20 then --100
				发送数据(玩家数据[id].连接id,1022,dfs["主角"])
				dfs["主角"] = {}
			end
		end
	end
	if #dfs["主角"] >= 1 then
		发送数据(玩家数据[id].连接id,1022,dfs["主角"])
	end
	dfs = {}
end

function 地图处理类:更新()
	for k,v in pairs(self.地图单位) do
		for i,s in pairs(self.地图单位[k]) do
			if self.地图单位[k][i].事件 == "明雷" or (self.地图单位[k][i] and self.地图单位[k][i].行走开关 and not self.地图单位[k][i].zhandou) then--and  取随机数() < 5 then
				if self.地图单位[k][i].行走间隔 == nil then
					local xy=self.地图坐标[k]:取附近点(self.地图单位[k][i].x,self.地图单位[k][i].y)
					self:npc行走(k,i,xy.x,xy.y)
					self.地图单位[k][i].行走间隔 = os.time() + 取随机数(10,20)
				else
					if self.地图单位[k][i].行走间隔 < os.time() then
						self.地图单位[k][i].行走间隔 = nil
					end
				end
			end
		end
		if k == 5005 then
			for i,s in pairs(self.地图玩家[k]) do
				-- if not 初始活动.昆仑仙境[i] then
				-- 	初始活动.昆仑仙境[i]={次数=0,最大次数=100,时间=os.time() + 180}
				-- end
				if 初始活动.昆仑仙境[i] and 初始活动.昆仑仙境[i].次数 and 初始活动.昆仑仙境[i].次数 < 初始活动.昆仑仙境[i].最大次数 and os.time() > 初始活动.昆仑仙境[i].时间 then
					初始活动.昆仑仙境[i].次数 = 初始活动.昆仑仙境[i].次数 +1
					初始活动.昆仑仙境[i].时间 = os.time() + 180
					if 玩家数据[i] and 玩家数据[i].角色 then
						local jy = qz(1180*玩家数据[i].角色.等级)
						local jy1 = qz(80000)
						local jy2 = qz(200000)
						玩家数据[i].角色:添加经验(jy,"昆仑仙境")
						玩家数据[i].角色:添加银子(jy1,"昆仑仙境")
						玩家数据[i].角色:添加储备(jy2,"昆仑仙境")
					end
				end
			end
		end
	end
end

function 地图处理类:加载房屋()
	-- for n=1,#房屋数据 do
	-- 	self:添加房屋(n)
	-- end
end
function 地图处理类:添加房屋(编号)
	-- if 编号 ~= 0 then
	-- 	self.地图数据[房屋数据[编号].庭院ID]={npc={},单位={},传送圈={}}
	-- 	self.地图玩家[房屋数据[编号].庭院ID]={}
	-- 	self.地图坐标[房屋数据[编号].庭院ID]=地图坐标类(房屋数据[编号].庭院地图)
	-- 	self.地图单位[房屋数据[编号].庭院ID]={}
	-- 	self.单位编号[房屋数据[编号].庭院ID]=1000
	-- 	self.地图数据[房屋数据[编号].房屋ID]={npc={},单位={},传送圈={}}
	-- 	self.地图玩家[房屋数据[编号].房屋ID]={}
	-- 	self.地图坐标[房屋数据[编号].房屋ID]=地图坐标类(房屋数据[编号].房屋地图)
	-- 	self.地图单位[房屋数据[编号].房屋ID]={}
	-- 	self.单位编号[房屋数据[编号].房屋ID]=1000
	-- 	self.地图数据[房屋数据[编号].牧场ID]={npc={},单位={},传送圈={}}
	-- 	self.地图玩家[房屋数据[编号].牧场ID]={}
	-- 	self.地图坐标[房屋数据[编号].牧场ID]=地图坐标类(房屋数据[编号].牧场地图)
	-- 	self.地图单位[房屋数据[编号].牧场ID]={}
	-- 	self.单位编号[房屋数据[编号].牧场ID]=1000
	-- 	if 房屋数据[编号].阁楼ID then
	-- 		self.地图数据[房屋数据[编号].阁楼ID]={npc={},单位={},传送圈={}}
	-- 		self.地图玩家[房屋数据[编号].阁楼ID]={}
	-- 		self.地图坐标[房屋数据[编号].阁楼ID]=地图坐标类(房屋数据[编号].阁楼地图)
	-- 		self.地图单位[房屋数据[编号].阁楼ID]={}
	-- 		self.单位编号[房屋数据[编号].阁楼ID]=1000
	-- 	end
	-- end
	-- body
end

function 地图处理类:显示(x,y) end
return 地图处理类