-- @Author: baidwwy
-- @Date:   2023-09-25 12:06:04
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2026-06-06 21:30:06
--======================================================================--
-- @作者: GGE研究群: 342119466
-- @创建时间:   2018-03-03 02:34:19
-- @Last Modified time: 2023-08-13 20:50:17
-- 梦幻西游游戏资源破解 baidwwy@vip.qq.com(313738139) 老毕   和 C++PrimerPlus 717535046 这俩位大神破解所以资源
--======================================================================--
local 场景类_对话商业栏 = class()
local sj = 取随机数
local format = string.format
local insert = table.insert
local ceil = math.ceil
local floor = math.floor
local wps = 取物品数据
local typ = type
local random = 取随机数
local 五行_ = {"金","木","水","火","土"}
function 场景类_对话商业栏:初始化() end

function 场景类_对话商业栏:购买商品(连接id,id,序号,内容)
	self.商品匹配=false
	if type(玩家数据[id].商品列表)~="table" then
		异常账号(id,"未触发商品界面却触发购买请求。请求购买的商品数据为："..内容.商品)
		return 0
	end
	self.组合商品=""
	for n=1,#玩家数据[id].商品列表 do
		self.组合商品=self.组合商品..玩家数据[id].商品列表[n]
		if 玩家数据[id].商品列表[n]==内容.商品 then
			self.商品匹配=true
			break
		end
	end
	if self.商品匹配==false then
		异常账号(id,"所购买的商品不再列表之类。商品列表为"..self.组合商品.."购买商品为"..内容.商品)
		return 0
	end
	内容.数量 = 内容.数量+0
	--先获取一次格子
	local 道具格子=玩家数据[id].角色:取道具格子()
	if 道具格子==0 then
		常规提示(id,"您的道具栏物品已经满啦")
		return 0
	end
	local 商品分割=分割文本(内容.商品,"*")
	local 商品名称=商品分割[1]
	local 商品单价=商品分割[2]
	local 商品附加=商品分割[3]
	local 商品数量=内容.数量
	local 商品类型=内容.类型

	if MRSPXZ[商品名称] and 商品类型~="副本积分" then
		商品单价 = MRSPXZ[商品名称].价格
	end

	local 商品道具=物品类()
	商品道具:置对象(商品名称)
	商品数量=qz(商品数量)
	商品单价=qz(商品单价)
	if 商品数量<1 or 商品单价<1 then
		return 0
	end
	if WJGMSPSLXZ[id]==nil and self.商品类型~="副本积分" then
		WJGMSPSLXZ[id]={}
		WJGMSPSLXZ[id]["神兽涎"]=0
		WJGMSPSLXZ[id]["仙露小丸子"]=0
	end
	if MRSPXZ[商品名称] and MRSPXZ[商品名称].数量 ~= nil and tonumber(MRSPXZ[商品名称].数量)~=nil then
		if MRSPXZ[商品名称].数量 <= 0 then
		    常规提示(id,"此商品今日已售完，请明日再来。")
	    发送数据(玩家数据[id].连接id,381,{MRSPXZ=table.copy(MRSPXZ)})
	    return 0
		elseif 商品数量 > MRSPXZ[商品名称].数量 then
	    常规提示(id,"购买失败，剩余商品数量小于预购数量。")
	    发送数据(玩家数据[id].连接id,381,{MRSPXZ=table.copy(MRSPXZ)})
	    return 0
		elseif 商品名称=="神兽涎" and WJGMSPSLXZ[id]["神兽涎"]+商品数量 > 10 then
	    local xzsla = 5 - WJGMSPSLXZ[id]["神兽涎"]
	    常规提示(id,"购买失败，你只能再购买" ..xzsla .."个神兽涎")
	    发送数据(玩家数据[id].连接id,381,{MRSPXZ=table.copy(MRSPXZ)})
	    return 0
		elseif 商品名称=="仙露小丸子" and WJGMSPSLXZ[id]["仙露小丸子"]+商品数量 > 110 then
	    local xzsla = 55 - WJGMSPSLXZ[id]["仙露小丸子"]
	    常规提示(id,"购买失败，你只能再购买" ..xzsla .."个仙露小丸子")
	    发送数据(玩家数据[id].连接id,381,{MRSPXZ=table.copy(MRSPXZ)})
	    return 0
		end
	end

	if 商品类型 == "银子" then
		self:购买商品银子(商品名称,商品单价,商品数量,商品类型,商品道具,id,商品附加)
	elseif 商品类型 == "副本积分" then
		self:购买商品副本积分(商品名称,商品单价,商品数量,商品类型,商品道具,id)
	elseif 商品类型 == "采矿声望" then
    		self:购买商品采矿声望(商品名称,商品单价,商品数量,商品类型,商品道具,id)
 	elseif 商品类型 == "新春兑换" then
		self:购买商品新春兑换(商品名称,商品单价,商品数量,商品类型,商品道具,id)
	elseif 商品类型 == "师徒积分" then
		self:购买师徒积分商品(商品名称,商品单价,商品数量,商品类型,商品道具,id,商品附加)
	elseif 商品类型 == "中秋积分" then
    		self:购买商品中秋积分(商品名称,商品单价,商品数量,商品类型,商品道具,id,商品附加)
    	elseif 商品类型 == "人族时空积分" then ----------CC修改（增加时空之钥商店）
		self:购买人族时空积分商品(商品名称,商品单价,商品数量,商品类型,商品道具,id,商品附加)
	elseif 商品类型 == "魔族时空积分" then ----------CC修改（增加时空之钥商店）
		self:购买魔族时空积分商品(商品名称,商品单价,商品数量,商品类型,商品道具,id,商品附加)
	elseif 商品类型 == "仙族时空积分" then ----------CC修改（增加时空之钥商店）
		self:购买仙族时空积分商品(商品名称,商品单价,商品数量,商品类型,商品道具,id,商品附加)
	elseif 商品类型 == "阵营兑换" then
		self:阵营兑换物品(商品名称,商品单价,商品数量,商品类型,商品道具,id,内容.位置,商品附加)
	elseif 商品类型 == "除妖军功" then
		self:购买商品除妖军功(商品名称,商品单价,商品数量,商品类型,商品道具,id)
	elseif 商品类型 == "镇妖关" then
		self:购买镇妖关物品(商品名称,商品单价,商品数量,商品类型,商品道具,id,商品附加)
	elseif 商品类型 == "玉魄积分" then
		self:购买玉魄积分物品(商品名称,商品单价,商品数量,商品类型,商品道具,id,商品附加)

-- elseif 商品类型 == "秘制积分" then
--    self:购买商品秘制积分(商品名称,商品单价,商品数量,商品类型,商品道具,id,商品附加)
	-- elseif 商品类型 == "门贡法宝" then
	-- 	self:购买商品门贡法宝(商品名称,商品单价,商品数量,商品类型,商品道具,id,商品附加)
	-- elseif 商品类型 == "门贡灵宝" then
	-- 	self:购买商品门贡灵宝(商品名称,商品单价,商品数量,商品类型,商品道具,id,商品附加)
	end
end
function 场景类_对话商业栏:购买玉魄积分物品(商品名称,商品单价,商品数量,商品类型,商品道具,id,商品附加) ----------C改
	local 购买成功 = false
	local 道具格子=0
	if 玩家数据[id].角色.玉魄积分< 商品数量*商品单价 then
		商品数量 = qz(玩家数据[id].角色.玉魄积分/商品单价)
	end
	if 商品道具.可叠加 == nil or 商品道具.可叠加 == false then
		if 商品数量 > 0 then
			if 玩家数据[id].角色:取空道具格子数量() < 商品数量 then
				商品数量 = 玩家数据[id].角色:取空道具格子数量()
			end
			if 商品数量 > 0 then
				for n=1,商品数量 do
					道具格子=玩家数据[id].角色:取道具格子()
					if 道具格子==0 then
						常规提示(id,"您的道具栏物品已经满啦")
						return 0
					end
					if 商品名称=="召唤兽内丹" then
						玩家数据[id].道具:给予道具(id,"召唤兽内丹",nil,取内丹("低级"),"商店")
					elseif 商品名称=="高级召唤兽内丹" then
						玩家数据[id].道具:给予道具(id,"高级召唤兽内丹",nil,取内丹("高级"),"商店")
					elseif 商品名称=="高级魔兽要诀" then
						玩家数据[id].道具:给予道具(id,"高级魔兽要诀",nil,nil,"商店")
						elseif 商品名称=="灵饰指南书" or 商品名称=="随机灵饰指南书" then
				玩家数据[id].道具:给予道具(id,"灵饰指南书",{6,8,10},nil,"商店")
				elseif 商品名称=="元灵晶石" or 商品名称=="随机元灵晶石" then
				玩家数据[id].道具:给予道具(id,"元灵晶石",{6,8,10},nil,"商店")
					else
						玩家数据[id].道具:给予道具(id,商品名称,nil,nil,"商店")
					end
				end
				购买成功 = true
			else
					常规提示(id,"您的道具栏物品已经满啦")
			end
		else
				常规提示(id,"你的玉魄积分积分不足无法兑换")
		end
	else
		道具格子=玩家数据[id].角色:取道具格子()
		if 道具格子==0 then
			常规提示(id,"您的道具栏物品已经满啦")
			return 0
		end
		if 商品数量 > 0 then
			if 商品名称=="待补充" then

			else
				玩家数据[id].道具:给予道具(id,商品名称,商品数量,nil,"商店")
			end
			购买成功 = true
		else
			常规提示(id,"你的镇妖关积分不足无法兑换")
		end
	end
	if 购买成功 then
		local 总价格=商品数量*商品单价
		玩家数据[id].角色.玉魄积分=玩家数据[id].角色.玉魄积分-总价格
		发送数据(玩家数据[id].连接id,38,{内容="#W您花费#R"..总价格.."#W点玉魄积分积分购买了#R"..商品数量.."#W个#R"..商品名称,频道="xx"})
		道具刷新(id)

		玩家数据[id].商品列表=商店处理类.商品列表[65]
		玩家数据[id].商品列表.玉魄积分=true
		发送数据(玩家数据[id].连接id,9.1,{商品=商店处理类.商品列表[65],银子=玩家数据[id].角色.玉魄积分,类型="玉魄积分"})
	end
end
function 场景类_对话商业栏:购买镇妖关物品(商品名称,商品单价,商品数量,商品类型,商品道具,id,商品附加) ----------C改
	local 购买成功 = false
	local 道具格子=0
	if 玩家数据[id].角色.镇妖关积分< 商品数量*商品单价 then
		商品数量 = qz(玩家数据[id].角色.镇妖关积分/商品单价)
	end
	if 商品道具.可叠加 == nil or 商品道具.可叠加 == false then
		if 商品数量 > 0 then
			if 玩家数据[id].角色:取空道具格子数量() < 商品数量 then
				商品数量 = 玩家数据[id].角色:取空道具格子数量()
			end
			if 商品数量 > 0 then
				for n=1,商品数量 do
					道具格子=玩家数据[id].角色:取道具格子()
					if 道具格子==0 then
						常规提示(id,"您的道具栏物品已经满啦")
						return 0
					end
					if 商品名称=="召唤兽内丹" then
						玩家数据[id].道具:给予道具(id,"召唤兽内丹",nil,取内丹("低级"),"商店")
					elseif 商品名称=="高级召唤兽内丹" then
						玩家数据[id].道具:给予道具(id,"高级召唤兽内丹",nil,取内丹("高级"),"商店")
					elseif 商品名称=="高级魔兽要诀" then
						玩家数据[id].道具:给予道具(id,"高级魔兽要诀",nil,nil,"商店")
						elseif 商品名称=="灵饰指南书" or 商品名称=="随机灵饰指南书" then
				玩家数据[id].道具:给予道具(id,"灵饰指南书",{6,8,10},nil,"商店")
				elseif 商品名称=="元灵晶石" or 商品名称=="随机元灵晶石" then
				玩家数据[id].道具:给予道具(id,"元灵晶石",{6,8,10},nil,"商店")
					else
						玩家数据[id].道具:给予道具(id,商品名称,nil,nil,"商店")
					end
				end
				购买成功 = true
			else
					常规提示(id,"您的道具栏物品已经满啦")
			end
		else
				常规提示(id,"你的镇妖关积分不足无法兑换")
		end
	else
		道具格子=玩家数据[id].角色:取道具格子()
		if 道具格子==0 then
			常规提示(id,"您的道具栏物品已经满啦")
			return 0
		end
		if 商品数量 > 0 then
			if 商品名称=="待补充" then

			else
				玩家数据[id].道具:给予道具(id,商品名称,商品数量,nil,"商店")
			end
			购买成功 = true
		else
			常规提示(id,"你的镇妖关积分不足无法兑换")
		end
	end
	if 购买成功 then
		local 总价格=商品数量*商品单价
		玩家数据[id].角色.镇妖关积分=玩家数据[id].角色.镇妖关积分-总价格
		发送数据(玩家数据[id].连接id,38,{内容="#W您花费#R"..总价格.."#W点镇妖关积分购买了#R"..商品数量.."#W个#R"..商品名称,频道="xx"})
		道具刷新(id)

		玩家数据[id].商品列表=商店处理类.商品列表[60]
		玩家数据[id].商品列表.镇妖关积分=true
		发送数据(玩家数据[id].连接id,9.1,{商品=商店处理类.商品列表[60],银子=玩家数据[id].角色.镇妖关积分,类型="镇妖关"})
	end
end

function 场景类_对话商业栏:购买商品除妖军功(商品名称,商品单价,商品数量,商品类型,商品道具,id)
	local 购买成功 = false
	local 道具格子=0
	if 玩家数据[id].角色.除妖军功< 商品数量*商品单价 then
		商品数量 = qz(玩家数据[id].角色.除妖军功/商品单价)
	end
	if 商品道具.可叠加 == nil or 商品道具.可叠加 == false then
		if 商品数量 > 0 then
			if 玩家数据[id].角色:取空道具格子数量() < 商品数量 then
				商品数量 = 玩家数据[id].角色:取空道具格子数量()
			end
			if 商品数量 > 0 then
				for n=1,商品数量 do
					道具格子=玩家数据[id].角色:取道具格子()
					if 道具格子==0 then
						常规提示(id,"您的道具栏物品已经满啦")
						return 0
					end
					if 商品名称=="召唤兽内丹" then
						玩家数据[id].道具:给予道具(id,"召唤兽内丹",nil,取内丹("低级"),"商店")
					elseif 商品名称=="高级召唤兽内丹" then
						玩家数据[id].道具:给予道具(id,"高级召唤兽内丹",nil,取内丹("高级"),"商店")
					elseif 商品名称=="高级魔兽要诀" then
						玩家数据[id].道具:给予道具(id,"高级魔兽要诀",nil,nil,"商店")
					elseif 商品名称=="灵饰指南书" or 商品名称=="随机灵饰指南书" then
						玩家数据[id].道具:给予道具(id,"灵饰指南书",{6,8,10},nil,"商店")
					elseif 商品名称=="元灵晶石" or 商品名称=="随机元灵晶石" then
						玩家数据[id].道具:给予道具(id,"元灵晶石",{6,8,10},nil,"商店")

					elseif 商品名称=="海妖的贡品" then
						玩家数据[id].道具:添加阵营道具(id,1,1)
					elseif 商品名称=="海妖精气" then
						玩家数据[id].道具:添加阵营道具(id,2,1)
					elseif 商品名称=="海妖精魄" then
						玩家数据[id].道具:添加阵营道具(id,3,1)
					elseif 商品名称=="阵营-牡丹花" then
						玩家数据[id].道具:添加阵营礼物(id,1,1)
					elseif 商品名称=="阵营-桃运花" then
						玩家数据[id].道具:添加阵营礼物(id,2,1)
					elseif 商品名称=="阵营-紫兰花" then
						玩家数据[id].道具:添加阵营礼物(id,3,1)
					else
						玩家数据[id].道具:给予道具(id,商品名称,nil,nil,"商店")
					end
				end
				购买成功 = true
			else
					常规提示(id,"您的道具栏物品已经满啦")
			end
		else
				常规提示(id,"你的积分不足无法兑换")
		end
	else
		道具格子=玩家数据[id].角色:取道具格子()
		if 道具格子==0 then
			常规提示(id,"您的道具栏物品已经满啦")
			return 0
		end
		if 商品数量 > 0 then
			if 商品名称=="待补充" then

			else
				玩家数据[id].道具:给予道具(id,商品名称,商品数量,nil,"商店")
			end
			购买成功 = true
		else
			常规提示(id,"你的积分不足无法兑换")
		end
	end
	if 购买成功 then
		local 总价格=商品数量*商品单价
		玩家数据[id].角色.除妖军功 = 玩家数据[id].角色.除妖军功 -  总价格
		消息提示(id,"#W您花费#R"..总价格.."#W除妖军功购买了#R"..商品数量.."#W个#R"..商品名称)
		道具刷新(id)

		玩家数据[id].商品列表=商店处理类.商品列表[63]
		发送数据(玩家数据[id].连接id,9.1,{商品=商店处理类.商品列表[63],银子=玩家数据[id].角色.除妖军功,类型="除妖军功"})


	end
end

function 场景类_对话商业栏:阵营兑换物品(商品名称,商品单价,商品数量,商品类型,商品道具,id,位置,商品附加)
local 购买成功 = false
	local 道具格子=0
	local 双龙职位={["四海卫兵"]=1,["四海先锋"]=2,["风泽龙裔"]=3,["擎天龙王"]=4,["沧瀛龙帝"]=5,["断空龙神"]=6,["四海龙尊"]=7,["覆海卫兵"]=1,["覆海先锋"]=2,["蛰虺战狂"]=3,["盘虬英豪"]=4,["潜蛟风云"]=5,["伏螭霸主"]=6,["卧龙传奇"]=7}
	--local 关数1=玩家数据[id].角色.三界聚圣.雷雨关数+玩家数据[id].角色.三界聚圣.寒冰关数+玩家数据[id].角色.三界聚圣.风暴关数+玩家数据[id].角色.三界聚圣.灼日关数

	if (双龙职位[玩家数据[id].双龙之战.数据.当前职位]+1)*2<位置 then
		常规提示(id,"当前通关总数不足以兑换此物品")
		return
	end
	if 玩家数据[id].双龙之战.数据.活动积分< 商品单价 then
		常规提示(id,"当活动积分不足以兑换此物品")
		return
	end
	if 商品道具.可叠加 == nil or 商品道具.可叠加 == false then

			if 玩家数据[id].角色:取空道具格子数量() < 商品数量 then
				商品数量 = 玩家数据[id].角色:取空道具格子数量()
			end
			if 商品数量 > 0 then
				for n=1,商品数量 do
					道具格子=玩家数据[id].角色:取道具格子()
					if 道具格子==0 then
						常规提示(id,"您的道具栏物品已经满啦")
						return 0
					end
						if 商品名称=="头盔元身" then
						装备处理类:获取装备元身(玩家数据[id].连接id,id,19)
						elseif 商品名称=="挂坠元身" then
						装备处理类:获取装备元身(玩家数据[id].连接id,id,21)
						elseif 商品名称=="纱衣元身" then
						装备处理类:获取装备元身(玩家数据[id].连接id,id,22)
						elseif 商品名称=="束带元身" then
						装备处理类:获取装备元身(玩家数据[id].连接id,id,24)
						 elseif 商品名称=="鞋履元身"  then
						装备处理类:获取装备元身(玩家数据[id].连接id,id,25)
						 elseif 商品名称=="红玫瑰"  then
						 玩家数据[id].双龙之战.数据.活动物品.礼物[5]= 玩家数据[id].双龙之战.数据.活动物品.礼物[5]+1
						常规提示(id,"您获得了一个玫瑰花")
						elseif 商品名称=="超级魔兽要诀" then
						玩家数据[id].道具:给予道具(id,"超级魔兽要诀",1,nil,"不存共享")

						elseif 商品名称=="星辉石" or 商品名称=="舍利子" or 商品名称=="红玛瑙" or 商品名称=="黑宝石" or 商品名称=="光芒石"  or 商品名称=="月亮石"or 商品名称=="太阳石" or 商品名称=="精魄灵石" or 商品名称=="五色灵尘" then
							local lv=商品附加
							if lv then
								lv=lv+0
							else
								lv=1
							end
							玩家数据[id].道具:给予道具(id,商品名称,lv,nil,"商店")
						else
						玩家数据[id].道具:给予道具(id,商品名称,nil,nil,"商店")
						end
				end
				购买成功 = true
			else
					常规提示(id,"您的道具栏物品已经满啦")
			end
	else
		道具格子=玩家数据[id].角色:取道具格子()
		if 道具格子==0 then
			常规提示(id,"您的道具栏物品已经满啦")
			return 0
		end

		if 商品名称=="头盔元身" then
		装备处理类:获取装备元身(玩家数据[id].连接id,id,19)
		elseif 商品名称=="挂坠元身" then
		装备处理类:获取装备元身(玩家数据[id].连接id,id,21)
		elseif 商品名称=="纱衣元身" then
		装备处理类:获取装备元身(玩家数据[id].连接id,id,22)
		elseif 商品名称=="束带元身" then
		装备处理类:获取装备元身(玩家数据[id].连接id,id,24)
		 elseif 商品名称=="鞋履元身"  then
		装备处理类:获取装备元身(玩家数据[id].连接id,id,25)

		 elseif 商品名称=="红玫瑰"  then
		 玩家数据[id].双龙之战.数据.活动物品.礼物[5]= 玩家数据[id].双龙之战.数据.活动物品.礼物[5]+1
		常规提示(id,"您获得了一个玫瑰花")
		elseif 商品名称=="超级魔兽要诀" then
			玩家数据[id].道具:给予道具(id,"超级魔兽要诀",1,nil,"不存共享")
		else
			玩家数据[id].道具:给予道具(id,商品名称,商品数量,nil,"商店")
		end
			购买成功 = true
	end
	if 购买成功 then
		local 总价格=商品单价
		玩家数据[id].双龙之战.数据.活动积分=玩家数据[id].双龙之战.数据.活动积分-总价格
		消息提示(id,"#W您花费#R"..总价格.."#W点积分购买了#R"..商品数量.."#W个#R"..商品名称)
		道具刷新(id)
		玩家数据[id].商品列表=商店处理类.商品列表[62]
		发送数据(玩家数据[id].连接id,440017,{页面=6,角色数据=玩家数据[id].双龙之战.数据,系统数据=双龙之战,商品 = 商店处理类.商品列表[62],目前次数=f函数.读配置(程序目录.."特殊活动配置.ini","暑期签到","系统次数")+0})
	end
end
----------CC修改（增加时空之钥商店）

function 场景类_对话商业栏:购买人族时空积分商品(商品名称,商品单价,商品数量,商品类型,商品道具,id,商品附加) ----------CC修改（增加人族时空积分系统）
	local 购买成功 = false
	local 道具格子=0
	if 玩家数据[id].角色.人族时空积分< 商品数量*商品单价 then
		商品数量 = qz(玩家数据[id].角色.人族时空积分/商品单价)
	end
	if 商品道具.可叠加 == nil or 商品道具.可叠加 == false then
		if 商品数量 > 0 then
			if 玩家数据[id].角色:取空道具格子数量() < 商品数量 then
				商品数量 = 玩家数据[id].角色:取空道具格子数量()
			end
			if 商品数量 > 0 then
				for n=1,商品数量 do
					道具格子=玩家数据[id].角色:取道具格子()
					if 道具格子==0 then
						常规提示(id,"您的道具栏物品已经满啦")
						return 0
					end
					if 商品名称=="召唤兽内丹" then
						玩家数据[id].道具:给予道具(id,"召唤兽内丹",nil,取内丹("低级"),"人族时空积分")
					elseif 商品名称=="高级召唤兽内丹" then
						玩家数据[id].道具:给予道具(id,"高级召唤兽内丹",nil,取内丹("高级"),"人族时空积分")
					elseif 商品名称=="高级魔兽要诀" then
						玩家数据[id].道具:给予道具(id,"高级魔兽要诀",nil,nil,"人族时空积分")
					elseif 商品名称=="超级魔兽要诀" then
						玩家数据[id].道具:给予道具(id,"超级魔兽要诀",nil,nil,"人族时空积分")
					elseif 商品名称=="灵饰指南书" or 商品名称=="随机灵饰指南书" then
						玩家数据[id].道具:给予道具(id,"灵饰指南书",{6,8,10},nil,"人族时空积分")
					elseif 商品名称=="元灵晶石" or 商品名称=="随机元灵晶石" then
						玩家数据[id].道具:给予道具(id,"元灵晶石",{6,8,10},nil,"人族时空积分")
					else
						玩家数据[id].道具:给予道具(id,商品名称,nil,nil,"人族时空积分")
					end
				end
				购买成功 = true
			else
					常规提示(id,"您的道具栏物品已经满啦")
			end
		else
				常规提示(id,"你的人族时空积分不足无法兑换")
		end
	else
		道具格子=玩家数据[id].角色:取道具格子()
		if 道具格子==0 then
			常规提示(id,"您的道具栏物品已经满啦")
			return 0
		end
		if 商品数量 > 0 then
			if 商品名称=="待补充" then

			else
				玩家数据[id].道具:给予道具(id,商品名称,商品数量,nil,"人族时空积分")
			end
			购买成功 = true
		else
			常规提示(id,"你的人族时空积分不足无法兑换")
		end
	end
	if 购买成功 then
		local 总价格=商品数量*商品单价
		玩家数据[id].角色.人族时空积分=玩家数据[id].角色.人族时空积分-总价格
		发送数据(玩家数据[id].连接id,38,{内容="#W您花费#R"..总价格.."#W点人族时空积分购买了#R"..商品数量.."#W个#R"..商品名称,频道="xx"})
		道具刷新(id)

		玩家数据[id].商品列表=商店处理类.商品列表[59]
		玩家数据[id].商品列表.人族时空积分=true
		发送数据(玩家数据[id].连接id,9.1,{商品=商店处理类.商品列表[59],银子=玩家数据[id].角色.人族时空积分,类型="人族时空积分"})


	end
end

function 场景类_对话商业栏:购买仙族时空积分商品(商品名称,商品单价,商品数量,商品类型,商品道具,id,商品附加) ----------CC修改（增加仙族时空积分系统）
	local 购买成功 = false
	local 道具格子=0
	if 玩家数据[id].角色.仙族时空积分< 商品数量*商品单价 then
		商品数量 = qz(玩家数据[id].角色.仙族时空积分/商品单价)
	end
	if 商品道具.可叠加 == nil or 商品道具.可叠加 == false then
		if 商品数量 > 0 then
			if 玩家数据[id].角色:取空道具格子数量() < 商品数量 then
				商品数量 = 玩家数据[id].角色:取空道具格子数量()
			end
			if 商品数量 > 0 then
				for n=1,商品数量 do
					道具格子=玩家数据[id].角色:取道具格子()
					if 道具格子==0 then
						常规提示(id,"您的道具栏物品已经满啦")
						return 0
					end
					if 商品名称=="召唤兽内丹" then
						玩家数据[id].道具:给予道具(id,"召唤兽内丹",nil,取内丹("低级"),"仙族时空积分")
					elseif 商品名称=="高级召唤兽内丹" then
						玩家数据[id].道具:给予道具(id,"高级召唤兽内丹",nil,取内丹("高级"),"仙族时空积分")
					elseif 商品名称=="高级魔兽要诀" then
						玩家数据[id].道具:给予道具(id,"高级魔兽要诀",nil,nil,"仙族时空积分")
						elseif 商品名称=="灵饰指南书" or 商品名称=="随机灵饰指南书" then
				玩家数据[id].道具:给予道具(id,"灵饰指南书",{6,8,10},nil,"仙族时空积分")
				elseif 商品名称=="元灵晶石" or 商品名称=="随机元灵晶石" then
				玩家数据[id].道具:给予道具(id,"元灵晶石",{6,8,10},nil,"仙族时空积分")
					else
						玩家数据[id].道具:给予道具(id,商品名称,nil,nil,"仙族时空积分")
					end
				end
				购买成功 = true
			else
					常规提示(id,"您的道具栏物品已经满啦")
			end
		else
				常规提示(id,"你的仙族时空积分不足无法兑换")
		end
	else
		道具格子=玩家数据[id].角色:取道具格子()
		if 道具格子==0 then
			常规提示(id,"您的道具栏物品已经满啦")
			return 0
		end
		if 商品数量 > 0 then
			if 商品名称=="待补充" then

			else
				玩家数据[id].道具:给予道具(id,商品名称,商品数量,nil,"仙族时空积分")
			end
			购买成功 = true
		else
			常规提示(id,"你的仙族时空积分不足无法兑换")
		end
	end
	if 购买成功 then
		local 总价格=商品数量*商品单价
		玩家数据[id].角色.仙族时空积分=玩家数据[id].角色.仙族时空积分-总价格
		发送数据(玩家数据[id].连接id,38,{内容="#W您花费#R"..总价格.."#W点仙族时空积分购买了#R"..商品数量.."#W个#R"..商品名称,频道="xx"})
		道具刷新(id)

		玩家数据[id].商品列表=商店处理类.商品列表[60]
		玩家数据[id].商品列表.仙族时空积分=true
		发送数据(玩家数据[id].连接id,9.1,{商品=商店处理类.商品列表[60],银子=玩家数据[id].角色.仙族时空积分,类型="仙族时空积分"})


	end
end


function 场景类_对话商业栏:购买魔族时空积分商品(商品名称,商品单价,商品数量,商品类型,商品道具,id,商品附加) ----------CC修改（增加魔族时空积分系统）
	local 购买成功 = false
	local 道具格子=0
	if 玩家数据[id].角色.魔族时空积分< 商品数量*商品单价 then
		商品数量 = qz(玩家数据[id].角色.魔族时空积分/商品单价)
	end
	if 商品道具.可叠加 == nil or 商品道具.可叠加 == false then
		if 商品数量 > 0 then
			if 玩家数据[id].角色:取空道具格子数量() < 商品数量 then
				商品数量 = 玩家数据[id].角色:取空道具格子数量()
			end
			if 商品数量 > 0 then
				for n=1,商品数量 do
					道具格子=玩家数据[id].角色:取道具格子()
					if 道具格子==0 then
						常规提示(id,"您的道具栏物品已经满啦")
						return 0
					end
					if 商品名称=="召唤兽内丹" then
						玩家数据[id].道具:给予道具(id,"召唤兽内丹",nil,取内丹("低级"),"魔族时空积分")
					elseif 商品名称=="高级召唤兽内丹" then
						玩家数据[id].道具:给予道具(id,"高级召唤兽内丹",nil,取内丹("高级"),"魔族时空积分")
					elseif 商品名称=="高级魔兽要诀" then
						玩家数据[id].道具:给予道具(id,"高级魔兽要诀",nil,nil,"魔族时空积分")
					elseif 商品名称=="灵饰指南书" or 商品名称=="随机灵饰指南书" then
						玩家数据[id].道具:给予道具(id,"灵饰指南书",{6,8,10},nil,"魔族时空积分")
					elseif 商品名称=="元灵晶石" or 商品名称=="随机元灵晶石" then
						玩家数据[id].道具:给予道具(id,"元灵晶石",{6,8,10},nil,"魔族时空积分")
					else
						玩家数据[id].道具:给予道具(id,商品名称,nil,nil,"魔族时空积分")
					end
				end
				购买成功 = true
			else
					常规提示(id,"您的道具栏物品已经满啦")
			end
		else
				常规提示(id,"你的魔族时空积分不足无法兑换")
		end
	else
		道具格子=玩家数据[id].角色:取道具格子()
		if 道具格子==0 then
			常规提示(id,"您的道具栏物品已经满啦")
			return 0
		end
		if 商品数量 > 0 then
			if 商品名称=="待补充" then

			else
				玩家数据[id].道具:给予道具(id,商品名称,商品数量,nil,"魔族时空积分")
			end
			购买成功 = true
		else
			常规提示(id,"你的魔族时空积分不足无法兑换")
		end
	end
	if 购买成功 then
		local 总价格=商品数量*商品单价
		玩家数据[id].角色.魔族时空积分=玩家数据[id].角色.魔族时空积分-总价格
		发送数据(玩家数据[id].连接id,38,{内容="#W您花费#R"..总价格.."#W点魔族时空积分购买了#R"..商品数量.."#W个#R"..商品名称,频道="xx"})
		道具刷新(id)

		玩家数据[id].商品列表=商店处理类.商品列表[61]
		玩家数据[id].商品列表.魔族时空积分=true
		发送数据(玩家数据[id].连接id,9.1,{商品=商店处理类.商品列表[61],银子=玩家数据[id].角色.魔族时空积分,类型="魔族时空积分"})


	end
end

----------CC修改（增加时空之钥商店）

function 场景类_对话商业栏:购买商品中秋积分(商品名称,商品单价,商品数量,商品类型,商品道具,id)
	local 购买成功 = false
	local 道具格子=0
	if 玩家数据[id].角色.中秋积分< 商品数量*商品单价 then
		商品数量 = qz(玩家数据[id].角色.中秋积分/商品单价)
	end
	if 商品道具.可叠加 == nil or 商品道具.可叠加 == false then
		if 商品数量 > 0 then
			if 玩家数据[id].角色:取空道具格子数量() < 商品数量 then
				商品数量 = 玩家数据[id].角色:取空道具格子数量()
			end
			if 商品数量 > 0 then
				for n=1,商品数量 do
					道具格子=玩家数据[id].角色:取道具格子()
					if 道具格子==0 then
						常规提示(id,"您的道具栏物品已经满啦")
						return 0
					end
					  local 链接 = {提示=format("#S(中秋积分)#Y辛辛苦苦,终有所获#R/%s#Y少侠在婵娟处使用中秋积分兑换出珍贵的#G",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
					if 商品名称=="召唤兽内丹" then
						玩家数据[id].道具:给予超链接道具(id,"召唤兽内丹",nil,取内丹("低级"),链接,"不存共享")
					elseif 商品名称=="高级召唤兽内丹" then
						玩家数据[id].道具:给予超链接道具(id,"高级召唤兽内丹",nil,取内丹("高级"),链接,"不存共享")
					elseif 商品名称=="高级魔兽要诀" then
						玩家数据[id].道具:给予超链接道具(id,"高级魔兽要诀",nil,nil,链接,"不存共享")
					elseif 商品名称=="灵饰指南书" or 商品名称=="随机灵饰指南书" then
						玩家数据[id].道具:给予超链接道具(id,"灵饰指南书",{6,8,10},nil,链接,"不存共享")
					elseif 商品名称=="元灵晶石" or 商品名称=="随机元灵晶石" then
						玩家数据[id].道具:给予超链接道具(id,"元灵晶石",{6,8,10},nil,链接,"不存共享")
					else
						玩家数据[id].道具:给予超链接道具(id,商品名称,nil,nil,链接,"不存共享")
					end
				end
				购买成功 = true
			else
					常规提示(id,"您的道具栏物品已经满啦")
			end
		else
				常规提示(id,"你的积分不足无法兑换")
		end
	else
		道具格子=玩家数据[id].角色:取道具格子()
		if 道具格子==0 then
			常规提示(id,"您的道具栏物品已经满啦")
			return 0
		end
		if 商品数量 > 0 then
			if 商品名称=="待补充" then

			else
				玩家数据[id].道具:给予道具(id,商品名称,商品数量,nil,"商店")
			end
			购买成功 = true
		else
			常规提示(id,"你的积分不足无法兑换")
		end
	end
	if 购买成功 then
		local 总价格=商品数量*商品单价
		玩家数据[id].角色.中秋积分 = 玩家数据[id].角色.中秋积分 -  总价格
		常规提示(id,"#Y您花费"..总价格.."中秋积分购买了#G"..商品数量.."个"..商品名称)
		道具刷新(id)
		玩家数据[id].商品列表=商店处理类.商品列表[57]
		-- 玩家数据[id].商品列表.师徒积分=true
		发送数据(玩家数据[id].连接id,9.1,{商品=商店处理类.商品列表[57],银子=玩家数据[id].角色.中秋积分,类型="中秋积分"})



	end
end

function 场景类_对话商业栏:购买商品新春兑换(商品名称,商品单价,商品数量,商品类型,商品道具,id)
local 购买成功 = false
	local 道具格子=0
	local 材料数量=玩家数据[id].道具:判断道具数量(id,"锦红彩笺")
	if 材料数量< 商品数量*商品单价 then
		商品数量 = qz(材料数量/商品单价)
	end
	if 商品道具.可叠加 == nil or 商品道具.可叠加 == false then
		if 商品数量 > 0 then
			if 玩家数据[id].角色:取空道具格子数量() < 商品数量 then
				商品数量 = 玩家数据[id].角色:取空道具格子数量()
			end
			if 商品数量 > 0 then
				for n=1,商品数量 do
					道具格子=玩家数据[id].角色:取道具格子()
					if 道具格子==0 then
						常规提示(id,"您的道具栏物品已经满啦")
						return 0
					end
						玩家数据[id].道具:给予道具(id,商品名称,nil,nil,"商店")
				end
				购买成功 = true
			else
					常规提示(id,"您的道具栏物品已经满啦")
			end
		else
				常规提示(id,"你的锦红彩笺不足无法兑换")
		end
	else
		道具格子=玩家数据[id].角色:取道具格子()
		if 道具格子==0 then
			常规提示(id,"您的道具栏物品已经满啦")
			return 0
		end
		if 商品数量 > 0 then
			if 商品名称=="待补充" then
			else
				玩家数据[id].道具:给予道具(id,商品名称,商品数量,nil,"商店")
			end
			购买成功 = true
		else
			常规提示(id,"你的锦红彩笺不足无法兑换")
		end
	end
	if 购买成功 then
		local 总价格=商品数量*商品单价
		-- 玩家数据[id].角色.堆雪人.活动积分 = 玩家数据[id].角色.堆雪人.活动积分 -  总价格

		玩家数据[id].道具:消耗背包道具(玩家数据[id].连接id,id,"锦红彩笺",总价格)
		消息提示(id,"#W您花费#R"..总价格.."#W个锦红彩笺购买了#R"..商品数量.."#W个#R"..商品名称)
		道具刷新(id)
	end
end
function 场景类_对话商业栏:购买商品采矿声望(商品名称,商品单价,商品数量,商品类型,商品道具,id)
  local 购买成功 = false
  local 道具格子=0
  if 玩家数据[id].角色.采矿数据.矿业声望< 商品数量*商品单价 then
    商品数量 = qz(玩家数据[id].角色.采矿数据.矿业声望/商品单价)
  end
  if 商品道具.可叠加 == nil or 商品道具.可叠加 == false then
    if 商品数量 > 0 then
      if 玩家数据[id].角色:取空道具格子数量() < 商品数量 then
        商品数量 = 玩家数据[id].角色:取空道具格子数量()
      end
      if 商品数量 > 0 then
        for n=1,商品数量 do
          道具格子=玩家数据[id].角色:取道具格子()
          if 道具格子==0 then
            常规提示(id,"您的道具栏物品已经满啦")
            return 0
          end
          if 商品名称=="召唤兽内丹" then
            玩家数据[id].道具:给予道具(id,"召唤兽内丹",nil,取内丹("低级"),"商店")
          elseif 商品名称=="高级召唤兽内丹" then
            玩家数据[id].道具:给予道具(id,"高级召唤兽内丹",nil,取内丹("高级"),"商店")
          elseif 商品名称=="高级魔兽要诀" then
            玩家数据[id].道具:给予道具(id,"高级魔兽要诀",nil,nil,"商店")
          elseif 商品名称=="灵饰指南书" or 商品名称=="随机灵饰指南书" then
            玩家数据[id].道具:给予道具(id,"灵饰指南书",{6,8,10},nil,"商店")
          elseif 商品名称=="元灵晶石" or 商品名称=="随机元灵晶石" then
            玩家数据[id].道具:给予道具(id,"元灵晶石",{6,8,10},nil,"商店")
          else
            玩家数据[id].道具:给予道具(id,商品名称,nil,nil,"商店")
          end
        end
        购买成功 = true
      else
          常规提示(id,"您的道具栏物品已经满啦")
      end
    else
        常规提示(id,"你的积分不足无法兑换")
    end
  else
    道具格子=玩家数据[id].角色:取道具格子()
    if 道具格子==0 then
      常规提示(id,"您的道具栏物品已经满啦")
      return 0
    end
    if 商品数量 > 0 then
      if 商品名称=="待补充" then

      else
        玩家数据[id].道具:给予道具(id,商品名称,商品数量,nil,"商店")
      end
      购买成功 = true
    else
      常规提示(id,"你的声望不足无法兑换")
    end
  end
  if 购买成功 then
    local 总价格=商品数量*商品单价
    玩家数据[id].角色.采矿数据.矿业声望= 玩家数据[id].角色.采矿数据.矿业声望 -  总价格
    消息提示(id,"#W您花费#R"..总价格.."#W声望积分购买了#R"..商品数量.."#W个#R"..商品名称)
    道具刷新(id)
  end
end
function 场景类_对话商业栏:购买商品银子(商品名称,商品单价,商品数量,商品类型,商品道具,id,商品附加)
	local 购买成功 = false
	local 道具格子=0
	if 取银子(id)< 商品数量*商品单价 then
		商品数量 = qz(取银子(id)/商品单价)
	end
	if 商品道具.可叠加 == nil or 商品道具.可叠加 == false then
		if 商品数量 > 0 then
			if 玩家数据[id].角色:取空道具格子数量() < 商品数量 then
				商品数量 = 玩家数据[id].角色:取空道具格子数量()
			end
			if 商品数量 > 0 then
				for n=1,商品数量 do
					道具格子=玩家数据[id].角色:取道具格子()
					if 道具格子==0 then
						常规提示(id,"您的道具栏物品已经满啦")
						return 0
					end
					if 商品名称=="高级魔兽要诀" then
						玩家数据[id].道具:给予道具(id,"高级魔兽要诀",nil,nil,"商店")
					elseif 商品名称=="灵饰指南书" or 商品名称=="随机灵饰指南书" then
						玩家数据[id].道具:给予道具(id,"灵饰指南书",{6,8,10},nil,"商店")
					elseif 商品名称=="元灵晶石" or 商品名称=="随机元灵晶石" then
						玩家数据[id].道具:给予道具(id,"元灵晶石",{6,8,10},nil,"商店")
					elseif 商品名称=="制造指南书" then
						玩家数据[id].道具:给予道具(id,"制造指南书",{9,10,11,12},nil,"商店")
					elseif 商品名称=="百炼精铁" then
						玩家数据[id].道具:给予道具(id,"百炼精铁",{9,10,11,12},nil,"商店")
					elseif 商品名称=="上古锻造图策" then
						玩家数据[id].道具:给予道具(id,"上古锻造图策",{7,8,9},nil,"商店")
					elseif 商品名称=="炼妖石" then
						玩家数据[id].道具:给予道具(id,"炼妖石",{7,8,9},nil,"商店")
					elseif 商品名称=="随机怪物卡片" then
						local lv=取随机数(1,8)
						玩家数据[id].道具:给予道具(id,"怪物卡片",lv,nil,"商店")
					  elseif 商品名称=="八级变身卡" then
						local lv=8
						玩家数据[id].道具:给予道具(id,"怪物卡片",lv,nil,"商店")
					  elseif 商品名称=="九级变身卡" then
						local lv=9
						玩家数据[id].道具:给予道具(id,"怪物卡片",lv,nil,"商店")
					elseif 商品名称=="战魄" then
						玩家数据[id].道具:给予道具(id,"战魄",商品附加+0,nil,"商店")
					elseif 商品名称=="陨铁" then
						玩家数据[id].道具:给予道具(id,"陨铁",商品附加+0,nil,"商店")
					elseif 商品名称=="珍珠" then
						玩家数据[id].道具:给予道具(id,"珍珠",商品附加+0,nil,"商店")
					elseif 商品名称=="自我陶醉钟灵石" then
						local lv=商品附加
						if lv then lv=lv+0 else lv=1 end
						玩家数据[id].道具:给予道具(id,"钟灵石",lv,"自我陶醉","商店")
					elseif 商品名称=="心源钟灵石" then
						local lv=商品附加
						if lv then lv=lv+0 else lv=1 end
						玩家数据[id].道具:给予道具(id,"钟灵石",lv,"心源","商店")
					elseif 商品名称=="163钟灵石" then
						local lv=商品附加
						if lv then lv=lv+0 else lv=1 end
						玩家数据[id].道具:给予道具(id,"钟灵石",lv,"163","商店")
					elseif 商品名称=="健步如飞钟灵石" then
						local lv=商品附加
						if lv then lv=lv+0 else lv=1 end
						玩家数据[id].道具:给予道具(id,"钟灵石",lv,"健步如飞","商店")
					elseif 商品名称=="血气方刚钟灵石" then
						local lv=商品附加
						if lv then lv=lv+0 else lv=1 end
						玩家数据[id].道具:给予道具(id,"钟灵石",lv,"血气方刚","商店")
					elseif 商品名称=="回春之术钟灵石" then
						local lv=商品附加
						if lv then lv=lv+0 else lv=1 end
						玩家数据[id].道具:给予道具(id,"钟灵石",lv,"回春之术","商店")
					elseif 商品名称=="锐不可当钟灵石" then
						local lv=商品附加
						if lv then lv=lv+0 else lv=1 end
						玩家数据[id].道具:给予道具(id,"钟灵石",lv,"锐不可当","商店")
					else
						if 商品名称=="星辉石" or 商品名称=="五色灵尘" or 商品名称=="舍利子" or 商品名称=="红玛瑙" or 商品名称=="黑宝石" or 商品名称=="光芒石"  or 商品名称=="月亮石"or 商品名称=="太阳石" or 商品名称=="精魄灵石" then
							local lv=商品附加
							if lv then
								lv=lv+0
							else
								lv=1
							end
							玩家数据[id].道具:给予道具(id,商品名称,lv,nil,"商店")
						else
							玩家数据[id].道具:给予道具(id,商品名称,nil,nil,"商店")
						end

					end
				end
				购买成功 = true
			else
				常规提示(id,"您的道具栏物品已经满啦")
			end
		else
			常规提示(id,"你的银子不足无法购买")
		end
	else
		道具格子=玩家数据[id].角色:取道具格子()
		if 道具格子==0 then
			常规提示(id,"您的道具栏物品已经满啦")
			return 0
		end
		if 商品数量 > 0 then
			if 商品名称=="高级魔兽要诀" then
				玩家数据[id].道具:给予道具(id,"高级魔兽要诀",nil,nil,"商店")
			elseif 商品名称=="灵饰指南书" or 商品名称=="随机灵饰指南书" then
				玩家数据[id].道具:给予道具(id,"灵饰指南书",{6,8,10},nil,"商店")
			elseif 商品名称=="元灵晶石" or 商品名称=="随机元灵晶石" then
				玩家数据[id].道具:给予道具(id,"元灵晶石",{6,8,10},nil,"商店")
			elseif 商品名称=="制造指南书" then
				玩家数据[id].道具:给予道具(id,"制造指南书",{9,10,11,12},nil,"商店")
			 elseif 商品名称=="百炼精铁" then
				玩家数据[id].道具:给予道具(id,"百炼精铁",{9,10,11,12},nil,"商店")
			elseif 商品名称=="上古锻造图策" then
				玩家数据[id].道具:给予道具(id,"上古锻造图策",{7,8,9},nil,"商店")
			elseif 商品名称=="炼妖石" then
				玩家数据[id].道具:给予道具(id,"炼妖石",{7,8,9},nil,"商店")
			elseif 商品名称=="随机怪物卡片" then
				local lv=取随机数(1,8)
				玩家数据[id].道具:给予道具(id,"怪物卡片",lv,nil,"商店")
	                           elseif 商品名称=="八级变身卡" then
				local lv=8
				玩家数据[id].道具:给予道具(id,"怪物卡片",lv,nil,"商店")
			 elseif 商品名称=="九级变身卡" then
				local lv=9
				玩家数据[id].道具:给予道具(id,"怪物卡片",lv,nil,"商店")

			elseif 商品名称=="战魄" then
				玩家数据[id].道具:给予道具(id,"战魄",商品附加+0,nil,"商店")
			elseif 商品名称=="珍珠" then
				玩家数据[id].道具:给予道具(id,"珍珠",商品附加+0,nil,"商店")
			else
				玩家数据[id].道具:给予道具(id,商品名称,商品数量,nil,"商店")
			end
			购买成功 = true
			if (商品名称=="神兽涎" or 商品名称=="仙露小丸子") and MRSPXZ[商品名称].数量 ~= nil and tonumber(MRSPXZ[商品名称].数量)~=nil then
	      MRSPXZ[商品名称].数量 = MRSPXZ[商品名称].数量 - 商品数量
	      WJGMSPSLXZ[id][商品名称] = WJGMSPSLXZ[id][商品名称] + 商品数量
	      if MRSPXZ[商品名称].数量 < 0 then --防错
	          MRSPXZ[商品名称].数量 = 0
	      end
			end
		else
			常规提示(id,"你的银子不足无法购买")
		end
	end
	if 购买成功 then
		local 总价格=商品数量*商品单价
		玩家数据[id].角色:扣除银子(总价格,0,0,"购买系统商店商品["..商品名称.."]")
		发送数据(玩家数据[id].连接id,3520,{银子=玩家数据[id].角色.银子, 仙玉=取仙玉(id)})
		发送数据(玩家数据[id].连接id,38,{内容="#W您花费#R"..总价格.."#W两银子购买了#R"..商品数量.."#W个#R"..商品名称,频道="xx"})
		道具刷新(id)

	end
end


function 场景类_对话商业栏:购买师徒积分商品(商品名称,商品单价,商品数量,商品类型,商品道具,id,商品附加)
	local 购买成功 = false
	local 道具格子=0
	if 玩家数据[id].角色.师徒积分< 商品数量*商品单价 then
		商品数量 = qz(玩家数据[id].角色.师徒积分/商品单价)
	end
	if 商品道具.可叠加 == nil or 商品道具.可叠加 == false then
		if 商品数量 > 0 and 玩家数据[id].角色.师徒积分-商品数量*商品单价>=0 then
			if 玩家数据[id].角色:取空道具格子数量() < 商品数量 then
				商品数量 = 玩家数据[id].角色:取空道具格子数量()
			end
			if 商品数量 > 0 then
				for n=1,商品数量 do
					道具格子=玩家数据[id].角色:取道具格子()
					if 道具格子==0 then
						常规提示(id,"您的道具栏物品已经满啦")
						return 0
					end
					if 商品名称=="高级魔兽要诀" then
						玩家数据[id].道具:给予道具(id,"高级魔兽要诀",nil,nil,"bwjf")
					elseif 商品名称=="灵饰指南书" or 商品名称=="随机灵饰指南书" then
						玩家数据[id].道具:给予道具(id,"灵饰指南书",{6,8,10},nil,"bwjf")
					elseif 商品名称=="元灵晶石" or 商品名称=="随机元灵晶石" then
						玩家数据[id].道具:给予道具(id,"元灵晶石",{6,8,10},nil,"bwjf")
					elseif 商品名称=="制造指南书" then
						玩家数据[id].道具:给予道具(id,"制造指南书",{9,10,11,12},nil,"bwjf")
					elseif 商品名称=="百炼精铁" then
						玩家数据[id].道具:给予道具(id,"百炼精铁",{9,10,11,12},nil,"bwjf")
					elseif 商品名称=="上古锻造图策" then
						玩家数据[id].道具:给予道具(id,"上古锻造图策",{7,8,9},nil,"bwjf")
					elseif 商品名称=="炼妖石" then
						玩家数据[id].道具:给予道具(id,"炼妖石",{7,8,9},nil,"bwjf")
					elseif 商品名称=="随机怪物卡片" then
						local lv=取随机数(1,8)

						玩家数据[id].道具:给予道具(id,"怪物卡片",lv,nil,"bwjf")
					elseif 商品名称=="战魄" then
						玩家数据[id].道具:给予道具(id,"战魄",商品附加+0,nil,"bwjf")
					elseif 商品名称=="陨铁" then
						玩家数据[id].道具:给予道具(id,"陨铁",商品附加+0,nil,"bwjf")
					elseif 商品名称=="珍珠" then
						玩家数据[id].道具:给予道具(id,"珍珠",商品附加+0,nil,"bwjf")
					elseif 商品名称=="装备指南书" or 商品名称=="精铁" then
						local  lv=qz((玩家数据[id].角色.等级+30)/10)*10
						if RpbARGB==1 then
							lv=150
						end
						if 商品名称=="精铁" then
							玩家数据[id].道具:给予道具(id,"百炼精铁",lv,nil,"商城购买")
						else
							local 书铁等级=lv
							local tx=角色武器类型[玩家数据[id].角色.模型][取随机数(1,#角色武器类型[玩家数据[id].角色.模型])]
							-- print(tx)
							-- print("=======")
							if 取随机数()<=60 then
								local jggr={19,21,23,24,25}
								if 玩家数据[id].角色.性别=="女" then
									jggr={20,21,22,24,25}
								end
								tx=jggr[取随机数(1,#jggr)]
							end
							--print(书铁等级)
							玩家数据[id].道具:给予道具(id,"制造指南书",书铁等级,tx)
							-- 玩家数据[id].道具:给予道具(id,"制造指南书",{lv,lv},nil,"商城购买")
						end
					else
						if 商品名称=="星辉石" or 商品名称=="舍利子" or 商品名称=="红玛瑙" or 商品名称=="黑宝石" or 商品名称=="光芒石"  or 商品名称=="月亮石"or 商品名称=="太阳石" or 商品名称=="精魄灵石" then
							local lv=商品附加
							if lv then
								lv=lv+0
							else
								lv=1
							end
							玩家数据[id].道具:给予道具(id,商品名称,lv,nil,"bwjf")
						else

							if __装备序列[商品名称] then
								local greewrt = 取物品数据(商品名称)
								local sping=开始生成购买环装(greewrt[5],__装备序列[商品名称],商品名称)
								玩家数据[id].道具:给予道具(id,nil,nil,nil,"bwjf",nil,sping,nil,nil,nil,链接)
							else
								玩家数据[id].道具:给予道具(id,商品名称,nil,nil,"bwjf")
							end

						end

					end
					-- print(商品附加)
				end
				购买成功 = true
			else
				常规提示(id,"您的道具栏物品已经满啦")
			end
		else
			常规提示(id,"你的师徒积分不足无法购买")
		end
	else
		道具格子=玩家数据[id].角色:取道具格子()
		if 道具格子==0 then
			常规提示(id,"您的道具栏物品已经满啦")
			return 0
		end
		if 商品数量 > 0 and 玩家数据[id].角色.师徒积分-商品数量*商品单价>=0 then
			if 商品名称=="高级魔兽要诀" then
				玩家数据[id].道具:给予道具(id,"高级魔兽要诀",nil,nil,"bwjf")
			elseif 商品名称=="灵饰指南书" or 商品名称=="随机灵饰指南书" then
				玩家数据[id].道具:给予道具(id,"灵饰指南书",{6,8,10},nil,"bwjf")
			elseif 商品名称=="元灵晶石" or 商品名称=="随机元灵晶石" then
				玩家数据[id].道具:给予道具(id,"元灵晶石",{6,8,10},nil,"bwjf")
			elseif 商品名称=="制造指南书" then
				玩家数据[id].道具:给予道具(id,"制造指南书",{9,10,11,12},nil,"bwjf")
			 elseif 商品名称=="百炼精铁" then
				玩家数据[id].道具:给予道具(id,"百炼精铁",{9,10,11,12},nil,"bwjf")
			elseif 商品名称=="上古锻造图策" then
				玩家数据[id].道具:给予道具(id,"上古锻造图策",{7,8,9},nil,"bwjf")
			elseif 商品名称=="炼妖石" then
				玩家数据[id].道具:给予道具(id,"炼妖石",{7,8,9},nil,"bwjf")
			elseif 商品名称=="随机怪物卡片" then
				local lv=取随机数(1,8)

				玩家数据[id].道具:给予道具(id,"怪物卡片",lv,nil,"bwjf")
			elseif 商品名称=="战魄" then
				玩家数据[id].道具:给予道具(id,"战魄",商品附加+0,nil,"bwjf")
			elseif 商品名称=="珍珠" then
				玩家数据[id].道具:给予道具(id,"珍珠",商品附加+0,nil,"bwjf")
			else
				玩家数据[id].道具:给予道具(id,商品名称,商品数量,nil,"bwjf")
			end
			购买成功 = true
		else
			常规提示(id,"你的师徒积分不足无法购买")
		end
	end
	if 购买成功 then
		local 总价格=商品数量*商品单价
		玩家数据[id].角色.师徒积分=玩家数据[id].角色.师徒积分-总价格
		发送数据(玩家数据[id].连接id,38,{内容="#W您花费#R"..总价格.."#W点师徒积分购买了#R"..商品数量.."#W个#R"..商品名称,频道="xx"})
		道具刷新(id)

		玩家数据[id].商品列表=商店处理类.商品列表[55]
		玩家数据[id].商品列表.师徒积分=true
		发送数据(玩家数据[id].连接id,9.1,{商品=商店处理类.商品列表[55],银子=玩家数据[id].角色.师徒积分,类型="师徒积分"})


	end
end

function 场景类_对话商业栏:购买商品副本积分(商品名称,商品单价,商品数量,商品类型,商品道具,id)
	local 购买成功 = false
	local 道具格子=0
	if 玩家数据[id].角色.副本积分< 商品数量*商品单价 then
		商品数量 = qz(玩家数据[id].角色.副本积分/商品单价)
	end
	if 商品道具.可叠加 == nil or 商品道具.可叠加 == false then
		if 商品数量 > 0 then
			if 玩家数据[id].角色:取空道具格子数量() < 商品数量 then
				商品数量 = 玩家数据[id].角色:取空道具格子数量()
			end
			if 商品数量 > 0 then
				for n=1,商品数量 do
					道具格子=玩家数据[id].角色:取道具格子()
					if 道具格子==0 then
						常规提示(id,"您的道具栏物品已经满啦")
						return 0
					end
					if 商品名称=="召唤兽内丹" then
						玩家数据[id].道具:给予道具(id,"召唤兽内丹",nil,取内丹("低级"),"商店")
					elseif 商品名称=="高级召唤兽内丹" then
						玩家数据[id].道具:给予道具(id,"高级召唤兽内丹",nil,取内丹("高级"),"商店")
					elseif 商品名称=="高级魔兽要诀" then
						玩家数据[id].道具:给予道具(id,"高级魔兽要诀",nil,nil,"商店")
					elseif 商品名称=="灵饰指南书" or 商品名称=="随机灵饰指南书" then
						玩家数据[id].道具:给予道具(id,"灵饰指南书",{6,8,10},nil,"商店")
					elseif 商品名称=="元灵晶石" or 商品名称=="随机元灵晶石" then
						玩家数据[id].道具:给予道具(id,"元灵晶石",{6,8,10},nil,"商店")
					else
						玩家数据[id].道具:给予道具(id,商品名称,nil,nil,"商店")
					end
				end
				购买成功 = true
			else
					常规提示(id,"您的道具栏物品已经满啦")
			end
		else
				常规提示(id,"你的积分不足无法兑换")
		end
	else
		道具格子=玩家数据[id].角色:取道具格子()
		if 道具格子==0 then
			常规提示(id,"您的道具栏物品已经满啦")
			return 0
		end
		if 商品数量 > 0 then
			if 商品名称=="待补充" then

			else
				玩家数据[id].道具:给予道具(id,商品名称,商品数量,nil,"商店")
			end
			购买成功 = true
		else
			常规提示(id,"你的积分不足无法兑换")

		end
	end
	if 购买成功 then
		local 总价格=商品数量*商品单价
		玩家数据[id].角色.副本积分 = 玩家数据[id].角色.副本积分 -  总价格
		消息提示(id,"#W您花费#R"..总价格.."#W副本积分购买了#R"..商品数量.."#W个#R"..商品名称)
		道具刷新(id)

		玩家数据[id].商品列表=商店处理类.商品列表[44]
		玩家数据[id].商品列表.副本积分=true
		发送数据(玩家数据[id].连接id,9.1,{商品=商店处理类.商品列表[44],银子=玩家数据[id].角色.副本积分,类型="副本积分"})
	end
end

function 场景类_对话商业栏:购买商品秘制积分(商品名称,商品单价,商品数量,商品类型,商品道具,id,商品附加)
	local 购买成功 = false
	local 道具格子=0
	if 玩家数据[id].角色.秘制积分< 商品数量*商品单价 then
		商品数量 = qz(玩家数据[id].角色.秘制积分/商品单价)
	end
	if 商品道具.可叠加 == nil or 商品道具.可叠加 == false then
		if 商品数量 > 0 then
			if 玩家数据[id].角色:取空道具格子数量() < 商品数量 then
				商品数量 = 玩家数据[id].角色:取空道具格子数量()
			end
			if 商品数量 > 0 then
				for n=1,商品数量 do
					道具格子=玩家数据[id].角色:取道具格子()
					if 道具格子==0 then
						常规提示(id,"您的道具栏物品已经满啦")
						return 0
					end
					if 商品名称=="待补充" then

					else
						玩家数据[id].道具:给予道具(id,商品名称,nil,商品附加+0,"商店")
					end
				end
				购买成功 = true
			else
					常规提示(id,"您的道具栏物品已经满啦")
			end
		else
				常规提示(id,"你的积分不足无法兑换")
		end
	else
		道具格子=玩家数据[id].角色:取道具格子()
		if 道具格子==0 then
			常规提示(id,"您的道具栏物品已经满啦")
			return 0
		end
		if 商品数量 > 0 then
			if 商品名称=="待补充" then

			else
				玩家数据[id].道具:给予道具(id,商品名称,商品数量,商品附加+0,"商店")
			end
			购买成功 = true
		else
			常规提示(id,"你的积分不足无法兑换")
		end
	end
	if 购买成功 then
		local 总价格=商品数量*商品单价
		玩家数据[id].角色.秘制积分 = 玩家数据[id].角色.秘制积分 -  总价格
		发送数据(玩家数据[id].连接id,38,{内容="#W您花费#R"..总价格.."#W秘制积分购买了#R"..商品数量.."#W个#R"..商品名称,频道="xx"})
		道具刷新(id)
	end
end

function 场景类_对话商业栏:购买商品门贡法宝(商品名称,商品单价,商品数量,商品类型,商品道具,id,商品附加)
	商品数量=1
	local 购买成功 = false
	if 玩家数据[id].角色.门贡< 1*商品单价 then
		常规提示(id,"你的门派贡献不足无法兑换")
		return
	end
	玩家数据[id].道具:给予法宝(id,商品名称)
	购买成功 = true
	if 购买成功 then
		local 总价格=1*商品单价
		玩家数据[id].角色.门贡 = 玩家数据[id].角色.门贡 -   总价格
		发送数据(玩家数据[id].连接id,38,{内容="#W您花费#R"..总价格.."#W门派贡献购买了#R"..商品数量.."#W个#R"..商品名称,频道="xx"})
		道具刷新(id)
	end
end

function 场景类_对话商业栏:购买商品门贡灵宝(商品名称,商品单价,商品数量,商品类型,商品道具,id,商品附加)
	商品数量=1
	local 购买成功 = false
	-- if 玩家数据[id].角色.门贡< 商品数量*商品单价 then --测试模式
	--    常规提示(id,"你的门派贡献不足无法兑换")
	--    return
	-- end
	-- 玩家数据[id].道具:给予灵宝(id,商品名称)
	-- 购买成功 = true
	-- if 购买成功 then
	--    local 总价格=商品数量*商品单价
	--    玩家数据[id].角色.门贡 = 玩家数据[id].角色.门贡 -总价格
	--    发送数据(玩家数据[id].连接id,38,{内容="#W您花费#R"..总价格.."#W门派贡献购买了#R"..商品数量.."#W个#R"..商品名称,频道="xx"})
	--    道具刷新(id)
	-- end
end

function 场景类_对话商业栏:治疗召唤兽气血(连接id,数字id)
	local 队伍组 = {数字id}
	if 玩家数据[数字id].队伍 ~= 0 and 玩家数据[数字id].队长 then--"#Y
		local 队伍id = 玩家数据[数字id].队伍
		for i=2,#队伍数据[队伍id].成员数据 do
			local lsid = 队伍数据[队伍id].成员数据[i]
			队伍组[#队伍组+1] = lsid
		end
	end
	local 成功=false
	for i=1,#队伍组 do
		local id = 队伍组[i]
		local 气血=玩家数据[id].召唤兽:取气血差()
		local 魔法=玩家数据[id].召唤兽:取魔法差()
		local 银子=math.floor(气血*0.5+魔法)
		if 玩家数据[id].角色:扣除银子(银子,0,0,"治疗召唤兽气血魔法",1) then
			if i==1 then
				成功=true
			end
			for n=1,#玩家数据[id].召唤兽.数据 do
				玩家数据[id].召唤兽.数据[n].气血=玩家数据[id].召唤兽.数据[n].最大气血
				玩家数据[id].召唤兽.数据[n].魔法=玩家数据[id].召唤兽.数据[n].最大魔法
			end
		end
	end
	if 成功 then
		if 玩家数据[数字id].角色.参战信息~=nil and 玩家数据[数字id].角色.参战宝宝 then
			发送数据(玩家数据[数字id].连接id,20.1,{气血=玩家数据[数字id].角色.参战宝宝.最大气血,魔法=玩家数据[数字id].角色.参战宝宝.最大魔法})
		end
		发送数据(连接id,1501,{名称="超级巫医",模型="男人_巫医",对话=format("已将您的所有召唤兽气血和魔法全部恢复至最佳状态。")})
	else
		发送数据(连接id,1501,{名称="超级巫医",模型="男人_巫医",对话=format("你没那么多的银子哟#24")})
	end
end

function 场景类_对话商业栏:治疗召唤兽忠诚(连接id,数字id)
	local 队伍组 = {数字id}
	if 玩家数据[数字id].队伍 ~= 0 and 玩家数据[数字id].队长 then--"#Y
		local 队伍id = 玩家数据[数字id].队伍
		for i=2,#队伍数据[队伍id].成员数据 do
			local lsid = 队伍数据[队伍id].成员数据[i]
			队伍组[#队伍组+1] = lsid
		end
	end
	local 成功=false
	local 银子
	for i=1,#队伍组 do
		local id = 队伍组[i]
		local 忠诚=玩家数据[id].召唤兽:取忠诚差()
		银子=忠诚*100
		if 玩家数据[id].角色:扣除银子(银子,0,0,"治疗召唤兽忠诚",1) then
			if i==1 then
				成功=true
			end
			for n=1,#玩家数据[id].召唤兽.数据 do
				if 玩家数据[id].召唤兽.数据[n].忠诚<100 then
					玩家数据[id].召唤兽.数据[n].忠诚=100
				end
			end
		end
	end
	if 成功 then
		发送数据(连接id,1501,{名称="超级巫医",模型="男人_巫医",对话=format("已将您的所有召唤兽忠诚恢复至最佳状态。")})
	else
		发送数据(连接id,1501,{名称="超级巫医",模型="男人_巫医",对话=format("你没那么多的银子哟#24")})
	end
end

function 场景类_对话商业栏:治疗召唤兽全体(连接id,数字id)
	local 队伍组 = {数字id}
	if 玩家数据[数字id].队伍 ~= 0 and 玩家数据[数字id].队长 then--"#Y
		local 队伍id = 玩家数据[数字id].队伍
		for i=2,#队伍数据[队伍id].成员数据 do
			local lsid = 队伍数据[队伍id].成员数据[i]
			队伍组[#队伍组+1] = lsid
		end
	end
	local 成功=false
	for i=1,#队伍组 do
		local id = 队伍组[i]
		local 忠诚=玩家数据[id].召唤兽:取忠诚差()
		local 银子=忠诚*100
		local 气血=玩家数据[id].召唤兽:取气血差()
		local 魔法=玩家数据[id].召唤兽:取魔法差()
		银子=银子+math.floor(气血*0.5)+魔法
		if 玩家数据[id].角色:扣除银子(银子,0,0,"治疗召唤兽忠诚、气血、魔法",1) then
			if i==1 then
				成功=true
			end
			for n=1,#玩家数据[id].召唤兽.数据 do
				玩家数据[id].召唤兽.数据[n].气血=玩家数据[id].召唤兽.数据[n].最大气血
				玩家数据[id].召唤兽.数据[n].魔法=玩家数据[id].召唤兽.数据[n].最大魔法
				if 玩家数据[id].召唤兽.数据[n].忠诚<100 then
					玩家数据[id].召唤兽.数据[n].忠诚=100
				end
			end
		end
	end
	if 成功 then
		if 玩家数据[数字id].角色.参战信息~=nil and 玩家数据[数字id].角色.参战宝宝 then
			发送数据(玩家数据[数字id].连接id,20.1,{气血=玩家数据[数字id].角色.参战宝宝.最大气血,魔法=玩家数据[数字id].角色.参战宝宝.最大魔法})
		end
		发送数据(连接id,1501,{名称="超级巫医",模型="男人_巫医",对话=format("已将您的所有召唤兽气血、魔法、忠诚恢复至最佳状态。")})
	else
		发送数据(连接id,1501,{名称="超级巫医",模型="男人_巫医",对话=format("你没那么多的银子哟#24")})
	end
end
function 场景类_对话商业栏:更新(dt)end
function 场景类_对话商业栏:显示(x,y)end

return 场景类_对话商业栏