-- @作者: baidwwy
-- @邮箱:  313738139@qq.com
-- @创建时间:   2023-01-03 09:00:53
-- @最后修改来自: baidwwy
-- @Last Modified time: 2026-05-18 20:35:05
local 副本_新手副本 = class()
local sj = 取随机数
local format = string.format
local insert = table.insert
local ceil = math.ceil
local floor = math.floor
local wps = 取物品数据
local typ = type
local random = 取随机数
local npc={GM="龙太子",GM小迷弟="剑侠客",百晓星君="女人_万圣公主",兰虎="男人_兰虎",酒店老板="男人_酒店老板",店小二="男人_店小二",吹鼓手="吹号手",侍女="女随从",新郎="骑马新郎",轿子="轿子",媒婆="媒婆",郑镖头="女人_程夫人",总镖头="罗百万",崔博衙="奸商",老书生="男人_老书生",兰虎="狐美人",酒店老板="逍遥生",钟馗="英女侠",赵姨娘="天兵",林军左统领="男人_老伯",夜影迷踪="蛟龙",沈唐="鲛人"} --模型,名字

function 副本_新手副本:初始化()
	地图处理类.地图数据[8100]={npc={},单位={},传送圈={}} --四方城
	地图处理类.地图玩家[8100]={}
	地图处理类.地图坐标[8100]=地图处理类.地图坐标[1001]
	地图处理类.地图单位[8100]={}
	地图处理类.单位编号[8100]=1000

	地图处理类.地图数据[8101]={npc={},单位={},传送圈={}} --崔府正厅
	地图处理类.地图玩家[8101]={}
	地图处理类.地图坐标[8101]=地图处理类.地图坐标[1193]
	地图处理类.地图单位[8101]={}
	地图处理类.单位编号[8101]=1000

	地图处理类.地图数据[8102]={npc={},单位={},传送圈={}} --沧浪墟
	地图处理类.地图玩家[8102]={}
	地图处理类.地图坐标[8102]=地图处理类.地图坐标[1092]
	地图处理类.地图单位[8102]={}
	地图处理类.单位编号[8102]=1000

	地图处理类.地图数据[8103]={npc={},单位={},传送圈={}} --沧浪墟
	地图处理类.地图玩家[8103]={}
	地图处理类.地图坐标[8103]=地图处理类.地图坐标[1044]
	地图处理类.地图单位[8103]={}
	地图处理类.单位编号[8103]=1000
end

function 副本_新手副本:开启副本(id)
	if 玩家数据[id].队伍==0 or 玩家数据[id].队长==false  then
		常规提示(id,"#Y/该任务必须组队完成且由队长领取")
		return
	elseif 取队伍人数(id)<5 and 调试模式==false then
		常规提示(id,"#Y此副本要求队伍人数不低于5人")
		return
	elseif  取等级要求(id,30)==false then
		常规提示(id,"#Y此副本要求角色等级不能低于30级")
		return
	end
	local 队伍id=玩家数据[id].队伍
	for n=1,#队伍数据[队伍id].成员数据 do
		local 临时id=队伍数据[队伍id].成员数据[n]
		if 副本数据.新手副本.完成[临时id]~=nil then
		常规提示(id,"#Y"..玩家数据[临时id].角色.名称.."本日已经完成过此副本了")
		return
		elseif 玩家数据[临时id].角色:取任务(400)~=0 then
			常规提示(id,"#Y"..玩家数据[临时id].角色.名称.."正在进行副本任务，无法领取新的副本")
			return
		end
	end
	副本数据.新手副本.进行[id]={进程=1}
	local 任务id,ZU=取唯一任务(400,id)
	任务数据[任务id]={
		id=任务id,
		起始=os.time(),
		结束=7200,
		玩家id=0,
		DWZ=ZU,
		销毁=true,
		副本重置=true,
		队伍组=ZU,
		副本id=id,
		类型=400
	}
	任务处理类:添加队伍任务(id,任务id,"#Y你开启了初出茅庐副本")
	刷新任务400(id)
end

function 刷新任务400(id)
	local id = 任务处理类:取副本id(id,400)
	if 副本数据.新手副本.进行[id]==nil then
		return
	end
	玩家数据[id].zhandou=0
	local 队伍id=玩家数据[id].队伍
	if 副本数据.新手副本.进行[id].进程==1 then
		local 地图=8100 --长安城
		local 任务id=id.."_401_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="GM",
			模型="龙太子",
			锦衣="萌龙咆哮",
			武器="飞龙在天",
			x=403,
			y=68,
			方向=0,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=401
		}
		地图处理类:添加单位(任务id)
		local 任务id=id.."_401_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="GM小迷弟",
			模型="巨魔王",
			锦衣="萌龙咆哮",
			武器="护法灭魔",
			x=411,
			y=67,
			方向=1,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=401
		}
		地图处理类:添加单位(任务id)
		local 任务id=id.."_401_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="GM小迷弟",
			模型="巨魔王",
			锦衣="萌龙咆哮",
			武器="护法灭魔",
			x=399,
			y=73,
			方向=1,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=401
		}
		地图处理类:添加单位(任务id)
		local 任务id=id.."_401_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="GM小迷妹",
			模型="鬼潇潇",
			锦衣="萌龙咆哮",
			武器="枕霞",
			x=406,
			y=75,
			方向=0,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=401
		}
		地图处理类:添加单位(任务id)
		local 任务id=id.."_401_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="GM小迷妹",
			模型="鬼潇潇",
			锦衣="萌龙咆哮",
			武器="枕霞",
			x=411,
			y=72,
			方向=0,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=401
		}
		地图处理类:添加单位(任务id)
		-- local 任务id=id.."_401_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		-- 任务数据[任务id]={
		-- 	id=任务id,
		-- 	起始=os.time(),
		-- 	结束=3600,
		-- 	销毁=true,
		-- 	副本重置=true,
		-- 	玩家id=0,
		-- 	队伍组={},
		-- 	名称="精锐小迷弟",
		-- 	模型="虎头怪坐下",
		-- 	-- 锦衣="萌龙咆哮",
		-- 	-- 武器="护法灭魔",
		-- 	x=415,
		-- 	y=78,
		-- 	方向=2,
		-- 	副本id=id,
		-- 	地图编号=地图,
		-- 	地图名称=取地图名称(地图),
		-- 	类型=401
		-- }
		-- 地图处理类:添加单位(任务id)
		地图处理类:跳转地图(id,8100,358,35) --跳转到动画地图
		--local text1={{"欢迎来到梦幻西游","初出茅庐副本开启"}}
		for n=1,#队伍数据[队伍id].成员数据 do
			local 临时id=队伍数据[队伍id].成员数据[n]
			--发送数据(玩家数据[临时id].连接id,6557,{文本=text1,类型="新手副本序",字体=nil,音乐=nil,背景=nil,横排显示=nil,动画调用=nil})
		end
	elseif 副本数据.新手副本.进行[id].进程==2 then
		local 地图=8100 --长安城
		local 任务id=id.."_402_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="百晓星君",
			模型="女人_万圣公主",
			x=222,
			y=108,
			方向=0,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=402
		}
		地图处理类:添加单位(任务id)
		--local text1={"此副本收益颇高!","每日必刷!"}
		for n=1,#队伍数据[队伍id].成员数据 do
			local 临时id=队伍数据[队伍id].成员数据[n]
			--发送数据(玩家数据[临时id].连接id,6557,{文本=text1,类型="新手副本1",字体=nil,音乐=nil,背景=nil,横排显示=true,动画调用=nil})
		end
	elseif 副本数据.新手副本.进行[id].进程==3 then
			任务处理类:删除副本单位(id,400,401)
			任务处理类:删除副本单位(id,400,402)
			local 任务id=id.."_403_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			local 地图=8100 --长安城
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="兰虎",
				模型="男人_兰虎",
				销毁=true,
				副本重置=true,
				x=417,
				y=173,
				方向=0,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=403
			}
			地图处理类:添加单位(任务id)
	elseif 副本数据.新手副本.进行[id].进程==4 then
		任务处理类:删除副本单位(id,400,403)
			local 地图=8100 --长安城
			local 任务id=id.."_404_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="酒店老板",
				模型="男人_酒店老板",
				销毁=true,
				副本重置=true,
				x=458,
				y=117,
				方向=4,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=404
			}
			地图处理类:添加单位(任务id)
			local 任务id=id.."_404_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="店小二",
				模型="男人_店小二",
				销毁=true,
				副本重置=true,
				x=466,
				y=123,
				方向=4,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=404
			}
			地图处理类:添加单位(任务id)
	elseif 副本数据.新手副本.进行[id].进程==5 then
		任务处理类:删除副本单位(id,400,404)
			local 地图=8100
			local 任务id=id.."_405_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="郑镖头",
				模型="男人_镖头",
				销毁=true,
				副本重置=true,
				x=524,
				y=130,
				方向=0,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=405
			}
			地图处理类:添加单位(任务id)
			-- local text1 = {"号外号外！梦幻西游真好玩！","我还要充钱。"}
			-- for n=1,#队伍数据[队伍id].成员数据 do
			-- 	local 临时id=队伍数据[队伍id].成员数据[n]
			-- 	发送数据(玩家数据[临时id].连接id,6557,{文本=text1,类型="新手副本2",字体=nil,音乐=nil,背景=nil,横排显示=true,动画调用=nil})
			-- end
	elseif 副本数据.新手副本.进行[id].进程==6 then
		任务处理类:删除副本单位(id,400,405)
			local 地图=8100
			local 任务id=id.."_406_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="钟馗",
				模型="男人_钟馗",
				销毁=true,
				副本重置=true,
				x=302,
				y=91,
				方向=0,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=406
			}
			地图处理类:添加单位(任务id)
			--地图处理类:跳转地图(id,8100,71,27)
			-- local text1 = {"号外号外！梦幻西游真好玩！","我还要充钱。"}
			-- for n=1,#队伍数据[队伍id].成员数据 do
			-- 	local 临时id=队伍数据[队伍id].成员数据[n]
			-- 	发送数据(玩家数据[临时id].连接id,6557,{文本=text1,类型="新手副本2",字体=nil,音乐=nil,背景=nil,横排显示=true,动画调用=nil})
			-- end
	elseif 副本数据.新手副本.进行[id].进程==7 then

			任务处理类:删除副本单位(id,400,406)
			local 地图=8100
			local 任务id=id.."_407_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="御林军左统领",
				模型="男人_马副将",
				销毁=true,
				副本重置=true,
				x=102,
				y=52,
				方向=0,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=407
			}
			地图处理类:添加单位(任务id)
			--地图处理类:跳转地图(id,8100,71,27)
			-- local text1 = {"号外号外！梦幻西游真好玩！","我还要充钱。"}
			-- for n=1,#队伍数据[队伍id].成员数据 do
			-- 	local 临时id=队伍数据[队伍id].成员数据[n]
			-- 	发送数据(玩家数据[临时id].连接id,6557,{文本=text1,类型="新手副本2",字体=nil,音乐=nil,背景=nil,横排显示=true,动画调用=nil})
			-- end
	elseif 副本数据.新手副本.进行[id].进程==8 then
			任务处理类:删除副本单位(id,400,407)
			local 地图=8101
			local 任务id=id.."_408_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="幕后贼首",
				模型="雨师",
				销毁=true,
				副本重置=true,
				x=71,
				y=70,
				方向=0,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=408
			}
			地图处理类:添加单位(任务id)
			地图处理类:跳转地图(id,8101,22,10)
	elseif 副本数据.新手副本.进行[id].进程==9 then
		任务处理类:删除副本单位(id,400,408)
			local 地图=8102
		            local 任务id=id.."_409_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				销毁=true,
				副本重置=true,
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="琵琶胡姬",
				模型="进阶蝎子精",
				x=131,
				y=44,
				方向=1,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=409
			}
			地图处理类:添加单位(任务id)
			地图处理类:跳转地图(id,8102,139,135)
			-- local text1 = {"号外号外！梦幻西游真好玩！","我还要充钱。"}
			-- for n=1,#队伍数据[队伍id].成员数据 do
			-- 	local 临时id=队伍数据[队伍id].成员数据[n]
			-- 	发送数据(玩家数据[临时id].连接id,6557,{文本=text1,类型="新手副本3",字体=nil,音乐=nil,背景=nil,横排显示=true,动画=nil})
			-- end
	elseif 副本数据.新手副本.进行[id].进程==10 then
		任务处理类:删除副本单位(id,400,409)
			local 地图=8102
		            local 任务id=id.."_410_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				销毁=true,
				副本重置=true,
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="王福来",
				模型="男人_酒店老板",
				x=184,
				y=125,
				方向=1,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=410
			}
			地图处理类:添加单位(任务id)
	elseif 副本数据.新手副本.进行[id].进程==11 then
		任务处理类:删除副本单位(id,400,410)
		local 任务id=玩家数据[id].角色:取任务(400)
		--local text1 = {"梦幻西游真好玩！","我还要充钱。","初出茅庐副本（完）"}
		for n=1,#队伍数据[队伍id].成员数据 do
			local 临时id=队伍数据[队伍id].成员数据[n]
			local 地图=8102
			玩家数据[临时id].角色:取消任务(任务id)
			副本数据.新手副本.完成[临时id]=true
			抽奖处理:转盘抽奖(id)
			地图处理类:跳转地图(id,1044,96,76)
			--发送数据(玩家数据[临时id].连接id,6557,{文本=text1,类型="新手副本结束",字体=nil,音乐=nil,背景=nil,横排显示=true,动画=nil})
		end
	end
end

function 副本_新手副本:怪物对话内容(id,类型,标识,地图)
	local 对话数据={}
	对话数据.模型=任务数据[标识].模型
	对话数据.名称=任务数据[标识].名称
	local 副本id = 任务处理类:取副本id(id,400)
	-- print(副本id)
	if 副本id == 0 or 副本id ~= id  then
		对话数据.对话="只有创建副本的队长才能和我对话"
		return 对话数据
	end
	if 副本数据.新手副本.进行[副本id].进程==1 then --走的这里啊
		if 对话数据.名称=="GM" then
			对话数据.对话 = "欢迎来到梦幻西游"
			对话数据.选项 = {"我来了","有些尴尬。。"}
		end
	elseif 副本数据.新手副本.进行[副本id].进程==2 then
		if 对话数据.名称=="百晓星君" then
			对话数据.对话 = "我勒个去打不过！来帮忙#4。"
			对话数据.选项 = {"帮我除了这些烦人的小妖","有些尴尬。。"}
		end
	elseif 副本数据.新手副本.进行[副本id].进程==3 then
			if 对话数据.名称=="兰虎" then
				对话数据.对话 = "小趴菜"
				对话数据.选项 = {"小子来切磋一下","这....好尴尬啊"}
			end
	elseif 副本数据.新手副本.进行[副本id].进程==4 then
			if 对话数据.名称=="酒店老板" then
				对话数据.对话 = "少侠你可来了#52（不等你开口，酒店老板就抢先说道）..我们的铺子，仓库都被查封了。如今官服咬定我们家出售的“精锐源码”有问题，你看，旁边的郑表头还说要把我娘子抓起来呢#52"
				对话数据.选项 = {"先拦下郑镖头，再询问事情真相","活该抓你"}
			elseif 对话数据.名称=="店小二" then
				对话数据.对话 = "我们家不可能卖假货啊#15这些货都是老板搞来的"
				对话数据.选项 = {"。。。。"}
			end
	elseif 副本数据.新手副本.进行[副本id].进程==5 then
			if 对话数据.名称=="郑镖头" then
				对话数据.对话 = "你小子想干嘛？#24不要妨碍公务"
				对话数据.选项 = {"小人先得罪了","没事大爷，我就看看"}
			end
	elseif 副本数据.新手副本.进行[副本id].进程==6 then
			if 对话数据.名称=="钟馗" then
				对话数据.对话 = "我们家不可能卖假货啊#15这些货都是夫君搞来的。怎么办呢，爹爹也被抓了。"
				对话数据.选项 = {"那我就帮崔小姐调查此事的来龙去脉吧","你活该"}
			end
	elseif 副本数据.新手副本.进行[副本id].进程==7 then
			if 对话数据.名称=="御林军左统领" then
				对话数据.对话 = "什么新手副本啊，不过是一些水底的凡物被施了一些小手段，短时间内会让人感觉精神百倍，长久下来，身体会慢慢中毒，腐烂！意识也会模糊，所以服用之人才会看谁都像妖怪！#99应该是崔家那入赘女婿搞的鬼，方才看到他鬼鬼祟祟的在不远处，你去问问他吧。"
				对话数据.选项 = {"多谢老大爷了"}
			end
	elseif 副本数据.新手副本.进行[副本id].进程==8 then
			if 对话数据.名称=="幕后贼首" then
				对话数据.对话 = "如今怕是你也知道新手副本的事情了，那便不能留你了！#4"
				对话数据.选项 = {"先将他擒下再说","看起来功夫很高的样子,我先溜了"}
			end
	elseif 副本数据.新手副本.进行[副本id].进程==9 then
			if 对话数据.名称=="琵琶胡姬" then
				对话数据.对话 = "你是何人，为何闯入沧浪墟！"
				对话数据.选项 = {"只能先击败他了","没事，我就闲逛逛"}
			end
	elseif 副本数据.新手副本.进行[副本id].进程==10 then
			if 对话数据.名称=="王福来" then
				对话数据.对话 = "没想到你竟能追到我族禁地，也罢，只要杀了你就再没人打扰我了，我就可以向崔家复仇了！"
				对话数据.选项 = {"那就手底下见真章吧","我先溜了"}
			end
	elseif 副本数据.新手副本.进行[副本id].进程==11 then
			if 对话数据.名称=="慕容先生" then
				对话数据.对话 = "没想到你竟能追到我族禁地，也罢，只要杀了你就再没人打扰我了，我就可以向崔家复仇了！"
				对话数据.选项 = {"只能回去和崔家如实说了","我先溜了"}
			end
	end
	return 对话数据
end

function 副本_新手副本:对话事件处理(id,名称,事件,类型)
	local 副本id = 任务处理类:取副本id(id,400)
	if 类型 == 401 and 名称=="GM" and  事件=="我来了" then
		副本数据.新手副本.进行[副本id] = {进程=2}
		刷新队伍任务追踪(id)
		刷新任务400(副本id)
	elseif 类型 == 402 and 名称=="百晓星君" and  事件=="帮我除了这些烦人的小妖" then
		if 副本数据.新手副本.进行[副本id].进程==2 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,102000,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 403 and 名称=="兰虎" and  事件=="小子来切磋一下" then
		if 副本数据.新手副本.进行[副本id].进程==3 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,102001,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 404 and 名称=="酒店老板" and  事件=="先拦下郑镖头，再询问事情真相" then
		if 副本数据.新手副本.进行[副本id].进程==4 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,102002,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 405 and 名称=="郑镖头" and  事件=="小人先得罪了" then
		if 副本数据.新手副本.进行[副本id].进程==5 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,102003,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 406 and 名称=="钟馗" and  事件=="那我就帮崔小姐调查此事的来龙去脉吧" then
		if 副本数据.新手副本.进行[副本id].进程==6 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,102004,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 407 and 名称=="御林军左统领" and  事件=="多谢老大爷了" then
		if 副本数据.新手副本.进行[副本id].进程==7 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,102005,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 408 and 名称=="幕后贼首" and  事件=="先将他擒下再说" then
		if 副本数据.新手副本.进行[副本id].进程==8 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,102006,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 409 and 名称=="琵琶胡姬" and  事件=="只能先击败他了" then
		if 副本数据.新手副本.进行[副本id].进程==9 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,102007,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 410 and 名称=="王福来" and  事件=="那就手底下见真章吧" then
		if 副本数据.新手副本.进行[副本id].进程==10 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,102008,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 411 and 名称=="慕容先生" and  事件=="只能回去和崔家如实说了" then
		if 副本数据.新手副本.进行[副本id].进程==11 then
			副本数据.新手副本.进行[副本id] = {进程=12}
			刷新队伍任务追踪(id)
			刷新任务400(副本id)
		end
	end
end

function 副本_新手副本:战斗胜利处理(id组,战斗类型,任务id)
	local id = id组[1]
	local 副本id = 任务处理类:取副本id(id,400)
	if 副本id == 0 then return end
	if 战斗类型 == 102000 then
		副本数据.新手副本.进行[副本id]={进程=3}
		任务数据[任务id].zhandou = nil
		刷新任务400(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 102001 then
		副本数据.新手副本.进行[副本id]={进程=4}
		任务数据[任务id].zhandou = nil
		刷新任务400(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 102002 then
		副本数据.新手副本.进行[副本id]={进程=5}
		任务数据[任务id].zhandou = nil
		刷新任务400(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 102003 then
		副本数据.新手副本.进行[副本id]={进程=6}
		任务数据[任务id].zhandou = nil
		刷新任务400(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 102004 then
		副本数据.新手副本.进行[副本id]={进程=7}
		任务数据[任务id].zhandou = nil
		刷新任务400(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 102005 then
		副本数据.新手副本.进行[副本id]={进程=8}
		任务数据[任务id].zhandou = nil
		刷新任务400(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 102006 then
		副本数据.新手副本.进行[副本id]={进程=9}
		任务数据[任务id].zhandou = nil
		刷新任务400(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 102007 then
		副本数据.新手副本.进行[副本id]={进程=10}
		任务数据[任务id].zhandou = nil
		刷新任务400(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 102008 then
		副本数据.新手副本.进行[副本id]={进程=11}
		任务数据[任务id].zhandou = nil
		刷新任务400(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	end
end

function 副本_新手副本:完成奖励(id组,战斗类型,倍率)
	local 倍率=倍率 or 1
	if 战斗类型 == 102000 then
		local stid=取随机数(1,#id组)
		stid=id组[stid]
		 --    local 链接={提示=format("#S(初出茅庐)#Y梦幻西游为新手玩家打造的副本，#G/%s#Y少侠在初出茅庐中跌跌撞撞，竟然得到了珍贵的",玩家数据[stid].角色.名称),频道="xt",结尾="#Y！"}
			-- 玩家数据[stid].道具:给予书铁(stid,{10,10},nil,链接)
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(4100,4500)
			local 银子=等级*取随机数(800,820)+9000
			玩家数据[cyid].角色:添加经验(经验*倍率,"新手副本兰虎")
			玩家数据[cyid].角色:添加银子(银子*倍率,"新手副本兰虎",1)
			玩家数据[cyid].角色:添加副本积分(20)
			if 取随机数()<=20 then
				local 奖励参数=取随机数(1,100)
				local 链接={提示=format("#S(初出茅庐)#Y梦幻西游为新手玩家打造的副本，#G/%s#Y少侠在初出茅庐中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
        				if 奖励参数<=10 then
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="超级金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=20 then
					local 名称="召唤兽内丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=35 then
					local 名称="神兽涎"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称="仙露小丸子"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=60 then
					local 名称="符石卷轴"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				else
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end--百晓星君
	elseif 战斗类型 == 102001 then
		local stid=取随机数(1,#id组)
		stid=id组[stid]
		 --    local 链接={提示=format("#S(初出茅庐)#Y梦幻西游为新手玩家打造的副本，#G/%s#Y少侠在初出茅庐中跌跌撞撞，竟然得到了珍贵的",玩家数据[stid].角色.名称),频道="xt",结尾="#Y！"}
			-- 玩家数据[stid].道具:给予超链接书铁(stid,{10,10},nil,链接)
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(4000,4100)
			local 银子=等级*取随机数(110,120)+8000
			玩家数据[cyid].角色:添加经验(经验*倍率,"新手副本郑镖头")
			玩家数据[cyid].角色:添加银子(银子*倍率,"新手副本郑镖头",1)
			玩家数据[cyid].角色:添加副本积分(20)
			if 取随机数()<=26 then
				local 奖励参数=取随机数(1,100)
				local 链接={提示=format("#S(初出茅庐)#Y梦幻西游为新手玩家打造的副本，#G/%s#Y少侠在初出茅庐中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
       					if 奖励参数<=10 then
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="超级金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=20 then
					local 名称="召唤兽内丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="神兽涎"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称="仙露小丸子"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=60 then
					local 名称="符石卷轴"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				else
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end--兰虎
	elseif 战斗类型 == 102002 then
		local stid=取随机数(1,#id组)
		stid=id组[stid]
		 --    local 链接={提示=format("#S(初出茅庐)#Y梦幻西游为新手玩家打造的副本，#G/%s#Y少侠在初出茅庐中跌跌撞撞，竟然得到了珍贵的",玩家数据[stid].角色.名称),频道="xt",结尾="#Y！"}
			-- 玩家数据[stid].道具:给予超链接书铁(stid,{10,10},nil,链接)
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(4000,4100)
			local 银子=等级*取随机数(110,120)+8000
			玩家数据[cyid].角色:添加经验(经验*倍率,"新手副本赵姨娘")
			玩家数据[cyid].角色:添加银子(银子*倍率,"新手副本赵姨娘",1)
			玩家数据[cyid].角色:添加副本积分(20)
			if 取随机数()<=26 then
				local 奖励参数=取随机数(1,100)
				local 链接={提示=format("#S(初出茅庐)#Y梦幻西游为新手玩家打造的副本，#G/%s#Y少侠在初出茅庐中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
        				if 奖励参数<=10 then
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="超级金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=20 then
					local 名称="召唤兽内丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="神兽涎"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称="仙露小丸子"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=60 then
					local 名称="符石卷轴"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				elseif 奖励参数<=81 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end--郑镖头
	elseif 战斗类型 == 102003 then
		local stid=取随机数(1,#id组)
		stid=id组[stid]
		 --    local 链接={提示=format("#S(初出茅庐)#Y梦幻西游为新手玩家打造的副本，#G/%s#Y少侠在初出茅庐中跌跌撞撞，竟然得到了珍贵的",玩家数据[stid].角色.名称),频道="xt",结尾="#Y！"}
			-- 玩家数据[stid].道具:给予超链接书铁(stid,{10,10},nil,链接)
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(4000,4100)
			local 银子=等级*取随机数(120,130)+10000
			玩家数据[cyid].角色:添加经验(经验*倍率,"新手副本酒店老板")
			玩家数据[cyid].角色:添加银子(银子*倍率,"新手副本酒店老板",1)
			玩家数据[cyid].角色:添加副本积分(20)
			if 取随机数()<=26 then
				local 奖励参数=取随机数(1,100)
				local 链接={提示=format("#S(初出茅庐)#Y梦幻西游为新手玩家打造的副本，#G/%s#Y少侠在初出茅庐中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
        				if 奖励参数<=10 then
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="超级金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=20 then
					local 名称="召唤兽内丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="神兽涎"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称="仙露小丸子"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=60 then
					local 名称="符石卷轴"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				elseif 奖励参数<=81 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end
	elseif 战斗类型 == 102004 then
		local stid=取随机数(1,#id组)
		stid=id组[stid]
		 --    local 链接={提示=format("#S(初出茅庐)#Y梦幻西游为新手玩家打造的副本，#G/%s#Y少侠在初出茅庐中跌跌撞撞，竟然得到了珍贵的",玩家数据[stid].角色.名称),频道="xt",结尾="#Y！"}
			-- 玩家数据[stid].道具:给予超链接书铁(stid,{10,10},nil,链接)
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(4000,4100)
			local 银子=等级*取随机数(110,120)+10000
			玩家数据[cyid].角色:添加经验(经验*倍率,"新手副本夜影迷踪")
			玩家数据[cyid].角色:添加银子(银子*倍率,"新手副本夜影迷踪",1)
			玩家数据[cyid].角色:添加副本积分(20)
			if 取随机数()<=26 then
				local 奖励参数=取随机数(1,100)
				local 链接={提示=format("#S(初出茅庐)#Y梦幻西游为新手玩家打造的副本，#G/%s#Y少侠在初出茅庐中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
        				if 奖励参数<=10 then
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="超级金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=20 then
					local 名称="召唤兽内丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				-- elseif 奖励参数<=26 then
				-- 	local 名称="高级魔兽要诀"
				-- 	玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="神兽涎"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称="仙露小丸子"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=60 then
					local 名称="符石卷轴"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				elseif 奖励参数<=81 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end
	elseif 战斗类型 == 102005 then
		local stid=取随机数(1,#id组)
		stid=id组[stid]
		 --    local 链接={提示=format("#S(初出茅庐)#Y梦幻西游为新手玩家打造的副本，#G/%s#Y少侠在初出茅庐中跌跌撞撞，竟然得到了珍贵的",玩家数据[stid].角色.名称),频道="xt",结尾="#Y！"}
			-- 玩家数据[stid].道具:给予超链接书铁(stid,{10,10},nil,链接)
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(4000,4100)
			local 银子=等级*取随机数(120,130)+10000
			玩家数据[cyid].角色:添加经验(经验*倍率,"新手副本完成奖励")
			玩家数据[cyid].角色:添加银子(银子*倍率,"新手副本完成奖励",1)
    			玩家数据[cyid].角色:添加副本积分(20)
			if 取随机数()<=50 then
				local 奖励参数=取随机数(1,100)
				 链接={提示=format("#S(初出茅庐)#Y梦幻西游为新手玩家打造的副本，#G/%s#Y少侠在初出茅庐中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
        				if 奖励参数<=10 then
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="超级金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=20 then
					local 名称="高级召唤兽内丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="神兽涎"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称="仙露小丸子"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=60 then
					local 名称="符石卷轴"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				elseif 奖励参数<=81 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="未激活的星石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				end
			end
		end
	elseif 战斗类型 == 102006 then
		local stid=取随机数(1,#id组)
		stid=id组[stid]
		 --    local 链接={提示=format("#S(初出茅庐)#Y梦幻西游为新手玩家打造的副本，#G/%s#Y少侠在初出茅庐中跌跌撞撞，竟然得到了珍贵的",玩家数据[stid].角色.名称),频道="xt",结尾="#Y！"}
			-- 玩家数据[stid].道具:给予超链接书铁(stid,{10,10},nil,链接)
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(4000,4100)
			local 银子=等级*取随机数(120,130)+10000
			玩家数据[cyid].角色:添加经验(经验*倍率,"新手副本完成奖励")
			玩家数据[cyid].角色:添加银子(银子*倍率,"新手副本完成奖励",1)
    			玩家数据[cyid].角色:添加副本积分(20)
			if 取随机数()<=50 then
				local 奖励参数=取随机数(1,100)
				链接={提示=format("#S(初出茅庐)#Y梦幻西游为新手玩家打造的副本，#G/%s#Y少侠在初出茅庐中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
        				if 奖励参数<=10 then
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="超级金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=20 then
					local 名称="高级召唤兽内丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=28 then
					local 名称="高级魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="神兽涎"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称="仙露小丸子"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=55 then
					local 名称="九转金丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,100,链接)
				elseif 奖励参数<=60 then
					local 名称="符石卷轴"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				elseif 奖励参数<=81 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="未激活的星石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				end
			end
		end
	elseif 战斗类型 == 102007 then
		local stid=取随机数(1,#id组)
		stid=id组[stid]
		 --    local 链接={提示=format("#S(初出茅庐)#Y梦幻西游为新手玩家打造的副本，#G/%s#Y少侠在初出茅庐中跌跌撞撞，竟然得到了珍贵的",玩家数据[stid].角色.名称),频道="xt",结尾="#Y！"}
			-- 玩家数据[stid].道具:给予超链接书铁(stid,{10,10},nil,链接)
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(4000,4100)
			local 银子=等级*取随机数(120,130)+10000
			玩家数据[cyid].角色:添加经验(经验*倍率,"新手副本完成奖励")
			玩家数据[cyid].角色:添加银子(银子*倍率,"新手副本完成奖励",1)
    			玩家数据[cyid].角色:添加副本积分(20)
			if 取随机数()<=50 then
				local 奖励参数=取随机数(1,100)
				链接={提示=format("#S(初出茅庐)#Y梦幻西游为新手玩家打造的副本，#G/%s#Y少侠在初出茅庐中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
        				if 奖励参数<=10 then
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="超级金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=20 then
					local 名称="高级召唤兽内丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="神兽涎"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称="仙露小丸子"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=60 then
					local 名称="符石卷轴"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				elseif 奖励参数<=81 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="未激活的星石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				end
			end
		end
	elseif 战斗类型 == 102008 then
		local stid=取随机数(1,#id组)
		stid=id组[stid]
		 --    local 链接={提示=format("#S(初出茅庐)#Y梦幻西游为新手玩家打造的副本，#G/%s#Y少侠在初出茅庐中跌跌撞撞，竟然得到了珍贵的",玩家数据[stid].角色.名称),频道="xt",结尾="#Y！"}
			-- 玩家数据[stid].道具:给予超链接书铁(stid,{10,10},nil,链接)
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(4000,4100)
			local 银子=等级*取随机数(120,130)+10000
			玩家数据[cyid].角色:添加经验(经验*倍率,"新手副本完成奖励")
			玩家数据[cyid].角色:添加银子(银子*倍率,"新手副本完成奖励",1)
    			玩家数据[cyid].角色:添加副本积分(200)
			if 取随机数()<=50 then
				local 奖励参数=取随机数(1,100)
				链接={提示=format("#S(初出茅庐)#Y梦幻西游为新手玩家打造的副本，#G/%s#Y少侠在初出茅庐中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
        				if 奖励参数<=10 then
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="超级金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=20 then
					local 名称="高级召唤兽内丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=28 then
					local 名称="高级魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="神兽涎"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称="仙露小丸子"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=60 then
					local 名称="九转金丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				elseif 奖励参数<=81 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="未激活的星石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				end
			end
		end
	end
end

function 副本_新手副本:任务说明(玩家id,任务id)
	local 说明 = {}
	local 副本id=任务数据[任务id].副本id
	if 副本数据.新手副本.进行[副本id]==nil then
		说明={"初出茅庐","#L您的副本已经完成"}
	else
		local 进程=副本数据.新手副本.进行[副本id].进程
		       if 进程==1 then
			说明={"初出茅庐",format("#L和".."#Y/qqq|GM*8100*临时npc*403*68/GM".."#L打声招呼吧。(剩余时间%s分钟)",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==2 then
			说明={"初出茅庐",format("#L好像".."#Y/qqq|百晓星君*8100*临时npc*222*108/百晓星君".."#L有什么需要帮助的，去看看。(剩余时间%s分钟)",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==3 then
			说明={"初出茅庐",format("#L另一侧，".."#Y/qqq|兰虎*8100*临时npc*417*173/兰虎".."#L好像有什么事叫你过去。(剩余时间%s分钟)",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==4 then
			说明={"初出茅庐",format("#L询问，".."#Y/qqq|酒店老板*8100*临时npc*458*117/酒店老板".."#L到底怎么回事。(剩余时间%s分钟)",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==5 then
			说明={"初出茅庐",format("#L没办法，只有先拦住，".."#Y/qqq|郑镖头*8100*临时npc*524*130/郑镖头".."#L然后再问问钟馗怎么回事了。(剩余时间%s分钟)",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==6 then
			说明={"初出茅庐",format("#L郑镖头被你打跑了，先问问".."#Y/qqq|钟馗*8100*临时npc*302*91/钟馗".."#L怎么回事吧。(剩余时间%s分钟)",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==7 then
			说明={"初出茅庐",format("#L只能先问问城里的人了，一旁的".."#Y/qqq|御林军左统领*8100*临时npc*102*52/御林军左统领".."#L好像知道些什么。(剩余时间%s分钟)",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==8 then
			说明={"初出茅庐",format("#L先去追上".."#Y/qqq|幕后贼首*8101*临时npc*71*70/幕后贼首".."#L,问问怎么回事。(剩余时间%s分钟)",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==9 then
			说明={"初出茅庐",format("#L先去追上".."#Y/qqq|琵琶胡姬*8102*临时npc*131*44/琵琶胡姬".."#L,问问怎么回事。(剩余时间%s分钟)",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==10 then
			说明={"初出茅庐",format("#L原来".."#Y/qqq|王福来*8102*临时npc*184*125/王福来".."#L就在前面，快去抓住他。(剩余时间%s分钟)",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==11 then
			说明={"初出茅庐",format("#L新手副本完。(剩余时间%s分钟)",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==12 then
			说明={"初出茅庐",format("#L新手副本完。(剩余时间%s分钟)",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		end
	end
	return 说明
end


function 副本_新手副本:扫荡(队长id)
    if not 玩家数据[队长id].道具:判定背包道具(队长id,"扫荡卡",1) then
       	常规提示(队长id,"#Y/扫荡副本需消耗1个扫荡卡")
    	return
    end
    玩家数据[队长id].道具:消耗背包道具(玩家数据[队长id].连接id,队长id,"扫荡卡",1)

    local 倍率=0.8
    local 最低等级 = 30          -- 原副本等级要求
    local 非调试最小人数 = 5     -- 非调试模式最低人数
    local 所有战斗类型 = {102000,102001,102002,102003,102004,102005,102006,102007,102008} -- 全阶段战斗类型
    if not 玩家数据[队长id] or 玩家数据[队长id].队长 ~= true then
        常规提示(队长id,"#Y请先组建队伍！"); return
    end
    local 队伍id = 玩家数据[队长id].队伍
    if 队伍id ==0 then
        常规提示(队长id,"#Y请先组建队伍！"); return
    end
    local 队员列表 = 队伍数据[队伍id].成员数据
    if #队员列表 < 非调试最小人数 and 调试模式 == false then
        常规提示(队长id,"#Y非调试模式需5人队伍！"); return
    end
    for _,队员id in ipairs(队员列表) do
        if 玩家数据[队员id] and 玩家数据[队员id].角色 and 玩家数据[队员id].角色.等级 < 最低等级 then
            常规提示(队长id,"#Y"..(玩家数据[队员id].角色.名称 or "未知玩家").."等级不足"..最低等级.."级！"); return
        end
        if 副本数据.新手副本.完成[队员id] then
            常规提示(队长id,"#Y"..(玩家数据[队员id].角色.名称 or "未知玩家").."今日已完成该副本！"); return
        end
        if 玩家数据[队员id] and 玩家数据[队员id].角色 and 玩家数据[队员id].角色:取任务(400) ~= 0 then
            常规提示(队长id,"#Y"..(玩家数据[队员id].角色.名称 or "未知玩家").."正在其他新手副本中！"); return
        end
    end
    for _, 战斗类型 in ipairs (所有战斗类型) do
        self:完成奖励(队员列表, 战斗类型,倍率)
    end
    for _,队员id in ipairs(队员列表) do
        if 玩家数据[队员id] and 玩家数据[队员id].角色 then
            副本数据.新手副本.完成[队员id] = true
            if 玩家数据[队员id] and 玩家数据[队员id].连接id then
                  发送数据(玩家数据[队员id].连接id, 550.3,{新手副本=true})
            end
            常规提示(队员id,"#Y新手副本（初出茅庐）已直接完成，所有奖励已发放！")
        end
    end
end
return 副本_新手副本
