local 副本_红孩儿 = class()

Q_蛛丝 = {{83,16,"蜘蛛精","蛛丝"},{85,14,"蜘蛛精","蛛丝"},{88,12,"蜘蛛精","蛛丝"},{91,11,"蜘蛛精","蛛丝"},{50,9,"蜘蛛精","蛛丝"},
{121,33,"蜘蛛精","蛛丝"},{125,34,"蜘蛛精","蛛丝"},{128,36,"蜘蛛精","蛛丝"},
{146,56,"蜘蛛精","蛛丝"},{149,55,"蜘蛛精","蛛丝"},{152,53,"蜘蛛精","蛛丝"},
{98,88,"蜘蛛精","蛛丝"},{98,90,"蜘蛛精","蛛丝"},{99,92,"蜘蛛精","蛛丝"},
{146,97,"蜘蛛精","蛛丝"},{149,97,"蜘蛛精","蛛丝"},{152,97,"蜘蛛精","蛛丝"},{156,96,"蜘蛛精","蛛丝"},
{146,116,"蜘蛛精","蛛丝"},{150,116,"蜘蛛精","蛛丝"},{153,116,"蜘蛛精","蛛丝"},{156,116,"蜘蛛精","蛛丝"},
}
Q_刀阵 = {{47,41,"天将","天魁"},{50,38,"天兵","天罡"},{54,34,"天将","天机"},{58,31,"天兵","天闲"},{50,44,"天将","天勇"},
{54,41,"天将","天雄"},{57,38,"天兵","天猛"},{62,35,"天将","天威"},
{68,37,"天将","天英"},{64,40,"天兵","天贵"},{60,42,"天将","天富"},
{56,45,"天将","天满"},{61,48,"天兵","天孤"},{66,45,"天将","天微"},
{71,43,"天将","天剑"},{68,47,"天兵","天罪"},{74,46,"天将","天暴"},{79,44,"天兵","天慧"},
}

function 副本_红孩儿:初始化()
	地图处理类.地图数据[7026]={npc={},单位={},传送圈={}}
	地图处理类.地图玩家[7026]={}
	地图处理类.地图坐标[7026]=地图处理类.地图坐标[1210]
	地图处理类.地图单位[7026]={}
	地图处理类.单位编号[7026]=1000

	地图处理类.地图数据[7027]={npc={},单位={},传送圈={}}
	地图处理类.地图玩家[7027]={}
	地图处理类.地图坐标[7027]=地图处理类.地图坐标[1197]
	地图处理类.地图单位[7027]={}
	地图处理类.单位编号[7027]=1000
end

function 设置任务760(id)
	local 副本等级 = 50
	local 人数=5
	if 调试模式 then
		人数=1
		end
	if 玩家数据[id].队伍==0 or 玩家数据[id].队长==false  then
		常规提示(id,"#Y/该任务必须组队完成且由队长领取")
		return
	elseif 取队伍人数(id)<人数 then
		常规提示(id,"#Y此副本要求队伍人数不低于5人")
		return
	elseif  取等级要求(id,副本等级)==false then
		常规提示(id,"#Y此副本要求角色等级不能低于"..副本等级.."级")
		return
	end
	local 队伍id=玩家数据[id].队伍
	for n=1,#队伍数据[队伍id].成员数据 do
		local 临时id=队伍数据[队伍id].成员数据[n]
		if 副本数据.红孩儿.完成[临时id]~=nil then
			常规提示(id,"#Y"..玩家数据[临时id].角色.名称.."本日已经完成过此副本了")
			return
		elseif 玩家数据[临时id].角色:取任务(740)~=0 then
			常规提示(id,"#Y"..玩家数据[临时id].角色.名称.."正在进行副本任务，无法领取新的副本")
			return
		end
	end
	副本数据.红孩儿.进行[id]={进程=1,数量=0}
	local 任务id=id.."_740_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999)
	任务数据[任务id]={
		副本名称="红孩儿",
		id=任务id,
		起始=os.time(),
		结束=7200,
		销毁=true,
		副本重置=true,
		玩家id=0,
		队伍组=table.loadstring(table.tostring(队伍数据[玩家数据[id].队伍].成员数据)),
		副本id=id,
		类型=740
	}
	任务处理类:添加队伍任务(id,任务id,"#Y你开启了红孩儿副本")
	GetUpMOB740(id)
end

function GetUpMOB740(id)
	local id = 任务处理类:取副本id(id,740)
	if 副本数据.红孩儿.进行[id]==nil then
		return
	end
	if 副本数据.红孩儿.进行[id].进程==1 then
		local 任务id=id.."_741_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		local 地图=7026
		任务数据[任务id]={
			副本名称="红孩儿",
			id=任务id,
			起始=os.time(),
			结束=7200,
			玩家id=0,
			队伍组={},
			销毁=true,
			副本重置=true,
			名称="红孩儿",
			模型="小魔头",
			x=178,
	      	y=106,
			方向=1,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=741
		}
		地图处理类:添加单位(任务id)
	elseif 副本数据.红孩儿.进行[id].进程==2 then
		副本数据.红孩儿.进行[id].五行车=0
 		副本数据.红孩儿.进行[id].聚水珠=0
		local 地图=7026
		local 任务id=id.."_743_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		local xy=地图处理类.地图坐标[地图]:取随机点()
		任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=7200,
        玩家id=id,
        队伍组={},
        名称="五行车",
        模型="进阶连弩车",
        事件="明雷活动",
        染色方案=114,
        染色组={[1]=1,[2]=0},
        x=167,
        y=115,
        方向=0,
        副本id=id,
        地图编号=地图,
        地图名称=取地图名称(地图),
        类型=743,
      }
		地图处理类:添加单位(任务id)
		local 任务id=id.."_744_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
	    local 地图=7026
	    local xy=地图处理类.地图坐标[地图]:取随机点()
	    任务数据[任务id]={
	      id=任务id,
	      起始=os.time(),
	      结束=7200,
	      玩家id=id,
	      队伍组={},
	      名称="布雨金龙",
	      模型="蛟龙",
	      变异=true,
	      x=163,
	      y=113,
	      方向=3,
	      副本id=id,
	      地图编号=地图,
	      地图名称=取地图名称(地图),
	      类型=744
	    }
	    地图处理类:添加单位(任务id)
	elseif 副本数据.红孩儿.进行[id].进程==3 then
		-- local 任务id=id.."_745_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
	 --    local 地图=7026
	 --    local xy=地图处理类.地图坐标[地图]:取随机点()
	 --    任务数据[任务id]={
	 --      id=任务id,
	 --      起始=os.time(),
	 --      结束=7200,
	 --      玩家id=id,
	 --      队伍组={},
	 --      名称="八戒",
	 --      模型="新猪八戒",
	 --      x=151,
	 --      y=103,
	 --      方向=0,
	 --      副本id=id,
	 --      地图编号=地图,
	 --      地图名称=取地图名称(地图),
	 --      类型=745
	 --    }
	 --    地图处理类:添加单位(任务id)
	    local 任务id=id.."_746_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
	    local 地图=7026
	    local xy=地图处理类.地图坐标[地图]:取随机点()
	    任务数据[任务id]={
	      id=任务id,
	      起始=os.time(),
	      结束=7200,
	      玩家id=id,
	      队伍组={},
	      名称="观音姐姐",
	      模型="观音姐姐",
	      x=152,
	      y=111,
	      方向=0,
	      副本id=id,
	      地图编号=地图,
	      地图名称=取地图名称(地图),
	      类型=746
	    }
	    地图处理类:添加单位(任务id)
	elseif 副本数据.红孩儿.进行[id].进程==4 then
		local 任务id=id.."_747_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
	    local 地图=7026
	    local xy=地图处理类.地图坐标[地图]:取随机点()
	    任务数据[任务id]={
	      id=任务id,
	      起始=os.time(),
	      结束=7200,
	      玩家id=id,
	      队伍组={},
	      名称="红孩儿",
	      模型="小魔头",
	      x=178,
	      y=106,
	      方向=0,
	      副本id=id,
	      地图编号=地图,
	      地图名称=取地图名称(地图),
	      类型=747
	    }
	    地图处理类:添加单位(任务id)
	elseif 副本数据.红孩儿.进行[id].进程==5 then
		local 任务id=id.."_751_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_" --C
	    local 地图=7026
	    local xy=地图处理类.地图坐标[地图]:取随机点()
	    任务数据[任务id]={
	      id=任务id,
	      起始=os.time(),
	      结束=7200,
	      玩家id=id,
	      队伍组={},
	      名称="红孩儿",
	      模型="小魔头",
	      x=178,
	      y=106,
	      方向=0,
	      副本id=id,
	      地图编号=地图,
	      地图名称=取地图名称(地图),
	      类型=751--C
	    }
	    地图处理类:添加单位(任务id)
	elseif 副本数据.红孩儿.进行[id].进程==6 then
	    local 任务id=id.."_752_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_" --C
	    local 地图=7026
	    local xy=地图处理类.地图坐标[地图]:取随机点()
	    任务数据[任务id]={
	      id=任务id,
	      起始=os.time(),
	      结束=7200,
	      玩家id=id,
	      队伍组={},
	      名称="木吒",
	      模型="男人_哪吒",
	      x=161,
	      y=113,
	      方向=3,
	      副本id=id,
	      地图编号=地图,
	      地图名称=取地图名称(地图),
	      类型=752 --C
	    }
	    地图处理类:添加单位(任务id)
	elseif 副本数据.红孩儿.进行[id].进程==7 then
    副本数据.红孩儿.进行[id].刀阵=0
    for i=1,18 do
			任务id=id.."_753_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"--C
			local 地图=7027
			local xy={x=Q_刀阵[i][1],y=Q_刀阵[i][2]}
			local 模型=Q_刀阵[i][3]
			local 名称=Q_刀阵[i][4]
			任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=7200,
			玩家id=id,
			队伍组={},
			名称=名称,
			模型=模型,
			事件="明雷活动",
			x=xy.x,
			y=xy.y,
			方向=方向,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=753,--C
			}
			地图处理类:添加单位(任务id)
    end
	elseif 副本数据.红孩儿.进行[id].进程==8 then
	    local 任务id=id.."_754_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"--C
	    local 地图=7027
	    local xy=地图处理类.地图坐标[地图]:取随机点()
	    任务数据[任务id]={
	      	id=任务id,
	      	起始=os.time(),
	      	结束=7200,
	      	玩家id=id,
	      	队伍组={},
	      	名称="木吒",
	      	模型="男人_哪吒",
	      	x=20,
	      	y=49,
	      	方向=3,
	      	副本id=id,
	      	地图编号=地图,
	      	地图名称=取地图名称(地图),
	      	类型=754 --C
	    }
	    地图处理类:添加单位(任务id)
	  elseif 副本数据.红孩儿.进行[id].进程==9 then
	    local 任务id=id.."_755_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"  --C
	    local 地图=7026
	    local xy=地图处理类.地图坐标[地图]:取随机点()
	    任务数据[任务id]={
	      id=任务id,
	      起始=os.time(),
	      结束=7200,
	      玩家id=id,
	      队伍组={},
	      名称="红孩儿",
	      模型="小魔头",
	      x=178,
	      y=106,
	      方向=0,
	      副本id=id,
	      地图编号=地图,
	      地图名称=取地图名称(地图),
	      类型=755--C
	    }
	    地图处理类:添加单位(任务id)
	end
end

__GWdh111[741]=function(连接id,数字id,序列,标识,地图)--红孩儿
  local 对话数据 = {}
   对话数据.模型=任务数据[标识].模型
  对话数据.名称=任务数据[标识].名称
  if 任务数据[标识].zhandou==nil then
    local 副本id=任务数据[标识].副本id
    if (任务数据[玩家数据[数字id].角色:取任务(740)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
    对话数据.对话="(哼，我就不信那和尚不上当!)来人啊，师父救人啊!#15救我下来#15"
    对话数据.选项={"我们来救你了"}
  end
  return 对话数据
end

__GWdh222[741]=function (连接id,数字id,序号,内容)
  local 事件=内容[1]
  local 名称=内容[3]
  if 事件=="我们来救你了" then
    if 任务数据[玩家数据[数字id].地图单位.标识]==nil then return end
    local 副本id = 任务处理类:取副本id(数字id,740)
    副本数据.红孩儿.进行[副本id]={进程=2}
    GetUpMOB740(数字id)
    刷新队伍任务追踪(数字id)
    任务处理类:删除副本单位(数字id,740 ,741)
    return
  end
end

__GWdh111[743]=function(连接id,数字id,序列,标识,地图)
	local 对话数据={}
	对话数据.模型=任务数据[标识].模型
  	对话数据.名称=任务数据[标识].名称
	if 任务数据[标识].zhandou==nil then
    local 副本id=任务数据[标识].副本id
    if 玩家数据[数字id].队伍==0 then 常规提示(数字id,"#Y请组队完成！") return  end
    if (任务数据[玩家数据[数字id].角色:取任务(740)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
    	if 副本数据.红孩儿.进行[副本id].聚水珠 < 1 then
    		对话数据.对话="请先领取聚水珠！"
  		else
		    任务数据[标识].zhandou=true
		    战斗准备类:创建战斗(数字id+0,155557,玩家数据[数字id].地图单位.标识) --
		    玩家数据[数字id].道具:消耗背包道具(连接id,数字id,"聚水珠",1)
		    玩家数据[数字id].地图单位=nil
		    return
    	end
  else
    对话数据.对话="我正在战斗中，请勿打扰。"
  end
	return 对话数据
end

__GWdh111[744]=function(连接id,数字id,序列,标识,地图)
	local 对话数据 = {}
  对话数据.模型=任务数据[标识].模型
  对话数据.名称=任务数据[标识].名称
  if 任务数据[标识].zhandou==nil then
    local 副本id=任务数据[标识].副本id
    if (任务数据[玩家数据[数字id].角色:取任务(740)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
    对话数据.对话="(我虽司雨，不敢擅专，须得玉帝旨意。眼下大圣急需灭火，小神可将龙宫至宝“聚水珠”借给诸位一用。"
    对话数据.选项={"我来拿珠子","我现在没空"}
  end
  return 对话数据
end

__GWdh222[744]=function (连接id,数字id,序号,内容)
  local 事件=内容[1]
  local 名称=内容[3]
  if 事件=="我来拿珠子" then
  	if 任务数据[玩家数据[数字id].地图单位.标识]==nil then return end
  	local 副本id = 任务处理类:取副本id(数字id,740)
  	玩家数据[数字id].道具:给予道具(数字id,"聚水珠",1,nil,"不存共享")
    副本数据.红孩儿.进行[副本id].聚水珠=副本数据.红孩儿.进行[副本id].聚水珠+1
	刷新队伍任务追踪(数字id)
    return
  end
end

__GWdh111[746]=function(连接id,数字id,序列,标识,地图)
	local 对话数据 = {}
  对话数据.模型=任务数据[标识].模型
  对话数据.名称=任务数据[标识].名称
  if 任务数据[标识].zhandou==nil then
    local 副本id=任务数据[标识].副本id
    if (任务数据[玩家数据[数字id].角色:取任务(740)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
    对话数据.对话="你们是谁?想来帮孙猴子?让我考较考较你们的功夫吧。#74(哼， 看我不打死你们!#4)"
    对话数据.选项={"这菩萨看起来怪怪的，莫非有炸！","我们只是路过"}
  end
  return 对话数据
end

__GWdh222[746]=function (连接id,数字id,序号,内容)
  local 事件=内容[1]
  local 名称=内容[3]
  if 事件=="这菩萨看起来怪怪的，莫非有炸！" then
    if 任务数据[玩家数据[数字id].地图单位.标识]==nil then return end
    if 任务数据[玩家数据[数字id].地图单位.标识].zhandou~=nil then 常规提示(数字id,"#Y/对方正在战斗中") return  end
    if 玩家数据[数字id].队伍==0 then 常规提示(数字id,"#Y必须组队才能触发该活动") return end
    if 取队伍人数(数字id)<1 then 常规提示(数字id,"#Y/挑战红孩儿最少要有五人") return  end
    if 取等级要求(数字id,60)==false then 常规提示(数字id,"#Y/挑战红孩儿至少要达到60级") return  end
    战斗准备类:创建战斗(数字id+0,155558,玩家数据[数字id].地图单位.标识)
    任务数据[玩家数据[数字id].地图单位.标识].zhandou=true
    玩家数据[数字id].地图单位=nil
    return
  end
end

__GWdh111[747]=function(连接id,数字id,序列,标识,地图)--红孩儿  需战斗
  local 对话数据 = {}
  对话数据.模型=任务数据[标识].模型
  对话数据.名称=任务数据[标识].名称
  if 任务数据[标识].zhandou==nil then
    local 副本id=任务数据[标识].副本id
    if (任务数据[玩家数据[数字id].角色:取任务(740)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
    对话数据.对话="想救唐僧？小的们,给我上!"
    对话数据.选项={"放马过来吧！","好多妖怪，逃跑先"}
  end
  return 对话数据
end

__GWdh222[747]=function (连接id,数字id,序号,内容)
  local 事件=内容[1]
  local 名称=内容[3]
  if 事件=="放马过来吧！" then
    if 任务数据[玩家数据[数字id].地图单位.标识]==nil then return end
    if 任务数据[玩家数据[数字id].地图单位.标识].zhandou~=nil then 常规提示(数字id,"#Y/对方正在战斗中") return  end
    if 玩家数据[数字id].队伍==0 then 常规提示(数字id,"#Y必须组队才能触发该活动") return end
    if 取队伍人数(数字id)<1 then 常规提示(数字id,"#Y/挑战红孩儿最少要有五人") return  end
    if 取等级要求(数字id,60)==false then 常规提示(数字id,"#Y/挑战红孩儿至少要达到60级") return  end
    战斗准备类:创建战斗(数字id+0,155570,玩家数据[数字id].地图单位.标识)
    任务数据[玩家数据[数字id].地图单位.标识].zhandou=true
    玩家数据[数字id].地图单位=nil
    return
  end
end

__GWdh111[751]=function(连接id,数字id,序列,标识,地图)--布雨金龙  C
  local 对话数据 = {}
  对话数据.模型=任务数据[标识].模型
  对话数据.名称=任务数据[标识].名称
  if 任务数据[标识].zhandou==nil then
    local 副本id=任务数据[标识].副本id
    if (任务数据[玩家数据[数字id].角色:取任务(740)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
    对话数据.对话="六健将每次被你们打败后都会埋头苦练，终于练就可以反击的本事，你们想要继续挑战吗? (失败无损失)。"
    对话数据.选项={"我还有更重要的事情要做(选择这个)","那就来试试你们的实力吧"}
  end
  return 对话数据
end

__GWdh222[751]=function (连接id,数字id,序号,内容) --C
  local 事件=内容[1]
  local 名称=内容[3]
  if 事件=="我还有更重要的事情要做(选择这个)" then
    if 任务数据[玩家数据[数字id].地图单位.标识]==nil then return end
    local 副本id = 任务处理类:取副本id(数字id,740)
    副本数据.红孩儿.进行[副本id].进程 = 6
    刷新队伍任务追踪(数字id)
    任务处理类:删除单位(标识)
	任务处理类:删除副本单位(数字id,740 ,751)--C
    GetUpMOB740(数字id)
    玩家数据[数字id].地图单位=nil
    return
  end
end

__GWdh111[752]=function(连接id,数字id,序列,标识,地图)--C
  local 对话数据 = {}
  对话数据.模型=任务数据[标识].模型
  对话数据.名称=任务数据[标识].名称
  if 任务数据[标识].zhandou==nil then
    local 副本id=任务数据[标识].副本id
    if (任务数据[玩家数据[数字id].角色:取任务(740)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
    对话数据.对话="爹爹的天罡刀我知道放在哪里，我带你们去拿。"
    对话数据.选项={"好的","稍等，让我准备一下"}
  end
  return 对话数据
end

__GWdh222[752]=function (连接id,数字id,序号,内容)  --C
  local 事件=内容[1]
  local 名称=内容[3]
  if 事件=="好的" then
    if 任务数据[玩家数据[数字id].地图单位.标识]==nil then return end
    local 副本id = 任务处理类:取副本id(数字id,740)
    副本数据.红孩儿.进行[副本id].进程 = 7
    刷新队伍任务追踪(数字id)
    任务处理类:删除单位(玩家数据[数字id].地图单位.标识)
		任务处理类:删除副本单位(数字id,740 ,752)--C
    GetUpMOB740(数字id)
    地图处理类:跳转地图(数字id,7027,26,51)
    玩家数据[数字id].地图单位=nil
    return
  end
end

__GWdh111[753]=function(连接id,数字id,序列,标识,地图)--C
  local 对话数据 = {}
  对话数据.模型=任务数据[标识].模型
  对话数据.名称=任务数据[标识].名称
    if 任务数据[标识].zhandou==nil then
		local 副本id=任务数据[标识].副本id
		if (任务数据[玩家数据[数字id].角色:取任务(740)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
		if 副本数据.红孩儿.进行[副本id].进程==7 then
			local 题目随机 = 取随机数()
			对话数据.对话="请问下面四个选项，哪个与其他三个不是一类？"
			if 题目随机 < 10 then
				对话数据.选项={"蓝","红","木","黄"}
			elseif 题目随机 < 20 then
				对话数据.选项={"月","春","夏","秋"}
			elseif 题目随机 < 30 then
				对话数据.选项={"狗","猫","鸟","鱼"}
			elseif 题目随机 < 40 then
				对话数据.选项={"圆","正方形","三角形","梯形"}
			elseif 题目随机 < 50 then
				对话数据.选项={"足球","篮球","排球","游泳"}
			elseif 题目随机 < 60 then
				对话数据.选项={"火车","飞机","船","自行车"}
			elseif 题目随机 < 70 then
				对话数据.选项={"英语","数学","历史","物理"}
			elseif 题目随机 < 80 then
				对话数据.选项={"汉字","英文字母","数字","符号"}
			elseif 题目随机 < 90 then
				对话数据.选项={"红色","蓝色","黄色","白色"}
			else
				对话数据.选项={"篮球场","足球场","网球场","游泳池"}
			end
		end
	end
	return 对话数据
end

__GWdh222[753]=function (连接id,数字id,序号,内容)--C
	local 事件=内容[1]
	local 名称=内容[3]
	if 事件 == "木" or 事件 == "月" or 事件 == "鱼" or 事件 == "梯形" or 事件 == "游泳" or 事件 == "自行车" or 事件 == "物理" or 事件 == "符号" or 事件 == "白色" or 事件 == "游泳池" then
		local 副本id = 任务处理类:取副本id(数字id,740)
		副本数据.红孩儿.进行[副本id].刀阵 = 副本数据.红孩儿.进行[副本id].刀阵 + 1
		任务处理类:删除单位(玩家数据[数字id].地图单位.标识)
		战斗奖励:其他奖励(数字id,"红孩儿刀阵")
		if 副本数据.红孩儿.进行[副本id].刀阵 >= 10 then
			副本数据.红孩儿.进行[副本id].进程 = 8
		  刷新队伍任务追踪(数字id)
			任务处理类:删除副本单位(数字id,740 ,753)--C
		  GetUpMOB740(数字id)
		end
		玩家数据[数字id].地图单位 = nil
	    return
	end
end

__GWdh111[751]=function(连接id,数字id,序列,标识,地图)--布雨金龙
  local 对话数据 = {}
  对话数据.模型=任务数据[标识].模型
  对话数据.名称=任务数据[标识].名称
  if 任务数据[标识].zhandou==nil then
    local 副本id=任务数据[标识].副本id
    if (任务数据[玩家数据[数字id].角色:取任务(740)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
    对话数据.对话="这天罡刀阵果然威风，爹爹说破阵不仅需要武力，还需要智慧。"
    对话数据.选项={"偷偷告诉我们秘诀吧","我们破阵成功了","我们是路过的"}
  end
  return 对话数据
end

__GWdh222[751]=function (连接id,数字id,序号,内容)
  local 事件=内容[1]
  local 名称=内容[3]
  if 事件=="我们破阵成功了" then
    if 任务数据[玩家数据[数字id].地图单位.标识]==nil then return end
    local 副本id = 任务处理类:取副本id(数字id,740)
    副本数据.红孩儿.进行[副本id].进程 = 9
    地图处理类:跳转地图(数字id,7026,153,110)
    刷新队伍任务追踪(数字id)
	任务处理类:删除副本单位(数字id,740 ,751)
    GetUpMOB740(数字id)
    玩家数据[数字id].地图单位=nil
    return
  end
end

__GWdh111[755]=function(连接id,数字id,序列,标识,地图)--观音姐姐--C
  local 对话数据 = {}
    对话数据.模型=任务数据[标识].模型
  对话数据.名称=任务数据[标识].名称
  if 任务数据[标识].zhandou==nil then
    local 副本id=任务数据[标识].副本id
    if (任务数据[玩家数据[数字id].角色:取任务(740)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
    对话数据.对话="你们是那猴子请来的救兵吗?#4"
    对话数据.选项={"正是！","不是，你认错人了"}
  end
  return 对话数据
end

__GWdh222[755]=function (连接id,数字id,序号,内容)
  local 事件=内容[1]
  local 名称=内容[3]
  if 事件=="正是！" then
    if 任务数据[玩家数据[数字id].地图单位.标识]==nil then return end
    if 任务数据[玩家数据[数字id].地图单位.标识].zhandou~=nil then 常规提示(数字id,"#Y/对方正在战斗中") return  end
    if 玩家数据[数字id].队伍==0 then 常规提示(数字id,"#Y必须组队才能触发该活动") return end
    if 取队伍人数(数字id)<1 then 常规提示(数字id,"#Y/挑战红孩儿最少要有五人") return  end
    if 取等级要求(数字id,60)==false then 常规提示(数字id,"#Y/挑战红孩儿至少要达到60级") return  end
    战斗准备类:创建战斗(数字id+0,155571,玩家数据[数字id].地图单位.标识)
    任务数据[玩家数据[数字id].地图单位.标识].zhandou=true
    玩家数据[数字id].地图单位=nil
    return
  end
end

function rwgx740(任务id)
	if os.time()-任务数据[任务id].起始>=任务数据[任务id].结束 and 任务数据[任务id].结束 ~= 99999999 then
		if 任务数据[任务id].zhandou~=true then  --未进入战斗状态
			if  任务数据[任务id].类型== 740 then
				local 队伍组 = 任务数据[任务id].队伍组
				for i=1,#队伍组 do
					local id = 队伍组[i]
					if 玩家数据[id] ~= nil then
						玩家数据[id].角色:取消任务(玩家数据[id].角色:取任务(740))
						刷新队伍任务追踪(id)
						副本数据.红孩儿.完成[id] = true
						更新玩家每日(id,"副本任务","红孩儿")
						常规提示(id, "很遗憾，副本失败了，请明天再来")
						任务处理类:副本结束传送(id,7)
					end
				end
				任务数据[任务id]=nil
			else
				任务处理类:删除单位(任务id)
			end
		end
	end
end


function 任务说明740(玩家id,任务id)
	local 说明 = {}
	local 副本id=任务数据[任务id].副本id
	if 副本数据.红孩儿.进行[副本id]==nil then
		说明={"红孩儿","#L您的副本已经完成"}
	else
		local 进程=副本数据.红孩儿.进行[副本id].进程
	    local 数量=副本数据.红孩儿.进行[副本id].数量
	    local 序列=副本数据.红孩儿.进行[副本id].序列
	    if 进程==1 then
	      说明={"红孩儿",format("#L在六百里钻头号山找到".."#Y/qqq|红孩儿*7026*临时npc*178*106/红孩儿".."#L。副本剩余时间#R/%s#W/分钟。",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
	    elseif 进程==2 then
	      说明={"红孩儿",format("#L领取聚水珠对五行车的火焰使用。副本剩余时间#R/%s#W/分钟。",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
	    elseif 进程==3 then
	      说明={"红孩儿",format("#L前方".."#Y/qqq|观音姐姐*7026*临时npc*152*112/观音姐姐".."#L是假扮的，打败他！副本剩余时间#R/%s#W/分钟。",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
	    elseif 进程==4 then
	      说明={"红孩儿",format("#L快去阻止".."#Y/qqq|红孩儿*7026*临时npc*178*106/红孩儿".."#L！。副本剩余时间#R/%s#W/分钟。",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
	    elseif 进程==5 then
	      说明={"红孩儿",format("#L通天".."#Y/qqq|红孩儿*7026*临时npc*178*106/红孩儿".."#L选择是否挑战日益渐强的六健将！。副本剩余时间#R/%s#W/分钟。",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
	    elseif 进程==6 then
	      说明={"红孩儿",format("#L寻找#Y木吒#L进入天罡刀阵并破坏。副本剩余时间#R/%s#W/分钟。",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
	    elseif 进程==7 then
	      说明={"红孩儿",format("#L寻找#Y木吒#L进入天罡刀阵并破坏。副本剩余时间#R/%s#W/分钟。",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
	    elseif 进程==8 then
	      说明={"红孩儿",format("#L寻找#Y木吒#L进入天罡刀阵并破坏。副本剩余时间#R/%s#W/分钟。",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
	    elseif 进程==9 then
	      说明={"红孩儿",format("#L最后一战！战胜".."#Y/qqq|红孩儿*7026*临时npc*178*106/红孩儿".."#L。副本剩余时间#R/%s#W/分钟。",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
	    end
	end
	return 说明
end

return 副本_红孩儿