-- @Author: baidwwy
-- @Date:   2023-11-11 15:25:46
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2025-12-27 14:19:55
-- @作者: baidwwy
-- @邮箱:  313738139@qq.com
-- @创建时间:   2021-01-31 18:57:39
-- @最后修改来自: baidwwy
-- @Last Modified time: 2023-11-22 00:06:23
local sj = 取随机数
local format = string.format
local insert = table.insert
local ceil = math.ceil
local floor = math.floor
local wps = 取物品数据
local typ = type
local random = 取随机数

__NPCdh111[1044]=function (ID,编号,页数,已经在任务中,数字id)
	local wb = {}
	local xx = {}
	if 编号 == 1 then
			wb[1] = "我们已发现在大唐境外有一叫做“ 幽森洞”的神越洞穴，被一凶恶幽灵霸占纵容各种妖魔鬼怪残害百姓，洞内妖魔猖狂，现招募天下英雄共伐之少侠如有此侠义之心，羽林军统领将带你们前往“幽森洞”"
			local xx = {"开启泾河龙王副本","一队御林军进洞都无法全身而退，我，我上有老下有小呀！"}
			if 玩家数据[数字id].角色:取任务(900)~=0 then
			wb[1]="你的副本已经开启了，是否需要我帮你传送进去？"
			xx={"请送我进去","我等会再进去"}
		 end
			return {"考官2","魏征",wb[1],xx}
	elseif 编号 == 2 then
		wb[1] = "本官的宗旨就是为了让治生活在和谐的环境中,辅的本份,但我也会抽出时间为大家排忧解难的。如果有对自己名字不满意的朋友可以找我来修改名但需要一定的代价呢(每月只修改1次,每次修改需扣除点数=基础点+(修改次数*300)-(时司隔*150),(小于600或者负值都取基时差按照月份来算30天算1个月,不足30天则算0.30天是从上1修改名字的时间到当月只能改一次名"
			-- local xx = {"我要修改名字","我随便看看而已"}
			return {"考官2","戴胄",wb[1],xx}
	elseif 编号 == 3 then
			wb[1] = "我大唐人才辈出，民间有不少能人异士在某些方面为常人所不同。唐王特令我搜寻这些能人异士，并将他们的功绩张榜公示，以鞭策后人。"
			local xx = {"查询总经验","我只是路过"}
			return{"考官2","房玄龄",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 5 then
			wb[1] = "为选拔天下贤能之士，特在此举行御前科举大赛，会试入围的才子可以在金銮殿上进行殿试，所有参加殿试的才子都可按成绩获得一定的奖励和称谓"
			xx = {"领取千亿经验奖励"}
			return {"皇帝","李世民",wb[1],xx}
	end
	return
end

__NPCdh222[1044 ]=function  (id,数字id,序号,内容)
	local 事件=内容[1]
	local 名称=内容[3]
	if 名称=="房玄龄" then
		if 事件=="查询总经验" then
			if 玩家数据[数字id].角色.经验记录==nil then
				玩家数据[数字id].角色.经验记录 = 0
			end
			local xxx = "总获得经验" ..玩家数据[数字id].角色.经验记录
			添加最后对话(数字id,xxx)
		end
	elseif 名称=="魏征" then
	    if 事件=="开启泾河龙王副本" then
			开启泾河龙王(数字id)
		elseif 事件=="请送我进去" then
			任务处理类:副本传送(数字id,11)
		end


	elseif 名称=="李世民" then
		if 事件=="领取千亿经验奖励" then
			if 玩家数据[数字id].角色.经验记录==nil then
				玩家数据[数字id].角色.经验记录 = 0
			end
			if 玩家数据[数字id].角色.千亿领取记录==nil then
				玩家数据[数字id].角色.千亿领取记录 = false
			end

			local 经验要求=100000000000
			local 差值=经验要求-玩家数据[数字id].角色.经验记录
			if 玩家数据[数字id].角色.经验记录<经验要求 then
				添加最后对话(数字id,"少侠你获得的总经验不足，距离领取千亿经验奖励还差"..差值.."经验")
				return
			end
			if not 玩家数据[数字id].角色.千亿领取记录 then
				玩家数据[数字id].角色:添加称谓("独步西游若等闲")
				玩家数据[数字id].道具:给予道具(数字id,"特殊魔兽要诀",1,"观照万象","不存共享")
				玩家数据[数字id].角色.千亿领取记录 = true
				添加最后对话(数字id,"这是你的奖励，请收好。")

			else
				添加最后对话(数字id,"#Y少侠，你已经领取过此奖励了。")
			end

		end
	end
end