-- @Author: baidwwy
-- @Date:   2023-12-02 14:12:06
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2025-10-17 23:30:44
-- @作者: baidwwy
-- @邮箱:  313738139@qq.com
-- @创建时间:   2021-01-31 18:04:08
-- @最后修改来自: baidwwy
-- @Last Modified time: 2023-05-13 14:17:16
local sj = 取随机数
local format = string.format
local insert = table.insert
local ceil = math.ceil
local floor = math.floor
local wps = 取物品数据
local typ = type
local random = 取随机数

__NPCdh111[1111]=function (ID,编号,页数,已经在任务中,数字id)
  local wb = {}
  local xx = {}
  if 编号 == 1 then
    wb[1] = "我可以送你去西牛贺洲，你要去吗？"
    local xx = {"是的我要去","我还要逛逛"}
    return {"天兵","守门天兵",wb[1],xx}
  elseif (编号 == 2 or 编号 == 3) then
    wb[1] = "天天在这里守门真是无聊死了，我也渴望冒险刺激的生活。"
    wb[2] = "整天有人来打听这打听那的，什么红琉璃白琉璃，当心我火了打你一顿。"
    wb[3] = "又要开蟠桃会了，我算算我守了多少年的门，自从我守门开始，已经开了2次蟠桃会了。"
    wb[4] = "天宫可是众仙云集之地，不是你想来就来，想走就走的！"
    wb[5] = "天宫重地，严禁喧哗！！"
    return {"天兵","守门天兵",wb[sj(1,#wb)]}
  elseif 编号 == 4 then
    wb[1] = "我可以送你去长安，你要去吗？"
    local xx = {"是的我要去","我还要逛逛"}
    return {"芙蓉仙子","接引仙女",wb[1],xx}
  elseif 编号 == 5 then
    wb[1] = "我是三界闻名的千里眼，什么事情都逃不过我的眼睛。"
    xx ={}
    local 任务id = 玩家数据[数字id].角色:取任务(307)
    if 玩家数据[数字id].角色:取任务(307)~=0 then
      if 任务数据[任务id].分类==3 then
        wb[1] = "好啦，看你这么善良正直。不开玩笑了，你帮我捎个信给大力神灵，我去帮你调查调查。"
        xx = {"好的，我这就去","路过"}
      elseif 任务数据[任务id].分类==5 then
        wb[1] = "朱紫国一带有一座麒麟山，寻那附近的土地公公查探查探。"
        xx = {"好的，我这就去","路过"}
      end
    end
    return {"天兵","千里眼",wb[取随机数(1,#wb)],xx}
  elseif 编号 == 6 or 编号==7 then
    wb[1] = "我就一看门的小屁孩#24"
    return {"男人_道童","守门道童",wb[sj(1,#wb)],{"我点错了"}}
  elseif 编号 == 8 then
    wb[1] = "我是三界闻名的顺风耳，什么事情都逃不过我的耳朵。"
    local 任务id
    if 玩家数据[数字id].角色:取任务(301)~=0 or 玩家数据[数字id].角色:取任务(302)~=0 then --青龙玄武
      wb={"你找我有什么事情吗？"}
      xx={}
      任务id= 玩家数据[数字id].角色:取任务(301)
      if 任务id~=0 and 任务数据[任务id].人物=="顺风耳" then
        xx[#xx+1] = "青龙任务"
      end
      任务id= 玩家数据[数字id].角色:取任务(302)
      if 任务id~=0 and 任务数据[任务id].人物=="顺风耳" then
        xx[#xx+1] = "玄武任务"
      end
      xx[#xx+1] = "没什么，我只是看看"
      return {"天兵","顺风耳",wb[sj(1,#wb)],xx}
    end
    return {"天兵","顺风耳",wb[sj(1,#wb)]}
  elseif 编号 == 9 then
    wb[1] = " 请选择你要进行的操作："
    xx={"领取宠物修炼任务","跳过宠物修炼任务","取消宠物修炼任务","领取人物修炼任务","跳过人物修炼任务","取消人物修炼任务","我只是路过"}
    return {"男人_道士","马真人",wb[sj(1,#wb)],xx}
  elseif 编号 == 10 then
    wb[1] = "天牢里关的都是十恶不赦的坏人。"
    return {"天将","天牢守卫",wb[sj(1,#wb)]}
  elseif 编号 == 11 then
    wb[1] = "掌管十万水兵虽然威风，但不知什么时候我也会被玉帝找个理由打入天牢，真是伴君如伴虎。"
    return {"男人_将军","水军统领",wb[sj(1,#wb)]}

  elseif 编号 == 14 then
      wb[1] = "我是叽呱冒险家，你是要挑战么？"
       xx={"普通难度","困难难度","英雄难度","我只是路过"}
      return {"进阶有苏鸩","叽呱冒险家",wb[sj(1,#wb)],xx}

  elseif 编号 == 18 then
    wb[1] = "明天就要行刑了，我居然把玄天铁鞭丢了……这可是大罪啊，如果被玉帝知道说不定会说我包庇罪犯贬下凡间像天蓬元帅一样投个猪胎说不定连猪都不如~~~~~~~啊~~~~"
    xx = {}
    local 任务id = 玩家数据[数字id].角色:取任务(307)
    if 玩家数据[数字id].角色:取任务(307)~=0 then
      if 任务数据[任务id].分类==4 then
        wb[1] = "#04什么？千里眼，那丫的还欠我钱呢，火大！让你走不走，打你走！"
        xx = {"看我不好好的收拾你！","路过"}
      end
    end
    return{"风伯","大力神灵",wb[取随机数(1,#wb)],xx}
  end
  return
end

__NPCdh222[1111 ]=function  (id,数字id,序号,内容)
  local 事件=内容[1]
    local 名称=内容[3]
    if 名称=="接引仙女" then
      if 事件=="是的我要去" then
        地图处理类:npc传送(数字id,1001,470,253)
      end
    elseif 名称=="守门天兵" then
      if 事件=="是的我要去" then
        地图处理类:跳转地图(数字id,1091,24,119)
      end
    elseif 名称=="千里眼" then
      if 事件=="好的，我这就去" then
        local 任务id=玩家数据[数字id].角色:取任务(307)
        if 任务数据[任务id].分类==3 then
            任务数据[任务id].分类=4
        elseif 任务数据[任务id].分类==5 then
            任务数据[任务id].分类=6
        end
        玩家数据[数字id].角色:刷新任务跟踪()
      end
    elseif 名称=="大力神灵" then
      if 事件=="看我不好好的收拾你！" then
        local 任务id=玩家数据[数字id].角色:取任务(307)
        if 任务id ~= 0 and  任务数据[任务id].分类==4 then
          战斗准备类:创建战斗(数字id,191000,任务id) ---1
        end
      end

    elseif 名称=="叽呱冒险家" then
          if 事件=="普通难度" or 事件=="困难难度" or 事件=="英雄难度"  then
          local 任务id = 玩家数据[数字id].角色:取任务(58)
          if 任务id == 0 or 任务数据[任务id].分类 ~= 2 or 任务数据[任务id].进程 ~= 15 then
              添加最后对话(数字id,"我好像不认识你吧？？？")
              return
          end
          local 队伍组 = 任务数据[任务id].队伍组
          if 玩家数据[数字id].队伍 == 0 then
            常规提示(数字id,"#Y/该任务为组队任务，请组齐你的队员再来吧")
            return
          end
          local 队伍id = 玩家数据[数字id].队伍
          for i=1,#队伍组 do
            local 找到 = false
            for n=1,#队伍数据[队伍id].成员数据 do
              if 队伍数据[队伍id].成员数据[n] == 队伍组[i] then
                找到=true
                break
              end
            end
            if 找到 == false then
              常规提示(数字id,"#Y/该任务为组队任务，请组齐你领取任务时的队员再来吧")
              return
            end
          end
          if 事件=="普通难度" then
          战斗准备类:创建战斗(数字id+0,150075,玩家数据[数字id].角色:取任务(58),事件)
        elseif 事件=="困难难度" then
          战斗准备类:创建战斗(数字id+0,150175,玩家数据[数字id].角色:取任务(58),事件)
        elseif 事件=="英雄难度" then
          战斗准备类:创建战斗(数字id+0,150275,玩家数据[数字id].角色:取任务(58),事件)
        end
          -- 战斗准备类:创建战斗(数字id+0,150075,玩家数据[数字id].角色:取任务(58),事件)
        end
    elseif 名称=="马真人" then
        if 事件=="领取宠物修炼任务" then
          if 玩家数据[数字id].角色:取任务(13)~=0 then
            添加最后对话(数字id,"请先完成之前领取的任务。")
            return
          else
            添加最后对话(数字id,"领取宠物修炼任务需要花费50万两银子，并且人物等级必须>=60级方可领取。",{"我要领取宠物修炼任务","我再考虑考虑"})
            return
          end
        elseif 事件=="我要领取宠物修炼任务" then
          if 玩家数据[数字id].角色:取任务(13)~=0 then
            添加最后对话(数字id,"请先完成之前领取的任务。")
            return
          else
            设置任务13(数字id)
          end
        elseif 事件=="跳过宠物修炼任务" then
          添加最后对话(数字id,"前90次任务均可以在我这里选择跳过本环任务，直接进入下一环任务。但将无法获得修炼经验奖励，且需要扣除50万两银子，只有当前任务积分≥50点时才可使用跳过功能，你需要我帮你跳过本轮任务吗？",{"请帮我跳过本环任务","我再考虑考虑"})
          return
        elseif 事件=="请帮我跳过本环任务" then
          if 玩家数据[数字id].角色:取任务(13)==0 then
            添加最后对话(数字id,"你有在我这里领取过任务吗？")
            return
          else
            local 任务id=玩家数据[数字id].角色:取任务(13)
            if 玩家数据[数字id].角色.银子<500000 then
              添加最后对话(数字id,"你没有那么多的银子")
              return
            elseif 任务数据[任务id].次数>=100 then
              添加最后对话(数字id,"我这里只能跳过前90环任务。")
              return
            else
              任务数据[任务id].次数=任务数据[任务id].次数+1
              if 玩家数据[数字id].角色:扣除银子(500000,0,0,"跳过宠物修炼任务",1)== false then 常规提示(数字id,"你的银两不足") return end
              local 任务id=玩家数据[数字id].角色:取任务(13)
              完成任务_13(数字id,任务id)
              return
            end
          end
        elseif 事件=="取消宠物修炼任务" then
          if 玩家数据[数字id].角色:取任务(13)==0 then
            添加最后对话(数字id,"你有在我这里领取过任务吗？")
            return
          else
            local 任务id=玩家数据[数字id].角色:取任务(13)
            玩家数据[数字id].角色:取消任务(任务id)
            任务数据[任务id]=nil
            添加最后对话(数字id,"已帮你取消了宠物修炼任务。")
            return
          end
        end
        if 事件=="领取人物修炼任务" then
          if 玩家数据[数字id].角色:取任务(501)~=0 then
            添加最后对话(数字id,"请先完成之前领取的任务。")
            return
          else
            添加最后对话(数字id,"领取人物修炼任务需要花费50万两银子，并且人物等级必须>=60级方可领取。",{"我要领取人物修炼任务","我再考虑考虑"})
            return
          end
        elseif 事件=="我要领取人物修炼任务" then
          if 玩家数据[数字id].角色:取任务(501)~=0 then
            添加最后对话(数字id,"请先完成之前领取的任务。")
            return
          else
            设置任务501(数字id)
          end
        elseif 事件=="跳过人物修炼任务" then
          添加最后对话(数字id,"前90次任务均可以在我这里选择跳过本环任务，直接进入下一环任务。但将无法获得修炼经验奖励，且需要扣除50万两银子，只有当前任务积分≥1点时才可使用跳过功能，你需要我帮你跳过本轮任务吗？",{"请帮我跳过本环修炼任务","我再考虑考虑"})
          return
        elseif 事件=="请帮我跳过本环修炼任务" then
          if 玩家数据[数字id].角色:取任务(501)==0 then
            添加最后对话(数字id,"你有在我这里领取过任务吗？")
            return
          else
            local 任务id=玩家数据[数字id].角色:取任务(501)
            if 玩家数据[数字id].角色.银子<500000 then
              添加最后对话(数字id,"你没有那么多的银子")
              return
            elseif 任务数据[任务id].次数>=100 then
              添加最后对话(数字id,"我这里只能跳过前90环任务。")
              return
            else
              任务数据[任务id].次数=任务数据[任务id].次数+1
              if 玩家数据[数字id].角色:扣除银子(500000,0,0,"跳过人物修炼任务",1)== false then 常规提示(数字id,"你的银两不足") return end
              local 任务id=玩家数据[数字id].角色:取任务(501)
              完成任务_501(数字id,任务id)
              -- 添加最后对话(数字id,"你消耗了5点任务积分和10万两银子跳过了本环任务。")
              return
            end
          end
        elseif 事件=="取消人物修炼任务" then
          if 玩家数据[数字id].角色:取任务(501)==0 then
            添加最后对话(数字id,"你有在我这里领取过任务吗？")
            return
          else
            local 任务id=玩家数据[数字id].角色:取任务(501)
            玩家数据[数字id].角色:取消任务(任务id)
            任务数据[任务id]=nil
            添加最后对话(数字id,"已帮你取消了宠物修炼任务。")
            return
          end
        end
    end
end