-- @作者: baidwwy
-- @邮箱:  313738139@qq.com
-- @创建时间:   2021-01-31 18:05:13
-- @最后修改来自: baidwwy
-- @Last Modified time: 2025-09-17 18:38:33
local sj = 取随机数
local format = string.format
local insert = table.insert
local ceil = math.ceil
local floor = math.floor
local wps = 取物品数据
local typ = type
local random = 取随机数

__NPCdh111[1112]=function (ID,编号,页数,已经在任务中,数字id)
	local wb = {}
	local xx = {}
	if 编号 == 2 then
		       -- if 限制神器次数[数字id]==nil and 神器满足(数字id)  then
		       --    限制神器次数[数字id]={次数=1}
		       -- elseif 限制神器次数[数字id]==nil  then
		       --    	限制神器次数[数字id]={次数=0}
		       -- end
		-- wb[1] = "下界有妖魔作乱，要多加防范才是，#R"..限制神器次数[数字id].次数.."#W次。"
		-- wb[2] = "不知道嫦娥仙子如何喜欢我，唉，真是苦恼啊#14，#R"..限制神器次数[数字id].次数.."#W次。"
		-- wb[3] = "天庭也非清净之地，啥时能再回到我的灌江口？，#R"..限制神器次数[数字id].次数.."#W次。"
		-- wb[4] = "我就是英俊潇洒玉树临风天庭第一美男子二郎神#17，#R"..限制神器次数[数字id].次数.."#W次。"
		wb[1] = "下界有妖魔作乱，要多加防范才是。"

		local xx = {"神器任务","路过"}
		return {"男人_杨戬","杨戬",wb[sj(1,#wb)],xx}
	elseif 编号 == 1 then
		wb[1] = "下界凡间遇到纷争可不要与他们一般见识，他们可是不讲理的。"
		wb[2] = "下界有妖魔作乱，要多加防范才是。"
		wb[3] = "天庭冷落，真想再回到人间。"
		wb[4] = "想成为天界的精英，是要下一番苦功夫的。"
		wb[5] = "修行贵在持之以恒，切记浮躁自满。"
		local xx = {"交谈","给予","乾元丹学习","师门任务","学习技能","我想切换流派","本命法宝相关"}
		if 玩家数据[数字id].角色.门派 == "无" or 玩家数据[数字id].角色.门派 == "无门派" then
		  	xx={"我还想去其他门派看看……","请收我为徒"}
		elseif 玩家数据[数字id].角色.门派~="天宫" then
		  	xx={}
		end
		if 玩家数据[数字id].角色:取任务(1163)~=0 and 任务数据[玩家数据[数字id].角色:取任务(1163)].分类==6 and 任务数据[玩家数据[数字id].角色:取任务(1163)].SX.地图编号==ID then
			xx = {"文韵墨香","我点错了"}
			if 玩家数据[数字id].角色.门派=="天宫" then
			    xx = {"文韵墨香","我要做其他事情","我点错了"}
			end
		end
		if 玩家数据[数字id].角色:取任务(300)~=0 then --优先级最高
			local 任务id= 玩家数据[数字id].角色:取任务(300)
			if 任务数据[任务id].人物=="李靖" then
				wb={}
				xx={}
				wb[1] = "原来是你给我送东西来了。怎么改行当镖师了？"
				押镖:完成押镖任务(任务id,数字id,任务数据[任务id].人物地图)
			else
				wb={}
				xx={}
			    wb[1] = "少侠你的镖是不是运送错了地方呢，再仔细看看任务提示！"
			end
		end
		return {"李靖","李靖",wb[sj(1,#wb)],xx,"门派师傅"}
	elseif 编号 == 3 then
		wb[1] = "作皇帝难，作玉皇大帝更难啊。"
		wb[2] = "那个什么九头虫献上的宝贝还真不错。"
		wb[3] = "其实我很怕我老婆的，很多事情都是她做主，但是话说回来，怕她，说明我爱她嘛#17你说是不是。"
		wb[4] = "汝等不来接受朕的考验，就别想飞升化境#99"
		wb[5] = "那猴子自从跟了唐三藏取经，好久都没消息了，也不知道现在行至何处？"
		local xx = {}
		return {"男人_玉帝","玉皇大帝",wb[sj(1,#wb)],xx}
	elseif 编号 == 4 then
		wb[1] = "我蟠桃园里的桃子可都是稀世珍品。"
		wb[2] = "谁这么大胆，偷走了我的九叶灵芝草#51"
		wb[3] = "蟠桃园的桃子长势喜人，今年又可以开一场盛大的蟠桃宴会了。"
		wb[4] = "猴子被佛祖降服以后，天界的日子总算太平了。"
		wb[5] = "仙魔两界向来水火不容，说什么神仙妖魔自由恋爱，哼，除非神仙都死光了。"
		return {"女人_王母","王母娘娘",wb[sj(1,#wb)]}
	elseif 编号 == 5 then
		wb[1] = "居然把火尖枪输给那个看门小神，那是师傅送我的枪啊#52我有何颜面去见师傅和父亲"
		wb[2] = "作为三坛海会大神，率领天兵去收降那猴子，却屡战屡败，真是惭愧！"
		wb[3] = "下界有妖魔作乱，要多加防范才是。"
		wb[4] = "天上一日，人间一年。下界许久没什么大动静，我待在这都快生锈了。"
		wb[5] = "莲藕为骨，荷叶为衣，我乃刀枪不入之躯。"
		return {"男人_哪吒","哪吒",wb[sj(1,#wb)]}
	end
	return
end

__NPCdh222[1112 ]=function  (id,数字id,序号,内容)
	local 事件=内容[1]
  	local 名称=内容[3]
  	if 名称=="李靖" then
        local 门派类型="天宫"
        if 事件=="请收我为徒" then
            玩家数据[数字id].角色:加入门派(数字id,门派类型)
            elseif 事件=="本命法宝相关" then
       添加最后对话(数字id,"在此挑战本命法宝难度，进行开启、突破等操作，若难度过高，可邀请玩家共同组队挑战哦 ",{"开启本命法宝","突破一级本命法宝","突破二级本命法宝","突破三级本命法宝","点错了"})
        elseif 事件=="开启本命法宝" then
        	简单_本命法宝:本命法宝挑战检测(数字id,1)
        elseif 事件=="突破一级本命法宝" then
        	简单_本命法宝:本命法宝挑战检测(数字id,2)
        elseif 事件=="突破二级本命法宝" then
        	简单_本命法宝:本命法宝挑战检测(数字id,3)
        elseif 事件=="突破三级本命法宝" then
        	简单_本命法宝:本命法宝挑战检测(数字id,4)
        elseif 事件=="交谈" then
          --玩家数据[数字id].角色:门派交谈(数字id,门派类型)
        elseif 事件=="师门任务" then
            玩家数据[数字id].角色:门派任务(数字id,门派类型)
        elseif 事件=="学习技能" then
          --local 临时数据=玩家数据[数字id].角色:取总数据()
          发送数据(id,31,玩家数据[数字id].角色:取总数据1())
          发送数据(id,32)
        elseif 事件=="文韵墨香" then
			if 玩家数据[数字id].队伍 == 0 then
				常规提示(数字id,"请组队后再来吧！")
				return
			end
			玩家数据[数字id].给予数据={类型=1,id=0,事件="文墨门派送信"}
			发送数据(id,3530,{道具=玩家数据[数字id].道具:索要道具1(数字id),名称="李靖",类型="NPC",等级="无"})
		elseif 事件=="我要做其他事情" then
		    添加最后对话(数字id,"下界凡间遇到纷争可不要与他们一般见识，他们可是不讲理的。",{"交谈","给予","乾元丹学习","师门任务","学习技能","我想切换流派"})
        end
    elseif 名称=="杨戬" then
					 if 事件=="神器任务" then
				       	添加最后对话(数字id,"选择你需要领取的星级#R",{"1星","2星","3星","4星","5星","6星","7星","8星","9星"})
						elseif 事件=="1星" then
							设置任务9999(数字id)  --一星
					     elseif 事件=="2星" then
							设置任务9992(数字id)--二星
					     elseif 事件=="3星" then
							设置任务9993(数字id)--三星
					     elseif 事件=="4星" then
							设置任务9994(数字id)--四星
					     elseif 事件=="5星" then
							设置任务9995(数字id)--五星
					     elseif 事件=="6星" then
							设置任务9996(数字id)--六星
					     elseif 事件=="7星" then
							设置任务9997(数字id)--七星
					     elseif 事件=="8星" then
							设置任务9998(数字id)--八星
					     elseif 事件=="9星" then
							设置任务9989(数字id)--九星
						end
    end
end