
local sj = 取随机数
local format = string.format
local insert = table.insert
local ceil = math.ceil
local floor = math.floor
local wps = 取物品数据
local typ = type
local random = 取随机数

__NPCdh111[11181]=function (ID,编号,页数,已经在任务中,数字id)
	if 编号< 7 then
  	local mc =取假人表(11181,编号)
	wb=随机对话
	xx = {"赠送礼物","点错了，打扰了"}
	return {mc.模型,mc.名称,wb[取随机数(1,#wb)],xx}
	else
	wb=随机对话
  	local mc =取假人表(11181,编号)
	xx = {"挑战海妖大王","点错了，打扰了"}
	return {mc.模型,mc.名称,wb[取随机数(1,#wb)],xx}
	end

end
__NPCdh222[11181]=function  (id,数字id,序号,内容)
	local 事件=内容[1]
	local 名称=内容[3]

	if  名称=="皓月" and  事件=="赠送礼物" then
		玩家数据[数字id].阵营赠礼=13
		添加最后对话(数字id, "请问需要赠送的物品为",{"牡丹花(1点好感)","桃运花(3点好感)","紫兰花(5点好感)","百合花(7点好感)","玫瑰花(10点好感)"})
	elseif  名称=="玉游" and  事件=="赠送礼物" then
		玩家数据[数字id].阵营赠礼=14
		添加最后对话(数字id, "请问需要赠送的物品为",{"牡丹花(1点好感)","桃运花(3点好感)","紫兰花(5点好感)","百合花(7点好感)","玫瑰花(10点好感)"})
	elseif  名称=="火焰灵" and  事件=="赠送礼物" then
		玩家数据[数字id].阵营赠礼=15
		添加最后对话(数字id, "请问需要赠送的物品为",{"牡丹花(1点好感)","桃运花(3点好感)","紫兰花(5点好感)","百合花(7点好感)","玫瑰花(10点好感)"})
	elseif  名称=="红尘老" and  事件=="赠送礼物" then
		玩家数据[数字id].阵营赠礼=16
		添加最后对话(数字id, "请问需要赠送的物品为",{"牡丹花(1点好感)","桃运花(3点好感)","紫兰花(5点好感)","百合花(7点好感)","玫瑰花(10点好感)"})
	elseif  名称=="影月狼" and  事件=="赠送礼物" then
		玩家数据[数字id].阵营赠礼=17
		添加最后对话(数字id, "请问需要赠送的物品为",{"牡丹花(1点好感)","桃运花(3点好感)","紫兰花(5点好感)","百合花(7点好感)","玫瑰花(10点好感)"})
	elseif  名称=="花间妖" and  事件=="赠送礼物" then
		玩家数据[数字id].阵营赠礼=18
		添加最后对话(数字id, "请问需要赠送的物品为",{"牡丹花(1点好感)","桃运花(3点好感)","紫兰花(5点好感)","百合花(7点好感)","玫瑰花(10点好感)"})
	elseif  名称=="海妖大王" and  事件=="挑战海妖大王" then
		if 玩家数据[数字id].队伍==0 then return 添加最后对话(数字id,"单枪匹马还妄想挑战我，组队再来吧#71") end
		for n = 1, #队伍数据[玩家数据[数字id].队伍].成员数据 do
			local cyid=队伍数据[玩家数据[数字id].队伍].成员数据[n]
			if  阵营活动数据.海妖大王[cyid] then
				添加最后对话(数字id,"队伍内有玩家今日已经挑战过我了#71")
				return
			end
		end
		for n = 1, #队伍数据[玩家数据[数字id].队伍].成员数据 do
			local cyid=队伍数据[玩家数据[数字id].队伍].成员数据[n]
			阵营活动数据.海妖大王[cyid]=true
			战斗准备类:创建战斗(数字id+0,120069)
		end
	elseif   事件=="牡丹花(1点好感)" then
		if not 玩家数据[数字id].阵营赠礼 then
	             	添加最后对话(数字id,"数据出错，请重新选择#45。")
			return
		end
		if 玩家数据[数字id].双龙之战.数据.活动物品.礼物[1]<1 then
	             	添加最后对话(数字id,"你都没有牡丹花，不要来丢人了#45。")
			return
		end
		local 对象序列=math.floor((玩家数据[数字id].阵营赠礼-1)/6)+1
		local 对象序号=玩家数据[数字id].阵营赠礼-math.floor((玩家数据[数字id].阵营赠礼-1)/6)*6
		if not 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列]={[1]=0,[2]=0,[3]=0,[4]=0,[5]=0,[6]=0}
		end
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>=对象序列*100 then
			添加最后对话(数字id,"以我们的关系，已经不需要送这些东西啦#59。")
			return
		end
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+1
		if 双龙之战[玩家数据[数字id].双龙之战.数据.阵营].阵营占领[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+1
		常规提示(数字id,"#Y/当前阵营#R/第"..对象序列.."周#Y/获得了胜利，本次赠送礼物额外获得#G/1点好感度#Y/加成")
		end
		玩家数据[数字id].双龙之战.数据.活动物品.礼物[1]=玩家数据[数字id].双龙之战.数据.活动物品.礼物[1]-1
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>对象序列*100 then 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=对象序列*100 end
	             添加最后对话(数字id,"啊，感谢你的礼物，我真的是太喜欢啦。#89#89。")
	             玩家数据[数字id].阵营赠礼=nil
	elseif   事件=="桃运花(3点好感)" then
		if not 玩家数据[数字id].阵营赠礼 then
	             	添加最后对话(数字id,"数据出错，请重新选择#45。")
			return
		end
		if 玩家数据[数字id].双龙之战.数据.活动物品.礼物[2]<1 then
	             	添加最后对话(数字id,"你都没有桃运花，不要来丢人了#45。")
			return
		end
		local 对象序列=math.floor((玩家数据[数字id].阵营赠礼-1)/6)+1
		local 对象序号=玩家数据[数字id].阵营赠礼-math.floor((玩家数据[数字id].阵营赠礼-1)/6)*6
		if not 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列]={[1]=0,[2]=0,[3]=0,[4]=0,[5]=0,[6]=0}
		end
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>=对象序列*100 then
			添加最后对话(数字id,"以我们的关系，已经不需要送这些东西啦#59。")
			return
		end
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+3
			if 双龙之战[玩家数据[数字id].双龙之战.数据.阵营].阵营占领[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+1
		常规提示(数字id,"#Y/当前阵营#R/第"..对象序列.."周#Y/获得了胜利，本次赠送礼物额外获得#G/1点好感度#Y/加成")
		end
		玩家数据[数字id].双龙之战.数据.活动物品.礼物[2]=玩家数据[数字id].双龙之战.数据.活动物品.礼物[2]-1
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>对象序列*100 then 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=对象序列*100 end
	             添加最后对话(数字id,"你的善良让我感动，感谢你的慷慨！#89#89。")
	             玩家数据[数字id].阵营赠礼=nil
	elseif   事件=="紫兰花(5点好感)" then
		if not 玩家数据[数字id].阵营赠礼 then
	             	添加最后对话(数字id,"数据出错，请重新选择#45。")
			return
		end
		if 玩家数据[数字id].双龙之战.数据.活动物品.礼物[3]<1 then
	             	添加最后对话(数字id,"你都没有紫兰花，不要来丢人了#45。")
			return
		end
		local 对象序列=math.floor((玩家数据[数字id].阵营赠礼-1)/6)+1
		local 对象序号=玩家数据[数字id].阵营赠礼-math.floor((玩家数据[数字id].阵营赠礼-1)/6)*6
		if not 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列]={[1]=0,[2]=0,[3]=0,[4]=0,[5]=0,[6]=0}
		end
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>=对象序列*100 then
			添加最后对话(数字id,"以我们的关系，已经不需要送这些东西啦#59。")
			return
		end
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+5
			if 双龙之战[玩家数据[数字id].双龙之战.数据.阵营].阵营占领[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+2
		常规提示(数字id,"#Y/当前阵营#R/第"..对象序列.."周#Y/获得了胜利，本次赠送礼物额外获得#G/2点好感度#Y/加成")
		end
		玩家数据[数字id].双龙之战.数据.活动物品.礼物[3]=玩家数据[数字id].双龙之战.数据.活动物品.礼物[3]-1
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>对象序列*100 then 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=对象序列*100 end
	             添加最后对话(数字id,"我会好好珍惜这个礼物的，谢谢你！#89#89。")
	             玩家数据[数字id].阵营赠礼=nil
	elseif   事件=="百合花(7点好感)" then
		if not 玩家数据[数字id].阵营赠礼 then
	             	添加最后对话(数字id,"数据出错，请重新选择#45。")
			return
		end
		if 玩家数据[数字id].双龙之战.数据.活动物品.礼物[4]<1 then
	             	添加最后对话(数字id,"你都没有百合花，不要来丢人了#45。")
			return
		end
		local 对象序列=math.floor((玩家数据[数字id].阵营赠礼-1)/6)+1
		local 对象序号=玩家数据[数字id].阵营赠礼-math.floor((玩家数据[数字id].阵营赠礼-1)/6)*6
		if not 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列]={[1]=0,[2]=0,[3]=0,[4]=0,[5]=0,[6]=0}
		end
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>=对象序列*100 then
			添加最后对话(数字id,"以我们的关系，已经不需要送这些东西啦#59。")
			return
		end
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+7
			if 双龙之战[玩家数据[数字id].双龙之战.数据.阵营].阵营占领[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+2
		常规提示(数字id,"#Y/当前阵营#R/第"..对象序列.."周#Y/获得了胜利，本次赠送礼物额外获得#G/2点好感度#Y/加成")
		end
		玩家数据[数字id].双龙之战.数据.活动物品.礼物[4]=玩家数据[数字id].双龙之战.数据.活动物品.礼物[4]-1
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>对象序列*100 then 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=对象序列*100 end
	             添加最后对话(数字id,"谢谢你的心意，这份礼物让我充满了力量！#89#89。")
	             玩家数据[数字id].阵营赠礼=nil
	elseif   事件=="玫瑰花(10点好感)" then
		if not 玩家数据[数字id].阵营赠礼 then
	             	添加最后对话(数字id,"数据出错，请重新选择#45。")
			return
		end
		if 玩家数据[数字id].双龙之战.数据.活动物品.礼物[5]<1 then
	             	添加最后对话(数字id,"你都没有牡丹花，不要来丢人了#45。")
			return
		end
		local 对象序列=math.floor((玩家数据[数字id].阵营赠礼-1)/6)+1
		local 对象序号=玩家数据[数字id].阵营赠礼-math.floor((玩家数据[数字id].阵营赠礼-1)/6)*6
		if not 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列]={[1]=0,[2]=0,[3]=0,[4]=0,[5]=0,[6]=0}
		end
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>=对象序列*100 then
			添加最后对话(数字id,"以我们的关系，已经不需要送这些东西啦#59。")
			return
		end
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+10
			if 双龙之战[玩家数据[数字id].双龙之战.数据.阵营].阵营占领[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+3
		常规提示(数字id,"#Y/当前阵营#R/第"..对象序列.."周#Y/获得了胜利，本次赠送礼物额外获得#G/3点好感度#Y/加成")
		end
		玩家数据[数字id].双龙之战.数据.活动物品.礼物[5]=玩家数据[数字id].双龙之战.数据.活动物品.礼物[5]-1
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>对象序列*100 then 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=对象序列*100 end
	             添加最后对话(数字id,"哇，这太棒了！你真是个好朋友！#89#89。")
	             玩家数据[数字id].阵营赠礼=nil
	end
end



__NPCdh111[11191]=function (ID,编号,页数,已经在任务中,数字id)
  	local mc =取假人表(11191,编号)
	wb=随机对话
	xx = {"赠送礼物","点错了，打扰了"}
	return {mc.模型,mc.名称,wb[取随机数(1,#wb)],xx}

end
__NPCdh222[11191]=function  (id,数字id,序号,内容)
	local 事件=内容[1]
	local 名称=内容[3]
	if  名称=="蛙鸣智者" and  事件=="赠送礼物" then
		玩家数据[数字id].阵营赠礼=19
		添加最后对话(数字id, "请问需要赠送的物品为",{"牡丹花(1点好感)","桃运花(3点好感)","紫兰花(5点好感)","百合花(7点好感)","玫瑰花(10点好感)"})
	elseif  名称=="风舞神灵" and  事件=="赠送礼物" then
		玩家数据[数字id].阵营赠礼=20
		添加最后对话(数字id, "请问需要赠送的物品为",{"牡丹花(1点好感)","桃运花(3点好感)","紫兰花(5点好感)","百合花(7点好感)","玫瑰花(10点好感)"})
	elseif  名称=="竹韵诗人" and  事件=="赠送礼物" then
		玩家数据[数字id].阵营赠礼=21
		添加最后对话(数字id, "请问需要赠送的物品为",{"牡丹花(1点好感)","桃运花(3点好感)","紫兰花(5点好感)","百合花(7点好感)","玫瑰花(10点好感)"})
	elseif  名称=="霓裳歌姬" and  事件=="赠送礼物" then
		玩家数据[数字id].阵营赠礼=22
		添加最后对话(数字id, "请问需要赠送的物品为",{"牡丹花(1点好感)","桃运花(3点好感)","紫兰花(5点好感)","百合花(7点好感)","玫瑰花(10点好感)"})
	elseif  名称=="竹影道士" and  事件=="赠送礼物" then
		玩家数据[数字id].阵营赠礼=23
		添加最后对话(数字id, "请问需要赠送的物品为",{"牡丹花(1点好感)","桃运花(3点好感)","紫兰花(5点好感)","百合花(7点好感)","玫瑰花(10点好感)"})
	elseif  名称=="霞光游者" and  事件=="赠送礼物" then
		玩家数据[数字id].阵营赠礼=24
		添加最后对话(数字id, "请问需要赠送的物品为",{"牡丹花(1点好感)","桃运花(3点好感)","紫兰花(5点好感)","百合花(7点好感)","玫瑰花(10点好感)"})

	elseif   事件=="牡丹花(1点好感)" then
		if not 玩家数据[数字id].阵营赠礼 then
	             	添加最后对话(数字id,"数据出错，请重新选择#45。")
			return
		end
		if 玩家数据[数字id].双龙之战.数据.活动物品.礼物[1]<1 then
	             	添加最后对话(数字id,"你都没有牡丹花，不要来丢人了#45。")
			return
		end
		local 对象序列=math.floor((玩家数据[数字id].阵营赠礼-1)/6)+1
		local 对象序号=玩家数据[数字id].阵营赠礼-math.floor((玩家数据[数字id].阵营赠礼-1)/6)*6
		if not 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列]={[1]=0,[2]=0,[3]=0,[4]=0,[5]=0,[6]=0}
		end
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>=对象序列*100 then
			添加最后对话(数字id,"以我们的关系，已经不需要送这些东西啦#59。")
			return
		end
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+1

		if 双龙之战[玩家数据[数字id].双龙之战.数据.阵营].阵营占领[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+1
		常规提示(数字id,"#Y/当前阵营#R/第"..对象序列.."周#Y/获得了胜利，本次赠送礼物额外获得#G/1点好感度#Y/加成")
		end
		玩家数据[数字id].双龙之战.数据.活动物品.礼物[1]=玩家数据[数字id].双龙之战.数据.活动物品.礼物[1]-1
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>对象序列*100 then 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=对象序列*100 end
	             添加最后对话(数字id,"啊，感谢你的礼物，我真的是太喜欢啦。#89#89。")
	             玩家数据[数字id].阵营赠礼=nil
	elseif   事件=="桃运花(3点好感)" then
		if not 玩家数据[数字id].阵营赠礼 then
	             	添加最后对话(数字id,"数据出错，请重新选择#45。")
			return
		end
		if 玩家数据[数字id].双龙之战.数据.活动物品.礼物[2]<1 then
	             	添加最后对话(数字id,"你都没有桃运花，不要来丢人了#45。")
			return
		end
		local 对象序列=math.floor((玩家数据[数字id].阵营赠礼-1)/6)+1
		local 对象序号=玩家数据[数字id].阵营赠礼-math.floor((玩家数据[数字id].阵营赠礼-1)/6)*6
		if not 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列]={[1]=0,[2]=0,[3]=0,[4]=0,[5]=0,[6]=0}
		end
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>=对象序列*100 then
			添加最后对话(数字id,"以我们的关系，已经不需要送这些东西啦#59。")
			return
		end
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+3
		if 双龙之战[玩家数据[数字id].双龙之战.数据.阵营].阵营占领[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+1
		常规提示(数字id,"#Y/当前阵营#R/第"..对象序列.."周#Y/获得了胜利，本次赠送礼物额外获得#G/1点好感度#Y/加成")
		end
		玩家数据[数字id].双龙之战.数据.活动物品.礼物[2]=玩家数据[数字id].双龙之战.数据.活动物品.礼物[2]-1
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>对象序列*100 then 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=对象序列*100 end
	             添加最后对话(数字id,"你的善良让我感动，感谢你的慷慨！#89#89。")
	             玩家数据[数字id].阵营赠礼=nil
	elseif   事件=="紫兰花(5点好感)" then
		if not 玩家数据[数字id].阵营赠礼 then
	             	添加最后对话(数字id,"数据出错，请重新选择#45。")
			return
		end
		if 玩家数据[数字id].双龙之战.数据.活动物品.礼物[3]<1 then
	             	添加最后对话(数字id,"你都没有紫兰花，不要来丢人了#45。")
			return
		end
		local 对象序列=math.floor((玩家数据[数字id].阵营赠礼-1)/6)+1
		local 对象序号=玩家数据[数字id].阵营赠礼-math.floor((玩家数据[数字id].阵营赠礼-1)/6)*6
		if not 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列]={[1]=0,[2]=0,[3]=0,[4]=0,[5]=0,[6]=0}
		end
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>=对象序列*100 then
			添加最后对话(数字id,"以我们的关系，已经不需要送这些东西啦#59。")
			return
		end
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+5
		if 双龙之战[玩家数据[数字id].双龙之战.数据.阵营].阵营占领[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+2
		常规提示(数字id,"#Y/当前阵营#R/第"..对象序列.."周#Y/获得了胜利，本次赠送礼物额外获得#G/2点好感度#Y/加成")
		end
		玩家数据[数字id].双龙之战.数据.活动物品.礼物[3]=玩家数据[数字id].双龙之战.数据.活动物品.礼物[3]-1
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>对象序列*100 then 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=对象序列*100 end
	             添加最后对话(数字id,"我会好好珍惜这个礼物的，谢谢你！#89#89。")
	             玩家数据[数字id].阵营赠礼=nil
	elseif   事件=="百合花(7点好感)" then
		if not 玩家数据[数字id].阵营赠礼 then
	             	添加最后对话(数字id,"数据出错，请重新选择#45。")
			return
		end
		if 玩家数据[数字id].双龙之战.数据.活动物品.礼物[4]<1 then
	             	添加最后对话(数字id,"你都没有百合花，不要来丢人了#45。")
			return
		end
		local 对象序列=math.floor((玩家数据[数字id].阵营赠礼-1)/6)+1
		local 对象序号=玩家数据[数字id].阵营赠礼-math.floor((玩家数据[数字id].阵营赠礼-1)/6)*6
		if not 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列]={[1]=0,[2]=0,[3]=0,[4]=0,[5]=0,[6]=0}
		end
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>=对象序列*100 then
			添加最后对话(数字id,"以我们的关系，已经不需要送这些东西啦#59。")
			return
		end
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+7
		if 双龙之战[玩家数据[数字id].双龙之战.数据.阵营].阵营占领[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+2
		常规提示(数字id,"#Y/当前阵营#R/第"..对象序列.."周#Y/获得了胜利，本次赠送礼物额外获得#G/2点好感度#Y/加成")
		end
		玩家数据[数字id].双龙之战.数据.活动物品.礼物[4]=玩家数据[数字id].双龙之战.数据.活动物品.礼物[4]-1
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>对象序列*100 then 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=对象序列*100 end
	             添加最后对话(数字id,"谢谢你的心意，这份礼物让我充满了力量！#89#89。")
	             玩家数据[数字id].阵营赠礼=nil
	elseif   事件=="玫瑰花(10点好感)" then
		if not 玩家数据[数字id].阵营赠礼 then
	             	添加最后对话(数字id,"数据出错，请重新选择#45。")
			return
		end
		if 玩家数据[数字id].双龙之战.数据.活动物品.礼物[5]<1 then
	             	添加最后对话(数字id,"你都没有牡丹花，不要来丢人了#45。")
			return
		end
		local 对象序列=math.floor((玩家数据[数字id].阵营赠礼-1)/6)+1
		local 对象序号=玩家数据[数字id].阵营赠礼-math.floor((玩家数据[数字id].阵营赠礼-1)/6)*6
		if not 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列]={[1]=0,[2]=0,[3]=0,[4]=0,[5]=0,[6]=0}
		end
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>=对象序列*100 then
			添加最后对话(数字id,"以我们的关系，已经不需要送这些东西啦#59。")
			return
		end
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+10
		if 双龙之战[玩家数据[数字id].双龙之战.数据.阵营].阵营占领[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+3
		常规提示(数字id,"#Y/当前阵营#R/第"..对象序列.."周#Y/获得了胜利，本次赠送礼物额外获得#G/3点好感度#Y/加成")
		end
		玩家数据[数字id].双龙之战.数据.活动物品.礼物[5]=玩家数据[数字id].双龙之战.数据.活动物品.礼物[5]-1
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>对象序列*100 then 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=对象序列*100 end
	             添加最后对话(数字id,"哇，这太棒了！你真是个好朋友！#89#89。")
	             玩家数据[数字id].阵营赠礼=nil
	end
end



__NPCdh111[11201]=function (ID,编号,页数,已经在任务中,数字id)
  	local mc =取假人表(11201,编号)
	wb=随机对话
	xx = {"赠送礼物","点错了，打扰了"}
	return {mc.模型,mc.名称,wb[取随机数(1,#wb)],xx}

end
__NPCdh222[11201]=function  (id,数字id,序号,内容)
	local 事件=内容[1]
	local 名称=内容[3]
	if  名称=="幽蓝女神" and  事件=="赠送礼物" then
		玩家数据[数字id].阵营赠礼=25
		添加最后对话(数字id, "请问需要赠送的物品为",{"牡丹花(1点好感)","桃运花(3点好感)","紫兰花(5点好感)","百合花(7点好感)","玫瑰花(10点好感)"})
	elseif  名称=="迷雾" and  事件=="赠送礼物" then
		玩家数据[数字id].阵营赠礼=26
		添加最后对话(数字id, "请问需要赠送的物品为",{"牡丹花(1点好感)","桃运花(3点好感)","紫兰花(5点好感)","百合花(7点好感)","玫瑰花(10点好感)"})
	elseif  名称=="猕猴" and  事件=="赠送礼物" then
		玩家数据[数字id].阵营赠礼=27
		添加最后对话(数字id, "请问需要赠送的物品为",{"牡丹花(1点好感)","桃运花(3点好感)","紫兰花(5点好感)","百合花(7点好感)","玫瑰花(10点好感)"})
	elseif  名称=="青藤" and  事件=="赠送礼物" then
		玩家数据[数字id].阵营赠礼=28
		添加最后对话(数字id, "请问需要赠送的物品为",{"牡丹花(1点好感)","桃运花(3点好感)","紫兰花(5点好感)","百合花(7点好感)","玫瑰花(10点好感)"})
	elseif  名称=="苍穹" and  事件=="赠送礼物" then
		玩家数据[数字id].阵营赠礼=29
		添加最后对话(数字id, "请问需要赠送的物品为",{"牡丹花(1点好感)","桃运花(3点好感)","紫兰花(5点好感)","百合花(7点好感)","玫瑰花(10点好感)"})
	elseif  名称=="星辰" and  事件=="赠送礼物" then
		玩家数据[数字id].阵营赠礼=30
		添加最后对话(数字id, "请问需要赠送的物品为",{"牡丹花(1点好感)","桃运花(3点好感)","紫兰花(5点好感)","百合花(7点好感)","玫瑰花(10点好感)"})

	elseif   事件=="牡丹花(1点好感)" then
		if not 玩家数据[数字id].阵营赠礼 then
	             	添加最后对话(数字id,"数据出错，请重新选择#45。")
			return
		end
		if 玩家数据[数字id].双龙之战.数据.活动物品.礼物[1]<1 then
	             	添加最后对话(数字id,"你都没有牡丹花，不要来丢人了#45。")
			return
		end
		local 对象序列=math.floor((玩家数据[数字id].阵营赠礼-1)/6)+1
		local 对象序号=玩家数据[数字id].阵营赠礼-math.floor((玩家数据[数字id].阵营赠礼-1)/6)*6
		if not 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列]={[1]=0,[2]=0,[3]=0,[4]=0,[5]=0,[6]=0}
		end
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>=对象序列*100 then
			添加最后对话(数字id,"以我们的关系，已经不需要送这些东西啦#59。")
			return
		end
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+1
		if 双龙之战[玩家数据[数字id].双龙之战.数据.阵营].阵营占领[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+1
		常规提示(数字id,"#Y/当前阵营#R/第"..对象序列.."周#Y/获得了胜利，本次赠送礼物额外获得#G/1点好感度#Y/加成")
		end
		玩家数据[数字id].双龙之战.数据.活动物品.礼物[1]=玩家数据[数字id].双龙之战.数据.活动物品.礼物[1]-1
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>对象序列*100 then 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=对象序列*100 end
	             添加最后对话(数字id,"啊，感谢你的礼物，我真的是太喜欢啦。#89#89。")
	             玩家数据[数字id].阵营赠礼=nil
	elseif   事件=="桃运花(3点好感)" then
		if not 玩家数据[数字id].阵营赠礼 then
	             	添加最后对话(数字id,"数据出错，请重新选择#45。")
			return
		end
		if 玩家数据[数字id].双龙之战.数据.活动物品.礼物[2]<1 then
	             	添加最后对话(数字id,"你都没有桃运花，不要来丢人了#45。")
			return
		end
		local 对象序列=math.floor((玩家数据[数字id].阵营赠礼-1)/6)+1
		local 对象序号=玩家数据[数字id].阵营赠礼-math.floor((玩家数据[数字id].阵营赠礼-1)/6)*6
		if not 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列]={[1]=0,[2]=0,[3]=0,[4]=0,[5]=0,[6]=0}
		end
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>=对象序列*100 then
			添加最后对话(数字id,"以我们的关系，已经不需要送这些东西啦#59。")
			return
		end
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+3
		if 双龙之战[玩家数据[数字id].双龙之战.数据.阵营].阵营占领[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+1
		常规提示(数字id,"#Y/当前阵营#R/第"..对象序列.."周#Y/获得了胜利，本次赠送礼物额外获得#G/1点好感度#Y/加成")
		end
		玩家数据[数字id].双龙之战.数据.活动物品.礼物[2]=玩家数据[数字id].双龙之战.数据.活动物品.礼物[2]-1
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>对象序列*100 then 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=对象序列*100 end
	             添加最后对话(数字id,"你的善良让我感动，感谢你的慷慨！#89#89。")
	             玩家数据[数字id].阵营赠礼=nil
	elseif   事件=="紫兰花(5点好感)" then
		if not 玩家数据[数字id].阵营赠礼 then
	             	添加最后对话(数字id,"数据出错，请重新选择#45。")
			return
		end
		if 玩家数据[数字id].双龙之战.数据.活动物品.礼物[3]<1 then
	             	添加最后对话(数字id,"你都没有紫兰花，不要来丢人了#45。")
			return
		end
		local 对象序列=math.floor((玩家数据[数字id].阵营赠礼-1)/6)+1
		local 对象序号=玩家数据[数字id].阵营赠礼-math.floor((玩家数据[数字id].阵营赠礼-1)/6)*6
		if not 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列]={[1]=0,[2]=0,[3]=0,[4]=0,[5]=0,[6]=0}
		end
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>=对象序列*100 then
			添加最后对话(数字id,"以我们的关系，已经不需要送这些东西啦#59。")
			return
		end
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+5
		if 双龙之战[玩家数据[数字id].双龙之战.数据.阵营].阵营占领[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+2
		常规提示(数字id,"#Y/当前阵营#R/第"..对象序列.."周#Y/获得了胜利，本次赠送礼物额外获得#G/2点好感度#Y/加成")
		end
		玩家数据[数字id].双龙之战.数据.活动物品.礼物[3]=玩家数据[数字id].双龙之战.数据.活动物品.礼物[3]-1
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>对象序列*100 then 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=对象序列*100 end
	             添加最后对话(数字id,"我会好好珍惜这个礼物的，谢谢你！#89#89。")
	             玩家数据[数字id].阵营赠礼=nil
	elseif   事件=="百合花(7点好感)" then
		if not 玩家数据[数字id].阵营赠礼 then
	             	添加最后对话(数字id,"数据出错，请重新选择#45。")
			return
		end
		if 玩家数据[数字id].双龙之战.数据.活动物品.礼物[4]<1 then
	             	添加最后对话(数字id,"你都没有百合花，不要来丢人了#45。")
			return
		end
		local 对象序列=math.floor((玩家数据[数字id].阵营赠礼-1)/6)+1
		local 对象序号=玩家数据[数字id].阵营赠礼-math.floor((玩家数据[数字id].阵营赠礼-1)/6)*6
		if not 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列]={[1]=0,[2]=0,[3]=0,[4]=0,[5]=0,[6]=0}
		end
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>=对象序列*100 then
			添加最后对话(数字id,"以我们的关系，已经不需要送这些东西啦#59。")
			return
		end
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+7
		if 双龙之战[玩家数据[数字id].双龙之战.数据.阵营].阵营占领[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+2
		常规提示(数字id,"#Y/当前阵营#R/第"..对象序列.."周#Y/获得了胜利，本次赠送礼物额外获得#G/2点好感度#Y/加成")
		end
		玩家数据[数字id].双龙之战.数据.活动物品.礼物[4]=玩家数据[数字id].双龙之战.数据.活动物品.礼物[4]-1
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>对象序列*100 then 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=对象序列*100 end
	             添加最后对话(数字id,"谢谢你的心意，这份礼物让我充满了力量！#89#89。")
	             玩家数据[数字id].阵营赠礼=nil
	elseif   事件=="玫瑰花(10点好感)" then
		if not 玩家数据[数字id].阵营赠礼 then
	             	添加最后对话(数字id,"数据出错，请重新选择#45。")
			return
		end
		if 玩家数据[数字id].双龙之战.数据.活动物品.礼物[5]<1 then
	             	添加最后对话(数字id,"你都没有牡丹花，不要来丢人了#45。")
			return
		end
		local 对象序列=math.floor((玩家数据[数字id].阵营赠礼-1)/6)+1
		local 对象序号=玩家数据[数字id].阵营赠礼-math.floor((玩家数据[数字id].阵营赠礼-1)/6)*6
		if not 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列]={[1]=0,[2]=0,[3]=0,[4]=0,[5]=0,[6]=0}
		end
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>=对象序列*100 then
			添加最后对话(数字id,"以我们的关系，已经不需要送这些东西啦#59。")
			return
		end
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+10
		if 双龙之战[玩家数据[数字id].双龙之战.数据.阵营].阵营占领[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+3
		常规提示(数字id,"#Y/当前阵营#R/第"..对象序列.."周#Y/获得了胜利，本次赠送礼物额外获得#G/3点好感度#Y/加成")
		end
		玩家数据[数字id].双龙之战.数据.活动物品.礼物[5]=玩家数据[数字id].双龙之战.数据.活动物品.礼物[5]-1
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>对象序列*100 then 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=对象序列*100 end
	             添加最后对话(数字id,"哇，这太棒了！你真是个好朋友！#89#89。")
	             玩家数据[数字id].阵营赠礼=nil
	end
end


__NPCdh111[11211]=function (ID,编号,页数,已经在任务中,数字id)
  	local mc =取假人表(11211,编号)
	wb=随机对话
	xx = {"赠送礼物","点错了，打扰了"}
	return {mc.模型,mc.名称,wb[取随机数(1,#wb)],xx}

end
__NPCdh222[11211]=function  (id,数字id,序号,内容)
	local 事件=内容[1]
	local 名称=内容[3]
	if  名称=="火焰神灵" and  事件=="赠送礼物" then
		玩家数据[数字id].阵营赠礼=31
		添加最后对话(数字id, "请问需要赠送的物品为",{"牡丹花(1点好感)","桃运花(3点好感)","紫兰花(5点好感)","百合花(7点好感)","玫瑰花(10点好感)"})
	elseif  名称=="风铃" and  事件=="赠送礼物" then
		玩家数据[数字id].阵营赠礼=32
		添加最后对话(数字id, "请问需要赠送的物品为",{"牡丹花(1点好感)","桃运花(3点好感)","紫兰花(5点好感)","百合花(7点好感)","玫瑰花(10点好感)"})
	elseif  名称=="夜雨道长" and  事件=="赠送礼物" then
		玩家数据[数字id].阵营赠礼=33
		添加最后对话(数字id, "请问需要赠送的物品为",{"牡丹花(1点好感)","桃运花(3点好感)","紫兰花(5点好感)","百合花(7点好感)","玫瑰花(10点好感)"})
	elseif  名称=="月影" and  事件=="赠送礼物" then
		玩家数据[数字id].阵营赠礼=34
		添加最后对话(数字id, "请问需要赠送的物品为",{"牡丹花(1点好感)","桃运花(3点好感)","紫兰花(5点好感)","百合花(7点好感)","玫瑰花(10点好感)"})
	elseif  名称=="紫霄" and  事件=="赠送礼物" then
		玩家数据[数字id].阵营赠礼=35
		添加最后对话(数字id, "请问需要赠送的物品为",{"牡丹花(1点好感)","桃运花(3点好感)","紫兰花(5点好感)","百合花(7点好感)","玫瑰花(10点好感)"})
	elseif  名称=="碧海" and  事件=="赠送礼物" then
		玩家数据[数字id].阵营赠礼=36
		添加最后对话(数字id, "请问需要赠送的物品为",{"牡丹花(1点好感)","桃运花(3点好感)","紫兰花(5点好感)","百合花(7点好感)","玫瑰花(10点好感)"})

	elseif   事件=="牡丹花(1点好感)" then
		if not 玩家数据[数字id].阵营赠礼 then
	             	添加最后对话(数字id,"数据出错，请重新选择#45。")
			return
		end
		if 玩家数据[数字id].双龙之战.数据.活动物品.礼物[1]<1 then
	             	添加最后对话(数字id,"你都没有牡丹花，不要来丢人了#45。")
			return
		end
		local 对象序列=math.floor((玩家数据[数字id].阵营赠礼-1)/6)+1
		local 对象序号=玩家数据[数字id].阵营赠礼-math.floor((玩家数据[数字id].阵营赠礼-1)/6)*6
		if not 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列]={[1]=0,[2]=0,[3]=0,[4]=0,[5]=0,[6]=0}
		end
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>=对象序列*100 then
			添加最后对话(数字id,"以我们的关系，已经不需要送这些东西啦#59。")
			return
		end
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+1
		if 双龙之战[玩家数据[数字id].双龙之战.数据.阵营].阵营占领[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+1
		常规提示(数字id,"#Y/当前阵营#R/第"..对象序列.."周#Y/获得了胜利，本次赠送礼物额外获得#G/1点好感度#Y/加成")
		end
		玩家数据[数字id].双龙之战.数据.活动物品.礼物[1]=玩家数据[数字id].双龙之战.数据.活动物品.礼物[1]-1
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>对象序列*100 then 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=对象序列*100 end
	             添加最后对话(数字id,"啊，感谢你的礼物，我真的是太喜欢啦。#89#89。")
	             玩家数据[数字id].阵营赠礼=nil
	elseif   事件=="桃运花(3点好感)" then
		if not 玩家数据[数字id].阵营赠礼 then
	             	添加最后对话(数字id,"数据出错，请重新选择#45。")
			return
		end
		if 玩家数据[数字id].双龙之战.数据.活动物品.礼物[2]<1 then
	             	添加最后对话(数字id,"你都没有桃运花，不要来丢人了#45。")
			return
		end
		local 对象序列=math.floor((玩家数据[数字id].阵营赠礼-1)/6)+1
		local 对象序号=玩家数据[数字id].阵营赠礼-math.floor((玩家数据[数字id].阵营赠礼-1)/6)*6
		if not 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列]={[1]=0,[2]=0,[3]=0,[4]=0,[5]=0,[6]=0}
		end
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>=对象序列*100 then
			添加最后对话(数字id,"以我们的关系，已经不需要送这些东西啦#59。")
			return
		end
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+3
		if 双龙之战[玩家数据[数字id].双龙之战.数据.阵营].阵营占领[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+1
		常规提示(数字id,"#Y/当前阵营#R/第"..对象序列.."周#Y/获得了胜利，本次赠送礼物额外获得#G/1点好感度#Y/加成")
		end
		玩家数据[数字id].双龙之战.数据.活动物品.礼物[2]=玩家数据[数字id].双龙之战.数据.活动物品.礼物[2]-1
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>对象序列*100 then 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=对象序列*100 end
	             添加最后对话(数字id,"你的善良让我感动，感谢你的慷慨！#89#89。")
	             玩家数据[数字id].阵营赠礼=nil
	elseif   事件=="紫兰花(5点好感)" then
		if not 玩家数据[数字id].阵营赠礼 then
	             	添加最后对话(数字id,"数据出错，请重新选择#45。")
			return
		end
		if 玩家数据[数字id].双龙之战.数据.活动物品.礼物[3]<1 then
	             	添加最后对话(数字id,"你都没有紫兰花，不要来丢人了#45。")
			return
		end
		local 对象序列=math.floor((玩家数据[数字id].阵营赠礼-1)/6)+1
		local 对象序号=玩家数据[数字id].阵营赠礼-math.floor((玩家数据[数字id].阵营赠礼-1)/6)*6
		if not 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列]={[1]=0,[2]=0,[3]=0,[4]=0,[5]=0,[6]=0}
		end
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>=对象序列*100 then
			添加最后对话(数字id,"以我们的关系，已经不需要送这些东西啦#59。")
			return
		end
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+5
		if 双龙之战[玩家数据[数字id].双龙之战.数据.阵营].阵营占领[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+2
		常规提示(数字id,"#Y/当前阵营#R/第"..对象序列.."周#Y/获得了胜利，本次赠送礼物额外获得#G/2点好感度#Y/加成")
		end
		玩家数据[数字id].双龙之战.数据.活动物品.礼物[3]=玩家数据[数字id].双龙之战.数据.活动物品.礼物[3]-1
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>对象序列*100 then 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=对象序列*100 end
	             添加最后对话(数字id,"我会好好珍惜这个礼物的，谢谢你！#89#89。")
	             玩家数据[数字id].阵营赠礼=nil
	elseif   事件=="百合花(7点好感)" then
		if not 玩家数据[数字id].阵营赠礼 then
	             	添加最后对话(数字id,"数据出错，请重新选择#45。")
			return
		end
		if 玩家数据[数字id].双龙之战.数据.活动物品.礼物[4]<1 then
	             	添加最后对话(数字id,"你都没有百合花，不要来丢人了#45。")
			return
		end
		local 对象序列=math.floor((玩家数据[数字id].阵营赠礼-1)/6)+1
		local 对象序号=玩家数据[数字id].阵营赠礼-math.floor((玩家数据[数字id].阵营赠礼-1)/6)*6
		if not 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列]={[1]=0,[2]=0,[3]=0,[4]=0,[5]=0,[6]=0}
		end
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>=对象序列*100 then
			添加最后对话(数字id,"以我们的关系，已经不需要送这些东西啦#59。")
			return
		end
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+7
		if 双龙之战[玩家数据[数字id].双龙之战.数据.阵营].阵营占领[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+2
		常规提示(数字id,"#Y/当前阵营#R/第"..对象序列.."周#Y/获得了胜利，本次赠送礼物额外获得#G/2点好感度#Y/加成")
		end
		玩家数据[数字id].双龙之战.数据.活动物品.礼物[4]=玩家数据[数字id].双龙之战.数据.活动物品.礼物[4]-1
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>对象序列*100 then 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=对象序列*100 end
	             添加最后对话(数字id,"谢谢你的心意，这份礼物让我充满了力量！#89#89。")
	             玩家数据[数字id].阵营赠礼=nil
	elseif   事件=="玫瑰花(10点好感)" then
		if not 玩家数据[数字id].阵营赠礼 then
	             	添加最后对话(数字id,"数据出错，请重新选择#45。")
			return
		end
		if 玩家数据[数字id].双龙之战.数据.活动物品.礼物[5]<1 then
	             	添加最后对话(数字id,"你都没有牡丹花，不要来丢人了#45。")
			return
		end
		local 对象序列=math.floor((玩家数据[数字id].阵营赠礼-1)/6)+1
		local 对象序号=玩家数据[数字id].阵营赠礼-math.floor((玩家数据[数字id].阵营赠礼-1)/6)*6
		if not 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列]={[1]=0,[2]=0,[3]=0,[4]=0,[5]=0,[6]=0}
		end
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>=对象序列*100 then
			添加最后对话(数字id,"以我们的关系，已经不需要送这些东西啦#59。")
			return
		end
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+10
		if 双龙之战[玩家数据[数字id].双龙之战.数据.阵营].阵营占领[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+3
		常规提示(数字id,"#Y/当前阵营#R/第"..对象序列.."周#Y/获得了胜利，本次赠送礼物额外获得#G/3点好感度#Y/加成")
		end
		玩家数据[数字id].双龙之战.数据.活动物品.礼物[5]=玩家数据[数字id].双龙之战.数据.活动物品.礼物[5]-1
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>对象序列*100 then 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=对象序列*100 end
	             添加最后对话(数字id,"哇，这太棒了！你真是个好朋友！#89#89。")
	             玩家数据[数字id].阵营赠礼=nil
	end
end


__NPCdh111[15321]=function (ID,编号,页数,已经在任务中,数字id)
  	local mc =取假人表(15321,编号)
	wb=随机对话
	xx = {"赠送礼物","点错了，打扰了"}
	return {mc.模型,mc.名称,wb[取随机数(1,#wb)],xx}

end
__NPCdh222[15321]=function  (id,数字id,序号,内容)
	local 事件=内容[1]
	local 名称=内容[3]
	if  名称=="碧云仙子" and  事件=="赠送礼物" then
		玩家数据[数字id].阵营赠礼=37
		添加最后对话(数字id, "请问需要赠送的物品为",{"牡丹花(1点好感)","桃运花(3点好感)","紫兰花(5点好感)","百合花(7点好感)","玫瑰花(10点好感)"})
	elseif  名称=="妖姬" and  事件=="赠送礼物" then
		玩家数据[数字id].阵营赠礼=38
		添加最后对话(数字id, "请问需要赠送的物品为",{"牡丹花(1点好感)","桃运花(3点好感)","紫兰花(5点好感)","百合花(7点好感)","玫瑰花(10点好感)"})
	elseif  名称=="雷霆" and  事件=="赠送礼物" then
		玩家数据[数字id].阵营赠礼=39
		添加最后对话(数字id, "请问需要赠送的物品为",{"牡丹花(1点好感)","桃运花(3点好感)","紫兰花(5点好感)","百合花(7点好感)","玫瑰花(10点好感)"})
	elseif  名称=="雪域神灵" and  事件=="赠送礼物" then
		玩家数据[数字id].阵营赠礼=40
		添加最后对话(数字id, "请问需要赠送的物品为",{"牡丹花(1点好感)","桃运花(3点好感)","紫兰花(5点好感)","百合花(7点好感)","玫瑰花(10点好感)"})
	elseif  名称=="追梦猎手" and  事件=="赠送礼物" then
		玩家数据[数字id].阵营赠礼=41
		添加最后对话(数字id, "请问需要赠送的物品为",{"牡丹花(1点好感)","桃运花(3点好感)","紫兰花(5点好感)","百合花(7点好感)","玫瑰花(10点好感)"})
	elseif  名称=="雪舞" and  事件=="赠送礼物" then
		玩家数据[数字id].阵营赠礼=42
		添加最后对话(数字id, "请问需要赠送的物品为",{"牡丹花(1点好感)","桃运花(3点好感)","紫兰花(5点好感)","百合花(7点好感)","玫瑰花(10点好感)"})

	elseif   事件=="牡丹花(1点好感)" then
		if not 玩家数据[数字id].阵营赠礼 then
	             	添加最后对话(数字id,"数据出错，请重新选择#45。")
			return
		end
		if 玩家数据[数字id].双龙之战.数据.活动物品.礼物[1]<1 then
	             	添加最后对话(数字id,"你都没有牡丹花，不要来丢人了#45。")
			return
		end
		local 对象序列=math.floor((玩家数据[数字id].阵营赠礼-1)/6)+1
		local 对象序号=玩家数据[数字id].阵营赠礼-math.floor((玩家数据[数字id].阵营赠礼-1)/6)*6
		if not 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列]={[1]=0,[2]=0,[3]=0,[4]=0,[5]=0,[6]=0}
		end
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>=对象序列*100 then
			添加最后对话(数字id,"以我们的关系，已经不需要送这些东西啦#59。")
			return
		end
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+1
		if 双龙之战[玩家数据[数字id].双龙之战.数据.阵营].阵营占领[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+1
		常规提示(数字id,"#Y/当前阵营#R/第"..对象序列.."周#Y/获得了胜利，本次赠送礼物额外获得#G/1点好感度#Y/加成")
		end
		玩家数据[数字id].双龙之战.数据.活动物品.礼物[1]=玩家数据[数字id].双龙之战.数据.活动物品.礼物[1]-1
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>对象序列*100 then 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=对象序列*100 end
	             添加最后对话(数字id,"啊，感谢你的礼物，我真的是太喜欢啦。#89#89。")
	             玩家数据[数字id].阵营赠礼=nil
	elseif   事件=="桃运花(3点好感)" then
		if not 玩家数据[数字id].阵营赠礼 then
	             	添加最后对话(数字id,"数据出错，请重新选择#45。")
			return
		end
		if 玩家数据[数字id].双龙之战.数据.活动物品.礼物[2]<1 then
	             	添加最后对话(数字id,"你都没有桃运花，不要来丢人了#45。")
			return
		end
		local 对象序列=math.floor((玩家数据[数字id].阵营赠礼-1)/6)+1
		local 对象序号=玩家数据[数字id].阵营赠礼-math.floor((玩家数据[数字id].阵营赠礼-1)/6)*6
		if not 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列]={[1]=0,[2]=0,[3]=0,[4]=0,[5]=0,[6]=0}
		end
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>=对象序列*100 then
			添加最后对话(数字id,"以我们的关系，已经不需要送这些东西啦#59。")
			return
		end
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+3
		if 双龙之战[玩家数据[数字id].双龙之战.数据.阵营].阵营占领[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+1
		常规提示(数字id,"#Y/当前阵营#R/第"..对象序列.."周#Y/获得了胜利，本次赠送礼物额外获得#G/1点好感度#Y/加成")
		end
		玩家数据[数字id].双龙之战.数据.活动物品.礼物[2]=玩家数据[数字id].双龙之战.数据.活动物品.礼物[2]-1
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>对象序列*100 then 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=对象序列*100 end
	             添加最后对话(数字id,"你的善良让我感动，感谢你的慷慨！#89#89。")
	             玩家数据[数字id].阵营赠礼=nil
	elseif   事件=="紫兰花(5点好感)" then
		if not 玩家数据[数字id].阵营赠礼 then
	             	添加最后对话(数字id,"数据出错，请重新选择#45。")
			return
		end
		if 玩家数据[数字id].双龙之战.数据.活动物品.礼物[3]<1 then
	             	添加最后对话(数字id,"你都没有紫兰花，不要来丢人了#45。")
			return
		end
		local 对象序列=math.floor((玩家数据[数字id].阵营赠礼-1)/6)+1
		local 对象序号=玩家数据[数字id].阵营赠礼-math.floor((玩家数据[数字id].阵营赠礼-1)/6)*6
		if not 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列]={[1]=0,[2]=0,[3]=0,[4]=0,[5]=0,[6]=0}
		end
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>=对象序列*100 then
			添加最后对话(数字id,"以我们的关系，已经不需要送这些东西啦#59。")
			return
		end
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+5
		if 双龙之战[玩家数据[数字id].双龙之战.数据.阵营].阵营占领[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+2
		常规提示(数字id,"#Y/当前阵营#R/第"..对象序列.."周#Y/获得了胜利，本次赠送礼物额外获得#G/2点好感度#Y/加成")
		end
		玩家数据[数字id].双龙之战.数据.活动物品.礼物[3]=玩家数据[数字id].双龙之战.数据.活动物品.礼物[3]-1
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>对象序列*100 then 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=对象序列*100 end
	             添加最后对话(数字id,"我会好好珍惜这个礼物的，谢谢你！#89#89。")
	             玩家数据[数字id].阵营赠礼=nil
	elseif   事件=="百合花(7点好感)" then
		if not 玩家数据[数字id].阵营赠礼 then
	             	添加最后对话(数字id,"数据出错，请重新选择#45。")
			return
		end
		if 玩家数据[数字id].双龙之战.数据.活动物品.礼物[4]<1 then
	             	添加最后对话(数字id,"你都没有百合花，不要来丢人了#45。")
			return
		end
		local 对象序列=math.floor((玩家数据[数字id].阵营赠礼-1)/6)+1
		local 对象序号=玩家数据[数字id].阵营赠礼-math.floor((玩家数据[数字id].阵营赠礼-1)/6)*6
		if not 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列]={[1]=0,[2]=0,[3]=0,[4]=0,[5]=0,[6]=0}
		end
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>=对象序列*100 then
			添加最后对话(数字id,"以我们的关系，已经不需要送这些东西啦#59。")
			return
		end
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+7
		if 双龙之战[玩家数据[数字id].双龙之战.数据.阵营].阵营占领[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+2
		常规提示(数字id,"#Y/当前阵营#R/第"..对象序列.."周#Y/获得了胜利，本次赠送礼物额外获得#G/2点好感度#Y/加成")
		end
		玩家数据[数字id].双龙之战.数据.活动物品.礼物[4]=玩家数据[数字id].双龙之战.数据.活动物品.礼物[4]-1
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>对象序列*100 then 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=对象序列*100 end
	             添加最后对话(数字id,"谢谢你的心意，这份礼物让我充满了力量！#89#89。")
	             玩家数据[数字id].阵营赠礼=nil
	elseif   事件=="玫瑰花(10点好感)" then
		if not 玩家数据[数字id].阵营赠礼 then
	             	添加最后对话(数字id,"数据出错，请重新选择#45。")
			return
		end
		if 玩家数据[数字id].双龙之战.数据.活动物品.礼物[5]<1 then
	             	添加最后对话(数字id,"你都没有牡丹花，不要来丢人了#45。")
			return
		end
		local 对象序列=math.floor((玩家数据[数字id].阵营赠礼-1)/6)+1
		local 对象序号=玩家数据[数字id].阵营赠礼-math.floor((玩家数据[数字id].阵营赠礼-1)/6)*6
		if not 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列]={[1]=0,[2]=0,[3]=0,[4]=0,[5]=0,[6]=0}
		end
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>=对象序列*100 then
			添加最后对话(数字id,"以我们的关系，已经不需要送这些东西啦#59。")
			return
		end
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+10
		if 双龙之战[玩家数据[数字id].双龙之战.数据.阵营].阵营占领[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+3
		常规提示(数字id,"#Y/当前阵营#R/第"..对象序列.."周#Y/获得了胜利，本次赠送礼物额外获得#G/3点好感度#Y/加成")
		end
		玩家数据[数字id].双龙之战.数据.活动物品.礼物[5]=玩家数据[数字id].双龙之战.数据.活动物品.礼物[5]-1
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>对象序列*100 then 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=对象序列*100 end
	             添加最后对话(数字id,"哇，这太棒了！你真是个好朋友！#89#89。")
	             玩家数据[数字id].阵营赠礼=nil
	end
end




