-- @Author: baidwwy
-- @Date:   2024-02-28 03:46:40
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2025-03-01 22:27:47
-- @作者: baidwwy
-- @邮箱:  313738139@qq.com
-- @创建时间:   2021-01-31 18:26:55
-- @最后修改来自: baidwwy
-- @Last Modified time: 2023-12-02 14:50:07
local sj = 取随机数
local format = string.format
local insert = table.insert
local ceil = math.ceil
local floor = math.floor
local wps = 取物品数据
local typ = type
local random = 取随机数

__NPCdh111[1249]=function (ID,编号,页数,已经在任务中,数字id)
	local wb = {}
	local xx = {}
	if 编号 == 1 then
		wb[1] = "学了本领要用在正途，不许恃强凌弱。"
		wb[2] = "修行要注重基础，持之以恒，切忌好高骛远。"
		wb[3] = "想成为仙界的精英，还要下一番苦功夫啊～"
		wb[4] = "我观中的人参果树乃是混沌初分，鸿蒙初判，天地未开之际产成的灵根。"
		wb[5] = "师傅领进门，修行在个人。本门法术之精妙还望各位多多领悟。"
		local xx = {"加入东海渊","交谈","给予","乾元丹学习","师门任务","学习技能","我想切换流派","门派秘籍学习","本命法宝相关"}
		return {"灵龟","灵龟",wb[sj(1,#wb)],xx,"门派师傅"}
	end
	return

end

__NPCdh222[1249 ]=function  (id,数字id,序号,内容)
	local 事件=内容[1]
  	local 名称=内容[3]
  	if 名称=="灵龟" then
        local 门派类型="东海渊"
        if 事件=="加入东海渊" then
          local 内容={门派="东海渊",角色=玩家数据[数字id].角色.模型,支付方式="经验银子"}
             玩家数据[数字id].角色:门派转换2(内容)
          elseif 事件=="本命法宝相关" then
       添加最后对话(数字id,"在此挑战本命法宝难度，进行开启、突破等操作，若难度过高，可邀请玩家共同组队挑战哦 ",{"开启本命法宝","突破一级本命法宝","突破二级本命法宝","突破三级本命法宝","点错了"})
        elseif 事件=="开启本命法宝" then
        	简单_本命法宝:本命法宝挑战检测(数字id,1)
        elseif 事件=="突破一级本命法宝" then
        	简单_本命法宝:本命法宝挑战检测(数字id,2)
        elseif 事件=="突破二级本命法宝" then
        	简单_本命法宝:本命法宝挑战检测(数字id,3)
        elseif 事件=="突破三级本命法宝" then
        	简单_本命法宝:本命法宝挑战检测(数字id,4)
        elseif 事件=="交谈" then
          --玩家数据[数字id].角色:门派交谈(数字id,门派类型)
        elseif 事件=="师门任务" then
          玩家数据[数字id].角色:门派任务(数字id,门派类型)
        elseif 事件=="门派秘籍学习" then

        	if 玩家数据[数字id].角色.门派秘籍挑战~= nil and 玩家数据[数字id].角色.门派秘籍挑战.门派~="无门派" then
	添加最后对话(数字id,"当前门派秘籍等级为： #Y"..玩家数据[数字id].角色.门派秘籍.." 级#W，角色所需挑战门派为 "..玩家数据[数字id].角色.门派秘籍挑战.门派,{"门派秘籍挑战","点错了"})
	elseif  玩家数据[数字id].角色.门派秘籍挑战~= nil and 玩家数据[数字id].角色.门派秘籍挑战.门派=="无门派" then
	添加最后对话(数字id,"当前门派秘籍等级为： #Y"..玩家数据[数字id].角色.门派秘籍.." 级#W，角色当前尚未获取门派秘籍 ")
	else
	添加最后对话(数字id,"当前门派秘籍等级为： #Y"..玩家数据[数字id].角色.门派秘籍.." 级#W，角色当前尚未获取门派秘籍 ")
	end
        elseif 事件=="门派秘籍挑战" then

          玩家数据[数字id].角色:门派秘籍交谈(数字id,门派类型)


        elseif 事件=="学习技能" then
          --local 临时数据=玩家数据[数字id].角色:取总数据()
          发送数据(id,31,玩家数据[数字id].角色:取总数据1())
          发送数据(id,32)
        end
    end
end