
local sj = 取随机数
local format = string.format
local insert = table.insert
local ceil = math.ceil
local floor = math.floor
local wps = 取物品数据
local typ = type
local random = 取随机数

__NPCdh111[1574]=function (ID,编号,页数,已经在任务中,数字id)
	local wb = {}
	local xx = {}
	if 编号 == 1 then
  	    wb[1] = "覆海大圣的誉名，只是外人给予的名誉，吾仅在乎，如何完美的克制那虚伪的龙宫。当前角色贡献值："..玩家数据[数字id].双龙之战.数据.贡献值
  	    xx = {"阵营每日任务","阵营达成任务","查看本方阵营战况","送我回长安","路过随便看看"}
  	    return {"蛟魔王","蛟魔王",wb[1],xx}
  	elseif  编号 == 2 then
  	    wb[1] = "那可是皮皮龙啊，百年难得一遇，万兽难降一只，你听我给你说，这可要不是我说，如果不是你我还不说，咱就是说！@@￥%@%&…………"
  	    xx = {"查看我的皮皮龙","路过随便看看"}
  	    return {"鲛人","黑水随从",wb[1],xx}
  	elseif  编号 == 3 then
  	    wb[1] = "尊敬的#R/"..玩家数据[数字id].双龙之战.数据.当前职位.."#W/，请问您有什么需要小的为您处理啊？"
  	    xx = {"查看职位","领取晋升俸禄","阵营官职操作","路过随便看看"}
  	    return {"鼠先锋","覆海军师",wb[1],xx}
  	elseif  编号 == 4 then
  	    wb[1] = "被我的美丽迷住了？难道美丽也是一种错误？哦~~~欢迎下次再来哦，愿你得到恩宠，除了不存在的其他的都有哦"
  	    xx = {"查看阵营商店","阵营好感度查看"}
  	    return {"女人_万圣公主","万圣公主",wb[1],xx}
  	end
  	local mc =取假人表(1574,编号)
  	if 编号>4 then
  		wb=随机对话
  		xx = {"赠送礼物","点错了，打扰了"}
  		return {mc.模型,mc.名称,wb[取随机数(1,#wb)],xx}
  	end

  	return
end

__NPCdh222[1574]=function  (id,数字id,序号,内容)
	local 事件=内容[1]
	local 名称=内容[3]
	if 名称=="蛟魔王" then
	             if 事件=="阵营每日任务" then
		发送数据(id,440017,{页面=1,角色数据=玩家数据[数字id].双龙之战.数据})
		elseif 事件=="查看本方阵营战况" then
		发送数据(id,440017,{页面=3,角色数据=玩家数据[数字id].双龙之战.数据,系统数据=双龙之战})
		elseif  事件=="阵营达成任务" then
		发送数据(id,440017,{页面=9,角色数据=玩家数据[数字id].双龙之战.数据})
		elseif  事件=="送我回长安" then
			地图处理类:跳转地图(数字id, 1001, 215, 112)
	             end
	elseif  名称=="万圣公主" then
	            if 事件=="阵营好感度查看" then
		发送数据(id,440017,{页面=8,角色数据=玩家数据[数字id].双龙之战.数据,系统数据=双龙之战,捐赠时间=玩家数据[数字id].阵营NPC捐赠,清空冷却=捐赠配置.清空捐献冷却})
		elseif  事件=="查看阵营商店" then
		if not 玩家数据[数字id].双龙之战.数据.活动物品.物品 then
      			玩家数据[数字id].双龙之战.数据.活动物品.物品={[1]=0,[2]=0,[3]=0,[4]=0,[5]=0}
      			玩家数据[数字id].双龙之战.数据.活动物品.礼物={[1]=0,[2]=0,[3]=0,[4]=0,[5]=0}
      		end
      		 发送数据(id,440017,{页面=2,角色数据=玩家数据[数字id].双龙之战.数据,系统数据=双龙之战})
		end
	elseif  名称=="黑水随从" then
	             if 事件=="查看我的皮皮龙" then
		发送数据(id,440017,{页面=7,角色数据=玩家数据[数字id].双龙之战.数据})
	             end
	elseif  名称=="覆海军师" then
	             if 事件=="查看职位" then
	             local 武器数据={}
	            if  玩家数据[数字id].角色.装备[3] then
	              	武器数据.子类=玩家数据[数字id].道具.数据[玩家数据[数字id].角色.装备[3]].子类
			武器数据.名称=玩家数据[数字id].道具.数据[玩家数据[数字id].角色.装备[3]].名称
			武器数据.等级=玩家数据[数字id].道具.数据[玩家数据[数字id].角色.装备[3]].等级
		else
			武器数据=nil
	            end
	            local 副武器数据={}
		if  玩家数据[数字id].角色.模型=="影精灵" and  玩家数据[数字id].角色.装备[4]  then
		    	副武器数据.子类=玩家数据[数字id].道具.数据[玩家数据[数字id].角色.装备[4]].子类
			副武器数据.名称=玩家数据[数字id].道具.数据[玩家数据[数字id].角色.装备[4]].名称
			副武器数据.等级=玩家数据[数字id].道具.数据[玩家数据[数字id].角色.装备[4]].等级
		end
		  if 玩家数据[数字id].角色.锦衣[1] then
	               	锦衣数据={}
			锦衣数据.子类=玩家数据[数字id].道具.数据[玩家数据[数字id].角色.锦衣[1]].子类
			锦衣数据.名称=玩家数据[数字id].道具.数据[玩家数据[数字id].角色.锦衣[1]].名称
		else
		  	锦衣数据=nil
		end
		  发送数据(id,440017,{页面=5,角色数据=玩家数据[数字id].双龙之战.数据,模型=玩家数据[数字id].角色.模型,名称=玩家数据[数字id].角色.名称,武器数据=武器数据,副武器数据=副武器数据,锦衣=锦衣数据})
	             elseif  事件=="领取晋升俸禄" then
	             	local 双龙职位={["四海卫兵"]=1,["四海先锋"]=2,["风泽龙裔"]=3,["擎天龙王"]=4,["沧瀛龙帝"]=5,["断空龙神"]=6,["四海龙尊"]=7,["覆海卫兵"]=1,["覆海先锋"]=2,["蛰虺战狂"]=3,["盘虬英豪"]=4,["潜蛟风云"]=5,["伏螭霸主"]=6,["卧龙传奇"]=7}
	             	if  not 玩家数据[数字id].双龙之战.数据.俸禄领取.时间 then  玩家数据[数字id].双龙之战.数据.俸禄领取.时间=0 end
	             	if 玩家数据[数字id].双龙之战:检查俸禄资格(数字id) then
		             	if 玩家数据[数字id].双龙之战.数据.当前职位~="无" and 双龙职位[玩家数据[数字id].双龙之战.数据.当前职位] and 双龙职位[玩家数据[数字id].双龙之战.数据.当前职位]>=1 and  玩家数据[数字id].双龙之战.数据.俸禄领取.时间~=tonumber(os.date("%Y%m%d"))  then
		             	玩家数据[数字id].双龙之战.数据.俸禄领取.时间=tonumber(os.date("%Y%m%d"))
		             		if 双龙职位[玩家数据[数字id].双龙之战.数据.当前职位]>1 then
	             			玩家数据[数字id].道具:给予道具(数字id,"红包碎片",双龙职位[玩家数据[数字id].双龙之战.数据.当前职位])
					if 双龙职位[玩家数据[数字id].双龙之战.数据.当前职位]<3 then
					玩家数据[数字id].道具:给予道具(数字id,"平安红包",1)
					elseif 双龙职位[玩家数据[数字id].双龙之战.数据.当前职位]<5 then
					玩家数据[数字id].道具:给予道具(数字id,"多福红包",1)
					elseif 双龙职位[玩家数据[数字id].双龙之战.数据.当前职位]<=7 then
					玩家数据[数字id].道具:给予道具(数字id,"进财红包",1)
					end
					玩家数据[数字id].道具:给予道具(数字id,"神兜兜",双龙职位[玩家数据[数字id].双龙之战.数据.当前职位]*3)
		             		else
		             		玩家数据[数字id].角色:添加经验(5000000,"阵营新手俸禄",1)
	           				 玩家数据[数字id].角色:添加储备(5000000,"阵营新手俸禄",1)
		             		end
		             	else
		             	添加最后对话(数字id,"今日的俸禄少侠不是已经领取过了吗#4。")
		             	end
		             end
	              elseif  事件=="阵营官职操作" then
	              	玩家数据[数字id].商品列表=商店处理类.商品列表[62]
		            发送数据(id,440017,{页面=6,角色数据=玩家数据[数字id].双龙之战.数据,签到奖励=双龙签到道具,系统数据=双龙之战,商品 = 商店处理类.商品列表[62],目前次数=f函数.读配置(程序目录.."特殊活动配置.ini","双龙之战","系统次数")+0})
	             end
	elseif  名称=="暮烟仙姑" and  事件=="赠送礼物" then
		玩家数据[数字id].阵营赠礼=1
		添加最后对话(数字id, "请问需要赠送的物品为",{"牡丹花(1点好感)","桃运花(3点好感)","紫兰花(5点好感)","百合花(7点好感)","玫瑰花(10点好感)"})
	elseif  名称=="虎魄神君" and  事件=="赠送礼物" then
		玩家数据[数字id].阵营赠礼=2
		添加最后对话(数字id, "请问需要赠送的物品为",{"牡丹花(1点好感)","桃运花(3点好感)","紫兰花(5点好感)","百合花(7点好感)","玫瑰花(10点好感)"})
	elseif  名称=="仙鹤使者" and  事件=="赠送礼物" then
		玩家数据[数字id].阵营赠礼=3
		添加最后对话(数字id, "请问需要赠送的物品为",{"牡丹花(1点好感)","桃运花(3点好感)","紫兰花(5点好感)","百合花(7点好感)","玫瑰花(10点好感)"})
	elseif  名称=="紫霄老祖" and  事件=="赠送礼物" then
		玩家数据[数字id].阵营赠礼=4
		添加最后对话(数字id, "请问需要赠送的物品为",{"牡丹花(1点好感)","桃运花(3点好感)","紫兰花(5点好感)","百合花(7点好感)","玫瑰花(10点好感)"})
	elseif  名称=="幽谷幻影" and  事件=="赠送礼物" then
		玩家数据[数字id].阵营赠礼=5
		添加最后对话(数字id, "请问需要赠送的物品为",{"牡丹花(1点好感)","桃运花(3点好感)","紫兰花(5点好感)","百合花(7点好感)","玫瑰花(10点好感)"})
	elseif  名称=="猪鬃道士" and  事件=="赠送礼物" then
		玩家数据[数字id].阵营赠礼=6
		添加最后对话(数字id, "请问需要赠送的物品为",{"牡丹花(1点好感)","桃运花(3点好感)","紫兰花(5点好感)","百合花(7点好感)","玫瑰花(10点好感)"})
	elseif  名称=="清姑" and  事件=="赠送礼物" then
		玩家数据[数字id].阵营赠礼=7
		添加最后对话(数字id, "请问需要赠送的物品为",{"牡丹花(1点好感)","桃运花(3点好感)","紫兰花(5点好感)","百合花(7点好感)","玫瑰花(10点好感)"})
	elseif  名称=="星老" and  事件=="赠送礼物" then
		玩家数据[数字id].阵营赠礼=8
		添加最后对话(数字id, "请问需要赠送的物品为",{"牡丹花(1点好感)","桃运花(3点好感)","紫兰花(5点好感)","百合花(7点好感)","玫瑰花(10点好感)"})
	elseif  名称=="夜行孤者" and  事件=="赠送礼物" then
		玩家数据[数字id].阵营赠礼=9
		添加最后对话(数字id, "请问需要赠送的物品为",{"牡丹花(1点好感)","桃运花(3点好感)","紫兰花(5点好感)","百合花(7点好感)","玫瑰花(10点好感)"})
	elseif  名称=="流云仙子" and  事件=="赠送礼物" then
		玩家数据[数字id].阵营赠礼=10
		添加最后对话(数字id, "请问需要赠送的物品为",{"牡丹花(1点好感)","桃运花(3点好感)","紫兰花(5点好感)","百合花(7点好感)","玫瑰花(10点好感)"})
	elseif  名称=="逐影" and  事件=="赠送礼物" then
		玩家数据[数字id].阵营赠礼=11
		添加最后对话(数字id, "请问需要赠送的物品为",{"牡丹花(1点好感)","桃运花(3点好感)","紫兰花(5点好感)","百合花(7点好感)","玫瑰花(10点好感)"})
	elseif  名称=="雷霆剑客" and  事件=="赠送礼物" then
		玩家数据[数字id].阵营赠礼=12
		添加最后对话(数字id, "请问需要赠送的物品为",{"牡丹花(1点好感)","桃运花(3点好感)","紫兰花(5点好感)","百合花(7点好感)","玫瑰花(10点好感)"})
	elseif   事件=="牡丹花(1点好感)" then
		if not 玩家数据[数字id].阵营赠礼 then
	             	添加最后对话(数字id,"数据出错，请重新选择#45。")
			return
		end
		if 玩家数据[数字id].双龙之战.数据.活动物品.礼物[1]<1 then
	             	添加最后对话(数字id,"你都没有牡丹花，不要来丢人了#45。")
			return
		end
		local 对象序列=math.floor((玩家数据[数字id].阵营赠礼-1)/6)+1
		local 对象序号=玩家数据[数字id].阵营赠礼-math.floor((玩家数据[数字id].阵营赠礼-1)/6)*6
		if not 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列]={[1]=0,[2]=0,[3]=0,[4]=0,[5]=0,[6]=0}
		end
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>=100 then
			添加最后对话(数字id,"以我们的关系，已经不需要送这些东西啦#59。")
			return
		end
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+1
		玩家数据[数字id].双龙之战.数据.活动物品.礼物[1]=玩家数据[数字id].双龙之战.数据.活动物品.礼物[1]-1
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>100 then 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=100 end
	             添加最后对话(数字id,"啊，感谢你的礼物，我真的是太喜欢啦。#89#89。")
	             玩家数据[数字id].阵营赠礼=nil
	elseif   事件=="桃运花(3点好感)" then
		if not 玩家数据[数字id].阵营赠礼 then
	             	添加最后对话(数字id,"数据出错，请重新选择#45。")
			return
		end
		if 玩家数据[数字id].双龙之战.数据.活动物品.礼物[2]<1 then
	             	添加最后对话(数字id,"你都没有桃运花，不要来丢人了#45。")
			return
		end
		local 对象序列=math.floor((玩家数据[数字id].阵营赠礼-1)/6)+1
		local 对象序号=玩家数据[数字id].阵营赠礼-math.floor((玩家数据[数字id].阵营赠礼-1)/6)*6
		if not 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列]={[1]=0,[2]=0,[3]=0,[4]=0,[5]=0,[6]=0}
		end
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>=100 then
			添加最后对话(数字id,"以我们的关系，已经不需要送这些东西啦#59。")
			return
		end
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+3
		玩家数据[数字id].双龙之战.数据.活动物品.礼物[2]=玩家数据[数字id].双龙之战.数据.活动物品.礼物[2]-1
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>100 then 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=100 end
	             添加最后对话(数字id,"你的善良让我感动，感谢你的慷慨！#89#89。")
	             玩家数据[数字id].阵营赠礼=nil
	elseif   事件=="紫兰花(5点好感)" then
		if not 玩家数据[数字id].阵营赠礼 then
	             	添加最后对话(数字id,"数据出错，请重新选择#45。")
			return
		end
		if 玩家数据[数字id].双龙之战.数据.活动物品.礼物[3]<1 then
	             	添加最后对话(数字id,"你都没有紫兰花，不要来丢人了#45。")
			return
		end
		local 对象序列=math.floor((玩家数据[数字id].阵营赠礼-1)/6)+1
		local 对象序号=玩家数据[数字id].阵营赠礼-math.floor((玩家数据[数字id].阵营赠礼-1)/6)*6
		if not 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列]={[1]=0,[2]=0,[3]=0,[4]=0,[5]=0,[6]=0}
		end
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>=100 then
			添加最后对话(数字id,"以我们的关系，已经不需要送这些东西啦#59。")
			return
		end
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+5
		玩家数据[数字id].双龙之战.数据.活动物品.礼物[3]=玩家数据[数字id].双龙之战.数据.活动物品.礼物[3]-1
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>100 then 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=100 end
	             添加最后对话(数字id,"我会好好珍惜这个礼物的，谢谢你！#89#89。")
	             玩家数据[数字id].阵营赠礼=nil
	elseif   事件=="百合花(7点好感)" then
		if not 玩家数据[数字id].阵营赠礼 then
	             	添加最后对话(数字id,"数据出错，请重新选择#45。")
			return
		end
		if 玩家数据[数字id].双龙之战.数据.活动物品.礼物[4]<1 then
	             	添加最后对话(数字id,"你都没有百合花，不要来丢人了#45。")
			return
		end
		local 对象序列=math.floor((玩家数据[数字id].阵营赠礼-1)/6)+1
		local 对象序号=玩家数据[数字id].阵营赠礼-math.floor((玩家数据[数字id].阵营赠礼-1)/6)*6
		if not 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列]={[1]=0,[2]=0,[3]=0,[4]=0,[5]=0,[6]=0}
		end
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>=100 then
			添加最后对话(数字id,"以我们的关系，已经不需要送这些东西啦#59。")
			return
		end
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+7
		玩家数据[数字id].双龙之战.数据.活动物品.礼物[4]=玩家数据[数字id].双龙之战.数据.活动物品.礼物[4]-1
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>100 then 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=100 end
	             添加最后对话(数字id,"谢谢你的心意，这份礼物让我充满了力量！#89#89。")
	             玩家数据[数字id].阵营赠礼=nil
	elseif   事件=="玫瑰花(10点好感)" then
		if not 玩家数据[数字id].阵营赠礼 then
	             	添加最后对话(数字id,"数据出错，请重新选择#45。")
			return
		end
		if 玩家数据[数字id].双龙之战.数据.活动物品.礼物[5]<1 then
	             	添加最后对话(数字id,"你都没有牡丹花，不要来丢人了#45。")
			return
		end
		local 对象序列=math.floor((玩家数据[数字id].阵营赠礼-1)/6)+1
		local 对象序号=玩家数据[数字id].阵营赠礼-math.floor((玩家数据[数字id].阵营赠礼-1)/6)*6
		if not 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列] then
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列]={[1]=0,[2]=0,[3]=0,[4]=0,[5]=0,[6]=0}
		end
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>=100 then
			添加最后对话(数字id,"以我们的关系，已经不需要送这些东西啦#59。")
			return
		end
		玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]+10
		玩家数据[数字id].双龙之战.数据.活动物品.礼物[5]=玩家数据[数字id].双龙之战.数据.活动物品.礼物[5]-1
		if 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]>100 then 玩家数据[数字id].双龙之战.数据.好感NPC[对象序列][对象序号]=100 end
	             添加最后对话(数字id,"哇，这太棒了！你真是个好朋友！#89#89。")
	             玩家数据[数字id].阵营赠礼=nil
	end
end



