-- @Author: baidwwy
-- @Date:   2023-12-25 09:36:19
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2026-05-18 13:34:31

function 取银子(id)
	return 玩家数据[id].角色.银子
end

function 取名称(id)
	return 玩家数据[id].角色.名称
end

-- function 取仙玉(id)
-- 	if 玩家数据[id] == nil then
-- 		print(id)
-- 	end
-- 	local 仙玉=f函数.读配置(程序目录..[[data\]]..玩家数据[id].角色.账号..[[\账号信息.txt]],"账号配置","仙玉")+0
--    if 仙玉 then
--       return 仙玉
--    else
--       消息提示(id, "查询仙玉数据异常，请联系管理员")
--       return false
--    end
-- end

function 取点卡(账号)
	local 点卡=f函数.读配置(程序目录..[[data\]]..账号..[[\账号信息.txt]],"账号配置","点卡")+0
   if 点卡 then
      return 点卡
   else
      消息提示(id, "查询点卡数据异常，请联系管理员")
      return false
  	end
end
function 道具刷新(id)
	发送数据(玩家数据[id].连接id,3699)
end

function 刷新修炼数据(id)
	发送数据(玩家数据[id].连接id,44,{人物=玩家数据[id].角色.修炼,bb=玩家数据[id].角色.bb修炼})
end

-- function 更改道具归属(道具识别码,账号,对方id,名称1)
-- 	if 道具识别码==nil then return  end
-- 	道具记录[道具识别码]={账号=账号,id=对方id,名称=名称1}
-- end

function 加载账号仓库数据(账号,数字id)
    	if 账号仓库数据[账号] == nil then
	        	账号仓库数据[账号]={}
	        	账号仓库数据[账号] = 账号仓库类:创建(账号)
	        	账号仓库数据[账号]:加载数据(账号, 数字id)
    	else
		账号仓库数据[账号]={}
	        	账号仓库数据[账号] = 账号仓库类:创建(账号)
	        	账号仓库数据[账号]:加载数据(账号, 数字id)
    	end
end

function 体活刷新(id)
	if id == nil or 玩家数据[id].连接id then return  end
	发送数据(玩家数据[id].连接id,15,{体力=玩家数据[id].角色.体力,活力=玩家数据[id].角色.活力})
end
function 添加累充(id,数额,提示,每日)
   	if  玩家数据[id].角色.累充金额==nil then
  		 玩家数据[id].角色.累充金额=0
  	end
  	local 数额=tonumber(数额)
  	if 数额 then
  		玩家数据[id].角色.累充金额=玩家数据[id].角色.累充金额+数额
  		常规提示(id,"#Y恭喜您获得累计充值额度:"..数额..",当前总累计充值额度："..玩家数据[id].角色.累充金额)
  		if 每日充值[id] == nil then 每日充值[id] = {当前=0} end
  		if 每日 then
	    	每日充值[id].当前 = 每日充值[id].当前 + 数额
	    常规提示(id,"#Y恭喜您获得每日充值额度:"..数额..",当前总每日充值额度："..每日充值[id].当前)
	    end
	   local 代理= "代理"..f函数.读配置(程序目录..[[data\]]..玩家数据[id].账号..[[\账号信息.txt]],"账号配置","邀请码")--玩家数据[id].角色.邀请码
	   代理充值[代理]= 代理充值[代理] or {注册={},充值={}}
	   代理充值[代理].充值[#代理充值[代理].充值+1]={数额=数额,时间=os.time(),账号=玩家数据[id].账号,id=id,名称=玩家数据[id].角色.名称}
	   代理充值[代理].充值.累计=(代理充值[代理].充值.累计 or 0) +数额
	   代理充值[代理].充值.未结算=(代理充值[代理].充值.未结算 or 0) +数额
	   if not 代理充值[代理].充值.记录 or 代理充值[代理].充值.记录~=math.floor(os.time()/86400) then
	   	代理充值[代理].充值.记录=math.floor(os.time()/86400)
	   	代理充值[代理].充值.今日=0
	   end
	   	代理充值[代理].充值.今日=代理充值[代理].充值.今日+数额
  	else
  		常规提示(id,"#Y数值非法！")
  	end
end
function 刷新玩家货币(连接id,id)
	发送数据(连接id,35,{
		银子=玩家数据[id].角色.银子,
		仙玉=取仙玉(id),
		点卡=取点卡(玩家数据[id].账号),
		储备=玩家数据[id].角色.储备,
		存银=玩家数据[id].角色.存银,
		经验=玩家数据[id].角色.当前经验,
		神器积分=玩家数据[id].角色.神器积分 or 0,
		天罡积分=玩家数据[id].角色.天罡积分 or 0,
		地煞积分=玩家数据[id].角色.地煞积分 or 0
		})
end

function 重置抽奖池物品数量(id,当前抽奖数据, 配置文件路径, 玩家抽奖数据, 是否返还次数)
    for _, 物品 in ipairs(当前抽奖数据) do
        if 物品 and 物品.初始剩余 then  -- 只处理有初始值的物品
            物品.剩余数量 = 物品.初始剩余  -- 恢复初始剩余数量
        end
    end
       写出文件(配置文件路径, formatTable(当前抽奖数据))
    if 是否返还次数 and 玩家抽奖数据 then
        玩家抽奖数据.次数 = 玩家抽奖数据.次数 + 1  -- 返还1次
        常规提示(id, "#Y已自动重置并返还1次抽奖次数")
        广播消息({内容=format("#G/[抽奖奖池]#Y/奖池已经自动进行了更新".."#"..取随机数(1,110)),频道="xt"})
        发送公告("#P/[抽奖奖池]#Y/奖池已经自动进行了更新！#51")

    end
end

function 取灵气上限(等级)
	if 等级==1 then
		return 3000000
	elseif 等级==2 then
		return 5000000
	else
		return 5000000
	end
end

function 取等级(id)
	return 玩家数据[id].角色.等级
end
function 跳转长安(数字id)
	地图处理类:跳转地图(数字id,1001,427,73)
end