
local 副本_天命秘境 = class()
local sj = 取随机数
local format = string.format
local insert = table.insert
local ceil = math.ceil
local floor = math.floor
local wps = 取物品数据
local typ = type
local random = 取随机数


function 副本_天命秘境:初始化()
	地图处理类.地图数据[8523]={npc={},单位={},传送圈={}}
	地图处理类.地图玩家[8523]={}
	地图处理类.地图坐标[8523]=地图处理类.地图坐标[1186]
	地图处理类.地图单位[8523]={}
	地图处理类.单位编号[8523]=1000

	地图处理类.地图数据[8524]={npc={},单位={},传送圈={}}
	地图处理类.地图玩家[8524]={}
	地图处理类.地图坐标[8524]=地图处理类.地图坐标[1187]
	地图处理类.地图单位[8524]={}
	地图处理类.单位编号[8524]=1000

	地图处理类.地图数据[8525]={npc={},单位={},传送圈={}}
	地图处理类.地图玩家[8525]={}
	地图处理类.地图坐标[8525]=地图处理类.地图坐标[1188]
	地图处理类.地图单位[8525]={}
	地图处理类.单位编号[8525]=1000

	地图处理类.地图数据[8526]={npc={},单位={},传送圈={}}
	地图处理类.地图玩家[8526]={}
	地图处理类.地图坐标[8526]=地图处理类.地图坐标[1189]
	地图处理类.地图单位[8526]={}
	地图处理类.单位编号[8526]=1000

	地图处理类.地图数据[8527]={npc={},单位={},传送圈={}}
	地图处理类.地图玩家[8527]={}
	地图处理类.地图坐标[8527]=地图处理类.地图坐标[1190]
	地图处理类.地图单位[8527]={}
	地图处理类.单位编号[8527]=1000

	地图处理类.地图数据[8528]={npc={},单位={},传送圈={}}
	地图处理类.地图玩家[8528]={}
	地图处理类.地图坐标[8528]=地图处理类.地图坐标[1191]
	地图处理类.地图单位[8528]={}
	地图处理类.单位编号[8528]=1000

	地图处理类.地图数据[8529]={npc={},单位={},传送圈={}}
	地图处理类.地图玩家[8529]={}
	地图处理类.地图坐标[8529]=地图处理类.地图坐标[1192]
	地图处理类.地图单位[8529]={}
	地图处理类.单位编号[8529]=1000

	地图处理类.地图数据[8530]={npc={},单位={},传送圈={}}
	地图处理类.地图玩家[8530]={}
	地图处理类.地图坐标[8530]=地图处理类.地图坐标[1180]
	地图处理类.地图单位[8530]={}
	地图处理类.单位编号[8530]=1000

	地图处理类.地图数据[8531]={npc={},单位={},传送圈={}}
	地图处理类.地图玩家[8531]={}
	地图处理类.地图坐标[8531]=地图处理类.地图坐标[1181]
	地图处理类.地图单位[8531]={}
	地图处理类.单位编号[8531]=1000

	地图处理类.地图数据[8532]={npc={},单位={},传送圈={}}
	地图处理类.地图玩家[8532]={}
	地图处理类.地图坐标[8532]=地图处理类.地图坐标[1182]
	地图处理类.地图单位[8532]={}
	地图处理类.单位编号[8532]=1000

	地图处理类.地图数据[8533]={npc={},单位={},传送圈={}}
	地图处理类.地图玩家[8533]={}
	地图处理类.地图坐标[8533]=地图处理类.地图坐标[1183]
	地图处理类.地图单位[8533]={}
	地图处理类.单位编号[8533]=1000

end

function 副本_天命秘境:开启副本(id)
	if 玩家数据[id].队伍==0 or 玩家数据[id].队长==false then
		常规提示(id,"#Y/该任务必须组队完成且由队长领取")
		return
	elseif 取队伍人数(id)<5 and 调试模式==false then
		常规提示(id,"#Y此副本要求队伍人数不低于5人")
		return
	elseif 取等级要求(id,50)==false then
		常规提示(id,"#Y此副本要求角色等级不能低于50级")
		return
	end
	local 队伍id=玩家数据[id].队伍
	for n=1,#队伍数据[队伍id].成员数据 do
		local 临时id=队伍数据[队伍id].成员数据[n]
		if 副本数据.天命秘境.完成[临时id]~=nil then
			常规提示(id,"#Y"..玩家数据[临时id].角色.名称.."本日已经完成过此副本了")
			return
		elseif 玩家数据[临时id].角色:取任务(3080)~=0 then
		local 副本id=任务数据[玩家数据[id].角色:取任务(3080)].副本id
		local 进程=副本数据.天命秘境.进行[副本id].进程
		local 地球=8522+副本数据.天命秘境.进行[副本id].进程
		local xxy=地图处理类.地图坐标[地球]:取随机点()
		地图处理类:跳转地图(id,地球,xxy.x,xxy.y)
			return
		end
	end
	副本数据.天命秘境.进行[id]={进程=1,数量=1}
	local 任务id,ZU=取唯一任务(3080,id)
	任务数据[任务id]={
		id=任务id,
		起始=os.time(),
		结束=3600,
		玩家id=0,
		DWZ=ZU,
		销毁=true,
		副本重置=true,
		队伍组=ZU,
		副本id=id,
		PlayerGroup = table.copy(队伍数据[队伍id].成员数据),
		类型=3080
	}
	任务处理类:添加队伍任务(id,任务id,"#Y你开启了天命秘境副本")
	刷新任务3080(id)
end

function 刷新任务3080(id)
	local id = 任务处理类:取副本id(id,3080)
	if 副本数据.天命秘境.进行[id]==nil then
		return
	end
	玩家数据[id].zhandou=0
	local 队伍id=玩家数据[id].队伍
	if 副本数据.天命秘境.进行[id].进程==1 then
		local 地图=8523 --长安城
		local xy=地图处理类.地图坐标[地图]:取随机点()
		local xx=地图处理类.地图坐标[地图]:取随机点()
		local 任务id=id.."_3091_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="天命特处士兵",
			模型="牛妖",
			x=xy.x,
			y=xy.y,
			方向=方向,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=3091
		}
		地图处理类:添加单位(任务id)
	elseif 副本数据.天命秘境.进行[id].进程==2 then
		任务处理类:删除副本单位(id,3080,3091)
		local 地图=8524 --长安城
		local xy=地图处理类.地图坐标[地图]:取随机点()
		local xx=地图处理类.地图坐标[地图]:取随机点()
		local 任务id=id.."_3092_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="天命偏将军",
			模型="护卫",
			x=xy.x,
			y=xy.y,
			方向=方向,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=3092
		}
		地图处理类:添加单位(任务id)
		地图处理类:跳转地图(id,地图,xx.x,xx.y)
	elseif 副本数据.天命秘境.进行[id].进程==3 then
			任务处理类:删除副本单位(id,3080,3092)
			local 任务id=id.."_3093_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			local 地图=8525 --长安城
			local xy=地图处理类.地图坐标[地图]:取随机点()
			local xx=地图处理类.地图坐标[地图]:取随机点()
			local 武器 = 取140武器造型("虎头怪")
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="天命战败者",
				模型="虎头怪",
				武器="元神禁锢",
				销毁=true,
				副本重置=true,
				x=xy.x,
				y=xy.y,
				方向=方向,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=3093
			}
			地图处理类:添加单位(任务id)
			地图处理类:跳转地图(id,地图,xx.x,xx.y)
	elseif 副本数据.天命秘境.进行[id].进程==4 then
			任务处理类:删除副本单位(id,3080,3093)
			local 任务id=id.."_3094_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			local 地图=8526 --长安城
			local xy=地图处理类.地图坐标[地图]:取随机点()
			local xx=地图处理类.地图坐标[地图]:取随机点()
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="天命秘境魔头",
        				模型="古代瑞兽",
				销毁=true,
				副本重置=true,
				x=xy.x,
				y=xy.y,
				方向=方向,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=3094
			}
			地图处理类:添加单位(任务id)
			地图处理类:跳转地图(id,地图,xx.x,xx.y)
	elseif 副本数据.天命秘境.进行[id].进程==5 then
			任务处理类:删除副本单位(id,3080,3094)
			local 任务id=id.."_3095_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			local 地图=8527 --长安城
			local xy=地图处理类.地图坐标[地图]:取随机点()
			local xx=地图处理类.地图坐标[地图]:取随机点()
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="天命白衣秀士",
				模型="风伯",
				销毁=true,
				副本重置=true,
				x=xy.x,
				y=xy.y,
				方向=方向,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=3095
			}
			地图处理类:添加单位(任务id)
			地图处理类:跳转地图(id,地图,xx.x,xx.y)
	elseif 副本数据.天命秘境.进行[id].进程==6 then
			任务处理类:删除副本单位(id,3080,3095)
			local 任务id=id.."_3096_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			local 地图=8528 --长安城
			local xy=地图处理类.地图坐标[地图]:取随机点()
			local xx=地图处理类.地图坐标[地图]:取随机点()
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="天命熊山君",
				模型="黑熊精",
				销毁=true,
				副本重置=true,
				x=xy.x,
				y=xy.y,
				方向=方向,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=3096
			}
			地图处理类:添加单位(任务id)
			地图处理类:跳转地图(id,地图,xx.x,xx.y)
	elseif 副本数据.天命秘境.进行[id].进程==7 then
			任务处理类:删除副本单位(id,3080,3096)
			local 任务id=id.."_3097_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			local 地图=8529 --长安城
			local xy=地图处理类.地图坐标[地图]:取随机点()
			local xx=地图处理类.地图坐标[地图]:取随机点()
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="天命秘境老妖",
				模型="黑山老妖",
				销毁=true,
				副本重置=true,
				x=xy.x,
				y=xy.y,
				方向=方向,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=3097
			}
			地图处理类:添加单位(任务id)
			地图处理类:跳转地图(id,地图,xx.x,xx.y)
	elseif 副本数据.天命秘境.进行[id].进程==8 then
			任务处理类:删除副本单位(id,3080,3097)
			local 任务id=id.."_3098_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			local 地图=8530 --长安城
			local xy=地图处理类.地图坐标[地图]:取随机点()
			local xx=地图处理类.地图坐标[地图]:取随机点()
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="天命秘境牛魔",
				模型="牛妖",
				销毁=true,
				副本重置=true,
				x=xy.x,
				y=xy.y,
				方向=方向,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=3098
			}
			地图处理类:添加单位(任务id)
			地图处理类:跳转地图(id,地图,xx.x,xx.y)
	elseif 副本数据.天命秘境.进行[id].进程==9 then
			任务处理类:删除副本单位(id,3080,3098)
			local 任务id=id.."_3099_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			local 地图=8531 --长安城
			local xy=地图处理类.地图坐标[地图]:取随机点()
			local xx=地图处理类.地图坐标[地图]:取随机点()
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="天命秘境圣子",
				模型="黑山老妖",
				销毁=true,
				副本重置=true,
				x=xy.x,
				y=xy.y,
				方向=方向,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=3099
			}
			地图处理类:添加单位(任务id)
			地图处理类:跳转地图(id,地图,xx.x,xx.y)
	elseif 副本数据.天命秘境.进行[id].进程==10 then
			任务处理类:删除副本单位(id,3080,3099)
			local 任务id=id.."_3100_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			local 地图=8532 --长安城
			local xy=地图处理类.地图坐标[地图]:取随机点()
			local xx=地图处理类.地图坐标[地图]:取随机点()
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="天命秘境妖王",
				模型="黑熊精",
				销毁=true,
				副本重置=true,
				x=xy.x,
				y=xy.y,
				方向=方向,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=3100
			}
			地图处理类:添加单位(任务id)
			地图处理类:跳转地图(id,地图,xx.x,xx.y)
	elseif 副本数据.天命秘境.进行[id].进程==11 then
			任务处理类:删除副本单位(id,3080,3100)
			local 任务id=id.."_3101_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			local 地图=8533 --长安城
			local xy=地图处理类.地图坐标[地图]:取随机点()
			local xx=地图处理类.地图坐标[地图]:取随机点()
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="天命秘境唐王",
				模型="皇帝",
				销毁=true,
				副本重置=true,
				x=xy.x,
				y=xy.y,
				方向=方向,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=3101
			}
			地图处理类:添加单位(任务id)
			地图处理类:跳转地图(id,地图,xx.x,xx.y)
	elseif 副本数据.天命秘境.进行[id].进程==12 then
		任务处理类:删除副本单位(id,3080,3101)
		local 任务id=玩家数据[id].角色:取任务(3080)
		local text1 = {"梦幻西游真好玩！","我还要充钱。","天命秘境副本（完）"}
		for n=1,#队伍数据[队伍id].成员数据 do
			local 临时id=队伍数据[队伍id].成员数据[n]
			玩家数据[临时id].角色:取消任务(任务id)
			副本数据.天命秘境.完成[临时id]=true
			抽奖处理:转盘抽奖(id)
			地图处理类:跳转地图(id,1001,224,118)
			发送数据(玩家数据[临时id].连接id,6557,{文本=text1,类型="归墟副本结束",字体=nil,音乐=nil,背景=nil,横排显示=true,动画=nil})
		end
	end
end

function 副本_天命秘境:怪物对话内容(id,类型,标识,地图)
	local 对话数据={}
	对话数据.模型=任务数据[标识].模型
	对话数据.名称=任务数据[标识].名称
	local 副本id = 任务处理类:取副本id(id,3080)
	if 副本id == 0 or 副本id ~= id  then
		对话数据.对话="只有创建副本的队长才能和我对话"
		return 对话数据
	end
	if 副本数据.天命秘境.进行[副本id].进程==1 then
		if 对话数据.名称=="天命特处士兵" then
			对话数据.对话 = "欢迎来到梦幻西游"
			对话数据.选项 = {"我来了","我准备一下"}
		end
	elseif 副本数据.天命秘境.进行[副本id].进程==2 then
		if 对话数据.名称=="天命偏将军" then
			对话数据.对话 = "欢迎来到梦幻西游"
			对话数据.选项 = {"挑战你","我准备一下"}
		end
	elseif 副本数据.天命秘境.进行[副本id].进程==3 then
			if 对话数据.名称=="天命战败者" then
				对话数据.对话 = "欢迎来到梦幻西游"
				对话数据.选项 = {"挑战你","我准备一下"}
			end
	elseif 副本数据.天命秘境.进行[副本id].进程==4 then
			if 对话数据.名称=="天命秘境魔头" then
				对话数据.对话 = "欢迎来到梦幻西游"
				对话数据.选项 = {"挑战你","我准备一下"}
			end
	elseif 副本数据.天命秘境.进行[副本id].进程==5 then
			if 对话数据.名称=="天命白衣秀士" then
				对话数据.对话 = "欢迎来到梦幻西游"
				对话数据.选项 = {"挑战你","我准备一下"}
			end
	elseif 副本数据.天命秘境.进行[副本id].进程==6 then
			if 对话数据.名称=="天命熊山君" then
				对话数据.对话 = "欢迎来到梦幻西游"
				对话数据.选项 = {"挑战你","我准备一下"}
			end
	elseif 副本数据.天命秘境.进行[副本id].进程==7 then
			if 对话数据.名称=="天命秘境老妖" then
				对话数据.对话 = "欢迎来到梦幻西游"
				对话数据.选项 = {"挑战你","我准备一下"}
			end
	elseif 副本数据.天命秘境.进行[副本id].进程==8 then
			if 对话数据.名称=="天命秘境牛魔" then
				对话数据.对话 = "欢迎来到梦幻西游"
				对话数据.选项 = {"挑战你","我准备一下"}
			end
	elseif 副本数据.天命秘境.进行[副本id].进程==9 then
			if 对话数据.名称=="天命秘境圣子" then
				对话数据.对话 = "欢迎来到梦幻西游"
				对话数据.选项 = {"挑战你","我准备一下"}
			end
	elseif 副本数据.天命秘境.进行[副本id].进程==10 then
			if 对话数据.名称=="天命秘境妖王" then
				对话数据.对话 = "欢迎来到梦幻西游"
				对话数据.选项 = {"挑战你","我准备一下"}
			end
	elseif 副本数据.天命秘境.进行[副本id].进程==11 then
			if 对话数据.名称=="天命秘境唐王" then
				对话数据.对话 = "欢迎来到梦幻西游"
				对话数据.选项 = {"挑战你","我准备一下"}
			end
	end
	return 对话数据
end

function 副本_天命秘境:对话事件处理(id,名称,事件,类型)
	local 副本id = 任务处理类:取副本id(id,3080)
	if 类型 == 3091 and 名称=="天命特处士兵" and  事件=="我来了" then
		if 副本数据.天命秘境.进行[副本id].进程==1 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,105111,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 3092 and 名称=="天命偏将军" and  事件=="挑战你" then
		if 副本数据.天命秘境.进行[副本id].进程==2 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,105112,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 3093 and 名称=="天命战败者" and  事件=="挑战你" then
		if 副本数据.天命秘境.进行[副本id].进程==3 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,105113,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 3094 and 名称=="天命秘境魔头" and  事件=="挑战你" then
		if 副本数据.天命秘境.进行[副本id].进程==4 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,105114,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 3095 and 名称=="天命白衣秀士" and  事件=="挑战你" then
		if 副本数据.天命秘境.进行[副本id].进程==5 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,105115,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 3096 and 名称=="天命熊山君" and  事件=="挑战你" then
		if 副本数据.天命秘境.进行[副本id].进程==6 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,105116,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 3097 and 名称=="天命秘境老妖" and  事件=="挑战你" then
		if 副本数据.天命秘境.进行[副本id].进程==7 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,105117,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 3098 and 名称=="天命秘境牛魔" and  事件=="挑战你" then
		if 副本数据.天命秘境.进行[副本id].进程==8 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,105118,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 3099 and 名称=="天命秘境圣子" and  事件=="挑战你" then
		if 副本数据.天命秘境.进行[副本id].进程==9 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,105119,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 3100 and 名称=="天命秘境妖王" and  事件=="挑战你" then
		if 副本数据.天命秘境.进行[副本id].进程==10 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,105120,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 3101 and 名称=="天命秘境唐王" and  事件=="挑战你" then
		if 副本数据.天命秘境.进行[副本id].进程==11 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,105121,玩家数据[id].地图单位.标识)
		end
	end
end

function 副本_天命秘境:战斗胜利处理(id组,战斗类型,任务id)
	local id = id组[1]
	local 副本id = 任务处理类:取副本id(id,3080)
	if 副本id == 0 then return end
	if 战斗类型 == 105111 then
		副本数据.天命秘境.进行[副本id]={进程=2}
		任务数据[任务id].zhandou = nil
		刷新任务3080(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 105112 then
		副本数据.天命秘境.进行[副本id]={进程=3}
		任务数据[任务id].zhandou = nil
		刷新任务3080(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 105113 then
		副本数据.天命秘境.进行[副本id]={进程=4}
		任务数据[任务id].zhandou = nil
		刷新任务3080(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 105114 then
		副本数据.天命秘境.进行[副本id]={进程=5}
		任务数据[任务id].zhandou = nil
		刷新任务3080(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 105115 then
		副本数据.天命秘境.进行[副本id]={进程=6}
		任务数据[任务id].zhandou = nil
		刷新任务3080(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 105116 then
		副本数据.天命秘境.进行[副本id]={进程=7}
		任务数据[任务id].zhandou = nil
		刷新任务3080(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 105117 then
		副本数据.天命秘境.进行[副本id]={进程=8}
		任务数据[任务id].zhandou = nil
		刷新任务3080(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 105118 then
		副本数据.天命秘境.进行[副本id]={进程=9}
		任务数据[任务id].zhandou = nil
		刷新任务3080(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 105119 then
		副本数据.天命秘境.进行[副本id]={进程=10}
		任务数据[任务id].zhandou = nil
		刷新任务3080(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 105120 then
		副本数据.天命秘境.进行[副本id]={进程=11}
		任务数据[任务id].zhandou = nil
		刷新任务3080(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 105121 then
		副本数据.天命秘境.进行[副本id]={进程=12}
		任务数据[任务id].zhandou = nil
		刷新任务3080(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	end
end

function 副本_天命秘境:完成奖励(id组,战斗类型)
	if 战斗类型 == 105111 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(2650,4100)+200000
			local 银子=等级*取随机数(110,120)+80000
			local 储备=等级*取随机数(110,120)+500000
			玩家数据[cyid].角色:添加储备(储备,"天命秘境",1)
			玩家数据[cyid].角色:添加经验(经验,"天命秘境")
			玩家数据[cyid].角色:添加银子(银子,"天命秘境",1)
			玩家数据[cyid].角色:添加副本积分(20)
			if 取随机数()<=35 then
				local 奖励参数=取随机数(1,100)
				local 链接={提示=format("#S(天命秘境)#Y梦幻西游为高手玩家打造的副本，#G/%s#Y少侠在天命秘境中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
        				if 奖励参数<=3 then
					local 名称="特效宝珠"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
        				elseif 奖励参数<=10 then
					local 名称="星辉石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="易经丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)

				elseif 奖励参数<=20 then
					local 名称="仙露小丸子"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="摇钱树苗"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称="神兽涎"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=60 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				else
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end--百晓星君
	elseif 战斗类型 == 105112 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(2650,4100)+200000
			local 银子=等级*取随机数(110,120)+80000
			local 储备=等级*取随机数(110,120)+500000
			玩家数据[cyid].角色:添加储备(储备,"天命秘境",1)
			玩家数据[cyid].角色:添加经验(经验,"天命秘境")
			玩家数据[cyid].角色:添加银子(银子,"天命秘境",1)
			玩家数据[cyid].角色:添加副本积分(20)
			if 取随机数()<=26 then
				local 奖励参数=取随机数(1,100)
				local 链接={提示=format("#S(天命秘境)#Y梦幻西游为高手玩家打造的副本，#G/%s#Y少侠在天命秘境中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
       					if 奖励参数<=10 then
					local 名称="星辉石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="易经丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=20 then
					local 名称="仙露小丸子"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="摇钱树苗"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称="神兽涎"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=60 then
					local 名称="符石卷轴"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				else
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end--兰虎
	elseif 战斗类型 == 105113 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(2650,4100)+200000
			local 银子=等级*取随机数(110,120)+80000
			local 储备=等级*取随机数(110,120)+500000
			玩家数据[cyid].角色:添加储备(储备,"天命秘境",1)
			玩家数据[cyid].角色:添加经验(经验,"天命秘境")
			玩家数据[cyid].角色:添加银子(银子,"天命秘境",1)
			玩家数据[cyid].角色:添加副本积分(20)
			if 取随机数()<=33 then
				local 奖励参数=取随机数(1,100)
				local 链接={提示=format("#S(天命秘境)#Y梦幻西游为高手玩家打造的副本，#G/%s#Y少侠在天命秘境中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
        				if 奖励参数<=3 then
					local 名称="特效宝珠"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
        				elseif 奖励参数<=10 then
					local 名称="星辉石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="易经丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)

				elseif 奖励参数<=20 then
					local 名称="仙露小丸子"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="摇钱树苗"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称="神兽涎"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=60 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				elseif 奖励参数<=81 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end--郑镖头
	elseif 战斗类型 == 105114 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(2650,4100)+200000
			local 银子=等级*取随机数(110,120)+80000
			local 储备=等级*取随机数(110,120)+500000
			玩家数据[cyid].角色:添加储备(储备,"天命秘境",1)
			玩家数据[cyid].角色:添加经验(经验,"天命秘境")
			玩家数据[cyid].角色:添加银子(银子,"天命秘境",1)
			玩家数据[cyid].角色:添加副本积分(20)
			if 取随机数()<=26 then
				local 奖励参数=取随机数(1,100)
				local 链接={提示=format("#S(天命秘境)#Y梦幻西游为高手玩家打造的副本，#G/%s#Y少侠在天命秘境中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
        				if 奖励参数<=10 then
					local 名称="星辉石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="易经丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=20 then
					local 名称="仙露小丸子"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="摇钱树苗"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称="神兽涎"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=60 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				elseif 奖励参数<=81 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end--郑镖头
	elseif 战斗类型 == 105115 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(2650,4100)+200000
			local 银子=等级*取随机数(110,120)+80000
			local 储备=等级*取随机数(110,120)+500000
			玩家数据[cyid].角色:添加储备(储备,"天命秘境",1)
			玩家数据[cyid].角色:添加经验(经验,"天命秘境")
			玩家数据[cyid].角色:添加银子(银子,"天命秘境",1)
			玩家数据[cyid].角色:添加副本积分(20)
			if 取随机数()<=34 then
				local 奖励参数=取随机数(1,100)
				local 链接={提示=format("#S(天命秘境)#Y梦幻西游为高手玩家打造的副本，#G/%s#Y少侠在天命秘境中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
        				if 奖励参数<=3 then
					local 名称="特效宝珠"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
        				elseif 奖励参数<=10 then
					local 名称="星辉石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="易经丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)

				elseif 奖励参数<=20 then
					local 名称="仙露小丸子"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="摇钱树苗"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称="神兽涎"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=60 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				elseif 奖励参数<=81 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end--郑镖头
	elseif 战斗类型 == 105116 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(2650,4100)+200000
			local 银子=等级*取随机数(110,120)+80000
			local 储备=等级*取随机数(110,120)+500000
			玩家数据[cyid].角色:添加储备(储备,"天命秘境",1)
			玩家数据[cyid].角色:添加经验(经验,"天命秘境")
			玩家数据[cyid].角色:添加银子(银子,"天命秘境",1)
			玩家数据[cyid].角色:添加副本积分(20)
			if 取随机数()<=26 then
				local 奖励参数=取随机数(1,100)
				local 链接={提示=format("#S(天命秘境)#Y梦幻西游为高手玩家打造的副本，#G/%s#Y少侠在天命秘境中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
        				if 奖励参数<=10 then
					local 名称="星辉石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="易经丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=20 then
					local 名称="仙露小丸子"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="摇钱树苗"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称="神兽涎"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=60 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				elseif 奖励参数<=81 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end--郑镖头
	elseif 战斗类型 == 105117 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(2650,4100)+200000
			local 银子=等级*取随机数(110,120)+80000
			local 储备=等级*取随机数(110,120)+500000
			玩家数据[cyid].角色:添加储备(储备,"天命秘境",1)
			玩家数据[cyid].角色:添加经验(经验,"天命秘境")
			玩家数据[cyid].角色:添加银子(银子,"天命秘境",1)
			玩家数据[cyid].角色:添加副本积分(20)
			if 取随机数()<=35 then
				local 奖励参数=取随机数(1,100)
				local 链接={提示=format("#S(天命秘境)#Y梦幻西游为高手玩家打造的副本，#G/%s#Y少侠在天命秘境中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
        				if 奖励参数<=3 then
					local 名称="特效宝珠"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
        				elseif 奖励参数<=10 then
					local 名称="星辉石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="易经丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)

				elseif 奖励参数<=20 then
					local 名称="仙露小丸子"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="摇钱树苗"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称="神兽涎"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=60 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				elseif 奖励参数<=81 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end--郑镖头
	elseif 战斗类型 == 105118 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(2650,4100)+200000
			local 银子=等级*取随机数(110,120)+80000
			local 储备=等级*取随机数(110,120)+500000
			玩家数据[cyid].角色:添加储备(储备,"天命秘境",1)
			玩家数据[cyid].角色:添加经验(经验,"天命秘境")
			玩家数据[cyid].角色:添加银子(银子,"天命秘境",1)
			玩家数据[cyid].角色:添加副本积分(20)
			if 取随机数()<=26 then
				local 奖励参数=取随机数(1,100)
				local 链接={提示=format("#S(天命秘境)#Y梦幻西游为高手玩家打造的副本，#G/%s#Y少侠在天命秘境中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
        				if 奖励参数<=10 then
					local 名称="星辉石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="易经丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=20 then
					local 名称="仙露小丸子"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="摇钱树苗"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称="神兽涎"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=60 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				elseif 奖励参数<=81 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end--郑镖头
	elseif 战斗类型 == 105119 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(2650,4100)+200000
			local 银子=等级*取随机数(110,120)+80000
			local 储备=等级*取随机数(110,120)+500000
			玩家数据[cyid].角色:添加储备(储备,"天命秘境",1)
			玩家数据[cyid].角色:添加经验(经验,"天命秘境")
			玩家数据[cyid].角色:添加银子(银子,"天命秘境",1)
			玩家数据[cyid].角色:添加副本积分(20)
			if 取随机数()<=36 then
				local 奖励参数=取随机数(1,100)
				local 链接={提示=format("#S(天命秘境)#Y梦幻西游为高手玩家打造的副本，#G/%s#Y少侠在天命秘境中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
        				if 奖励参数<=3 then
					local 名称="特效宝珠"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
        				elseif 奖励参数<=10 then
					local 名称="星辉石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="易经丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)

				elseif 奖励参数<=20 then
					local 名称="仙露小丸子"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="摇钱树苗"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称="神兽涎"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=60 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				elseif 奖励参数<=81 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end--郑镖头
	elseif 战斗类型 == 105120 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(2650,4100)+200000
			local 银子=等级*取随机数(110,120)+80000
			local 储备=等级*取随机数(110,120)+500000
			玩家数据[cyid].角色:添加储备(储备,"天命秘境",1)
			玩家数据[cyid].角色:添加经验(经验,"天命秘境")
			玩家数据[cyid].角色:添加银子(银子,"天命秘境",1)
			玩家数据[cyid].角色:添加副本积分(20)
			if 取随机数()<=26 then
				local 奖励参数=取随机数(1,100)
				local 链接={提示=format("#S(天命秘境)#Y梦幻西游为高手玩家打造的副本，#G/%s#Y少侠在天命秘境中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
        				if 奖励参数<=10 then
					local 名称="星辉石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="易经丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=20 then
					local 名称="仙露小丸子"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="摇钱树苗"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称="神兽涎"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=60 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				elseif 奖励参数<=81 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end--郑镖头
	elseif 战斗类型 == 105121 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(2650,4100)+200000
			local 银子=等级*取随机数(110,120)+80000
			local 储备=等级*取随机数(110,120)+500000
			玩家数据[cyid].角色:添加储备(储备,"天命秘境",1)
			玩家数据[cyid].角色:添加经验(经验,"天命秘境")
			玩家数据[cyid].角色:添加银子(银子,"天命秘境",1)
			玩家数据[cyid].角色:添加副本积分(200)
			添加活跃(cyid,10)
			更新玩家每日(cyid,"副本任务","天命秘境")

			if 取随机数()<=28 then
				local 奖励参数=取随机数(1,100)
				local 链接={提示=format("#S(天命秘境)#Y梦幻西游为高手玩家打造的副本，#G/%s#Y少侠在天命秘境中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
        				if 奖励参数<=3 then
					local 名称="特殊魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=8 then
					local 名称="特效宝珠"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
        				elseif 奖励参数<=10 then
					local 名称="星辉石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="易经丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)

				elseif 奖励参数<=20 then
					local 名称="仙露小丸子"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="摇钱树苗"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称="神兽涎"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=60 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				elseif 奖励参数<=81 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end--郑镖头
	end
end

function 副本_天命秘境:任务说明(玩家id,任务id)
	local 说明 = {}
	local 副本id=任务数据[任务id].副本id
	local 数量 = 1
	if 副本数据.天命秘境.进行[副本id]==nil then
		说明={"天命秘境","#W您的副本已经完成"}
	else
		local 进程=副本数据.天命秘境.进行[副本id].进程

		       if 进程==1 then
          说明={"副本·天命秘境",format("#W/请在20分钟内消灭该场景内的#R/天命特处士兵#W/(当前剩余：#Y/%s#W/尚未消灭)，否则副本会失败！距离副本结束剩余:#R/%s#W分钟",数量,取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
        elseif 进程==2 then
          说明={"副本·天命秘境",format("#W/请在20分钟内消灭该场景内的#R/天命偏将军#W/(当前剩余：#Y/%s#W/尚未消灭)，否则副本会失败！距离副本结束剩余:#R/%s#W分钟",数量,取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
        elseif 进程==3 then
          说明={"副本·天命秘境",format("#W/请在20分钟内消灭该场景内的#R/天命战败者#W/(当前剩余：#Y/%s#W/尚未消灭)，否则副本会失败！距离副本结束剩余:#R/%s#W分钟",数量,取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
        elseif 进程==4 then
          说明={"副本·天命秘境",format("#W/请在20分钟内消灭该场景内的#R/天命秘境魔头#W/(当前剩余：#Y/%s#W/尚未消灭)，否则副本会失败！距离副本结束剩余:#R/%s#W分钟",数量,取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
        elseif 进程==5 then
          说明={"副本·天命秘境",format("#W/请在20分钟内消灭该场景内的#R/天命白衣秀士#W/(当前剩余：#Y/%s#W/尚未消灭)，否则副本会失败！距离副本结束剩余:#R/%s#W分钟",数量,取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
        elseif 进程==6 then
          说明={"副本·天命秘境",format("#W/请在20分钟内消灭该场景内的#R/天命熊山君#W/(当前剩余：#Y/%s#W/尚未找到)，否则副本会失败！距离副本结束剩余:#R/%s#W分钟",数量,取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
        elseif 进程==7 then
          说明={"副本·天命秘境",format("#W/请在20分钟内消灭该场景内的#R/天命秘境老妖#W/(当前剩余：#Y/%s#W/尚未消灭)，否则副本会失败！距离副本结束剩余:#R/%s#W分钟",数量,取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
        elseif 进程==8 then
          说明={"副本·天命秘境",format("#W/请在20分钟内消灭该场景内的#R/天命秘境牛魔#W/(当前剩余：#Y/%s#W/尚未消灭)，否则副本会失败！距离副本结束剩余:#R/%s#W分钟",数量,取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
        elseif 进程==9 then
          说明={"副本·天命秘境",format("#W/请在20分钟内消灭该场景内的#R/天命秘境圣子#W/(当前剩余：#Y/%s#W/尚未消灭)，否则副本会失败！距离副本结束剩余:#R/%s#W分钟",数量,取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
        elseif 进程==10 then
          说明={"副本·天命秘境",format("#W/请在20分钟内消灭该场景内的#R/天命秘境妖王#W/(当前剩余：#Y/%s#W/尚未消灭)，否则副本会失败！距离副本结束剩余:#R/%s#W分钟",数量,取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
        elseif 进程==11 then
          说明={"副本·天命秘境",format("#W/请在20分钟内消灭该场景内的#G/天命秘境唐王#W/(当前剩余：#Y/%s#W/尚未消灭)，否则副本会失败！距离副本结束剩余:#R/%s#W分钟",数量,取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
        end
	end
	return 说明
end

return 副本_天命秘境
