-- @作者: baidwwy
-- @邮箱:  313738139@qq.com
-- @创建时间:   2023-01-07 14:28:52
-- @最后修改来自: baidwwy
-- @Last Modified time: 2026-05-18 20:35:05
local 副本_天命通天 = class()
local sj = 取随机数
local format = string.format
local insert = table.insert
local ceil = math.ceil
local floor = math.floor
local wps = 取物品数据
local typ = type
local random = 取随机数
local npc={} --模型,名字

function 副本_天命通天:初始化()
	地图处理类.地图数据[8507]={npc={},单位={},传送圈={}} --长寿
	地图处理类.地图玩家[8507]={}
	地图处理类.地图坐标[8507]=地图处理类.地图坐标[1070]
	地图处理类.地图单位[8507]={}
	地图处理类.单位编号[8507]=1000

	地图处理类.地图数据[8508]={npc={},单位={},传送圈={}} --普陀山
	地图处理类.地图玩家[8508]={}
	地图处理类.地图坐标[8508]=地图处理类.地图坐标[1140]
	地图处理类.地图单位[8508]={}
	地图处理类.单位编号[8508]=1000

	地图处理类.地图数据[8509]={npc={},单位={},传送圈={}} --天命通天底
	地图处理类.地图玩家[8509]={}
	地图处理类.地图坐标[8509]=地图处理类.地图坐标[1116]
	地图处理类.地图单位[8509]={}
	地图处理类.单位编号[8509]=1000

	地图处理类.地图数据[8510]={npc={},单位={},传送圈={}} --灵感之腹
	地图处理类.地图玩家[8510]={}
	地图处理类.地图坐标[8510]=地图处理类.地图坐标[1202]
	地图处理类.地图单位[8510]={}
	地图处理类.单位编号[8510]=1000

end


function 副本_天命通天:更改模型(id,模型)
	玩家数据[id].角色.变身数据=模型
	发送数据(玩家数据[id].连接id,37,玩家数据[id].角色.变身数据)
	设置任务1(id,1,玩家数据[id].角色.变身数据,3600)
	地图处理类:更改模型(id,玩家数据[id].角色.变身数据,1)
end

function 副本_天命通天:开启副本(id)
	if 玩家数据[id].队伍==0 or 玩家数据[id].队长==false  then
		常规提示(id,"#Y/该任务必须组队完成且由队长领取")
		return
	elseif 取队伍人数(id)<5 and 调试模式==false then
		常规提示(id,"#Y此副本要求队伍人数不低于5人")
		return
	elseif  取等级要求(id,69)==false then
		常规提示(id,"#Y此副本要求角色等级不能低于69级")
		return
	end
	local 队伍id=玩家数据[id].队伍
	for n=1,#队伍数据[队伍id].成员数据 do
		local 临时id=队伍数据[队伍id].成员数据[n]
		if 副本数据.天命通天.完成[临时id]~=nil then
			常规提示(id,"#Y"..玩家数据[临时id].角色.名称.."本日已经完成过此副本了")
			return
		elseif 玩家数据[临时id].角色:取任务(3020)~=0 then
		local 副本id=任务数据[玩家数据[id].角色:取任务(3020)].副本id
		local 进程=副本数据.天命通天.进行[副本id].进程
		local 地图=8507
		local x=0
		local y=0
		if 进程==1 then
			x,y=31,180
		elseif 进程==2 then
			x,y=31,180
		elseif 进程==3 then
			x,y=31,180
		elseif 进程 ==4 then
			地图=8508
			x,y=94,192
		elseif 进程 ==5 then
			地图=8508
			x,y=19,24
		elseif 进程 ==6 then
			地图=8509
			x,y=99,58
		else
			地图=8510
			x,y=41,37
		end
		地图处理类:跳转地图(id,地图,x,y)
			常规提示(id,"#Y"..玩家数据[临时id].角色.名称.."正在进行副本任务，无法领取新的副本")
			return
		end
	end

	副本数据.天命通天.进行[id]={进程=1,答题={}}
	local 任务id,ZU=取唯一任务(3020,id)
	任务数据[任务id]={
		id=任务id,
		起始=os.time(),
		结束=7200,
		玩家id=0,
		DWZ=ZU,
		销毁=true,
		副本重置=true,
		队伍组=ZU,
		副本id=id,
		PlayerGroup = table.copy(队伍数据[队伍id].成员数据),
		类型=3020
	}
	任务处理类:添加队伍任务(id,任务id,"#Y你开启了天命通天副本")
	self:刷新任务3020(id)
end

function 副本_天命通天:刷新任务3020(id) --这是全局方法啊，别用全局，不然调用不到self
	local id = 任务处理类:取副本id(id,3020)
	if 副本数据.天命通天.进行[id]==nil then
		-- print(1111)
		return
	end
	玩家数据[id].zhandou=0
	local 队伍id=玩家数据[id].队伍
	--print(副本数据.天命通天.进行[id].进程)
	if 副本数据.天命通天.进行[id].进程==1 then
		-- print(22222)
		--if 副本数据.天命通天.进行[id].阶段 == 0 then
		local 地图=8507
		local 任务id=id.."_3021_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="陈关保",
			模型="小毛头",
			x=94,
			y=192,
			方向=0,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=3021
		}
		地图处理类:添加单位(任务id)
		local 任务id=id.."_3021_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="一秤金",
			模型="小丫丫",
			x=138,
			y=130,
			方向=1,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=3021
		}
		地图处理类:添加单位(任务id)
		local 任务id=id.."_3021_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="陈铁柱",
			模型="小毛头",
			x=67,
			y=72,
			方向=0,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=3021
		}
		地图处理类:添加单位(任务id)
		地图处理类:跳转地图(id,8507,31,180) --跳转到长寿

	elseif 副本数据.天命通天.进行[id].进程==2 then
		local 地图=8507
		local 任务id=id.."_3022_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="灵感大王分身",
			模型="神天兵",
			x=19,
			y=172,
			方向=0,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=3022
		}
		地图处理类:添加单位(任务id)
		local 任务id=id.."_3022_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="灵灯",
			模型="灵灯",
			x=27,
			y=177,
			方向=0,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=3022
		}
		地图处理类:添加单位(任务id)
		-- local 小孩模型 = {"小毛头","小丫丫"}
		-- for n=1,#队伍数据[队伍id].成员数据 do
		-- 	local 临时id=队伍数据[队伍id].成员数据[n]
		-- 	self:更改模型(临时id,小孩模型[math.random(#小孩模型)])
		-- end
	elseif 副本数据.天命通天.进行[id].进程==3 then
			任务处理类:删除副本单位(id,3020,711)
			任务处理类:删除副本单位(id,3020,712)
			local 任务id=id.."_3023_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			local 地图=8507 --
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="唐僧",
				模型="唐僧",
				销毁=true,
				副本重置=true,
				x=100,
				y=92,
				方向=3,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=3023
			}
			地图处理类:添加单位(任务id)
			local 任务id=id.."_3023_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			local 地图=8507 --
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="陈家村村长",
				模型="刘老爹",
				销毁=true,
				副本重置=true,
				x=87,
				y=91,
				方向=1,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=3023
			}
			地图处理类:添加单位(任务id)
			local 任务id=id.."_3023_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			local 地图=8507 --
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="村民",
				模型="男人_书生",
				销毁=true,
				副本重置=true,
				x=110,
				y=96,
				方向=1,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=3023
			}
			地图处理类:添加单位(任务id)
			local 任务id=id.."_3023_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			local 地图=8507 --
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="村民",
				模型="樵夫",
				销毁=true,
				副本重置=true,
				x=104,
				y=108,
				方向=2,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=3023
			}
			地图处理类:添加单位(任务id)
	elseif 副本数据.天命通天.进行[id].进程==4 then
			local 地图=8508 --
			local 任务id=id.."_3024_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="善财童子",
				模型="小魔头",
				销毁=true,
				副本重置=true,
				x=19,
				y=24,
				方向=0,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=3024
			}
			地图处理类:添加单位(任务id)
			local 任务id=id.."_3024_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="黑熊精",
				模型="黑熊精",
				销毁=true,
				副本重置=true,
				x=26,
				y=20,
				方向=0,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=3024
			}
			地图处理类:添加单位(任务id)
			地图处理类:跳转地图(id,8508,25,48)
			local text1 = {"河妖太多，师傅被抓走了","天命通天太危险，只好去南海求菩萨了"}
			for n=1,#队伍数据[队伍id].成员数据 do
				local 临时id=队伍数据[队伍id].成员数据[n]
				发送数据(玩家数据[临时id].连接id,6557,{文本=text1,类型="天命通天1",字体=nil,音乐=nil,背景=nil,横排显示=true,动画调用=nil})
			end
	elseif 副本数据.天命通天.进行[id].进程==5 then
			local 地图=8508
			local 任务id=id.."_3025_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="木材",
				模型="木材",
				销毁=true,
				副本重置=true,
				x=55,
				y=15,
				方向=0,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=3025
			}
			地图处理类:添加单位(任务id)

	elseif 副本数据.天命通天.进行[id].进程==6 then
			local 地图=8509
			local 任务id=id.."_3026_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="金鱼左将军",
				模型="金鱼",
				销毁=true,
				副本重置=true,
				x=99,
				y=58,
				方向=1,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=3026
			}
			地图处理类:添加单位(任务id)
			local 任务id=id.."_3026_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="金鱼右将军",
				模型="金鱼",
				销毁=true,
				副本重置=true,
				x=107,
				y=61,
				方向=1,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=3026
			}
			地图处理类:添加单位(任务id)
			地图处理类:跳转地图(id,8509,86,70)
			local text1 = {"将竹材交给菩萨后得到了避水珠","你同众人来到了天命通天底"}
			for n=1,#队伍数据[队伍id].成员数据 do
				local 临时id=队伍数据[队伍id].成员数据[n]
				发送数据(玩家数据[临时id].连接id,6557,{文本=text1,类型="天命通天2",字体=nil,音乐=nil,背景=nil,横排显示=true,动画调用=nil})
			end
	elseif 副本数据.天命通天.进行[id].进程==7 then

			local 地图=8510
			local 任务id=id.."_3027_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="婴灵",
				模型="幽灵",
				销毁=true,
				副本重置=true,
				x=41,
				y=37,
				方向=0,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=3027
			}
			地图处理类:添加单位(任务id)
			local 任务id=id.."_3027_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="冤魂",
				模型="野鬼",
				销毁=true,
				副本重置=true,
				x=78,
				y=67,
				方向=0,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=3027
			}
			地图处理类:添加单位(任务id)
			地图处理类:跳转地图(id,8510,48,112)
			local text1 = {"得益于菩萨避水珠的帮助","你打败了强敌，进入了灵感之腹"}
			for n=1,#队伍数据[队伍id].成员数据 do
				local 临时id=队伍数据[队伍id].成员数据[n]
				发送数据(玩家数据[临时id].连接id,6557,{文本=text1,类型="天命通天3",字体=nil,音乐=nil,背景=nil,横排显示=true,动画调用=nil})
			end
			-- 发送数据(玩家数据[id].连接id,6557,{文本=text1,类型="五更寒渔村2",字体=nil,音乐=nil,背景=nil,横排显示=true,动画={100,5}})
			-- 发送数据(玩家数据[id].连接id,6560,true)
		-- elseif 副本数据.天命通天.进行[id].阶段 == 1 then
		-- 	常规提示(id,"#Y/此处为播放动画")
		-- 	return'
		-- end
	elseif 副本数据.天命通天.进行[id].进程==8 then
			任务处理类:删除副本单位(id,3020,717)
			local 地图=8510
			local 任务id=id.."_3028_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="心",
				模型="钻石",
				销毁=true,
				副本重置=true,
				x=114,
				y=27,
				方向=0,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=3028
			}
			地图处理类:添加单位(任务id)
			local 任务id=id.."_3028_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="肝",
				模型="钻石",
				销毁=true,
				副本重置=true,
				x=107,
				y=27,
				方向=0,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=3028
			}
			地图处理类:添加单位(任务id)
			local 任务id=id.."_3028_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="脾",
				模型="钻石",
				销毁=true,
				副本重置=true,
				x=118,
				y=32,
				方向=0,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=3028
			}
			地图处理类:添加单位(任务id)
			local 任务id=id.."_3028_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="肾",
				模型="钻石",
				销毁=true,
				副本重置=true,
				x=123,
				y=27,
				方向=0,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=3028
			}
			地图处理类:添加单位(任务id)
			local 任务id=id.."_3028_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="肺",
				模型="钻石",
				销毁=true,
				副本重置=true,
				x=114,
				y=22,
				方向=0,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=3028
			}
			地图处理类:添加单位(任务id)
	elseif 副本数据.天命通天.进行[id].进程==9 then
			任务处理类:删除副本单位(id,3020,718)
			local 地图=8510
		            local 任务id=id.."_3029_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				销毁=true,
				副本重置=true,
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="灵感元神",
				模型="帮派妖兽",
				x=171,
				y=121,
				方向=1,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=3029
			}
			地图处理类:添加单位(任务id)
			local text1 = {"你解救了灵感腹中的孩子","惊动了灵感大王"}
			for n=1,#队伍数据[队伍id].成员数据 do
				local 临时id=队伍数据[队伍id].成员数据[n]
				发送数据(玩家数据[临时id].连接id,6557,{文本=text1,类型="天命通天4",字体=nil,音乐=nil,背景=nil,横排显示=true,动画=nil})
			end


	elseif 副本数据.天命通天.进行[id].进程==10 then
		地图处理类:跳转地图(id,1070,127,178)
		local 任务id=玩家数据[id].角色:取任务(3020)
		local text1={{"祸害一方的灵感大王","倒下了"},{"你将活着的孩子","送回了陈家庄","唐僧师徒也继续西行"},{"天命通天  完"}}
		for n=1,#队伍数据[队伍id].成员数据 do
			local 临时id=队伍数据[队伍id].成员数据[n]
			玩家数据[临时id].角色:取消任务(任务id)
			抽奖处理:转盘抽奖(id)
			副本数据.天命通天.完成[临时id]=true
			发送数据(玩家数据[临时id].连接id,6557,{文本=text1,类型="天命通天结束",字体=nil,音乐=nil,背景=nil,横排显示=nil,动画=nil})
		end
	end
	刷新队伍任务追踪(id)
end

function 副本_天命通天:怪物对话内容(id,类型,标识,地图)
    local 对话数据={}
	对话数据.模型=任务数据[标识].模型
	对话数据.名称=任务数据[标识].名称
	local 副本id = 任务处理类:取副本id(id,3020)
	if 副本id == 0 or 副本id ~= id  then
		对话数据.对话="只有创建副本的队长才能和我对话"
	end
	if 副本数据.天命通天.进行[副本id].进程==1 then
		if 对话数据.名称=="陈关保" or 对话数据.名称=="一秤金" or 对话数据.名称=="陈铁柱" then
			if 副本数据.天命通天.进行[副本id].答题[标识] then
				对话数据.对话 = "你已经在我这里答过题了，去找别的小朋友吧！"
				对话数据.选项 = {"好的好的"}
			else
				local 临时题目 = {
					{"旧事王谢堂前( )，飞入寻常百姓家。",{"燕","雁","鸡","鲲"}},
					{"白日依山( )，黄河入海流。",{"傍","尽","近","逝"}},
					{"蔡徐坤做了多久练习生？",{"一年","一年半","两年","两年半"}},
					{"2+2*2-2=( )",{"4","6","2","8"}},
					{"May the force be with you的中文意思是",{"别太放肆没什么用","愿力量与你同在","五月的力量是你的","我看不懂"}},
					{"西游记中孙悟空在菩提老祖处所习得的技能是？",{"天罡三十六变","地煞七十二变","如来神掌","九阴真经"}},
				}
				local lstk = 临时题目[math.random(#临时题目)]
				对话数据.对话 = lstk[1]
				对话数据.选项 = lstk[2]
			end
		else
			对话数据.对话="发生肾么事了"
		end
	elseif 副本数据.天命通天.进行[副本id].进程==2 then
		if 对话数据.名称=="灵感大王分身" then
			对话数据.对话 = "该死的村民终于把童男童女送来了#24"
			对话数据.选项 = {}
		elseif 对话数据.名称=="灵灯" then
			对话数据.对话 = "灵灯发出了不详的光照"
			对话数据.选项 = {"伸手触摸一下"}
		end
	elseif 副本数据.天命通天.进行[副本id].进程==3 then
		--if 副本数据.天命通天.进行[副本id].阶段 == 0 then
			if 对话数据.名称=="唐僧" then
				对话数据.对话 = "少侠，村子周围出现了很多河妖，你能帮助村民们击退水妖吗？"
				对话数据.选项 = {"没问题","我自身难保先溜了"}
			end
		--end
	elseif 副本数据.天命通天.进行[副本id].进程==4 then
		--if 副本数据.天命通天.进行[副本id].阶段 == 0 then
			if 对话数据.名称=="善财童子" then
				对话数据.对话 = "好啊，又是孙猴子的朋友，想要菩萨先打败我再说吧！"
				对话数据.选项 = {"那就得罪了","我先溜了..."}
			elseif 对话数据.名称=="黑熊精" then
				对话数据.对话 = "这善财童子阻拦你们我也不好多说话.."
				对话数据.选项 = {"。。。。"}
			end
	elseif 副本数据.天命通天.进行[副本id].进程==5 then
		--if 副本数据.天命通天.进行[副本id].阶段 == 0 then
			if 对话数据.名称=="木材" then
				对话数据.对话 = "一块被不知道谁处理好的木材在地上发着光"
				对话数据.选项 = {"捡起来"}
			end
	elseif 副本数据.天命通天.进行[副本id].进程==6 then
		--if 副本数据.天命通天.进行[副本id].阶段 == 0 then
			if 对话数据.名称=="金鱼左将军" then
				对话数据.对话 = "你是何人，尽然能安然来到这天命通天底！#24"
				对话数据.选项 = {}
			elseif 对话数据.名称=="金鱼右将军" then
				对话数据.对话 = "你是何人，尽然能安然来到这天命通天底！#24"
				对话数据.选项 = {"我是来要你命的人","小弟匆忙中不慎闯入"}
			end
	elseif 副本数据.天命通天.进行[副本id].进程==7 then
		--if 副本数据.天命通天.进行[副本id].阶段 == 0 then
			if 副本数据.天命通天.进行[副本id].怪物[对话数据.名称] then
					对话数据.对话 = "我死的好惨#115"
					对话数据.选项 = {"...吓死个人"}
			else
				if 对话数据.名称=="婴灵" then
					对话数据.对话 = "我死的好惨#115"
					对话数据.选项 = {"帮助婴灵解脱","...吓死个人"}
				elseif 对话数据.名称=="冤魂" then
					对话数据.对话 = "我死的好惨#115"
					对话数据.选项 = {"帮助冤魂解脱","...吓死个人"}
				end
			end
	elseif 副本数据.天命通天.进行[副本id].进程==8 then
		--if 副本数据.天命通天.进行[副本id].阶段 == 0 then
			if 副本数据.天命通天.进行[副本id].怪物[对话数据.名称] then
					对话数据.对话 = "我死的好惨#115"
					对话数据.选项 = {"...吓死个人"}
			else
				if 对话数据.名称=="心" then
					对话数据.对话 = "解救灵感大王腹中的童男童女的心"
					对话数据.选项 = {"杀","不知道打不打得过,我先溜了"}
				elseif 对话数据.名称=="肝" then
					对话数据.对话 = "解救灵感大王腹中的童男童女的肝"
					对话数据.选项 = {"杀","不知道打不打得过,我先溜了"}
				elseif 对话数据.名称=="脾" then
					对话数据.对话 = "解救灵感大王腹中的童男童女的脾"
					对话数据.选项 = {"杀","不知道打不打得过,我先溜了"}
				elseif 对话数据.名称=="肾" then
					对话数据.对话 = "解救灵感大王腹中的童男童女的肾"
					对话数据.选项 = {"杀","不知道打不打得过,我先溜了"}
				elseif 对话数据.名称=="肺" then
					对话数据.对话 = "解救灵感大王腹中的童男童女的肺"
					对话数据.选项 = {"杀","不知道打不打得过,我先溜了"}
				end
			end
	elseif 副本数据.天命通天.进行[副本id].进程==9 then
		--if 副本数据.天命通天.进行[副本id].阶段 == 0 then
			if 对话数据.名称=="灵感元神" then
				对话数据.对话 = "原来是你小子在我腹中搅得我无法安宁，受死吧！"
				对话数据.选项 = {"战就战谁怕谁","大王我错了，我给你跪下了。。"}
			end
	end

	return 对话数据
end

function 副本_天命通天:对话事件处理(id,名称,事件,类型)
	local 副本id = 任务处理类:取副本id(id,3020)
	if 类型 == 3021 and (名称=="陈关保" or 名称 =="一秤金" or 名称=="陈铁柱")  then
		if 事件 == "燕" or 事件 == "尽" or  事件 == "两年半" or  事件 == "4" or  事件 == "愿力量与你同在" or  事件 == "地煞七十二变" then
			副本数据.天命通天.进行[副本id].答题[玩家数据[id].地图单位.标识] = 1
			if table_leng(副本数据.天命通天.进行[副本id].答题) >= 3 then
				副本数据.天命通天.进行[副本id] = {进程=2}
				self:刷新任务3020(副本id)
			end
			常规提示(id,"#Y/回答正确！")
		elseif 事件 == "好的好的" then
			return
		else
			常规提示(id,"#Y/太笨啦，不对不对")
		end
	elseif 类型 == 3022 and 名称=="灵灯" and  事件=="伸手触摸一下" then
		if 副本数据.天命通天.进行[副本id].进程==2 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,105020,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 3023 and 名称=="唐僧" and  事件=="没问题" then
		if 副本数据.天命通天.进行[副本id].进程==3 then
			副本数据.天命通天.进行[副本id] = {进程=4}
			self:刷新任务3020(副本id)
		end
	elseif 类型 == 3024 and 名称=="善财童子" and  事件=="那就得罪了" then
		if 副本数据.天命通天.进行[副本id].进程==4 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,105021,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 3025 and 名称=="木材" and  事件=="捡起来" then
		if 副本数据.天命通天.进行[副本id].进程==5 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,105022,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 3026 and 名称=="金鱼右将军" and  事件=="我是来要你命的人" then
		if 副本数据.天命通天.进行[副本id].进程==6 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,105023,玩家数据[id].地图单位.标识) --暂用8测试
			--从4开始连续战斗至8   战斗准备类:创建战斗(id+0,190204,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 3027 and 副本数据.天命通天.进行[副本id].进程 == 7 then
		if 名称=="婴灵" and 事件=="帮助婴灵解脱" then
			if 副本数据.天命通天.进行[副本id].怪物[名称] then 常规提示(id,"#Y/该怪物已被超度！") return  end
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,105028,玩家数据[id].地图单位.标识)

		elseif 名称=="冤魂" and 事件=="帮助冤魂解脱" then
			if 副本数据.天命通天.进行[副本id].怪物[名称] then 常规提示(id,"#Y/该怪物已被超度！") return  end
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,105029,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 3028 and 副本数据.天命通天.进行[副本id].进程 == 8 then
		if 副本数据.天命通天.进行[副本id].怪物[名称] then 常规提示(id,"#Y/该部位已被超度！") return  end
		if 事件=="杀" then
			local ls = {心=105030,肝=105031,脾=105032,肾=105033,肺=105034}
			if ls[名称] ~= nil then
				if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
				if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
				任务数据[玩家数据[id].地图单位.标识].zhandou=true
				战斗准备类:创建战斗(id+0,ls[名称],玩家数据[id].地图单位.标识)
			end
		end
	elseif 类型 == 3029 and 名称=="灵感元神" and  事件=="战就战谁怕谁" then
		if 副本数据.天命通天.进行[副本id].进程==9 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,105035,玩家数据[id].地图单位.标识)
		end
	end
end


function 副本_天命通天:战斗胜利处理(id组,战斗类型,任务id)
	local id = id组[1]
	local 副本id = 任务处理类:取副本id(id,3020)
	if 副本id == 0 then return end
	if 战斗类型 == 105020 then
		副本数据.天命通天.进行[副本id]={进程=3}
		任务数据[任务id].zhandou = nil
		self:刷新任务3020(副本id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 105021 then
		副本数据.天命通天.进行[副本id]={进程=5}
		任务数据[任务id].zhandou = nil
		self:刷新任务3020(副本id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 105022 then
		副本数据.天命通天.进行[副本id]={进程=6}
		任务数据[任务id].zhandou = nil
		self:刷新任务3020(副本id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 105023 or 战斗类型 == 105024 or 战斗类型 == 105025 or 战斗类型 == 105026 then
	elseif 战斗类型 == 105027 then --204 205 206 207 208
		副本数据.天命通天.进行[副本id]={进程=7,怪物={}}
		任务数据[任务id].zhandou = nil
		self:刷新任务3020(副本id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 105028 then --209
		任务数据[任务id].zhandou = nil
		if  副本数据.天命通天.进行[副本id].进程==7 and 副本数据.天命通天.进行[副本id].怪物 then
			副本数据.天命通天.进行[副本id].怪物["婴灵"] = 1
		end
		if table_leng(副本数据.天命通天.进行[副本id].怪物) >= 2 then
			副本数据.天命通天.进行[副本id]={进程=8,怪物={}}
			self:刷新任务3020(副本id)
			self:完成奖励(id组,战斗类型)
		end
	elseif 战斗类型 == 105029 then
		任务数据[任务id].zhandou = nil
		if 副本数据.天命通天.进行[副本id].进程==7 and 副本数据.天命通天.进行[副本id].怪物 then
			副本数据.天命通天.进行[副本id].怪物["冤魂"] = 1
		end
		if table_leng(副本数据.天命通天.进行[副本id].怪物) >= 2 then
			副本数据.天命通天.进行[副本id]={进程=8,怪物={}}
			self:刷新任务3020(副本id)
			self:完成奖励(id组,战斗类型)
		end
	elseif 战斗类型 >= 105030 and 战斗类型 <= 105034 then
		任务数据[任务id].zhandou = nil
		if 副本数据.天命通天.进行[副本id].进程== 8 and 副本数据.天命通天.进行[副本id].怪物 then
			副本数据.天命通天.进行[副本id].怪物[任务数据[任务id].名称] = 1
		end
		if table_leng(副本数据.天命通天.进行[副本id].怪物) >= 5 then
			副本数据.天命通天.进行[副本id]={进程=9}
			self:刷新任务3020(副本id)
			self:完成奖励(id组,战斗类型)
		end
	elseif 战斗类型 == 105035 then
		副本数据.天命通天.进行[副本id]={进程=10}
		任务数据[任务id].zhandou = nil
		self:刷新任务3020(副本id)
		self:完成奖励(id组,战斗类型)
	end
end


function 副本_天命通天:完成奖励(id组,战斗类型)
	if 战斗类型 == 105020 then
		local 链接
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(1500,2000)+200000
			local 银子=等级*取随机数(100,120)+80000
			local 储备=等级*取随机数(110,120)+500000
			玩家数据[cyid].角色:添加储备(储备,"灵感分身",1)
			玩家数据[cyid].角色:添加经验(经验,"灵感分身")
			玩家数据[cyid].角色:添加银子(银子,"灵感分身",1)
			local 链接
			if 取随机数()<=20 then
				local 奖励参数=取随机数(1,100)
				链接={提示=format("#S(天命通天)#G/%s#Y击败了灵感分身，获得了",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
				if 奖励参数<=4 then
					local 名称="特效宝珠"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
	            		             elseif 奖励参数<=10 then
					local 名称="星辉石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="易经丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=18 then
					local 名称="高级魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,3),nil,链接)
				elseif 奖励参数<=20 then
					local 名称="仙露小丸子"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="摇钱树苗"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称="神兽涎"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=55 then
					local 名称="九转金丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,100,链接)
				elseif 奖励参数<=60 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				else
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end
	elseif 战斗类型 == 105021 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(1500,2000)+200000
			local 银子=等级*取随机数(100,120)+80000
			local 储备=等级*取随机数(110,120)+500000
			玩家数据[cyid].角色:添加储备(储备,"天命通天红孩儿",1)
			玩家数据[cyid].角色:添加经验(经验,"天命通天红孩儿")
			玩家数据[cyid].角色:添加银子(银子,"天命通天红孩儿",1)
			local 链接
			if 取随机数()<=26 then
				local 奖励参数=取随机数(1,100)
				链接={提示=format("#S(天命通天)#G/%s#Y险胜善财童子，获得了",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
	           			 if 奖励参数<=10 then
					local 名称="星辉石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="易经丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=20 then
					local 名称="仙露小丸子"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="摇钱树苗"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称="神兽涎"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=55 then
					local 名称="九转金丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,100,链接)
				elseif 奖励参数<=60 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				else
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end
	elseif 战斗类型 == 105022 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(1500,2000)+200000
			local 银子=等级*取随机数(100,130)+80000
			local 储备=等级*取随机数(110,120)+500000
			玩家数据[cyid].角色:添加储备(储备,"天命通天木材",1)
			玩家数据[cyid].角色:添加经验(经验,"天命通天木材")
			玩家数据[cyid].角色:添加银子(银子,"天命通天木材",1)
			local 链接
			if 取随机数()<=26 then
				local 奖励参数=取随机数(1,100)
				链接={提示=format("#S(天命通天)#G/%s#Y打败了竹精，获得了",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y一个！"}
	            		if 奖励参数<=5 then
					local 名称="特效宝珠"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
	            		elseif 奖励参数<=10 then
					local 名称="星辉石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="易经丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=18 then
					local 名称="高级魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,3),nil,链接)
				elseif 奖励参数<=20 then
					local 名称="仙露小丸子"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="摇钱树苗"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=26 then
					local 名称="高级魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称="神兽涎"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=55 then
					local 名称="九转金丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,100,链接)
				elseif 奖励参数<=60 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				elseif 奖励参数<=81 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end
	elseif 战斗类型 == 105023 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(1500,2000)+200000
			local 银子=等级*取随机数(110,150)+80000
			local 储备=等级*取随机数(110,120)+500000
			玩家数据[cyid].角色:添加储备(储备,"天命通天金鱼",1)
			玩家数据[cyid].角色:添加经验(经验,"天命通天金鱼")
			玩家数据[cyid].角色:添加银子(银子,"天命通天金鱼",1)
			local 链接
			if 取随机数()<=26 then
				local 奖励参数=取随机数(1,100)
				链接={提示=format("#S(天命通天)#G/%s#Y击败了灵感手下的金鱼将军，获得了",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y一个！"}
	            		if 奖励参数<=3 then
					local 名称="特效宝珠"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
	            		elseif 奖励参数<=10 then
					local 名称="星辉石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="易经丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=20 then
					local 名称="仙露小丸子"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="摇钱树苗"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=26 then
					local 名称="高级魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称="神兽涎"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=55 then
					local 名称="九转金丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,100,链接)
				elseif 奖励参数<=60 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				elseif 奖励参数<=81 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end
	elseif 战斗类型 == 105024 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(1500,2000)+200000
			local 银子=等级*取随机数(120,150)+80000
			local 储备=等级*取随机数(110,120)+500000
			玩家数据[cyid].角色:添加储备(储备,"天命通天婴灵",1)
			玩家数据[cyid].角色:添加经验(经验,"天命通天婴灵")
			玩家数据[cyid].角色:添加银子(银子,"天命通天婴灵",1)
			local 链接
			if 取随机数()<=26 then
				local 奖励参数=取随机数(1,100)
				链接={提示=format("#S(天命通天)#G/%s#Y超度了婴灵，获得了",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y一个！"}
	            		if 奖励参数<=3 then
					local 名称="特效宝珠"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
	            		elseif 奖励参数<=10 then
					local 名称="星辉石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="易经丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=18 then
					local 名称="高级魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,3),nil,链接)
				elseif 奖励参数<=20 then
					local 名称="仙露小丸子"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="摇钱树苗"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=26 then
					local 名称="高级魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称="神兽涎"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=55 then
					local 名称="九转金丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,100,链接)
				elseif 奖励参数<=60 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				elseif 奖励参数<=81 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end
	elseif 战斗类型 == 105025 then
		-- local stid=取随机数(1,#id组)
		-- stid=id组[stid]
		-- local 链接={提示=format("#S(天命通天)#G/%s#R超度了冤魂，获得了",玩家数据[stid].角色.名称),频道="xt",结尾="#R！#80"}
		-- 玩家数据[stid].道具:给予超链接书铁(stid,{15,15},nil,链接)
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(1500,2000)+200000
			local 银子=等级*取随机数(120,150)+80000
			local 储备=等级*取随机数(110,120)+500000
			玩家数据[cyid].角色:添加储备(储备,"天命通天冤魂",1)
			玩家数据[cyid].角色:添加经验(经验,"天命通天冤魂")
			玩家数据[cyid].角色:添加银子(银子,"天命通天冤魂",1)
	        		玩家数据[cyid].角色:添加副本积分(100)
			if 取随机数()<=50 then
				local 奖励参数=取随机数(1,100)
				链接={提示=format("#S(天命通天)#G/%s#Y超度了冤魂，获得了",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y一个！"}
	            		if 奖励参数<=3 then
					local 名称="特效宝珠"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
	            		elseif 奖励参数<=10 then
					local 名称="星辉石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="易经丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=20 then
					local 名称="高级召唤兽内丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="摇钱树苗"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=28 then
					local 名称="高级魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称="神兽涎"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=55 then
					local 名称="九转金丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,100,链接)
				elseif 奖励参数<=60 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				elseif 奖励参数<=81 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="未激活的星石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				end
			end
		end
	elseif 战斗类型 == 105026 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(1500,2000)+200000
			local 银子=等级*取随机数(120,150)+80000
			local 储备=等级*取随机数(110,120)+500000
			玩家数据[cyid].角色:添加储备(储备,"天命通天心",1)
			玩家数据[cyid].角色:添加经验(经验,"天命通天心")
			玩家数据[cyid].角色:添加银子(银子,"天命通天心",1)
			local 链接
			if 取随机数()<=26 then
				local 奖励参数=取随机数(1,100)
				链接={提示=format("#S(天命通天)#G/%s#Y解放了孩童之心，获得了",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y一个！"}
	            		if 奖励参数<=3 then
					local 名称="特效宝珠"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
	            		elseif 奖励参数<=10 then
					local 名称="星辉石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="易经丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=18 then
					local 名称="高级魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,3),nil,链接)
				elseif 奖励参数<=20 then
					local 名称="仙露小丸子"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="摇钱树苗"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=26 then
					local 名称="高级魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称="神兽涎"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=55 then
					local 名称="九转金丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,100,链接)
				elseif 奖励参数<=60 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				elseif 奖励参数<=81 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end
	elseif 战斗类型 == 105027 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(1500,2000)+200000
			local 银子=等级*取随机数(120,150)+80000
			local 储备=等级*取随机数(110,120)+500000
			玩家数据[cyid].角色:添加储备(储备,"天命通天肝",1)
			玩家数据[cyid].角色:添加经验(经验,"天命通天肝")
			玩家数据[cyid].角色:添加银子(银子,"天命通天肝",1)
			local 链接
			if 取随机数()<=26 then
				local 奖励参数=取随机数(1,100)
				链接={提示=format("#S(天命通天)#G/%s#Y超度了孩童之肝，获得了",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y一个！"}
	            		if 奖励参数<=3 then
					local 名称="特效宝珠"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
	            		elseif 奖励参数<=10 then
					local 名称="星辉石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="易经丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=20 then
					local 名称="仙露小丸子"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="摇钱树苗"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=26 then
					local 名称="高级魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称="神兽涎"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=55 then
					local 名称="九转金丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,100,链接)
				elseif 奖励参数<=60 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				elseif 奖励参数<=81 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end
	elseif 战斗类型 == 105028 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(1500,2000)+200000
			local 银子=等级*取随机数(120,150)+80000
			local 储备=等级*取随机数(110,120)+500000
			玩家数据[cyid].角色:添加储备(储备,"天命通天肾",1)
			玩家数据[cyid].角色:添加经验(经验,"天命通天肾")
			玩家数据[cyid].角色:添加银子(银子,"天命通天肾",1)
			local 链接
			if 取随机数()<=26 then
				local 奖励参数=取随机数(1,100)
				链接={提示=format("#S(天命通天)#G/%s#Y超度了孩童之肾，获得了",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y一个！"}
	            		if 奖励参数<=3 then
					local 名称="特效宝珠"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
	            		elseif 奖励参数<=10 then
					local 名称="星辉石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="易经丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=20 then
					local 名称="仙露小丸子"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="摇钱树苗"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=26 then
					local 名称="高级魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称="神兽涎"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=55 then
					local 名称="九转金丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,100,链接)
				elseif 奖励参数<=60 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				elseif 奖励参数<=81 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end
	elseif 战斗类型 == 105029 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(1500,2000)+200000
			local 银子=等级*取随机数(120,150)+80000
			local 储备=等级*取随机数(110,120)+500000
			玩家数据[cyid].角色:添加储备(储备,"天命通天脾",1)
			玩家数据[cyid].角色:添加经验(经验,"天命通天脾")
			玩家数据[cyid].角色:添加银子(银子,"天命通天脾",1)
			local 链接
			if 取随机数()<=26 then
				local 奖励参数=取随机数(1,100)
				链接={提示=format("#S(天命通天)#G/%s#Y超度了孩童之脾，获得了",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y一个！"}
	            		if 奖励参数<=3 then
					local 名称="星辉石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
	            		elseif 奖励参数<=10 then
					local 名称="星辉石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="易经丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=18 then
					local 名称="高级魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,3),nil,链接)
				elseif 奖励参数<=20 then
					local 名称="仙露小丸子"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="摇钱树苗"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=26 then
					local 名称="高级魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称="神兽涎"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=55 then
					local 名称="九转金丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,100,链接)
				elseif 奖励参数<=60 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				elseif 奖励参数<=81 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end
	elseif 战斗类型 == 105034 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(1500,2000)+200000
			local 银子=等级*取随机数(120,150)+80000
			local 储备=等级*取随机数(110,120)+500000
			玩家数据[cyid].角色:添加储备(储备,"天命通天肺",1)
			玩家数据[cyid].角色:添加经验(经验,"天命通天肺")
			玩家数据[cyid].角色:添加银子(银子,"天命通天肺",1)
			local 链接
			if 取随机数()<=26 then
				local 奖励参数=取随机数(1,100)
				链接={提示=format("#S(天命通天)#G/%s#Y超度了孩童之肺，获得了",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y一个！"}
	            		if 奖励参数<=3 then
					local 名称="特效宝珠"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
	            		elseif 奖励参数<=10 then
					local 名称="星辉石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="易经丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=20 then
					local 名称="仙露小丸子"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="摇钱树苗"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=26 then
					local 名称="高级魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称="神兽涎"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=55 then
					local 名称="九转金丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,100,链接)
				elseif 奖励参数<=60 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				elseif 奖励参数<=81 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end
	elseif 战斗类型 == 105035 then
		local stid=取随机数(1,#id组)
		stid=id组[stid]
		-- local 链接={提示=format("#S(天命通天)#G/%s#R击败了灵感大王，孩童们被解救，获得了村民送出的",玩家数据[stid].角色.名称),频道="xt",结尾="#R！#80"}
		-- 玩家数据[stid].道具:给予超链接书铁(stid,{13,13},nil,链接)
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(1500,2000)+200000
			local 银子=等级*取随机数(120,150)+15000
			local 储备=等级*取随机数(110,120)+500000
			玩家数据[cyid].角色:添加储备(储备,"天命通天灵感大王",1)
			玩家数据[cyid].角色:添加副本积分(300)
			玩家数据[cyid].角色:添加经验(经验,"天命通天灵感大王")
			玩家数据[cyid].角色:添加银子(银子,"天命通天灵感大王",1)
			添加活跃(cyid,10)
			更新玩家每日(cyid,"副本任务","天命通天")

			local 链接
			if 取随机数()<=30 then
				local 奖励参数=取随机数(1,100)
				链接={提示=format("#S(天命通天)#G/%s#Y击败了灵感大王，获得了",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y一个！"}
	            		if 奖励参数<=3 then
					local 名称="特殊魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=8 then
					local 名称="特效宝珠"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)

	            		elseif 奖励参数<=10 then
					local 名称="星辉石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="易经丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=18 then
					local 名称="高级魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,3),nil,链接)
				elseif 奖励参数<=20 then
					local 名称="仙露小丸子"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="摇钱树苗"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=26 then
					local 名称="高级魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称="神兽涎"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=55 then
					local 名称="九转金丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,100,链接)
				elseif 奖励参数<=60 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				elseif 奖励参数<=81 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end

	else -- 无效战斗类型
		return
	end

end


function 副本_天命通天:任务说明(玩家id,任务id)
	local 说明 = {}
	local 副本id=任务数据[任务id].副本id
	if 副本数据.天命通天.进行[副本id]==nil then
		说明={"天命通天","#W您的副本已经完成"}
	else
		local 进程=副本数据.天命通天.进行[副本id].进程
		if 进程==1 then
			说明={"天命通天",format("#W先在庄里逛逛，和".."#Y/qqq|陈关保*8507*临时npc*94*192/陈关保".."#W、".."#Y/qqq|一秤金*8507*临时npc*138*130/一秤金".."#W以及".."#Y/qqq|陈铁柱*8507*临时npc*67*72/陈铁柱".."#W打声招呼吧。(剩余时间%s分钟)",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==2 then
			说明={"天命通天",format("#W此时灵感大王已经进入庄内了,前去触摸他面前的".."#Y/qqq|灵灯*8507*临时npc*19*172/灵灯".."#W打探一番吧。触摸(剩余时间%s分钟)",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==3 then
			说明={"天命通天",format("#W庄内似乎冲出了很多河妖，快去找".."#Y/qqq|唐僧*8507*临时npc*100*92/唐僧".."#W他似乎有话对你说。(剩余时间%s分钟)",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==4 then
			说明={"天命通天",format("#W到了南海".."#Y/qqq|善财童子*8508*临时npc*19*24/善财童子".."#W挡住了你的去路。(剩余时间%s分钟)",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==5 then
			说明={"天命通天",format("#W击败了善财童子，从他口中得知菩萨需要，".."#Y/qqq|木材*8508*临时npc*55*15/木材".."#W,快去帮菩萨找一些来吧。(剩余时间%s分钟)",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==6 then
			说明={"天命通天",format("#W得到了菩萨的宝物，来到了天命通天底。向面前的".."#Y/qqq|金鱼右将军*8509*临时npc*107*61/金鱼右将军".."#W打探一番情报(此处将进行5场连续战斗)。(剩余时间%s分钟)",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==7 then
			说明={"天命通天",format("#W击败了金鱼将军，却被吸入灵感之腹。远处有不少".."#Y/qqq|冤魂*8510*临时npc*78*67/冤魂".."#W和".."#Y/qqq|婴灵*8510*临时npc*41*37/婴灵".."#W,只好先超度他们了。(剩余时间%s分钟)",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==8 then
			说明={"天命通天",format("#W在不远处好像有灵感吃下孩童的".."#Y/qqq|心*8510*临时npc*114*27/心、肝、脾、肾、肺".."#W,快去解救未来得及消化的孩童。(剩余时间%s分钟)",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==9 then
			说明={"天命通天",format("#W你惊动了".."#Y/qqq|灵感元神*8510*临时npc*171*121/灵感元神".."#W,看来只能同他决一死战了。(剩余时间%s分钟)",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==10 then
			说明={"天命通天",format("#W天命通天完(剩余时间%s分钟)",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		end
	end
	return 说明
end

return 副本_天命通天