
local 副本_天命红孩儿 = class()
local sj = 取随机数
local format = string.format
local insert = table.insert
local ceil = math.ceil
local floor = math.floor
local wps = 取物品数据
local typ = type
local random = 取随机数

function 副本_天命红孩儿:初始化()
	地图处理类.地图数据[8521]={npc={},单位={},传送圈={}} --六百里钻头号山
	地图处理类.地图玩家[8521]={}
	地图处理类.地图坐标[8521]=地图处理类.地图坐标[1210]
	地图处理类.地图单位[8521]={}
	地图处理类.单位编号[8521]=1000

	地图处理类.地图数据[8522]={npc={},单位={},传送圈={}} --天罡刀阵
	地图处理类.地图玩家[8522]={}
	地图处理类.地图坐标[8522]=地图处理类.地图坐标[1197]
	地图处理类.地图单位[8522]={}
	地图处理类.单位编号[8522]=1000

end

function 副本_天命红孩儿:开启副本(id)
	if 玩家数据[id].队伍==0 or 玩家数据[id].队长==false then
		常规提示(id,"#Y/该任务必须组队完成且由队长领取")
		return
	elseif 取队伍人数(id)<5 and 调试模式==false then
		常规提示(id,"#Y此副本要求队伍人数不低于5人")
		return
	elseif 取等级要求(id,50)==false then
		常规提示(id,"#Y此副本要求角色等级不能低于50级")
		return
	end
	local 队伍id=玩家数据[id].队伍
	for n=1,#队伍数据[队伍id].成员数据 do
		local 临时id=队伍数据[队伍id].成员数据[n]
		if 副本数据.天命红孩儿.完成[临时id]~=nil then
			常规提示(id,"#Y"..玩家数据[临时id].角色.名称.."本日已经完成过此副本了")
			return
		elseif 玩家数据[临时id].角色:取任务(3060)~=0 then
		local 副本id=任务数据[玩家数据[id].角色:取任务(3060)].副本id
		local 进程=副本数据.天命红孩儿.进行[副本id].进程
		local 地图=8521
		local x=0
		local y=0
		if 进程<4 then
			x,y=26,27
		elseif 进程== 5 or 进程== 6 then
			地图=8522
			x,y=19,53
		elseif 进程== 6 or 进程== 7 or 进程== 8  then
			地图=8521
			x,y=164,126
		end
		地图处理类:跳转地图(id,地图,x,y)
			return
		end
	end
	副本数据.天命红孩儿.进行[id]={进程=1,数量=0}
	local 任务id,ZU=取唯一任务(3060,id)
	任务数据[任务id]={
		id=任务id,
		起始=os.time(),
		结束=3600,
		玩家id=0,
		DWZ=ZU,
		销毁=true,
		副本重置=true,
		队伍组=ZU,
		副本id=id,
		PlayerGroup = table.copy(队伍数据[队伍id].成员数据),
		类型=3060
	}
	任务处理类:添加队伍任务(id,任务id,"#Y你开启了天命红孩儿副本")
	刷新任务3060(id)
end

function 刷新任务3060(id)
	local id = 任务处理类:取副本id(id,3060)
	if 副本数据.天命红孩儿.进行[id]==nil then
		return
	end
	玩家数据[id].zhandou=0
	local 队伍id=玩家数据[id].队伍
	if 副本数据.天命红孩儿.进行[id].进程==1 then
		local 地图=8521 --长安城
		local 任务id=id.."_3081_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="天命蛛丝",
			模型="蜘蛛精",
			染色方案=2078,
       			染色组={[1]=5,[2]=0},
			x=110,
			y=91,
			方向=2,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=3081
		}
		地图处理类:添加单位(任务id)
		local 地图=8521 --长安城
		local 任务id=id.."_3081_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="蛛丝",
			模型="蜘蛛精",
			x=114,
			y=83,
			方向=2,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=3081
		}
		地图处理类:添加单位(任务id)
		local 地图=8521 --长安城
		local 任务id=id.."_3081_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="蛛丝",
			模型="蜘蛛精",
			x=113,
			y=86,
			方向=2,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=3081
		}
		地图处理类:添加单位(任务id)
		local 地图=8521 --长安城
		local 任务id=id.."_3081_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="蛛丝",
			模型="蜘蛛精",
			x=114,
			y=88,
			方向=2,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=3081
		}
		地图处理类:添加单位(任务id)
		local 地图=8521 --长安城
		local 任务id=id.."_3081_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="蛛丝",
			模型="蜘蛛精",
			x=112,
			y=90,
			方向=2,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=3081
		}
		地图处理类:添加单位(任务id)
		local 地图=8521 --长安城
		local 任务id=id.."_3081_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="蛛丝",
			模型="蜘蛛精",
			x=107,
			y=93,
			方向=2,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=3081
		}
		地图处理类:添加单位(任务id)
		local 地图=8521 --长安城
		local 任务id=id.."_3081_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="蛛丝",
			模型="蜘蛛精",
			x=103,
			y=94,
			方向=2,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=3081
		}
		地图处理类:添加单位(任务id)
	elseif 副本数据.天命红孩儿.进行[id].进程==2 then
			任务处理类:删除副本单位(id,3060,3081)
			local 地图=8521 --长安城
			local 任务id=id.."_3082_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				销毁=true,
				副本重置=true,
				玩家id=0,
				队伍组={},
				名称="天命红孩儿",
				模型="小魔头",
				x=174,
				y=109,
				方向=0,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=3082
			}
			地图处理类:添加单位(任务id)
	elseif 副本数据.天命红孩儿.进行[id].进程==3 then
			任务处理类:删除副本单位(id,3060,3082)
			local 任务id=id.."_3083_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			local 地图=8521 --长安城
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="观音姐姐",
				模型="观音姐姐",
				销毁=true,
				副本重置=true,
				x=153,
				y=112,
				方向=0,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=3083
			}
			地图处理类:添加单位(任务id)
	elseif 副本数据.天命红孩儿.进行[id].进程==4 then
			任务处理类:删除副本单位(id,3060,3083)
			local 任务id=id.."_3084_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			local 地图=8521 --长安城
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="天命红孩儿",
				模型="小魔头",
				销毁=true,
				副本重置=true,
				x=174,
				y=109,
				方向=0,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=3084
			}
			地图处理类:添加单位(任务id)
	elseif 副本数据.天命红孩儿.进行[id].进程==5 then
			任务处理类:删除副本单位(id,3060,3084)
			local 任务id=id.."_3085_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			local 地图=8522 --长安城
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="天罡刀守卫",
				模型="天兵",
				x=64,
				y=40,
				方向=0,
				销毁=true,
				副本重置=true,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=3085
			}
			地图处理类:添加单位(任务id)
			地图处理类:跳转地图(id,8522,19,53) --跳转到动画地图
			local 任务id=id.."_3085_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			local 地图=8522 --长安城
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="天罡刀阵",
				模型="巡游天神",
				x=64,
				y=35,
				方向=0,
				销毁=true,
				副本重置=true,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=3085
			}
			地图处理类:添加单位(任务id)
			local 任务id=id.."_3085_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			local 地图=8522 --长安城
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="天罡刀阵",
				模型="巡游天神",
				x=57,
				y=35,
				方向=0,
				销毁=true,
				副本重置=true,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=3085
			}
			地图处理类:添加单位(任务id)
			local 任务id=id.."_3085_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			local 地图=8522 --长安城
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="天罡刀阵",
				模型="巡游天神",
				x=57,
				y=40,
				方向=0,
				销毁=true,
				副本重置=true,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=3085
			}
			地图处理类:添加单位(任务id)
			local 任务id=id.."_3085_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			local 地图=8522 --长安城
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="天罡刀阵",
				模型="巡游天神",
				x=57,
				y=45,
				方向=0,
				销毁=true,
				副本重置=true,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=3085
			}
			地图处理类:添加单位(任务id)
			local 任务id=id.."_3085_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			local 地图=8522 --长安城
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="天罡刀阵",
				模型="巡游天神",
				x=64,
				y=35,
				方向=0,
				销毁=true,
				副本重置=true,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=3085
			}
			地图处理类:添加单位(任务id)
			local 任务id=id.."_3085_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			local 地图=8522 --长安城
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="天罡刀阵",
				模型="巡游天神",
				x=64,
				y=45,
				方向=0,
				销毁=true,
				副本重置=true,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=3085
			}
			地图处理类:添加单位(任务id)
			local 任务id=id.."_3085_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			local 地图=8522 --长安城
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="天罡刀阵",
				模型="巡游天神",
				x=70,
				y=45,
				方向=0,
				销毁=true,
				副本重置=true,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=3085
			}
			地图处理类:添加单位(任务id)
			local 任务id=id.."_3085_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			local 地图=8522 --长安城
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="天罡刀阵",
				模型="巡游天神",
				x=71,
				y=40,
				方向=0,
				销毁=true,
				副本重置=true,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=3085
			}
			地图处理类:添加单位(任务id)
			local 任务id=id.."_3085_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			local 地图=8522 --长安城
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="天罡刀阵",
				模型="巡游天神",
				x=71,
				y=35,
				方向=0,
				销毁=true,
				副本重置=true,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=3085
			}
			地图处理类:添加单位(任务id)
	elseif 副本数据.天命红孩儿.进行[id].进程==6 then
			任务处理类:删除副本单位(id,3060,3085)
			local 任务id=id.."_3086_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			local 地图=8522 --长安城
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="阵眼",
				模型="钻石",
				销毁=true,
				副本重置=true,
				x=64,
				y=40,
				方向=0,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=3086
			}
			地图处理类:添加单位(任务id)
	elseif 副本数据.天命红孩儿.进行[id].进程==7 then
			任务处理类:删除副本单位(id,3060,3086)
			local 任务id=id.."_3087_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			local 地图=8522 --长安城
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="木吒",
				模型="男人_哪吒",
				销毁=true,
				副本重置=true,
				x=27,
				y=47,
				方向=0,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=3087
			}
			地图处理类:添加单位(任务id)
	elseif 副本数据.天命红孩儿.进行[id].进程==8 then
			任务处理类:删除副本单位(id,3060,3087)
			local 任务id=id.."_3088_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			local 地图=8521 --长安城
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="圣婴大王",
				模型="小魔头",
				销毁=true,
				副本重置=true,
				x=156,
				y=112,
				方向=0,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=3088
			}
			地图处理类:添加单位(任务id)
			地图处理类:跳转地图(id,8521,174,109)
	elseif 副本数据.天命红孩儿.进行[id].进程==9 then
		任务处理类:删除副本单位(id,3060,3089)
		local 任务id=玩家数据[id].角色:取任务(3060)
		local text1 = {"梦幻西游真好玩！","我还要充钱。","天命红孩儿副本（完）"}
		for n=1,#队伍数据[队伍id].成员数据 do
			local 临时id=队伍数据[队伍id].成员数据[n]
			玩家数据[临时id].角色:取消任务(任务id)
			副本数据.天命红孩儿.完成[临时id]=true
			抽奖处理:转盘抽奖(id)
			地图处理类:跳转地图(id,1001,224,118)
			发送数据(玩家数据[临时id].连接id,6557,{文本=text1,类型="归墟副本结束",字体=nil,音乐=nil,背景=nil,横排显示=true,动画=nil})
		end
	end
end

function 副本_天命红孩儿:怪物对话内容(id,类型,标识,地图)
	local 对话数据={}
	对话数据.模型=任务数据[标识].模型
	对话数据.名称=任务数据[标识].名称
	local 副本id = 任务处理类:取副本id(id,3060)
	if 副本id == 0 or 副本id ~= id  then
		对话数据.对话="只有创建副本的队长才能和我对话"
		return 对话数据
	end
	if 副本数据.天命红孩儿.进行[副本id].进程==1 then
		if 对话数据.名称=="天命蛛丝" then
			对话数据.对话 = "欢迎来到梦幻西游"
			对话数据.选项 = {"我来了","我准备一下"}
			else
			对话数据.对话 = "欢迎来到梦幻西游"
			对话数据.选项 = {"我是路过的"}
		end
	elseif 副本数据.天命红孩儿.进行[副本id].进程==2 then
		if 对话数据.名称=="天命红孩儿" then
			对话数据.对话 = "欢迎来到梦幻西游"
			对话数据.选项 = {"挑战你","我准备一下"}
		end
	elseif 副本数据.天命红孩儿.进行[副本id].进程==3 then
			if 对话数据.名称=="观音姐姐" then
				对话数据.对话 = "欢迎来到梦幻西游"
				对话数据.选项 = {"挑战你","我准备一下"}
			end
	elseif 副本数据.天命红孩儿.进行[副本id].进程==4 then
			if 对话数据.名称=="天命红孩儿" then
				对话数据.对话 = "欢迎来到梦幻西游"
				对话数据.选项 = {"挑战你","我准备一下"}
			end
	elseif 副本数据.天命红孩儿.进行[副本id].进程==5 then
			if 对话数据.名称=="天罡刀守卫" then
				对话数据.对话 = "欢迎来到梦幻西游"
				对话数据.选项 = {"挑战你","我准备一下"}
			end
	elseif 副本数据.天命红孩儿.进行[副本id].进程==6 then
			if 对话数据.名称=="阵眼" then
				对话数据.对话 = "欢迎来到梦幻西游"
				对话数据.选项 = {"挑战你","我准备一下"}
			end
	elseif 副本数据.天命红孩儿.进行[副本id].进程==7 then
			if 对话数据.名称=="木吒" then
				对话数据.对话 = "欢迎来到梦幻西游"
				对话数据.选项 = {"挑战你","我准备一下"}
			end
	elseif 副本数据.天命红孩儿.进行[副本id].进程==8 then
			if 对话数据.名称=="圣婴大王" then
				对话数据.对话 = "欢迎来到梦幻西游"
				对话数据.选项 = {"挑战你","我准备一下"}
			end
	end
	return 对话数据
end

function 副本_天命红孩儿:对话事件处理(id,名称,事件,类型)
	local 副本id = 任务处理类:取副本id(id,3060)
	if 类型 == 3081 and 名称=="天命蛛丝" and  事件=="我来了" then
		if 副本数据.天命红孩儿.进行[副本id].进程==1 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,105091,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 3082 and 名称=="天命红孩儿" and  事件=="挑战你" then
		if 副本数据.天命红孩儿.进行[副本id].进程==2 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,105092,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 3083 and 名称=="观音姐姐" and  事件=="挑战你" then
		if 副本数据.天命红孩儿.进行[副本id].进程==3 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,105093,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 3084 and 名称=="天命红孩儿" and  事件=="挑战你" then
		if 副本数据.天命红孩儿.进行[副本id].进程==4 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,105094,玩家数据[id].地图单位.标识)--这里设计一个连打--105099
		end
	elseif 类型 == 3085 and 名称=="天罡刀守卫" and  事件=="挑战你" then
		if 副本数据.天命红孩儿.进行[副本id].进程==5 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,105100,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 3086 and 名称=="阵眼" and  事件=="挑战你" then
		if 副本数据.天命红孩儿.进行[副本id].进程==6 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,105101,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 3087 and 名称=="木吒" and  事件=="挑战你" then
		if 副本数据.天命红孩儿.进行[副本id].进程==7 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,105102,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 3088 and 名称=="圣婴大王" and  事件=="挑战你" then
		if 副本数据.天命红孩儿.进行[副本id].进程==8 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,105103,玩家数据[id].地图单位.标识)
		end
	end
end

function 副本_天命红孩儿:战斗胜利处理(id组,战斗类型,任务id)
	local id = id组[1]
	local 副本id = 任务处理类:取副本id(id,3060)
	if 副本id == 0 then return end
	if 战斗类型 == 105091 then
		副本数据.天命红孩儿.进行[副本id]={进程=2}
		任务数据[任务id].zhandou = nil
		刷新任务3060(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 105092 then
		副本数据.天命红孩儿.进行[副本id]={进程=3}
		任务数据[任务id].zhandou = nil
		刷新任务3060(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 105093 then
		副本数据.天命红孩儿.进行[副本id]={进程=4}
		任务数据[任务id].zhandou = nil
		刷新任务3060(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 105094 or 战斗类型 == 105095 or 战斗类型 == 105096 or 战斗类型 == 105097  or 战斗类型 == 105098 then
	elseif 战斗类型 == 105099 then
		副本数据.天命红孩儿.进行[副本id]={进程=5}
		任务数据[任务id].zhandou = nil
		刷新任务3060(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 105100 then
		副本数据.天命红孩儿.进行[副本id]={进程=6}
		任务数据[任务id].zhandou = nil
		刷新任务3060(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 105101 then
		副本数据.天命红孩儿.进行[副本id]={进程=7}
		任务数据[任务id].zhandou = nil
		刷新任务3060(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 105102 then
		副本数据.天命红孩儿.进行[副本id]={进程=8}
		任务数据[任务id].zhandou = nil
		刷新任务3060(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 105103 then
		副本数据.天命红孩儿.进行[副本id]={进程=9}
		任务数据[任务id].zhandou = nil
		刷新任务3060(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	end
end

function 副本_天命红孩儿:完成奖励(id组,战斗类型)
	if 战斗类型 == 105091 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(2650,4100)+200000
			local 银子=等级*取随机数(110,120)+80000
			local 储备=等级*取随机数(110,120)+500000
			玩家数据[cyid].角色:添加储备(储备,"天命红孩儿",1)
			玩家数据[cyid].角色:添加经验(经验,"天命红孩儿")
			玩家数据[cyid].角色:添加银子(银子,"天命红孩儿",1)
			玩家数据[cyid].角色:添加副本积分(20)
			if 取随机数()<=33 then
				local 奖励参数=取随机数(1,100)
				local 链接={提示=format("#S(天命红孩儿)#Y梦幻西游为高手玩家打造的副本，#G/%s#Y少侠在天命红孩儿中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
        				if 奖励参数<=3 then
					local 名称="特效宝珠"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
        				elseif 奖励参数<=10 then
					local 名称="星辉石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="易经丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=18 then
					local 名称="特殊兽诀·碎片"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,3),nil,链接)
				elseif 奖励参数<=20 then
					local 名称="仙露小丸子"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="摇钱树苗"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称="神兽涎"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=60 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				else
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end--百晓星君
	elseif 战斗类型 == 105092 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(2650,4100)+200000
			local 银子=等级*取随机数(110,120)+80000
			local 储备=等级*取随机数(110,120)+500000
			玩家数据[cyid].角色:添加储备(储备,"天命红孩儿",1)
			玩家数据[cyid].角色:添加经验(经验,"天命红孩儿")
			玩家数据[cyid].角色:添加银子(银子,"天命红孩儿",1)
			玩家数据[cyid].角色:添加副本积分(20)
			if 取随机数()<=26 then
				local 奖励参数=取随机数(1,100)
				local 链接={提示=format("#S(天命红孩儿)#Y梦幻西游为高手玩家打造的副本，#G/%s#Y少侠在天命红孩儿中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
       				if 奖励参数<=3 then
					local 名称="特效宝珠"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
       				elseif 奖励参数<=10 then
					local 名称="星辉石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="易经丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=20 then
					local 名称="仙露小丸子"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="摇钱树苗"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称="神兽涎"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=60 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				else
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end--兰虎
	elseif 战斗类型 == 105093 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(2650,4100)+200000
			local 银子=等级*取随机数(110,120)+80000
			local 储备=等级*取随机数(110,120)+500000
			玩家数据[cyid].角色:添加储备(储备,"天命红孩儿",1)
			玩家数据[cyid].角色:添加经验(经验,"天命红孩儿")
			玩家数据[cyid].角色:添加银子(银子,"天命红孩儿",1)
			玩家数据[cyid].角色:添加副本积分(20)
			if 取随机数()<=26 then
				local 奖励参数=取随机数(1,100)
				local 链接={提示=format("#S(天命红孩儿)#Y梦幻西游为高手玩家打造的副本，#G/%s#Y少侠在天命红孩儿中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
       				if 奖励参数<=3 then
					local 名称="特效宝珠"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
       				elseif 奖励参数<=10 then
					local 名称="星辉石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="易经丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=18 then
					local 名称="特殊兽诀·碎片"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,3),nil,链接)
				elseif 奖励参数<=20 then
					local 名称="仙露小丸子"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="摇钱树苗"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称="神兽涎"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=60 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				else
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end--兰虎
	elseif 战斗类型 == 105099 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(2650,4100)+200000
			local 银子=等级*取随机数(110,120)+80000
			local 储备=等级*取随机数(110,120)+500000
			玩家数据[cyid].角色:添加储备(储备,"天命红孩儿",1)
			玩家数据[cyid].角色:添加经验(经验,"天命红孩儿")
			玩家数据[cyid].角色:添加银子(银子,"天命红孩儿",1)
			玩家数据[cyid].角色:添加副本积分(20)
			if 取随机数()<=26 then
				local 奖励参数=取随机数(1,100)
				local 链接={提示=format("#S(天命红孩儿)#Y梦幻西游为高手玩家打造的副本，#G/%s#Y少侠在天命红孩儿中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
        				if 奖励参数<=3 then
					local 名称="特效宝珠"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
        				elseif 奖励参数<=10 then
					local 名称="星辉石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="易经丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=20 then
					local 名称="仙露小丸子"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="摇钱树苗"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称="神兽涎"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=60 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				elseif 奖励参数<=81 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end--郑镖头
	elseif 战斗类型 == 105100 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(2650,4100)+200000
			local 银子=等级*取随机数(110,120)+80000
			local 储备=等级*取随机数(110,120)+500000
			玩家数据[cyid].角色:添加储备(储备,"天命红孩儿",1)
			玩家数据[cyid].角色:添加经验(经验,"天命红孩儿")
			玩家数据[cyid].角色:添加银子(银子,"天命红孩儿",1)
			玩家数据[cyid].角色:添加副本积分(20)
			if 取随机数()<=26 then
				local 奖励参数=取随机数(1,100)
				local 链接={提示=format("#S(天命红孩儿)#Y梦幻西游为高手玩家打造的副本，#G/%s#Y少侠在天命红孩儿中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
        				if 奖励参数<=10 then
					local 名称="特效宝珠"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
        				elseif 奖励参数<=10 then
					local 名称="星辉石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="易经丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=18 then
					local 名称="特殊兽诀·碎片"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,3),nil,链接)
				elseif 奖励参数<=20 then
					local 名称="仙露小丸子"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="摇钱树苗"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称="神兽涎"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=60 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				elseif 奖励参数<=81 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end--郑镖头
	elseif 战斗类型 == 105101 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(2650,4100)+200000
			local 银子=等级*取随机数(110,120)+80000
			local 储备=等级*取随机数(110,120)+500000
			玩家数据[cyid].角色:添加储备(储备,"天命红孩儿",1)
			玩家数据[cyid].角色:添加经验(经验,"天命红孩儿")
			玩家数据[cyid].角色:添加银子(银子,"天命红孩儿",1)
			玩家数据[cyid].角色:添加副本积分(20)
			if 取随机数()<=26 then
				local 奖励参数=取随机数(1,100)
				local 链接={提示=format("#S(天命红孩儿)#Y梦幻西游为高手玩家打造的副本，#G/%s#Y少侠在天命红孩儿中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
        				if 奖励参数<=3 then
					local 名称="特效宝珠"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
        				elseif 奖励参数<=10 then
					local 名称="星辉石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="易经丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=20 then
					local 名称="仙露小丸子"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="摇钱树苗"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称="神兽涎"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=60 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				elseif 奖励参数<=81 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end--郑镖头
	elseif 战斗类型 == 105102 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(2650,4100)+200000
			local 银子=等级*取随机数(110,120)+80000
			local 储备=等级*取随机数(110,120)+500000
			玩家数据[cyid].角色:添加储备(储备,"天命红孩儿",1)
			玩家数据[cyid].角色:添加经验(经验,"天命红孩儿")
			玩家数据[cyid].角色:添加银子(银子,"天命红孩儿",1)
			玩家数据[cyid].角色:添加副本积分(20)
			if 取随机数()<=26 then
				local 奖励参数=取随机数(1,100)
				local 链接={提示=format("#S(天命红孩儿)#Y梦幻西游为高手玩家打造的副本，#G/%s#Y少侠在天命红孩儿中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
        				if 奖励参数<=3 then
					local 名称="特效宝珠"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
        				elseif 奖励参数<=10 then
					local 名称="星辉石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="易经丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=18 then
					local 名称="特殊兽诀·碎片"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,3),nil,链接)
				elseif 奖励参数<=20 then
					local 名称="仙露小丸子"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="摇钱树苗"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称="神兽涎"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=60 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				elseif 奖励参数<=81 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end--郑镖头
	elseif 战斗类型 == 105103 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(2650,4100)+200000
			local 银子=等级*取随机数(110,120)+80000
			local 储备=等级*取随机数(110,120)+500000
			玩家数据[cyid].角色:添加储备(储备,"天命红孩儿",1)
			玩家数据[cyid].角色:添加经验(经验,"天命红孩儿")
			玩家数据[cyid].角色:添加银子(银子,"天命红孩儿",1)
			玩家数据[cyid].角色:添加副本积分(200)
			添加活跃(cyid,10)
			更新玩家每日(cyid,"副本任务","天命红孩儿")

			if 取随机数()<=45 then
				local 奖励参数=取随机数(1,100)
				local 链接={提示=format("#S(天命红孩儿)#Y梦幻西游为高手玩家打造的副本，#G/%s#Y少侠在天命红孩儿中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
        				if 奖励参数<=3 then
					local 名称="特殊魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=8 then
					local 名称="特效宝珠"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
        				elseif 奖励参数<=10 then
					local 名称="星辉石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="易经丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=20 then
					local 名称="仙露小丸子"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="摇钱树苗"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称="神兽涎"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=60 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				elseif 奖励参数<=81 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end--郑镖头
	end
end

function 副本_天命红孩儿:任务说明(玩家id,任务id)
  local 说明 = {}
  local 副本id=任务数据[任务id].副本id
  if 副本数据.天命红孩儿.进行[副本id]==nil then
    说明={"天命红孩儿","#W您的副本已经完成"}
  else
    local 进程=副本数据.天命红孩儿.进行[副本id].进程
    if 进程==1 then
      说明={"天命红孩儿",format("#W在六百里钻头号山找到".."#Y/qqq|天命蛛丝*8521*临时npc*110*91/天命蛛丝".."#W。副本剩余时间#R/%s#W/分钟。",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
    elseif 进程==2 then
       说明={"天命红孩儿",format("#W在六百里钻头号山找到".."#Y/qqq|天命红孩儿*8521*临时npc*174*109/天命红孩儿".."#W。副本剩余时间#R/%s#W/分钟。",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
    elseif 进程==3 then
       说明={"天命红孩儿",format("#W在六百里钻头号山找到".."#Y/qqq|观音姐姐*8521*临时npc*153*112/观音姐姐".."#W。副本剩余时间#R/%s#W/分钟。",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
    elseif 进程==4 then
       说明={"天命红孩儿",format("#W在六百里钻头号山找到".."#Y/qqq|天命红孩儿*8521*临时npc*174*109/天命红孩儿".."#W。副本剩余时间#R/%s#W/分钟。",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
    elseif 进程==5 then
      说明={"天命红孩儿",format("#W通天".."#Y/qqq|天命红孩儿*8521*临时npc*174*109/天命红孩儿".."#W选择是否挑战日益渐强的六健将！。副本剩余时间#R/%s#W/分钟。",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
    elseif 进程==6 then
      说明={"天命红孩儿",format("#W寻找#Y阵眼#W将天罡刀阵破坏。副本剩余时间#R/%s#W/分钟。",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
    elseif 进程==7 then
      说明={"天命红孩儿",format("#W寻找#Y木吒#W进入天罡刀阵并破坏。副本剩余时间#R/%s#W/分钟。",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
    elseif 进程==8 then
      说明={"天命红孩儿",format("#W在六百里钻头号山找到".."#Y/qqq|天命红孩儿*8521*临时npc*174*109/天命红孩儿".."#W。副本剩余时间#R/%s#W/分钟。",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
    end
  end
  return 说明
end
return 副本_天命红孩儿