-- @作者: baidwwy
-- @邮箱:  313738139@qq.com
-- @创建时间:   2023-01-03 09:00:53
-- @最后修改来自: baidwwy
-- @Last Modified time: 2026-05-18 20:35:06
local 副本_天命大闹 = class()
local sj = 取随机数
local format = string.format
local insert = table.insert
local ceil = math.ceil
local floor = math.floor
local wps = 取物品数据
local typ = type
local random = 取随机数
-- local npc={1="1",2="2",3="3",4="4"} --模型,名字

function 副本_天命大闹:初始化()
	地图处理类.地图数据[8511]={npc={},单位={},传送圈={}}--帮战地图
	地图处理类.地图玩家[8511]={}
	地图处理类.地图坐标[8511]=地图处理类.地图坐标[1511]
	地图处理类.地图单位[8511]={}
	地图处理类.单位编号[8511]=1000

	地图处理类.地图数据[8512]={npc={},单位={},传送圈={}}--蟠桃园
	地图处理类.地图玩家[8512]={}
	地图处理类.地图坐标[8512]=地图处理类.地图坐标[1231]
	地图处理类.地图单位[8512]={}
	地图处理类.单位编号[8512]=1000

	地图处理类.地图数据[8513]={npc={},单位={},传送圈={}}--花果山
	地图处理类.地图玩家[8513]={}
	地图处理类.地图坐标[8513]=地图处理类.地图坐标[1514]
	地图处理类.地图单位[8513]={}
	地图处理类.单位编号[8513]=1000

	地图处理类.地图数据[8514]={npc={},单位={},传送圈={}}
	地图处理类.地图玩家[8514]={}
	地图处理类.地图坐标[8514]=地图处理类.地图坐标[1111]--天宫
	地图处理类.地图单位[8514]={}
	地图处理类.单位编号[8514]=1000

end

function 副本_天命大闹:开启副本(id)
	if 玩家数据[id].队伍==0 or 玩家数据[id].队长==false then
		常规提示(id,"#Y/该任务必须组队完成且由队长领取")
		return
	elseif 取队伍人数(id)<5 and 调试模式==false then
		常规提示(id,"#Y此副本要求队伍人数不低于5人")
		return
	elseif 取等级要求(id,50)==false then
		常规提示(id,"#Y此副本要求角色等级不能低于50级")
		return
	end
	local 队伍id=玩家数据[id].队伍
	for n=1,#队伍数据[队伍id].成员数据 do
		local 临时id=队伍数据[队伍id].成员数据[n]
		if 副本数据.天命大闹.完成[临时id]~=nil then
			常规提示(id,"#Y"..玩家数据[临时id].角色.名称.."本日已经完成过此副本了")
			return
		elseif 玩家数据[临时id].角色:取任务(3043)~=0 then
		local 副本id=任务数据[玩家数据[id].角色:取任务(3043)].副本id
		local 进程=副本数据.天命大闹.进行[副本id].进程
		local 地图=8511
		local x=0
		local y=0
		if 进程==1 or 进程==2 or 进程==3  then --帮战地图
			地图=8511
			x,y=132,87
		elseif 进程==4 or 进程==5 or 进程==6 or 进程==7  then --花果山
			地图=8513
			x,y=13,109
		elseif 进程==8 then
			地图=8514
			x,y=32,27
		end
		地图处理类:跳转地图(id,地图,x,y)
			return
		end
	end
	副本数据.天命大闹.进行[id]={进程=1,数量=0}
	local 任务id,ZU=取唯一任务(3043,id)
	任务数据[任务id]={
		id=任务id,
		起始=os.time(),
		结束=3600,
		玩家id=0,
		DWZ=ZU,
		销毁=true,
		副本重置=true,
		队伍组=ZU,
		副本id=id,
		PlayerGroup = table.copy(队伍数据[队伍id].成员数据),
		类型=3043
	}
	任务处理类:添加队伍任务(id,任务id,"#Y你开启了天命大闹副本")
	刷新任务3043(id)
end

function 刷新任务3043(id)
	local id = 任务处理类:取副本id(id,3043)
	if 副本数据.天命大闹.进行[id]==nil then
		return
	end
	玩家数据[id].zhandou=0
	local 队伍id=玩家数据[id].队伍
	if 副本数据.天命大闹.进行[id].进程==1 then
		local 地图=8511 --长安城
		local 任务id=id.."_3044_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="天命锄树力士",
			模型="至尊宝",
			x=49,
			y=54,
			方向=0,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=3044
		}
		地图处理类:添加单位(任务id)
		local 地图=8511 --长安城
		local 任务id=id.."_3044_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="天命浇水力士",
			模型="赌霸天",
			x=51,
			y=63,
			方向=0,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=3044
		}
		地图处理类:添加单位(任务id)
		local 地图=8511 --长安城
		local 任务id=id.."_3044_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="天命修桃力士",
			模型="吴刚",
			x=62,
			y=50,
			方向=0,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=3044
		}
		地图处理类:添加单位(任务id)
	elseif 副本数据.天命大闹.进行[id].进程==2 then
		任务处理类:删除副本单位(id,3043,3044)
		local 地图=8511 --长安城
		local 任务id=id.."_3045_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="九千年桃树",
			模型="桃树",
			x=96,
			y=45,
			方向=0,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=3045
		}
		地图处理类:添加单位(任务id)

	elseif 副本数据.天命大闹.进行[id].进程==3 then
		任务处理类:删除副本单位(id,3043,3045)
		local 地图=8511 --长安城
		local 任务id=id.."_3046_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="天命七仙女",
			模型="芙蓉仙子",
			显示饰品=true,
			x=121,
			y=90,
			方向=0,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=3046
		}
		地图处理类:添加单位(任务id)
	elseif 副本数据.天命大闹.进行[id].进程==4 then
		任务处理类:删除副本单位(id,3043,3046)
		local 地图=8513 --长安城
		local xy=地图处理类.地图坐标[地图]:取随机点()
		local 任务id=id.."_3047_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="天命惠岸行者",
			模型="剑侠客",
			锦衣="浮生",
			武器="晓风残月",
			x=27,
			y=20,
			方向=0,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=3047
		}
		地图处理类:添加单位(任务id)
		地图处理类:跳转地图(id,8513,13,109) --跳转到动画地图
	elseif 副本数据.天命大闹.进行[id].进程==5 then
		任务处理类:删除副本单位(id,3043,3047)
		local 地图=8513 --长安城
		local 任务id=id.."_3048_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="天命二郎神",
			模型="男人_杨戬",
			x=87,
			y=17,
			方向=0,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=3048
		}
		地图处理类:添加单位(任务id)
	elseif 副本数据.天命大闹.进行[id].进程==6 then
		任务处理类:删除副本单位(id,3043,3048)
		local 地图=8513 --长安城
		local 任务id=id.."_3049_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="天命天兵统帅",
			模型="天兵",
			显示饰品=true,
			x=130,
			y=64,
			方向=0,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=3049
		}
		地图处理类:添加单位(任务id)
	elseif 副本数据.天命大闹.进行[id].进程==7 then
		任务处理类:删除副本单位(id,3043,3049)
		local 地图=8513 --长安城
		local 任务id=id.."_3050_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="天命天将统帅",
			模型="天将",
			x=130,
			y=16,
			方向=0,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=3050
		}
		地图处理类:添加单位(任务id)
	elseif 副本数据.天命大闹.进行[id].进程==8 then
			任务处理类:删除副本单位(id,3043,3050)
			local 任务id=id.."_3051_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			local 地图=8514 --长安城
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="天命巨灵神",
				模型="男人_程咬金",
				显示饰品=true,
				销毁=true,
				副本重置=true,
				x=108,
				y=125,
				方向=0,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=3051
			}
			地图处理类:添加单位(任务id)
			地图处理类:跳转地图(id,8514,42,154) --跳转到动画地图
	elseif 副本数据.天命大闹.进行[id].进程==9 then
			任务处理类:删除副本单位(id,3043,3051)
			local 任务id=id.."_3052_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			local 地图=8514 --长安城
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="天命上古雷神",
				模型="进阶谛听",
				显示饰品=true,
				销毁=true,
				副本重置=true,
				x=154,
				y=110,
				方向=0,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=3052
			}
			地图处理类:添加单位(任务id)
			--地图处理类:跳转地图(id,8503,126,36) --跳转到动画地图
	elseif 副本数据.天命大闹.进行[id].进程==10 then
		任务处理类:删除副本单位(id,3043,3052)
		local 任务id=玩家数据[id].角色:取任务(3043)
		local text1 = {"梦幻西游真好玩！","我还要充钱。","天命大闹副本（完）"}
		for n=1,#队伍数据[队伍id].成员数据 do
			local 临时id=队伍数据[队伍id].成员数据[n]
			玩家数据[临时id].角色:取消任务(任务id)
			副本数据.天命大闹.完成[临时id]=true
			抽奖处理:转盘抽奖(id)
			地图处理类:跳转地图(id,1001,224,118)
			发送数据(玩家数据[临时id].连接id,6557,{文本=text1,类型="归墟副本结束",字体=nil,音乐=nil,背景=nil,横排显示=true,动画=nil})
		end
	end
end

function 副本_天命大闹:怪物对话内容(id,类型,标识,地图)
	local 对话数据={}
	对话数据.模型=任务数据[标识].模型
	对话数据.名称=任务数据[标识].名称
	local 副本id = 任务处理类:取副本id(id,3043)
	if 副本id == 0 or 副本id ~= id  then
		对话数据.对话="只有创建副本的队长才能和我对话"
		return 对话数据
	end
	if 副本数据.天命大闹.进行[副本id].进程==1 then
		if 对话数据.名称=="天命锄树力士" then
			对话数据.对话 = "欢迎来到梦幻西游"
			对话数据.选项 = {"我来了","我准备一下"}
		elseif	对话数据.名称=="天命浇水力士" then
			对话数据.对话 = "欢迎来到梦幻西游"
			对话数据.选项 = {"我来了","我准备一下"}
		elseif	对话数据.名称=="天命修桃力士" then
			对话数据.对话 = "欢迎来到梦幻西游"
			对话数据.选项 = {"我来了","我准备一下"}
		else
			对话数据.对话 = "欢迎来到梦幻西游"
			对话数据.选项 = {"我就是路过"}
		end
	elseif 副本数据.天命大闹.进行[副本id].进程==2 then
		if 对话数据.名称=="九千年桃树" then
			对话数据.对话 = "欢迎来到梦幻西游"
			对话数据.选项 = {"挑战你","我准备一下"}
		end
	elseif 副本数据.天命大闹.进行[副本id].进程==3 then
			if 对话数据.名称=="天命七仙女" then
				对话数据.对话 = "欢迎来到梦幻西游"
				对话数据.选项 = {"挑战你","我准备一下"}
			end
	elseif 副本数据.天命大闹.进行[副本id].进程==4 then
			if 对话数据.名称=="天命惠岸行者" then
				对话数据.对话 = "欢迎来到梦幻西游"
				对话数据.选项 = {"挑战你","我准备一下"}
			end
	elseif 副本数据.天命大闹.进行[副本id].进程==5 then
			if 对话数据.名称=="天命二郎神" then
				对话数据.对话 = "欢迎来到梦幻西游"
				对话数据.选项 = {"挑战你","我准备一下"}
			end
	elseif 副本数据.天命大闹.进行[副本id].进程==6 then
			if 对话数据.名称=="天命天兵统帅" then
				对话数据.对话 = "欢迎来到梦幻西游"
				对话数据.选项 = {"挑战你","我准备一下"}
			end
	elseif 副本数据.天命大闹.进行[副本id].进程==7 then
			if 对话数据.名称=="天命天将统帅" then
				对话数据.对话 = "欢迎来到梦幻西游"
				对话数据.选项 = {"挑战你","我准备一下"}
			end
	elseif 副本数据.天命大闹.进行[副本id].进程==8 then
			if 对话数据.名称=="天命巨灵神" then
				对话数据.对话 = "欢迎来到梦幻西游"
				对话数据.选项 = {"挑战你","我准备一下"}
			end
	elseif 副本数据.天命大闹.进行[副本id].进程==9 then
			if 对话数据.名称=="天命上古雷神" then
				对话数据.对话 = "欢迎来到梦幻西游"
				对话数据.选项 = {"挑战你","我准备一下"}
			end
	end
	return 对话数据
end

function 副本_天命大闹:对话事件处理(id,名称,事件,类型)
	local 副本id = 任务处理类:取副本id(id,3043)
	if 类型 == 3044 and 名称=="天命锄树力士"  and  事件=="我来了" then
		if 副本数据.天命大闹.进行[副本id].进程==1 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,105040,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 3044 and 名称=="天命浇水力士" and  事件=="我来了" then
		if 副本数据.天命大闹.进行[副本id].进程==1 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,105040,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 3044 and 名称=="天命修桃力士" and  事件=="我来了" then
		if 副本数据.天命大闹.进行[副本id].进程==1 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,105040,玩家数据[id].地图单位.标识)
		end

	elseif 类型 == 3045 and 名称=="九千年桃树" and  事件=="挑战你" then
		if 副本数据.天命大闹.进行[副本id].进程==2 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,105041,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 3046 and 名称=="天命七仙女" and  事件=="挑战你" then
		if 副本数据.天命大闹.进行[副本id].进程==3 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,105042,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 3047 and 名称=="天命惠岸行者" and  事件=="挑战你" then
		if 副本数据.天命大闹.进行[副本id].进程==4 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,105043,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 3048 and 名称=="天命二郎神" and  事件=="挑战你" then
		if 副本数据.天命大闹.进行[副本id].进程==5 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,105044,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 3049 and 名称=="天命天兵统帅" and  事件=="挑战你" then
		if 副本数据.天命大闹.进行[副本id].进程==6 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,105045,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 3050 and 名称=="天命天将统帅" and  事件=="挑战你" then
		if 副本数据.天命大闹.进行[副本id].进程==7 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,105046,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 3051 and 名称=="天命巨灵神" and  事件=="挑战你" then
		if 副本数据.天命大闹.进行[副本id].进程==8 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,105047,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 3052 and 名称=="天命上古雷神" and  事件=="挑战你" then
		if 副本数据.天命大闹.进行[副本id].进程==9 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,105048,玩家数据[id].地图单位.标识)
		end
	end
end

function 副本_天命大闹:战斗胜利处理(id组,战斗类型,任务id)
	local id = id组[1]
	local 副本id = 任务处理类:取副本id(id,3043)
	if 副本id == 0 then return end
	if 战斗类型 == 105040 then
		副本数据.天命大闹.进行[副本id]={进程=2}
		任务数据[任务id].zhandou = nil
		刷新任务3043(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 105041 then
		副本数据.天命大闹.进行[副本id]={进程=3}
		任务数据[任务id].zhandou = nil
		刷新任务3043(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 105042 then
		副本数据.天命大闹.进行[副本id]={进程=4}
		任务数据[任务id].zhandou = nil
		刷新任务3043(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 105043 then
		副本数据.天命大闹.进行[副本id]={进程=5}
		任务数据[任务id].zhandou = nil
		刷新任务3043(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 105044 then
		副本数据.天命大闹.进行[副本id]={进程=6}
		任务数据[任务id].zhandou = nil
		刷新任务3043(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 105045 then
		副本数据.天命大闹.进行[副本id]={进程=7}
		任务数据[任务id].zhandou = nil
		刷新任务3043(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 105046 then
		副本数据.天命大闹.进行[副本id]={进程=8}
		任务数据[任务id].zhandou = nil
		刷新任务3043(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 105047 then
		副本数据.天命大闹.进行[副本id]={进程=9}
		任务数据[任务id].zhandou = nil
		刷新任务3043(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 105048 then
		副本数据.天命大闹.进行[副本id]={进程=10}
		任务数据[任务id].zhandou = nil
		刷新任务3043(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	end
end

function 副本_天命大闹:完成奖励(id组,战斗类型)
	if 战斗类型 == 105040 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(2650,4100)+200000
			local 银子=等级*取随机数(110,120)+80000
			local 储备=等级*取随机数(110,120)+500000
			玩家数据[cyid].角色:添加储备(储备,"天命大闹",1)
			玩家数据[cyid].角色:添加经验(经验,"天命大闹")
			玩家数据[cyid].角色:添加银子(银子,"天命大闹",1)
			玩家数据[cyid].角色:添加副本积分(20)
			if 取随机数()<=35 then
				local 奖励参数=取随机数(1,100)
				local 链接={提示=format("#S(天命大闹)#Y梦幻西游为高手玩家打造的副本，#G/%s#Y少侠在天命大闹中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
        				if 奖励参数<=10 then
					local 名称="星辉石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="易经丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=18 then
					local 名称="高级魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,3),nil,链接)
				elseif 奖励参数<=20 then
					local 名称="仙露小丸子"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="摇钱树苗"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="符石卷轴"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称="神兽涎"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)


				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)

				else
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end--百晓星君
	elseif 战斗类型 == 105041 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(2650,4100)+200000
			local 银子=等级*取随机数(110,120)+80000
			local 储备=等级*取随机数(110,120)+500000
			玩家数据[cyid].角色:添加储备(储备,"天命大闹",1)
			玩家数据[cyid].角色:添加经验(经验,"天命大闹")
			玩家数据[cyid].角色:添加银子(银子,"天命大闹",1)
			玩家数据[cyid].角色:添加副本积分(20)
			if 取随机数()<=35 then
				local 奖励参数=取随机数(1,100)
				local 链接={提示=format("#S(天命大闹)#Y梦幻西游为高手玩家打造的副本，#G/%s#Y少侠在天命大闹中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
       				if 奖励参数<=3 then
					local 名称="特效宝珠"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
       				elseif 奖励参数<=10 then
					local 名称="星辉石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="易经丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=20 then
					local 名称="仙露小丸子"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="摇钱树苗"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="符石卷轴"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称="神兽涎"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=60 then
					local 名称="符石卷轴"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				else
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end--兰虎
	elseif 战斗类型 == 105042 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(2650,4100)+200000
			local 银子=等级*取随机数(110,120)+80000
			local 储备=等级*取随机数(110,120)+500000
			玩家数据[cyid].角色:添加储备(储备,"天命大闹",1)
			玩家数据[cyid].角色:添加经验(经验,"天命大闹")
			玩家数据[cyid].角色:添加银子(银子,"天命大闹",1)
			玩家数据[cyid].角色:添加副本积分(20)
			if 取随机数()<=35 then
				local 奖励参数=取随机数(1,100)
				local 链接={提示=format("#S(天命大闹)#Y梦幻西游为高手玩家打造的副本，#G/%s#Y少侠在天命大闹中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
        				if 奖励参数<=3 then
					local 名称="特效宝珠"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
        				elseif 奖励参数<=10 then
					local 名称="星辉石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=18 then
					local 名称="高级魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,3),nil,链接)
				elseif 奖励参数<=15 then
					local 名称="易经丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=20 then
					local 名称="仙露小丸子"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="摇钱树苗"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="符石卷轴"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称="神兽涎"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=60 then
					local 名称="符石卷轴"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				elseif 奖励参数<=81 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end--郑镖头
	elseif 战斗类型 == 105043 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(2650,4100)+200000
			local 银子=等级*取随机数(110,120)+80000
			local 储备=等级*取随机数(110,120)+500000
			玩家数据[cyid].角色:添加储备(储备,"天命大闹",1)
			玩家数据[cyid].角色:添加经验(经验,"天命大闹")
			玩家数据[cyid].角色:添加银子(银子,"天命大闹",1)
			玩家数据[cyid].角色:添加副本积分(20)
			if 取随机数()<=35 then
				local 奖励参数=取随机数(1,100)
				local 链接={提示=format("#S(天命大闹)#Y梦幻西游为高手玩家打造的副本，#G/%s#Y少侠在天命大闹中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
        				if 奖励参数<=10 then
					local 名称="星辉石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="易经丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=20 then
					local 名称="仙露小丸子"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="摇钱树苗"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="符石卷轴"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称="神兽涎"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=60 then
					local 名称="符石卷轴"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				elseif 奖励参数<=81 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end--郑镖头
	elseif 战斗类型 == 105044 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(2650,4100)+200000
			local 银子=等级*取随机数(110,120)+80000
			local 储备=等级*取随机数(110,120)+500000
			玩家数据[cyid].角色:添加储备(储备,"天命大闹",1)
			玩家数据[cyid].角色:添加经验(经验,"天命大闹")
			玩家数据[cyid].角色:添加银子(银子,"天命大闹",1)
			玩家数据[cyid].角色:添加副本积分(20)
			if 取随机数()<=35 then
				local 奖励参数=取随机数(1,100)
				local 链接={提示=format("#S(天命大闹)#Y梦幻西游为高手玩家打造的副本，#G/%s#Y少侠在天命大闹中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
        				if 奖励参数<=10 then
					local 名称="星辉石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="易经丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=20 then
					local 名称="仙露小丸子"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="摇钱树苗"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="符石卷轴"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称="神兽涎"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=60 then
					local 名称="符石卷轴"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				elseif 奖励参数<=81 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end--郑镖头
	elseif 战斗类型 == 105045 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(2650,4100)+200000
			local 银子=等级*取随机数(110,120)+80000
			local 储备=等级*取随机数(110,120)+500000
			玩家数据[cyid].角色:添加储备(储备,"天命大闹",1)
			玩家数据[cyid].角色:添加经验(经验,"天命大闹")
			玩家数据[cyid].角色:添加银子(银子,"天命大闹",1)
			玩家数据[cyid].角色:添加副本积分(20)
			if 取随机数()<=35 then
				local 奖励参数=取随机数(1,100)
				local 链接={提示=format("#S(天命大闹)#Y梦幻西游为高手玩家打造的副本，#G/%s#Y少侠在天命大闹中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
        				if 奖励参数<=3 then
					local 名称="特效宝珠"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
        				elseif 奖励参数<=10 then
					local 名称="星辉石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=18 then
					local 名称="高级魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,3),nil,链接)
				elseif 奖励参数<=15 then
					local 名称="易经丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=20 then
					local 名称="仙露小丸子"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="摇钱树苗"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="符石卷轴"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称="神兽涎"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=60 then
					local 名称="符石卷轴"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				elseif 奖励参数<=81 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end--郑镖头
	elseif 战斗类型 == 105046 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(2650,4100)+200000
			local 银子=等级*取随机数(110,120)+80000
			local 储备=等级*取随机数(110,120)+500000
			玩家数据[cyid].角色:添加储备(储备,"天命大闹",1)
			玩家数据[cyid].角色:添加经验(经验,"天命大闹")
			玩家数据[cyid].角色:添加银子(银子,"天命大闹",1)
			玩家数据[cyid].角色:添加副本积分(20)
			if 取随机数()<=35 then
				local 奖励参数=取随机数(1,100)
				local 链接={提示=format("#S(天命大闹)#Y梦幻西游为高手玩家打造的副本，#G/%s#Y少侠在天命大闹中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
        				if 奖励参数<=10 then
					local 名称="星辉石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="易经丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=20 then
					local 名称="仙露小丸子"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="摇钱树苗"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="符石卷轴"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称="神兽涎"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=60 then
					local 名称="符石卷轴"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				elseif 奖励参数<=81 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end--郑镖头
	elseif 战斗类型 == 105047 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(2650,4100)+200000
			local 银子=等级*取随机数(110,120)+80000
			local 储备=等级*取随机数(110,120)+500000
			玩家数据[cyid].角色:添加储备(储备,"天命大闹",1)
			玩家数据[cyid].角色:添加经验(经验,"天命大闹")
			玩家数据[cyid].角色:添加银子(银子,"天命大闹",1)
			玩家数据[cyid].角色:添加副本积分(20)
			if 取随机数()<=35 then
				local 奖励参数=取随机数(1,100)
				local 链接={提示=format("#S(天命大闹)#Y梦幻西游为高手玩家打造的副本，#G/%s#Y少侠在天命大闹中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
        				if 奖励参数<=10 then
					local 名称="星辉石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="易经丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=18 then
					local 名称="高级魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,3),nil,链接)
				elseif 奖励参数<=20 then
					local 名称="仙露小丸子"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="摇钱树苗"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="符石卷轴"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称="神兽涎"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=60 then
					local 名称="符石卷轴"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				elseif 奖励参数<=81 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end--郑镖头
	elseif 战斗类型 == 105048 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(2650,4100)+200000
			local 银子=等级*取随机数(110,120)+80000
			local 储备=等级*取随机数(110,120)+500000
			玩家数据[cyid].角色:添加储备(储备,"天命大闹",1)
			玩家数据[cyid].角色:添加经验(经验,"天命大闹")
			玩家数据[cyid].角色:添加银子(银子,"天命大闹",1)
			玩家数据[cyid].角色:添加副本积分(200)
			添加活跃(cyid,10)
			更新玩家每日(cyid,"副本任务","天命大闹")

			if 取随机数()<=50 then
				local 奖励参数=取随机数(1,100)
				local 链接={提示=format("#S(天命大闹)#Y梦幻西游为高手玩家打造的副本，#G/%s#Y少侠在天命大闹中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
        				if 奖励参数<=5 then
					local 名称="特殊魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=8 then
					local 名称="特效宝珠"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
        				elseif 奖励参数<=10 then
					local 名称="星辉石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="易经丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=20 then
					local 名称="仙露小丸子"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="摇钱树苗"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="符石卷轴"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称="神兽涎"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=60 then
					local 名称="符石卷轴"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				elseif 奖励参数<=81 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end--郑镖头
	end
end

function 副本_天命大闹:任务说明(玩家id,任务id)
	local 说明 = {}
	local 副本id=任务数据[任务id].副本id
	if 副本数据.天命大闹.进行[副本id]==nil then
		说明={"天命大闹","#W您的副本已经完成"}
	else
		local 进程=副本数据.天命大闹.进行[副本id].进程
		       if 进程==1 then
			说明={"副本·天命大闹",format("#W战斗特性：#Y天命\n与".."#Y/三个大闹桃园力士".."#W战斗。剩余时间%s分钟。)（可在#Y副本官员#W处重新返回副本）\n【难度★★】",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==2 then
			说明={"副本·天命大闹",format("#W战斗特性：#Y天命\n与".."#Y/qqq|九千年桃树*8511*临时npc*96*45/九千年桃树".."#W战斗。剩余时间%s分钟。)（可在#Y副本官员#W处重新返回副本）\n【难度★★】",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==3 then
			说明={"副本·天命大闹",format("#W战斗特性：#Y天命\n与".."#Y/qqq|天命七仙女*8511*临时npc*121*90/天命七仙女".."#W战斗。剩余时间%s分钟。)（可在#Y副本官员#W处重新返回副本）\n【难度★★】",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==4 then
			说明={"副本·天命大闹",format("#W战斗特性：#Y天命\n与".."#Y/qqq|天命惠岸行者*8513*临时npc*27*20/天命惠岸行者".."#W战斗。剩余时间%s分钟。)（可在#Y副本官员#W处重新返回副本）\n【难度★★】",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==5 then
			说明={"副本·天命大闹",format("#W战斗特性：#Y天命\n与".."#Y/qqq|天命二郎神*8513*临时npc*87*17/天命二郎神".."#W战斗。剩余时间%s分钟。)（可在#Y副本官员#W处重新返回副本）\n【难度★★】",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==6 then
			说明={"副本·天命大闹",format("#W战斗特性：#Y天命\n与".."#Y/qqq|天命天兵统帅*8513*临时npc*130*64/天命天兵统帅".."#W战斗。剩余时间%s分钟。)（可在#Y副本官员#W处重新返回副本）\n【难度★★】",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==7 then
			说明={"副本·天命大闹",format("#W战斗特性：#Y天命\n与".."#Y/qqq|天命天将统帅*8513*临时npc*130*16/天命天将统帅".."#W战斗。剩余时间%s分钟。)（可在#Y副本官员#W处重新返回副本）\n【难度★★】",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==8 then
			说明={"副本·天命大闹",format("#W战斗特性：#Y天命\n与".."#Y/qqq|天命巨灵神*8514*临时npc*108*125/天命巨灵神".."#W战斗。剩余时间%s分钟。)（可在#Y副本官员#W处重新返回副本）\n【难度★★】",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==9 then
			说明={"副本·天命大闹",format("#W战斗特性：#Y天命\n与".."#Y/qqq|天命上古雷神*8514*临时npc*154*110/天命上古雷神".."#W战斗。剩余时间%s分钟。)（可在#Y副本官员#W处重新返回副本）\n【难度★★】",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		end
	end
	return 说明
end

return 副本_天命大闹
