-- @Author: baidwwy
-- @Date:   2025-04-08 18:32:41
-- @Last Modified by:   tangguo
-- @Last Modified time: 2026-04-22 22:21:40
local 礼包奖励类 = class()
function 礼包奖励类:初始化()end

function 礼包奖励类:新手使者奖励(id)
	-- 玩家数据[id].角色:添加储备(100000,"宠物仙子新手奖励",1)
	-- self:全套专用装备(id,10,"无级别限制",id)
	-- 玩家数据[id].角色.新手礼包 = nil
	-- 发送数据(玩家数据[id].连接id,1501,{名称="新手使者",模型="普陀_接引仙女",对话="欢迎您进入这个世界，这两件装备你拿去防身吧。#1"})
end
function 礼包奖励类:挖矿宝宝(id,名称,类型,等级)
	local jnz = {"必杀","高级精神集中","连击","反击","苍鸾怒击","再生","魔之心","法术波动","法术暴击","泰山压顶"}--给什么技能  你可以自己设置
	local zz={1400,1300,4000,2360,1300,1300,6000}--资质
	local cz=1.255--成长
	if 神话 then
		玩家数据[id].召唤兽:添加召唤兽2(名称, 名称, 类型, nil, 0 , nil , jnz,zz,cz,等级)
	else
		玩家数据[id].召唤兽:添加召唤兽1(名称, 名称, 类型, nil, 0 , nil , jnz,zz,cz,等级)
	end
	常规提示(id,"#Y/你获得了一只"..名称)
end
function 礼包奖励类:挖矿宝宝1(id,名称,类型,等级)
	local jnz = {"必杀","高级精神集中","连击","反击","苍鸾怒击","再生","魔之心","法术波动","法术暴击","泰山压顶"}
	local zz={1500,1500,4500,2760,1500,1500,8000}
	local cz=1.285
	if 神话 then
		玩家数据[id].召唤兽:添加召唤兽2(名称, 名称, 类型, nil, 0 , nil , jnz,zz,cz,等级)
	else
		玩家数据[id].召唤兽:添加召唤兽1(名称, 名称, 类型, nil, 0 , nil , jnz,zz,cz,等级)
	end
	常规提示(id,"#Y/你获得了一只"..名称)
end
function 礼包奖励类:设置拜师奖励(id)
	玩家数据[id].道具:给予道具(id,"超级合成旗",99,nil,"不存共享","专用")
	玩家数据[id].角色:添加经验(30000000,"拜师奖励")
	玩家数据[id].角色:添加银子(3000000,"拜师奖励",1)
	玩家数据[id].角色:添加储备(30000000,"拜师奖励",1)
	玩家数据[id].角色:增加剧情点(99)
	常规提示(id,"恭喜直接获得剧情技能点99点")
	发送数据(玩家数据[id].连接id,1501,{名称=玩家数据[id].最后对话.名称,模型=玩家数据[id].最后对话.模型,对话="既然你诚心要拜入本门派，那我就收你为徒。从即日起，我就是你的师傅了。你可要好好得尊师重道。这点礼物是为师的一点心意。"})
end

function 礼包奖励类:增加宠物(id,名称,类型,等级,额外技能数量,变异概率)
	local bbb = {"高级夜战","高级偷袭","高级吸血"}
	local 技能组 = {}
	if 类型=="攻" then
		for i=1,额外技能数量 do
			local xh = 取随机数(1,#bbb)
			技能组[#技能组+1] =  bbb[xh]
			table.remove(bbb,xh)
		end
		技能组[#技能组+1] =  "高级必杀"
		技能组[#技能组+1] =  "高级连击"
	else
		bbb = {"魔之心","敏捷","神佑复生","感知","法术暴击","法术波动"}
		local daf = {"地狱烈火","奔雷咒","泰山压顶","水漫金山"}
		for i=1,额外技能数量 do
			local xh = 取随机数(1,#bbb)
			技能组[#技能组+1] =  bbb[xh]
			table.remove(bbb,xh)
		end
		技能组[#技能组+1] =  "高级法术连击"
		技能组[#技能组+1] =  daf[取随机数(1,#daf)]
	end
	local 类型="宝宝"
	if 变异概率 then
		if 取随机数()<=变异概率 then
			类型="变异"
		end
	end
	玩家数据[id].召唤兽:添加召唤兽(名称, 名称, 类型, nil, 等级 , nil , 技能组)
	常规提示(id,"#Y/你获得了一只"..名称)
end
function 礼包奖励类:增加测试宠物2(id,名称,类型,等级,变异概率)
	local 技能组={"高级夜战","高级偷袭","高级吸血","高级必杀","高级连击"}
		local 类型="宝宝"
	if 变异概率 then
		if 取随机数()<=变异概率 then
			类型="变异"
		end
	end
	玩家数据[id].召唤兽:添加召唤兽(名称, 名称, 类型, nil, 等级 , nil , 技能组)
	常规提示(id,"#Y/你获得了一只"..名称)
end
function 礼包奖励类:增加测试宠物(id,名称,类型,等级)
	local 技能组={"高级连击","天降灵葫","月光","食指大动","流沙轻音","叱咤风云","神来气旺","千钧一怒"}
	玩家数据[id].召唤兽:添加召唤兽(名称, 名称, "宝宝", nil, 等级 , nil , 技能组)
	常规提示(id,"#Y/你获得了一只"..名称)
end

function 礼包奖励类:新手宝石(id,宝石等级,门派,专用)
	if 门派~="无门派" then
		if 门派=="天宫" or 门派=="龙宫" or 门派=="魔王寨" or 门派=="神木林"  then
			玩家数据[id].道具:给予道具(id,"太阳石",宝石等级,nil,"不存共享",专用)
			玩家数据[id].道具:给予道具(id,"舍利子",宝石等级,nil,"不存共享",专用)
			玩家数据[id].道具:给予道具(id,"舍利子",宝石等级,nil,"不存共享",专用)
			玩家数据[id].道具:给予道具(id,"黑宝石",宝石等级,nil,"不存共享",专用)
			玩家数据[id].道具:给予道具(id,"光芒石",宝石等级,nil,"不存共享",专用)
			玩家数据[id].道具:给予道具(id,"月亮石",宝石等级,nil,"不存共享",专用)
		elseif 门派=="凌波城" or 门派=="花果山" or 门派=="狮驼岭" or 门派=="大唐官府" then
			玩家数据[id].道具:给予道具(id,"红玛瑙",宝石等级,nil,"不存共享",专用)
			玩家数据[id].道具:给予道具(id,"红玛瑙",宝石等级,nil,"不存共享",专用)
			玩家数据[id].道具:给予道具(id,"舍利子",宝石等级,nil,"不存共享",专用)
			玩家数据[id].道具:给予道具(id,"黑宝石",宝石等级,nil,"不存共享",专用)
			玩家数据[id].道具:给予道具(id,"光芒石",宝石等级,nil,"不存共享",专用)
			玩家数据[id].道具:给予道具(id,"月亮石",宝石等级,nil,"不存共享",专用)
		else
			玩家数据[id].道具:给予道具(id,"太阳石",宝石等级,nil,"不存共享",专用)
			玩家数据[id].道具:给予道具(id,"黑宝石",宝石等级,nil,"不存共享",专用)
			玩家数据[id].道具:给予道具(id,"舍利子",宝石等级,nil,"不存共享",专用)
			玩家数据[id].道具:给予道具(id,"黑宝石",宝石等级,nil,"不存共享",专用)
			玩家数据[id].道具:给予道具(id,"光芒石",宝石等级,nil,"不存共享",专用)
			玩家数据[id].道具:给予道具(id,"月亮石",宝石等级,nil,"不存共享",专用)
		end
	else
		玩家数据[id].道具:给予道具(id,"太阳石",宝石等级,nil,"不存共享",专用)
		玩家数据[id].道具:给予道具(id,"红玛瑙",宝石等级,nil,"不存共享",专用)
		玩家数据[id].道具:给予道具(id,"舍利子",宝石等级,nil,"不存共享",专用)
		玩家数据[id].道具:给予道具(id,"黑宝石",宝石等级,nil,"不存共享",专用)
		玩家数据[id].道具:给予道具(id,"光芒石",宝石等级,nil,"不存共享",专用)
		玩家数据[id].道具:给予道具(id,"月亮石",宝石等级,nil,"不存共享",专用)
	end
end
function 礼包奖励类:领取新手礼包(id,等级)
	if 玩家数据[id].角色.成长礼包==nil then
		常规提示(id,"你已经领取过了")
		return
	elseif 玩家数据[id].角色.等级<等级 then
		常规提示(id,"当前等级不足"..等级.."级，继续努力吧")
		return
	end
	if 等级==20 then
		if 玩家数据[id].角色.成长礼包.礼包一 then
			常规提示(id,"你已经领取过了")
			return
		end
		if #玩家数据[id].召唤兽.数据 >= 玩家数据[id].角色.召唤兽携带上限 then
			常规提示(id, "#Y/召唤兽已满，需保留两个召唤兽格子")
			return
		end
		常规提示(id,"领取成功！")
		玩家数据[id].角色.成长礼包.礼包一=true
		玩家数据[id].道具:给予道具(id,"秘制红罗羹",5,nil,"不存共享")
		玩家数据[id].道具:给予道具(id,"秘制绿芦羹",5,nil,"不存共享")
		玩家数据[id].角色:添加储备(5000000,"新手礼包",1)
		玩家数据[id].道具:给予道具(id,"鬼谷子",nil,"天覆阵","不存共享")
		local 临时道具 = {可叠加=false,总类=11,xy={[2]={y=11,x=495},[5]={y=273,x=12},[3]={y=117,x=457},[7]={y=105,x=192},[1]={y=7,x=312},[4]={y=186,x=389},[6]={y=240,x=277},[8]={y=248,x=474},[9]={y=197,x=475},[10]={y=167,x=364},[11]={y=86,x=292},[12]={y=180,x=130},[13]={y=19,x=383}},地图=1001,子类=50,y=7,x=312,分类=2,次数=70,名称="红色合成旗"}
		玩家数据[id].道具:给予道具(id,nil,nil,nil,"不存共享","专用",临时道具,nil,nil,"新手礼包")
	elseif 等级==30 then
		if 玩家数据[id].角色.成长礼包.礼包二 then
			常规提示(id,"你已经领取过了")
			return
		end
		常规提示(id,"领取成功！")
		玩家数据[id].角色.成长礼包.礼包二=true
		玩家数据[id].角色:增加种族坐骑(id)
		-- self:新手宝石(id,1,玩家数据[id].角色.门派,1)
		玩家数据[id].角色:添加储备(1000000,"新手礼包",1)
		玩家数据[id].道具:给予道具(id,"九转金丹",2,nil,"不存共享",1)
		玩家数据[id].道具:给予道具(id,"修炼果",2,nil,"不存共享",1)
	elseif 等级==40 then
		if 玩家数据[id].角色.成长礼包.礼包三 then
			常规提示(id,"你已经领取过了")
			return
		end
		if #玩家数据[id].召唤兽.数据 >= 玩家数据[id].角色.召唤兽携带上限 then
			常规提示(id, "#Y/召唤兽已满，需保留两个召唤兽格子")
			return
		end
		常规提示(id,"领取成功！")
		玩家数据[id].角色.成长礼包.礼包三=true
		local zz={1320,1320,3800,2000,1200,1200,6000}
		local cz=1.2
		local 随机法术技能 = {"地狱烈火","泰山压顶","水漫金山","奔雷咒"}
			随机法 = 随机法术技能[取随机数(1,#随机法术技能)]
		local jnz ={"高级法术暴击","高级法术连击","高级魔之心","须弥真言","高级精神集中",随机法}
		玩家数据[id].召唤兽:添加召唤兽("进阶雷龙", "进阶雷龙", "新手", nil, 0 , nil , jnz,zz,cz,0)
		self:全套专用装备(id,120,"无级别限制",id)
		玩家数据[id].道具:给予道具(id,"九转金丹",4,nil,"不存共享",1)
		玩家数据[id].道具:给予道具(id,"修炼果",4,nil,"不存共享",1)
		玩家数据[id].道具:给予道具(id,"摄妖香",30,nil,"不存共享",1)

		-- self:新手宝石(id,2,玩家数据[id].角色.门派,1)
	elseif 等级==50 then
		if 玩家数据[id].角色.成长礼包.礼包四 then
			常规提示(id,"你已经领取过了")
			return
		end
		常规提示(id,"领取成功！")
		玩家数据[id].角色.成长礼包.礼包四=true
		-- self:新手宝石(id,3,玩家数据[id].角色.门派,1)
		玩家数据[id].道具:给予道具(id,"回梦丹",2,nil,"不存共享",1)
		玩家数据[id].道具:给予道具(id,"九转金丹",6,nil,"不存共享",1)
		玩家数据[id].道具:给予道具(id,"修炼果",6,nil,"不存共享",1)
		local 临时道具={可叠加=false,总类=11,xy={[1]={y=13,x=13},[2]={y=55,x=29},[3]={y=120,x=55},[4]={y=133,x=167},[5]={y=13,x=209}},地图=1092,子类=50,y=7,x=312,分类=2,次数=70,名称="黄色合成旗"}
		玩家数据[id].道具:给予道具(id,nil,nil,nil,"不存共享","专用",临时道具,nil,nil,"新手礼包")
	elseif 等级==60 then
		if 玩家数据[id].角色.成长礼包.礼包五 then
			常规提示(id,"你已经领取过了")
			return
		end

		常规提示(id,"领取成功！")
		玩家数据[id].角色.成长礼包.礼包五=true
		-- self:全套灵饰(id,60,"超级简易",id,nil,nil,1)
		-- 玩家数据[id].道具:给予道具(id,"灵饰图鉴",160,nil,"不存共享",1)
		-- 玩家数据[id].道具:给予道具(id,"灵饰图鉴",160,nil,"不存共享",1)
		-- 玩家数据[id].道具:给予道具(id,"灵饰图鉴",160,nil,"不存共享",1)
		-- 玩家数据[id].道具:给予道具(id,"灵饰图鉴",160,nil,"不存共享",1)
		玩家数据[id].道具:给予道具(id,"新春飞行符",999,nil,"不存共享",1)
		玩家数据[id].道具:给予道具(id,"九转金丹",5,nil,"不存共享",1)
		玩家数据[id].道具:给予道具(id,"月华露",20,nil,"不存共享")
		玩家数据[id].道具:给予道具(id,"三打礼包",1,nil,"不存共享")
		玩家数据[id].道具:给予道具(id,"自动回收卡",1,nil,"不存共享",1)

	end
	发送数据(玩家数据[id].连接id,3716,{内容=玩家数据[id].角色.成长礼包})
	if 玩家数据[id].角色.成长礼包.礼包一 and 玩家数据[id].角色.成长礼包.礼包二 and 玩家数据[id].角色.成长礼包.礼包三 and 玩家数据[id].角色.成长礼包.礼包四 and 玩家数据[id].角色.成长礼包.礼包五 then
		玩家数据[id].角色.成长礼包=nil
		玩家数据[id].道具:消耗背包道具(玩家数据[id].连接id,id,"良师册",1)
	end
end
-- function 礼包奖励类:领取新手礼包(id,等级)
-- 	if 玩家数据[id].角色.成长礼包==nil then
-- 		常规提示(id,"你已经领取过了")
-- 		return
-- 	elseif 玩家数据[id].角色.等级<等级 then
-- 		常规提示(id,"当前等级不足"..等级.."级，继续努力吧")
-- 		return
-- 	end
-- 	local 领取物品 = {}
-- 	for i = 1, #全局礼包数据.成长礼包 do
-- 		if 等级 == 全局礼包数据.成长礼包[i].领取条件 then
-- 			if 玩家数据[id].角色.成长礼包[全局礼包数据.成长礼包[i].礼包类型] then
-- 				常规提示(id,"你已经领取过了")
-- 				return
-- 			end
-- 			if #玩家数据[id].召唤兽.数据 >= 玩家数据[id].角色.召唤兽携带上限 then
-- 				常规提示(id, "#Y/召唤兽已满，需保留两个召唤兽格子")
-- 				return
-- 			end
-- 			for n = 1, 10 do
--  				if 全局礼包数据.成长礼包[i]["物品"..n] ~= nil then
--  					领取物品[#领取物品 + 1] = table.copy(全局礼包数据.成长礼包[i]["物品"..n])
--  				end
--  			end
-- 			self:领取定义礼包(id, 领取物品)
-- 			常规提示(id,"领取成功！")
-- 			玩家数据[id].角色.成长礼包[全局礼包数据.成长礼包[i].礼包类型]=true
-- 		end
-- 	end
-- 	发送数据(玩家数据[id].连接id,3716,{内容=玩家数据[id].角色.成长礼包})
-- 	if 玩家数据[id].角色.成长礼包.礼包一 and 玩家数据[id].角色.成长礼包.礼包二 and 玩家数据[id].角色.成长礼包.礼包三 and 玩家数据[id].角色.成长礼包.礼包四 and 玩家数据[id].角色.成长礼包.礼包五 then
-- 		玩家数据[id].角色.成长礼包=nil
-- 		玩家数据[id].道具:消耗背包道具(玩家数据[id].连接id,id,"良师册",1)
-- 	end
-- end


function 礼包奖励类:增加测试宠物1(id,名称,类型,等级)
	local jnz = {"必杀","高级精神集中","连击","反击","苍鸾怒击","再生","魔之心","法术波动","高级隐身","法术暴击","毒","泰山压顶"}
	local zz={1560,1428,4200,2160,1440,1620,6000}
	local cz=1.285
	if RpbARGB.序列==3 then
		jnz = {"法术连击","法术暴击","泰山压顶","魔之心","高级驱鬼"}
		zz={1300,1200,3000,2000,1100,1100,6000}
		cz=1
	end
	玩家数据[id].召唤兽:添加召唤兽1(名称, 名称, 类型, nil, 0 , nil , jnz,zz,cz,等级)
	常规提示(id,"#Y/你获得了一只"..名称)
end

function 礼包奖励类:剧情奖励30(id)
	玩家数据[id].角色:添加经验(10000,"35级奖励")
	玩家数据[id].角色:添加银子(30000,"35级奖励",1)
	玩家数据[id].角色:添加储备(500000,"35级奖励",1)
end

function 礼包奖励类:剧情奖励50(id)
	玩家数据[id].角色:添加经验(150000,"55级奖励")
	玩家数据[id].角色:添加银子(100000,"55级奖励",1)
	玩家数据[id].角色:添加储备(1000000,"55级奖励",1)
end

function 礼包奖励类:剧情奖励70(id)
	-- self:全套专用装备(id,80,"无级别限制",id)
	玩家数据[id].角色:添加经验(200000,"75级奖励")
	玩家数据[id].角色:添加银子(150000,"75级奖励",1)
	玩家数据[id].角色:添加储备(1000000,"75级奖励",1)
end

function 礼包奖励类:剧情奖励80(id)
	-- self:全套灵饰(id,60,"无级别限制",id)
	玩家数据[id].角色:添加经验(250000,"80级奖励")
	玩家数据[id].角色:添加银子(200000,"80级奖励",1)
	玩家数据[id].角色:添加储备(1000000,"80级奖励",1)
end

function 礼包奖励类:剧情奖励85(id)
	-- self:全套专用装备(id,90,"无级别限制",true)
	玩家数据[id].角色:添加经验(300000,"85级奖励")
	玩家数据[id].角色:添加银子(250000,"85级奖励",1)
	玩家数据[id].角色:添加储备(1000000,"85级奖励",1)
end

function 礼包奖励类:剧情奖励20(id)
	玩家数据[id].角色:添加经验(50000,"25级奖励")
	玩家数据[id].角色:添加银子(10000,"25级奖励",1)
	玩家数据[id].角色:添加储备(50000,"25级奖励",1)
	-- self:增加宠物(id,"龟丞相","法",10)
end

-- function 礼包奖励类:剧情奖励10(id)
-- 	玩家数据[id].角色:添加经验(30000,"5级奖励")
-- 	玩家数据[id].角色:添加银子(10000,"5级奖励",1)
-- 	玩家数据[id].角色:添加储备(50000,"5级奖励",1)
-- end

function 礼包奖励类:全套灵饰(id,等级,无级别,专用)
	for n=1,#随机灵饰 do
		local 名称=制造装备[随机灵饰[n]][等级]
		local 临时道具 = 玩家数据[id].道具:灵饰处理(id,名称,等级,3,随机灵饰[n])
		if 玩家数据[id].道具:给予道具(id,nil,nil,nil,"不存共享",nil,临时道具) then
			常规提示(id,"#Y/你得到了#R/"..名称)
		end
	end
end

function 礼包奖励类:全套专用装备(id,等级,无级别,专用,是否商城)
	if 等级>=100 then
		等级=等级/10
		等级=math.floor(等级)
	else
		等级=等级/10
		等级=math.floor(等级)
	end
	等级=math.floor(等级)
	local 模型=玩家数据[id].角色.模型
	local 武器序列=角色武器类型[模型][取随机数(1,#角色武器类型[模型])]
	local 武器名称=装备处理类.打造物品[武器序列][等级+1]
	if 等级>=9 and 等级<12 then
		武器名称=装备处理类.打造物品[武器序列][取随机数(10,12)]
	elseif 等级>=12 and 等级<15 then
		武器名称=装备处理类.打造物品[武器序列][取随机数(13,15)]
	end
	local 衣服类型=2
	if 玩家数据[id].角色.性别=="女" then
		衣服类型=1
	end
	local 衣服序列=21
	local 衣服名称= 装备处理类.打造物品[衣服序列][等级+1][衣服类型]
	local 头盔类型=1
	if 玩家数据[id].角色.性别=="女" then
		头盔类型=2
	end
	local 头盔序列=19
	local 头盔名称= 装备处理类.打造物品[头盔序列][等级+1][头盔类型]
	local 项链序列=20
	local 项链名称= 装备处理类.打造物品[项链序列][等级+1][取随机数(1,2)]
	if type(装备处理类.打造物品[项链序列][等级+1])=="table" then
		项链名称= 装备处理类.打造物品[项链序列][等级+1][取随机数(1,2)]
	else
		项链名称= 装备处理类.打造物品[项链序列][等级+1]
	end
	local 腰带序列=22
	local 腰带名称= 装备处理类.打造物品[腰带序列][等级+1][取随机数(1,2)]
	if type(装备处理类.打造物品[腰带序列][等级+1])=="table" then
		腰带名称= 装备处理类.打造物品[腰带序列][等级+1][取随机数(1,2)]
	else
		腰带名称= 装备处理类.打造物品[腰带序列][等级+1]
	end
	local 鞋子序列=23
	local 鞋子名称= 装备处理类.打造物品[鞋子序列][等级+1]
	local 临时道具 = 1
	local 产出类型 = "系统产出"
	if 是否商城 then 产出类型 = "商城产出" end
	if 正式 then
		装备处理类:生成打造装备(id,等级*10,武器序列,武器名称,产出类型,nil,true,nil,无级别)
		装备处理类:生成打造装备(id,等级*10,衣服序列,衣服名称,产出类型,nil,true,nil,无级别)
		装备处理类:生成打造装备(id,等级*10,头盔序列,头盔名称,产出类型,nil,true,nil,无级别)
		装备处理类:生成打造装备(id,等级*10,项链序列,项链名称,产出类型,nil,true,nil,无级别)
		装备处理类:生成打造装备(id,等级*10,腰带序列,腰带名称,产出类型,nil,true,nil,无级别)
		装备处理类:生成打造装备(id,等级*10,鞋子序列,鞋子名称,产出类型,nil,true,nil,无级别)
	else
		装备处理类:生成打造装备(id,等级*10,武器序列,武器名称,产出类型,nil,true,nil,无级别)
		装备处理类:生成打造装备(id,等级*10,衣服序列,衣服名称,产出类型,nil,true,nil,无级别)
		装备处理类:生成打造装备(id,等级*10,头盔序列,头盔名称,产出类型,nil,true,nil,无级别)
		装备处理类:生成打造装备(id,等级*10,项链序列,项链名称,产出类型,nil,true,nil,无级别)
		装备处理类:生成打造装备(id,等级*10,腰带序列,腰带名称,产出类型,nil,true,nil,无级别)
		装备处理类:生成打造装备(id,等级*10,鞋子序列,鞋子名称,产出类型,nil,true,nil,无级别)
	end
	常规提示(id,"#Y/你获得了"..(等级*10).."级全套装备")
end

function 礼包奖励类:单件随机装备(id,等级,无级别,专用,是否商城)
	if 等级>=100 then
		等级=等级/10
		等级=math.floor(等级)
	else
		等级=等级/10
		等级=math.floor(等级)
	end
	等级=math.floor(等级)
	local 临时等级=等级
	local 临时参数=取随机数(1,#书铁范围)
	if 取随机数()<=72 then
		临时参数=取随机数(19,#书铁范围)
	end
	local 临时序列=临时参数
	if 临时序列==25 then
		临时序列=23
	elseif 临时序列==24 then
		临时序列=22
	elseif 临时序列==23 or 临时序列==22 then
		临时序列=21
	elseif 临时序列==21 then
		临时序列=20
	elseif 临时序列==20 or 临时序列==19 then
		临时序列=19
	end
	local 临时类型=装备处理类.打造物品[临时序列][临时等级+1]
	if type(临时类型)=="table" then
		if 临时参数 ==23 then
		 临时类型=临时类型[2]
		elseif 临时参数 ==22 then
		 临时类型=临时类型[1]
		elseif 临时参数 ==20 then
		 临时类型=临时类型[2]
		elseif 临时参数 ==19 then
		 临时类型=临时类型[1]
		else
			临时类型=临时类型[取随机数(1,2)]
		end
	end
	装备处理类:生成打造装备(id,等级*10,临时序列,临时类型,"系统产出",nil,true,nil,无级别)
end

function 礼包奖励类:签到奖励处理(id, 数据)
	local 月份 =tonumber(os.date("%m", os.time()))
	--local 数据类型 = "修改签到数据"
	-- if 全局签到数据[id] == nil then
	--   	数据类型 = "写入签到数据"
	-- end
	if 全局签到数据[id] == nil or 全局签到数据[id][月份] == nil then
		系统处理类:获取签到数据(id)
		return
	end
	if 全局签到数据[id][月份][数据.奖励类型] then
		常规提示(id,"#Y/你已经领取过该奖励了")
		系统处理类:获取签到数据(id)
		return
	end
	local 奖励
	for i=1,#全局礼包数据.签到奖励 do
	    if 全局礼包数据.签到奖励[i].礼包类型==数据.奖励类型 then
	    	奖励 =  i
	    	break
	    end
	end
	if 奖励 then
		if 全局签到数据[id][月份].累计签到 < 全局礼包数据.签到奖励[奖励].领取条件 then
			常规提示(id,"#Y/请先完成签到！")
		else
			local 领取物品 = {}
			for n = 1, 10 do
 				if 全局礼包数据.签到奖励[奖励]["物品"..n] ~= nil then
 					领取物品[#领取物品 + 1] = table.copy(全局礼包数据.签到奖励[奖励]["物品"..n])
 				end
 			end
 			全局签到数据[id][月份][数据.奖励类型]=true
 			self:领取定义礼包(id, 领取物品)
 			local 队伍id = 玩家数据[id].队伍
 			if 队伍id and 队伍id~=0 and 队伍数据[队伍id] then
 				for n=1,#队伍数据[队伍id].成员数据 do
 					local cyid = 队伍数据[队伍id].成员数据[n]
 					if cyid ~= id and 玩家数据[cyid] ~= nil then
 						if 全局签到数据[cyid] == nil or 全局签到数据[cyid][月份] == nil then
 							系统处理类:获取签到数据(cyid)
 						end
 						if 全局签到数据[cyid] and 全局签到数据[cyid][月份] and not 全局签到数据[cyid][月份][数据.奖励类型]
 							and 全局签到数据[cyid][月份].累计签到 >= 全局礼包数据.签到奖励[奖励].领取条件 then
 							全局签到数据[cyid][月份][数据.奖励类型]=true
 							self:领取定义礼包(cyid, table.copy(领取物品))
 							常规提示(cyid,"#Y/队友领取了签到奖励，你也获得了一份！")
 							发送数据(玩家数据[cyid].连接id,116.2,全局签到数据[cyid][月份])
 						end
 					end
 				end
 			end
		end
	else
		常规提示(id,"#Y/奖励不存在！")
	end
	发送数据(玩家数据[id].连接id,116.2,全局签到数据[id][月份])
end

function 礼包奖励类:领取定义礼包(id,领取物品)
	local 不生成={"包子","四叶花"}
	local bs=false

	for i = 1, #领取物品 do
		if 领取物品[i].名称==不生成 then
			bs=true
		end
		if 领取物品[i].类型 and 领取物品[i].类型 == "召唤兽" then
			local 等级 = 领取物品[i].等级 or 0
			local 参战等级 = 领取物品[i].参战等级 or 0
			local zz = {领取物品[i].攻击资质,领取物品[i].防御资质,领取物品[i].体力资质,领取物品[i].法力资质,领取物品[i].速度资质,领取物品[i].躲闪资质,领取物品[i].寿命}
			玩家数据[id].召唤兽:添加召唤兽1(领取物品[i].模型,领取物品[i].名称,领取物品[i].种类,nil,等级,nil,领取物品[i].技能,zz,领取物品[i].成长,参战等级)
			常规提示(id,"#Y/你获得了一只"..领取物品[i].名称)
		elseif 领取物品[i].类型 and 领取物品[i].类型 == "法宝" then
			玩家数据[id].道具:给予法宝(id,领取物品[i].名称)
		elseif 领取物品[i].类型 and 领取物品[i].类型 == "灵宝" then
			玩家数据[id].道具:给予灵宝(id,领取物品[i].名称)
		elseif not bs and string.find(领取物品[i].名称, "装备礼包") then
			self:全套专用装备(id,领取物品[i].等级,"无级别限制",id)
		elseif string.find(领取物品[i].名称, "级宝石礼包") then
			self:新手宝石(id,领取物品[i].等级,玩家数据[id].角色.门派,"专用")
		elseif 领取物品[i].名称 == "储备" then
			玩家数据[id].角色:添加储备(领取物品[i].数量,"新手礼包",1)
		elseif 领取物品[i].名称 == "经验" or 领取物品[i].名称 == "测试经验" then
			玩家数据[id].角色:添加经验(领取物品[i].数量,"新手礼包")
		elseif 领取物品[i].名称 == "仙玉" then
			添加仙玉(id, 玩家数据[id].账号,领取物品[i].数量,"自定义礼包")
		elseif 领取物品[i].名称 == "金砖" then
			玩家数据[id].角色:添加银子(领取物品[i].数量, "自定义礼包", 1)
		elseif 领取物品[i].名称 == "点卡" then
			添加点卡(id,玩家数据[id].账号, 领取物品[i].数量, "自定义礼包")
		elseif 领取物品[i].名称 == "钟灵石" then
			玩家数据[id].道具:给予道具(id, 领取物品[i].名称, 取随机数(1,5), 领取物品[i].参数, 领取物品[i].附加, 领取物品[i].专用, nil, nil, nil, nil, nil, 领取物品[i].限时,"不存共享")
		elseif 领取物品[i].名称 == "随机神兽" then
			local 随机神兽 = 取随机神兽()
			名称 = 随机神兽
			local 事件 = "物理型（单点爆伤）"
			if 取随机数() >= 50 then 事件 = "法术型（秒伤）" end
			玩家数据[id].召唤兽:添加神兽(随机神兽,事件,true)
		elseif 领取物品[i].名称 == "盲盒随机神兽" then
			local 随机神兽 = 取盲盒随机神兽()
			名称 = 随机神兽
			local 事件 = "物理型（单点爆伤）"
			if 取随机数() >= 50 then 事件 = "法术型（秒伤）" end
			玩家数据[id].召唤兽:添加神兽(随机神兽,事件,true)
		elseif 领取物品[i].装备类型 then
			装备处理类:生成指定装备(id, 领取物品[i])
		elseif 领取物品[i].灵饰 and 领取物品[i].部位类型 then
			玩家数据[id].道具:给予道具(id, nil, 1, nil, "不存共享", nil, 领取物品[i])
		elseif 领取物品[i].名称 == "种族坐骑" then
			玩家数据[id].角色:增加种族坐骑(id)
		elseif string.find(领取物品[i].名称, "合成旗") then
			玩家数据[id].道具:给予道具(id,nil,nil,nil,"不存共享","专用",领取物品[i],nil,nil,"新手礼包")
		elseif 领取物品[i].名称 == "制造指南书" or 领取物品[i].名称 == "百炼精铁" or 领取物品[i].名称 == "灵饰指南书" or 领取物品[i].名称 == "元灵晶石" then
			-- local 随机等级 = {60,80,100,120}
			-- local 等级 = 领取物品[i].等级 or 随机等级[取随机数(1, #随机等级)]
			-- 玩家数据[id].道具:给予道具(id,领取物品[i].名称,等级,领取物品[i].参数,领取物品[i].附加,领取物品[i].专用, nil, nil, nil, nil, nil, 领取物品[i].限时,"不存共享")
		else
			if 领取物品[i].附带技能 then 领取物品[i].参数 = 领取物品[i].附带技能 end
			if 领取物品[i].特殊 then 领取物品[i].名称 = "特殊兽诀" end
			local 假道具 = 物品类()
			假道具:置对象(领取物品[i].名称)
			if 假道具.可叠加 then
				玩家数据[id].道具:给予道具(id, 领取物品[i].名称, 领取物品[i].数量, 领取物品[i].参数, 领取物品[i].附加, 领取物品[i].专用, nil, nil, nil, nil, nil, 领取物品[i].限时,"不存共享")
			else
				if 领取物品[i].数量 then
					for n = 1, 领取物品[i].数量 do
						玩家数据[id].道具:给予道具(id, 领取物品[i].名称, 1, 领取物品[i].参数, 领取物品[i].附加, 领取物品[i].专用, nil, nil, nil, nil, nil, 领取物品[i].限时,"不存共享")
					end
				else
					玩家数据[id].道具:给予道具(id, 领取物品[i].名称, nil, 领取物品[i].参数, 领取物品[i].附加, 领取物品[i].专用, nil, nil, nil, nil, nil, 领取物品[i].限时,"不存共享")
				end
			end
		end
	end
end

return 礼包奖励类