
local 简单_兽魂系统 = class()
function 简单_兽魂系统:初始化()
end

function 简单_兽魂系统:兽魂数据处理(id,序号,助战编号)
                if 玩家数据[id].摊位数据~=nil then
                常规提示(id,"#Y/摆摊呢，乱点什么？")
                return
            end
    if  玩家数据[id].角色.兽魂 == nil then
        玩家数据[id].角色.兽魂 ={一="无",二="无",三="无",四="无",五="无",组合="无",开启=false,等级=0}
    end
    if 玩家数据[id].角色.兽魂.等级<0 then 玩家数据[id].角色.兽魂.等级=0 end
    if 助战编号 and 玩家数据[id].角色.分角色[助战编号] and 玩家数据[id].角色.分角色[助战编号]~=0 then
        助战编号=玩家数据[id].角色.分角色[助战编号]
        if not 玩家数据[助战编号] then
            常规提示(id,"#P/请先让助战进入游戏")
            return
        end
    else
        助战编号=nil
    end
    if 序号==1 then
        self:兽魂显示信息(id,序号,助战编号)
    elseif 序号== 2 then
        self:开启兽魂系统(id,序号,助战编号)
    elseif 序号== 3 then
        self:兽魂升级处理(id,序号,助战编号)
    elseif 序号== 4 then
        self:兽魂重置处理(id,序号,助战编号)
    end
end




function 简单_兽魂系统:兽魂显示信息(id,序号,助战编号)
    local 主人id
    if 助战编号 then
        主人id = id
        id = 助战编号
    else
         主人id = id
    end
    if 玩家数据[id].角色.兽魂.五 ~= "无" then
        if 玩家数据[id].角色.兽魂.一 == "暴起" then
            if  玩家数据[id].角色.兽魂.二 == "相胜" then
                if  玩家数据[id].角色.兽魂.三 == "千手" then
                    if  玩家数据[id].角色.兽魂.四 == "暴戾" then
                        if  玩家数据[id].角色.兽魂.五 == "辉耀" then
                            玩家数据[id].角色.兽魂.组合 = "陆地王者"
                        else
                            玩家数据[id].角色.兽魂.组合 = "无"
                        end
                        else
                            玩家数据[id].角色.兽魂.组合 = "无"
                    end
                end
            end
        end
        if 玩家数据[id].角色.兽魂.一 == "雷伤" then
            if  玩家数据[id].角色.兽魂.二 == "祈胜" then
                if  玩家数据[id].角色.兽魂.三 == "残忍" then
                    if  玩家数据[id].角色.兽魂.四 == "御盾" then
                        if  玩家数据[id].角色.兽魂.五 == "沸血" then
                            玩家数据[id].角色.兽魂.组合 = "远古蛮妖"
                        else
                            玩家数据[id].角色.兽魂.组合 = "无"
                        end
                        else
                            玩家数据[id].角色.兽魂.组合 = "无"
                    end
                end
            end
        end
        if 玩家数据[id].角色.兽魂.一 == "灵涌" then
            if  玩家数据[id].角色.兽魂.二 == "祈胜" then
                if  玩家数据[id].角色.兽魂.三 == "激励" then
                    if  玩家数据[id].角色.兽魂.四 == "破体" then
                        if  玩家数据[id].角色.兽魂.五 == "破伤" then
                            玩家数据[id].角色.兽魂.组合 = "鲲鹏之躯"
                        else
                            玩家数据[id].角色.兽魂.组合 = "无"
                        end
                        else
                            玩家数据[id].角色.兽魂.组合 = "无"
                    end
                end
            end
        end
        if 玩家数据[id].角色.兽魂.一 == "祈胜" then
            if  玩家数据[id].角色.兽魂.二 == "暴起" then
                if  玩家数据[id].角色.兽魂.三 == "附体" then
                    if  玩家数据[id].角色.兽魂.四 == "傀儡" then
                        if  玩家数据[id].角色.兽魂.五 == "爆裂" then
                            玩家数据[id].角色.兽魂.组合 = "灵狐之附"
                        else
                            玩家数据[id].角色.兽魂.组合 = "无"
                        end
                        else
                            玩家数据[id].角色.兽魂.组合 = "无"
                    end
                end
            end
        end
        if 玩家数据[id].角色.兽魂.一 == "相胜" then
            if  玩家数据[id].角色.兽魂.二 == "雷伤" then
                if  玩家数据[id].角色.兽魂.三 == "疗愈" then
                    if  玩家数据[id].角色.兽魂.四 == "陷足" then
                        if  玩家数据[id].角色.兽魂.五 == "返照" then
                            玩家数据[id].角色.兽魂.组合 = "雷云之雀"
                        else
                            玩家数据[id].角色.兽魂.组合 = "无"
                        end
                        else
                            玩家数据[id].角色.兽魂.组合 = "无"
                    end
                end
            end
        end
                        else
                            玩家数据[id].角色.兽魂.组合 = "无"
    end


                   内容={}
                   内容.一号=玩家数据[id].角色.兽魂.一
                   内容.二号 = 玩家数据[id].角色.兽魂.二
                   内容.三号 =  玩家数据[id].角色.兽魂.三
                   内容.四号 =  玩家数据[id].角色.兽魂.四
                   内容.五号 =  玩家数据[id].角色.兽魂.五
                   内容.开启 = 玩家数据[id].角色.兽魂.开启
                   内容.等级 = 玩家数据[id].角色.兽魂.等级
                   内容.门派 = 玩家数据[id].角色.门派
                   内容.组合 = 玩家数据[id].角色.兽魂.组合
                   内容.模型 = 玩家数据[id].角色.模型
                   内容.名称 = 玩家数据[id].角色.名称
                   内容.人物等级 = 玩家数据[id].角色.等级

                   内容.参战宝宝 = "无"
                if 玩家数据[id].召唤兽.数据.参战~=0  then
                   内容.参战宝宝= 玩家数据[id].角色.参战宝宝
                end
                   发送数据(玩家数据[主人id].连接id,440007,内容)
        end



function 简单_兽魂系统:刷新兽魂信息(id,序号,助战编号)

                local 主人id
                if 助战编号 then
                    主人id = id
                    id = 助战编号
                else
                     主人id = id
                end
                   内容={}
                   内容.一号 = 玩家数据[id].角色.兽魂.一
                   内容.二号 = 玩家数据[id].角色.兽魂.二
                   内容.三号 =  玩家数据[id].角色.兽魂.三
                   内容.四号 =  玩家数据[id].角色.兽魂.四
                   内容.五号 =  玩家数据[id].角色.兽魂.五
                   内容.开启 = 玩家数据[id].角色.兽魂.开启
                   内容.等级 = 玩家数据[id].角色.兽魂.等级
                   内容.门派 = 玩家数据[id].角色.门派
                   内容.组合 = 玩家数据[id].角色.兽魂.组合
                   内容.模型 = 玩家数据[id].角色.模型
                   内容.名称 = 玩家数据[id].角色.名称
                   内容.人物等级 = 玩家数据[id].角色.等级
                   内容.参战宝宝 = "无"
                if 玩家数据[id].召唤兽.数据.参战~=0  then
                   内容.参战宝宝=玩家数据[id].角色.参战宝宝
                end
                   发送数据(玩家数据[主人id].连接id,440008,内容)
        end



function 简单_兽魂系统:开启兽魂系统(id,序号,助战编号)

        local 主人id
        if 助战编号 then
            主人id = id
            id = 助战编号
        else
             主人id = id
        end
        if   玩家数据[id].角色.bb修炼.法术控制力[1]+玩家数据[id].角色.bb修炼.攻击控制力[1]+玩家数据[id].角色.bb修炼.防御控制力[1]+玩家数据[id].角色.bb修炼.抗法控制力[1] < 59 then
            常规提示(主人id,"#P/开启兽魂系统，最少需要4修宠物修炼总等级>60级")
            return
        end
        if  玩家数据[主人id].角色.当前经验 < 500000000   then
            常规提示(主人id,"#P/开启兽魂系统，最少5E经验，你的经验不足")
            return
        end
        if  玩家数据[id].角色.兽魂.开启 == true then
            常规提示(主人id,"#P/你已开启过兽魂系统，无需再次开启")
            return
        end
      if  玩家数据[主人id].角色:扣除银子(300000000,0,0,"兽魂") then

        玩家数据[主人id].角色.当前经验 = 玩家数据[主人id].角色.当前经验-500000000
        玩家数据[id].角色.兽魂.开启 = true
            常规提示(主人id,"#P/兽魂开启成功")
    else
            常规提示(主人id,"#P/当前银子不足3E")

    end


end


function 简单_兽魂系统:兽魂升级处理(id,序号,助战编号)

        local 主人id
        if 助战编号 then
            主人id = id
            id = 助战编号
            玩家数据[主人id].助战兽魂=助战编号
        else
             主人id = id
        end
        if  玩家数据[id].角色.兽魂.开启 == false  then
            常规提示(主人id,"#P/未开启兽魂系统，无法进行升级")
            return
        end
        local 银子 =   1
        local 经验 =   1
        if 玩家数据[id].角色.兽魂.等级 <= 70 then
            银子 = 200000*玩家数据[id].角色.兽魂.等级
            经验 = 400000*玩家数据[id].角色.兽魂.等级
        elseif 玩家数据[id].角色.兽魂.等级 > 70 and  玩家数据[id].角色.兽魂.等级 <= 105  then
            银子 = 450000*玩家数据[id].角色.兽魂.等级
            经验 = 900000*玩家数据[id].角色.兽魂.等级
        elseif 玩家数据[id].角色.兽魂.等级 > 105 and  玩家数据[id].角色.兽魂.等级 <= 140  then
            银子 = 900000*玩家数据[id].角色.兽魂.等级
            经验 = 1800000*玩家数据[id].角色.兽魂.等级
        else
            银子 = 1800000*玩家数据[id].角色.兽魂.等级
            经验 = 5800000*玩家数据[id].角色.兽魂.等级
        end
        if 玩家数据[主人id].角色.当前经验 < 经验 then
            常规提示(主人id,"#P/你的经验不足以本次的升级")
            return
        end
        if 玩家数据[id].角色.兽魂.等级 >= 玩家数据[id].角色.等级 then
            常规提示(主人id,"#P/你的兽魂等级已经满级，无法在进行提升")
            return
        end
        if 玩家数据[id].角色.兽魂.等级 == 35 and 玩家数据[id].角色.兽魂.一 == "无" then
             local 对话1="当前可进行兽魂首个技能的领悟，领悟需上交"..兽魂提升物品.."共计"..兽魂物品消耗[1].."个，请问是否进行技能领悟？"
             local 选项1={"确定领悟兽魂技能","我再考虑考虑"}
            玩家数据[主人id].最后对话={}
            玩家数据[主人id].最后对话.名称="兽魂一技能"
            玩家数据[主人id].最后对话.模型=玩家数据[主人id].角色.模型
             发送数据(玩家数据[主人id].连接id,1501,{名称="兽魂一技能",模型=玩家数据[主人id].角色.模型,对话=对话1,选项=选项1})
             return
        end

        if 玩家数据[id].角色.兽魂.等级 == 70 and 玩家数据[id].角色.兽魂.二 == "无" then
             local 对话1="当前可进行兽魂第二个技能的领悟，领悟需上交"..兽魂提升物品.."共计"..兽魂物品消耗[2].."个，请问是否进行技能领悟？"
             local 选项1={"确定领悟兽魂技能","我再考虑考虑"}
            玩家数据[主人id].最后对话={}
            玩家数据[主人id].最后对话.名称="兽魂二技能"
            玩家数据[主人id].最后对话.模型=玩家数据[主人id].角色.模型
             发送数据(玩家数据[主人id].连接id,1501,{名称="兽魂二技能",模型=玩家数据[主人id].角色.模型,对话=对话1,选项=选项1})
             return
        end
        if 玩家数据[id].角色.兽魂.等级 == 105 and 玩家数据[id].角色.兽魂.三 == "无" then
                      local 对话1="当前可进行兽魂第三个技能的领悟，领悟需上交"..兽魂提升物品.."共计"..兽魂物品消耗[3].."个，请问是否进行技能领悟？"
             local 选项1={"确定领悟兽魂技能","我再考虑考虑"}
            玩家数据[主人id].最后对话={}
            玩家数据[主人id].最后对话.名称="兽魂三技能"
            玩家数据[主人id].最后对话.模型=玩家数据[主人id].角色.模型
             发送数据(玩家数据[主人id].连接id,1501,{名称="兽魂三技能",模型=玩家数据[主人id].角色.模型,对话=对话1,选项=选项1})
             return
        end
        if 玩家数据[id].角色.兽魂.等级 == 140 and 玩家数据[id].角色.兽魂.四 == "无" then
             local 对话1="当前可进行兽魂第四个技能的领悟，领悟需上交"..兽魂提升物品.."共计"..兽魂物品消耗[4].."个，请问是否进行技能领悟？"
             local 选项1={"确定领悟兽魂技能","我再考虑考虑"}
            玩家数据[主人id].最后对话={}
            玩家数据[主人id].最后对话.名称="兽魂四技能"
            玩家数据[主人id].最后对话.模型=玩家数据[主人id].角色.模型
             发送数据(玩家数据[主人id].连接id,1501,{名称="兽魂四技能",模型=玩家数据[主人id].角色.模型,对话=对话1,选项=选项1})
             return
        end
        if 玩家数据[id].角色.兽魂.等级 == 174 and 玩家数据[id].角色.兽魂.五 == "无" then
                       local 对话1="当前可进行兽魂第五个技能的领悟，领悟需上交"..兽魂提升物品.."共计"..兽魂物品消耗[5].."个，请问是否进行技能领悟？"
             local 选项1={"确定领悟兽魂技能","我再考虑考虑"}
            玩家数据[主人id].最后对话={}
            玩家数据[主人id].最后对话.名称="兽魂五技能"
            玩家数据[主人id].最后对话.模型=玩家数据[主人id].角色.模型
             发送数据(玩家数据[主人id].连接id,1501,{名称="兽魂五技能",模型=玩家数据[主人id].角色.模型,对话=对话1,选项=选项1})
             return
        end

            if  玩家数据[主人id].角色:扣除银子(银子,0,0,"兽魂") then
            玩家数据[id].角色.兽魂.等级 = 玩家数据[id].角色.兽魂.等级+1
            玩家数据[主人id].角色.当前经验 = 玩家数据[主人id].角色.当前经验-经验

            常规提示(主人id,"#P/你失去了#R/"..经验.."#P/点经验")
            常规提示(主人id,"#P/你的兽魂等级获得了提升")
                 self:刷新兽魂信息(主人id,序号,助战编号)
                 玩家数据[主人id].角色:刷新信息()
                发送数据(玩家数据[主人id].连接id,31,玩家数据[主人id].角色:取总数据())
             end

        end




function 简单_兽魂系统:兽魂重置处理(id,序号,助战编号)
        local 主人id
        if 助战编号 then
            主人id = id
            id = 助战编号
            玩家数据[主人id].助战兽魂=助战编号
        else
             主人id = id
        end
    if 玩家数据[id].角色.兽魂.等级 >35 and 玩家数据[id].角色.兽魂.等级 < 70  then

            local 对话1="当前选择将#R/重置兽魂1技能#W/，重置后兽魂等级将降低35级，请问是否进行重置？"
             local 选项1={"确定重置技能","我再考虑考虑"}
            玩家数据[主人id].最后对话={}
            玩家数据[主人id].最后对话.名称="兽魂一技能"
            玩家数据[主人id].最后对话.模型=玩家数据[主人id].角色.模型
             发送数据(玩家数据[主人id].连接id,1501,{名称="兽魂一技能",模型=玩家数据[主人id].角色.模型,对话=对话1,选项=选项1})
             return

    elseif  玩家数据[id].角色.兽魂.等级 >=70 and 玩家数据[id].角色.兽魂.等级 < 105  then


            local 对话1="当前选择将#R/重置兽魂2技能#W/，重置后兽魂等级将降低35级，请问是否进行重置？"
             local 选项1={"确定重置技能","我再考虑考虑"}
            玩家数据[主人id].最后对话={}
            玩家数据[主人id].最后对话.名称="兽魂二技能"
            玩家数据[主人id].最后对话.模型=玩家数据[主人id].角色.模型
             发送数据(玩家数据[主人id].连接id,1501,{名称="兽魂二技能",模型=玩家数据[主人id].角色.模型,对话=对话1,选项=选项1})
             return
    elseif  玩家数据[id].角色.兽魂.等级 >=105 and 玩家数据[id].角色.兽魂.等级 < 140  then

            local 对话1="当前选择将#R/重置兽魂3技能#W/，重置后兽魂等级将降低35级，请问是否进行重置？"
             local 选项1={"确定重置技能","我再考虑考虑"}
            玩家数据[主人id].最后对话={}
            玩家数据[主人id].最后对话.名称="兽魂三技能"
            玩家数据[主人id].最后对话.模型=玩家数据[主人id].角色.模型
             发送数据(玩家数据[主人id].连接id,1501,{名称="兽魂三技能",模型=玩家数据[主人id].角色.模型,对话=对话1,选项=选项1})
             return
    elseif  玩家数据[id].角色.兽魂.等级 >=140 and 玩家数据[id].角色.兽魂.等级 < 174  then


            local 对话1="当前选择将#R/重置兽魂4技能#W/，重置后兽魂等级将降低35级，请问是否进行重置？"
             local 选项1={"确定重置技能","我再考虑考虑"}
            玩家数据[主人id].最后对话={}
            玩家数据[主人id].最后对话.名称="兽魂四技能"
            玩家数据[主人id].最后对话.模型=玩家数据[主人id].角色.模型
             发送数据(玩家数据[主人id].连接id,1501,{名称="兽魂四技能",模型=玩家数据[主人id].角色.模型,对话=对话1,选项=选项1})
             return
    elseif  玩家数据[id].角色.兽魂.等级 > 174  then

            local 对话1="当前选择将#R/重置兽魂5技能#W/，重置后兽魂等级将降低35级，请问是否进行重置？"
             local 选项1={"确定重置技能","我再考虑考虑"}
            玩家数据[主人id].最后对话={}
            玩家数据[主人id].最后对话.名称="兽魂五技能"
            玩家数据[主人id].最后对话.模型=玩家数据[主人id].角色.模型
             发送数据(玩家数据[主人id].连接id,1501,{名称="兽魂五技能",模型=玩家数据[主人id].角色.模型,对话=对话1,选项=选项1})
             return
    else

               常规提示(主人id,"#P/当前无法进行重置")
    end

end

return 简单_兽魂系统
