
local 简单_本命法宝 = class()

function 简单_本命法宝:初始化()
end


function 简单_本命法宝:本命法宝数据处理(id,序号,数据)
	序号=序号+0
    if  玩家数据[id].角色.本命法宝 == nil then
        玩家数据[id].角色.本命法宝 ={开启=false,指定=0,等级=0,精华=0,耐久=200,两仪洗炼=0,四象洗炼=0,镶嵌格子=0,镶嵌属性={},两仪={},四象={},额外格子={},名称=本命法宝[玩家数据[id].角色.门派][1]}
    end
      if   玩家数据[id].角色.门派~="无门派" and 玩家数据[id].角色.本命法宝.名称=="无" then
      玩家数据[id].角色.本命法宝.名称=本命法宝[玩家数据[id].角色.门派][1]
    elseif   玩家数据[id].角色.门派=="无门派" or 玩家数据[id].角色.本命法宝.名称=="无" then
        常规提示(id,"先加入门派吧1")
        return
    elseif not  本命法宝[玩家数据[id].角色.门派] then
        常规提示(id,"暂无此门派法宝")
        return
    elseif  玩家数据[id].角色.本命法宝.名称~= 本命法宝[玩家数据[id].角色.门派][1] then
      玩家数据[id].角色.本命法宝.名称=本命法宝[玩家数据[id].角色.门派][1]
    end
    self:检测助战本命法宝(id,数据)
    if 序号==1 then
        self:本命法宝显示信息(id,数据)
    elseif 序号== 2 then
        self:本命法宝开启处理(id,序号,数据)
    elseif 序号== 3 then
        self:本命法宝升级处理(id,序号,数据)
    elseif 序号== 4 then
        self:本命法宝修复处理(id,序号,数据)
    elseif 序号== 5 then
        self:本命法宝两仪属性转换(id,序号,数据)
    elseif 序号== 6 then
        self:本命法宝两仪数值转换(id,序号,数据)
    elseif 序号== 7 then
        self:本命法宝两仪阴阳转换(id,序号,数据)
    elseif 序号== 8 then
        self:本命法宝四象属性转换(id,序号,数据)
    elseif 序号== 9 then
        self:本命法宝四象数值转换(id,序号,数据)
    elseif 序号== 10 then
        if 数据 then
        self:本命法宝助战格子一镶嵌(id,序号,数据)
        else
        self:本命法宝格子一镶嵌(id,序号,数据)
         end
    elseif 序号== 11 then
        if 数据 then
        self:本命法宝助战格子二镶嵌(id,序号,数据)
        else
        self:本命法宝格子二镶嵌(id,序号,数据)
         end
    elseif 序号== 12 then
        if 数据 then
        self:本命法宝助战格子三镶嵌(id,序号,数据)
        else
        self:本命法宝格子三镶嵌(id,序号,数据)
      end
    elseif 序号>= 13 and  序号<= 26  then
        self:本命法宝指定属性(id,序号,数据)
    end
end

function 简单_本命法宝:检测助战本命法宝(id,主人id)
        if 玩家数据[id].角色.主人id and 主人id then
               if 玩家数据[id].角色.本命法宝.开启==false and 玩家数据[主人id].角色.本命法宝.开启 then
                  self:本命法宝开启处理(id,序号,主人id)
              elseif  玩家数据[主人id].角色.本命法宝.等级>9 and  玩家数据[id].角色.本命法宝.等级==9 then
                  self:本命法宝突破处理(id,序号,主人id)
              elseif  玩家数据[主人id].角色.本命法宝.等级>18 and  玩家数据[id].角色.本命法宝.等级==18 then
                  self:本命法宝突破处理(id,序号,主人id)
              elseif  玩家数据[主人id].角色.本命法宝.等级>27 and  玩家数据[id].角色.本命法宝.等级==27 then
                  self:本命法宝突破处理(id,序号,主人id)
               end
        end
end
function 简单_本命法宝:本命法宝指定属性(id,序号,数据)
          if  self:扣除法宝精华(id,数据,20) then
    local 临时数值=取随机数(1,50)
    local 随机几率=取随机数(1,68)
    if 随机几率<30 then
    临时数值=取随机数(1,50)
    elseif  随机几率<40 then
    临时数值=取随机数(1,55)
    elseif  随机几率<45 then
    临时数值=取随机数(1,60)
    elseif  随机几率<50 then
    临时数值=取随机数(1,65)
    elseif  随机几率<55 then
    临时数值=取随机数(1,70)
    elseif  随机几率<58 then
    临时数值=取随机数(1,75)
    elseif  随机几率<60 then
    临时数值=取随机数(1,80)
    elseif  随机几率<62 then
    临时数值=取随机数(1,85)
    elseif  随机几率<64 then
    临时数值=取随机数(1,90)
    elseif  随机几率<66 then
    临时数值=取随机数(1,95)
    elseif  随机几率<68 then
    临时数值=取随机数(1,100)
    end
    local 四象临时数值=取随机数(1,3)
    local 随机几率1=取随机数(1,100)
    if 随机几率1<20 then
        四象临时数值=取随机数(1,50)
    elseif  随机几率1<35 then
        四象临时数值=取随机数(1,55)
    elseif  随机几率1<40 then
        四象临时数值=取随机数(1,60)
    elseif  随机几率1<45 then
        四象临时数值=取随机数(1,65)
    elseif  随机几率1<60 then
        四象临时数值=取随机数(1,70)
    elseif  随机几率1<80 then
        四象临时数值=取随机数(1,75)
    elseif  随机几率1<90 then
        四象临时数值=取随机数(1,80)
    elseif  随机几率1<93 then
        四象临时数值=取随机数(1,85)
    elseif  随机几率1<96 then
        四象临时数值=取随机数(1,90)
    elseif  随机几率1<98 then
        四象临时数值=取随机数(1,95)
    elseif  随机几率1<100 then
        四象临时数值=取随机数(1,100)
    end
 local 四象主属性 ={"法术伤害" ,"法术防御" ,"治疗能力" ,"气血回复效果" ,"固定伤害" ,"法术伤害结果" ,"格挡值" ,"狂暴等级" ,"穿刺等级" ,"抗物理暴击等级" ,"法术暴击等级" ,"封印命中等级" ,"物理暴击等级" ,"抗法术暴击等级" ,"抵抗封印等级"}
    四象临时属性=四象主属性[取随机数(1,#四象主属性)]
 local 主属性 ={"命中","气血","法防","灵力","魔法","速度","防御","伤害"}
 临时属性=主属性[取随机数(1,#主属性)]
     if 序号==13 then
     if  玩家数据[id].角色.本命法宝.等级<9 then  常规提示(id,"#P/未开启此条属性")return end
        local 阴阳="阴"if 取随机数(1, 100) < 50 then 阴阳="阳" end
          玩家数据[id].角色.本命法宝.两仪[1].阴阳=阴阳
         玩家数据[id].角色.本命法宝.两仪[1].属性=临时属性   常规提示(id,"#P/你的#R/首条#P/两仪属性更换成功，当前两仪：#R/增加"..临时属性.."#P/当前阴阳属性：#R/ "..阴阳.."属性")
         -- 玩家数据[id].角色.本命法宝.精华=玩家数据[id].角色.本命法宝.精华-50
     elseif  序号==14 then
     if  玩家数据[id].角色.本命法宝.等级<9 then  常规提示(id,"#P/未开启此条属性")return end
        玩家数据[id].角色.本命法宝.两仪[1].数值=临时数值   常规提示(id,"#P/你的#R/首条#P/两仪数值转换成功")
        -- 玩家数据[id].角色.本命法宝.精华=玩家数据[id].角色.本命法宝.精华-50
    elseif   序号==15 then
     if  玩家数据[id].角色.本命法宝.等级<18 then  常规提示(id,"#P/未开启此条属性")return end
        local 阴阳="阴"if 取随机数(1, 100) < 50 then 阴阳="阳" end
          玩家数据[id].角色.本命法宝.两仪[2].阴阳=阴阳
         玩家数据[id].角色.本命法宝.两仪[2].属性=临时属性   常规提示(id,"#P/你的#R/第二条#P/两仪属性更换成功，当前两仪：#R/增加"..临时属性.."#P/当前阴阳属性：#R/ "..阴阳.."属性")
         -- 玩家数据[id].角色.本命法宝.精华=玩家数据[id].角色.本命法宝.精华-50
    elseif   序号==16 then
     if  玩家数据[id].角色.本命法宝.等级<18 then  常规提示(id,"#P/未开启此条属性")return end
        玩家数据[id].角色.本命法宝.两仪[2].数值=临时数值   常规提示(id,"#P/你的#R/第二条#P/两仪数值转换成功")
        -- 玩家数据[id].角色.本命法宝.精华=玩家数据[id].角色.本命法宝.精华-50
    elseif   序号==17 then
     if  玩家数据[id].角色.本命法宝.等级<27 then  常规提示(id,"#P/未开启此条属性")return end
        local 阴阳="阴"if 取随机数(1, 100) < 50 then 阴阳="阳" end
          玩家数据[id].角色.本命法宝.两仪[3].阴阳=阴阳
         玩家数据[id].角色.本命法宝.两仪[3].属性=临时属性   常规提示(id,"#P/你的#R/第三条#P/两仪属性更换成功，当前两仪：#R/增加"..临时属性.."#P/当前阴阳属性：#R/ "..阴阳.."属性")
         -- 玩家数据[id].角色.本命法宝.精华=玩家数据[id].角色.本命法宝.精华-50
    elseif   序号==18 then
     if  玩家数据[id].角色.本命法宝.等级<27 then  常规提示(id,"#P/未开启此条属性")return end
        玩家数据[id].角色.本命法宝.两仪[3].数值=临时数值   常规提示(id,"#P/你的#R/第三条#P/两仪数值转换成功")
        -- 玩家数据[id].角色.本命法宝.精华=玩家数据[id].角色.本命法宝.精华-50
    elseif   序号==19 then
        玩家数据[id].角色.本命法宝.四象[1].属性=四象临时属性
        常规提示(id,"#P/你的#R/首条#P/四象属性更换成功，当前四象：增加"..四象临时属性)
        -- 玩家数据[id].角色.本命法宝.精华=玩家数据[id].角色.本命法宝.精华-50
    elseif   序号==20 then
        玩家数据[id].角色.本命法宝.四象[1].数值=四象临时数值
        常规提示(id,"#P/你的#R/首条#P/四象属性数值更换成功，当前四象：增加"..四象临时数值)
        -- 玩家数据[id].角色.本命法宝.精华=玩家数据[id].角色.本命法宝.精华-50
    elseif   序号==21 then
    if  玩家数据[id].角色.本命法宝.等级 <9 then     常规提示(id,"#P/未开启此条属性")return end
    if not 玩家数据[id].角色.本命法宝.四象[2] then     常规提示(id,"#P/未开启此条属性")return end
        玩家数据[id].角色.本命法宝.四象[2].属性=四象临时属性
        常规提示(id,"#P/你的#R/第二条#P/四象属性更换成功，当前四象：增加"..四象临时属性)
        -- 玩家数据[id].角色.本命法宝.精华=玩家数据[id].角色.本命法宝.精华-50
    elseif   序号==22 then
    if  玩家数据[id].角色.本命法宝.等级 <9 then     常规提示(id,"#P/未开启此条属性")return end
    if not 玩家数据[id].角色.本命法宝.四象[2] then     常规提示(id,"#P/未开启此条属性")return end
        玩家数据[id].角色.本命法宝.四象[2].数值=四象临时数值
        常规提示(id,"#P/你的#R/第二条#P/四象属性更换成功，当前四象：增加"..四象临时数值)
        -- 玩家数据[id].角色.本命法宝.精华=玩家数据[id].角色.本命法宝.精华-50
    elseif   序号==23 then
    if  玩家数据[id].角色.本命法宝.等级 <18 then     常规提示(id,"#P/未开启此条属性")return end
    if not 玩家数据[id].角色.本命法宝.四象[3] then     常规提示(id,"#P/未开启此条属性")return end
        玩家数据[id].角色.本命法宝.四象[3].属性=四象临时属性
        常规提示(id,"#P/你的#R/第三条#P/四象属性更换成功，当前四象：增加"..四象临时属性)
        -- 玩家数据[id].角色.本命法宝.精华=玩家数据[id].角色.本命法宝.精华-50
    elseif   序号==24 then
    if  玩家数据[id].角色.本命法宝.等级 <18 then     常规提示(id,"#P/未开启此条属性")return end
    if not 玩家数据[id].角色.本命法宝.四象[3] then     常规提示(id,"#P/未开启此条属性")return end
        玩家数据[id].角色.本命法宝.四象[3].数值=四象临时数值
        常规提示(id,"#P/你的#R/第三条#P/四象属性更换成功，当前四象：增加"..四象临时数值)
        -- 玩家数据[id].角色.本命法宝.精华=玩家数据[id].角色.本命法宝.精华-50
    elseif   序号==25 then
    if  玩家数据[id].角色.本命法宝.等级 <27 then     常规提示(id,"#P/未开启此条属性")return end
    if not 玩家数据[id].角色.本命法宝.四象[4] then     常规提示(id,"#P/未开启此条属性")return end
        玩家数据[id].角色.本命法宝.四象[4].属性=四象临时属性
        常规提示(id,"#P/你的#R/第四条#P/四象属性更换成功，当前四象：增加"..四象临时属性)
        -- 玩家数据[id].角色.本命法宝.精华=玩家数据[id].角色.本命法宝.精华-50
    elseif   序号==26 then
    if  玩家数据[id].角色.本命法宝.等级 <27 then     常规提示(id,"#P/未开启此条属性")return end
    if not 玩家数据[id].角色.本命法宝.四象[4] then     常规提示(id,"#P/未开启此条属性")return end
        玩家数据[id].角色.本命法宝.四象[4].数值=四象临时数值
        常规提示(id,"#P/你的#R/第四条#P/四象属性更换成功，当前四象：增加"..四象临时数值)
    end
end

    self:本命法宝显示信息(id,数据)
    玩家数据[id].角色:刷新信息()
end

function 简单_本命法宝:本命法宝显示信息(id,数据)
    if  玩家数据[id].角色.本命法宝 == nil then
        玩家数据[id].角色.本命法宝 ={开启=false,指定=0,等级=0,精华=0,耐久=200,两仪洗炼=0,四象洗炼=0,镶嵌格子=0,镶嵌属性={},两仪={},四象={},额外格子={},名称=本命法宝[玩家数据[id].角色.门派][1]}
    end
    if 玩家数据[id].角色.本命法宝.开启==false then
                常规提示(id,"#P/当前未开启本命法宝，请前往门派师傅处开启")
        return
    end
         if 数据 then
             发送数据(玩家数据[数据].连接id,430042,{本命数据=玩家数据[id].角色.本命法宝,助战id=id})
          else
             发送数据(玩家数据[id].连接id,430042,{本命数据=玩家数据[id].角色.本命法宝})
          end
end

function 简单_本命法宝:扣除法宝精华(id,数据,数量)
    数量=数量+0
      if 数据 then
         if 玩家数据[数据].角色.本命法宝.精华<数量 then
                    常规提示(数据,"#P/法宝精华数量不足")
            return false
         end
         玩家数据[数据].角色.本命法宝.精华=玩家数据[数据].角色.本命法宝.精华-数量
          常规提示(数据,"#P/当前已消耗#R"..数量.."点#P/法宝精华")
            return true
        else
         if 玩家数据[id].角色.本命法宝.精华<数量 then
                    常规提示(id,"#P/法宝精华数量不足")
            return false
         end
         玩家数据[id].角色.本命法宝.精华=玩家数据[id].角色.本命法宝.精华-数量
          常规提示(id,"#P/当前已消耗#R"..数量.."点#P/法宝精华")
            return true
      end

end
function 简单_本命法宝:本命法宝挑战检测(id,序号,数据)
    if 序号==1 then
        if 玩家数据[id].角色.本命法宝.开启==false then
           if 玩家数据[id].角色.等级<69 then
                    常规提示(id,"#P/等级未达到69级，无法进行突破")
            return
           end
           if 玩家数据[id].队伍==0 then
                    常规提示(id,"#P/请组队进行挑战")
           	return
           end
           战斗准备类:创建战斗(id,121028)
       end
   elseif  序号==2 then
        local 所需经验=  玩家数据[id].角色.本命法宝.等级*15
        if 玩家数据[id].角色.本命法宝.等级~=9 then
          常规提示(id,"#P/你的本命法宝未达到#R/一层9级#P/无法进行突破")
          return
        end
           if 玩家数据[id].队伍==0 then
                    常规提示(id,"#P/请组队进行挑战")
           	return
           end

          if  self:扣除法宝精华(id,数据,所需经验) then
           战斗准备类:创建战斗(id,121029)
         end
   elseif  序号==3 then
    local 所需经验=  玩家数据[id].角色.本命法宝.等级*15
        if 玩家数据[id].角色.本命法宝.等级~=18 then
          常规提示(id,"#P/你的本命法宝未达到#R/二层9级#P/无法进行突破")
          return
        end
           if 玩家数据[id].队伍==0 then
                    常规提示(id,"#P/请组队进行挑战")
           	return
           end

          if  self:扣除法宝精华(id,数据,所需经验) then
           战斗准备类:创建战斗(id,121030)
       end
   elseif  序号==4 then
    local 所需经验=  玩家数据[id].角色.本命法宝.等级*15
        if 玩家数据[id].角色.本命法宝.等级~=27 then
          常规提示(id,"#P/你的本命法宝未达到#R/三层9级#P/无法进行突破")
          return
        end
           if 玩家数据[id].队伍==0 then
                    常规提示(id,"#P/请组队进行挑战")
           	return
           end

          if  self:扣除法宝精华(id,数据,所需经验) then
           战斗准备类:创建战斗(id,121031)
         end
    end

end

function 简单_本命法宝:本命法宝完成检测(id,序号,数据)
    if 序号== 121028 then
        self:本命法宝开启处理(id,序号,数据)
    else
        self:本命法宝突破处理(id,序号,数据)
    end
end

function 简单_本命法宝:本命法宝助战格子一镶嵌(id,序号,数据)
    if  玩家数据[id].角色.本命法宝.开启 ==false then
        常规提示(id,"#P/未开启本命法宝，请前往门派师傅处进行开启")
        return
    end
    玩家数据[数据].助战本命=id
    if  玩家数据[id].角色.本命法宝.额外格子[1]==nil then
       local 对话1="当前未开启本镶嵌孔位，开启本孔位后可镶嵌门派秘籍，额外增加属性，但有几率失败，2000W银子开启一次，请问是否开启？"
        local 选项1={"确定开启助战本命法宝一孔","我再考虑考虑"}
            玩家数据[数据].最后对话={}
            玩家数据[数据].最后对话.名称="本命法宝开孔"
            玩家数据[数据].最后对话.模型=玩家数据[id].角色.模型
    发送数据(玩家数据[数据].连接id,1501,{名称="本命法宝开孔",模型=玩家数据[id].角色.模型,对话=对话1,选项=选项1})
        return
    elseif   玩家数据[id].角色.本命法宝.额外格子[1].属性~="无" then
       local 对话1="当前孔位已经镶嵌了门派秘籍，请问是否摧毁本位置的秘籍？（每次消耗1000W银子）"
        local 选项1={"确定摧毁助战本命法宝一孔","我再考虑考虑"}
    发送数据(玩家数据[数据].连接id,1501,{名称="本命法宝开孔",模型=玩家数据[id].角色.模型,对话=对话1,选项=选项1})
       return
    else
        玩家数据[数据].给予数据 = {类型 = 1, 事件 = "本命法宝助战一孔镶嵌"}
       发送数据(玩家数据[数据].连接id, 3530, {道具 = 玩家数据[数据].道具:索要道具1(数据), 名称 = "本命法宝镶嵌", 类型 = "NPC"})
    end
end
function 简单_本命法宝:本命法宝助战格子二镶嵌(id,序号,数据)
    if  玩家数据[id].角色.本命法宝.开启 ==false then
        常规提示(id,"#P/未开启本命法宝，请前往门派师傅处进行开启")
        return
    end
    玩家数据[数据].助战本命=id
    if  玩家数据[id].角色.本命法宝.额外格子[2]==nil then
       local 对话1="当前未开启本镶嵌孔位，开启本孔位后可镶嵌门派秘籍，额外增加属性，但有几率失败，2000W银子开启一次，请问是否开启？"
        local 选项1={"确定开启助战本命法宝二孔","我再考虑考虑"}
            玩家数据[数据].最后对话={}
            玩家数据[数据].最后对话.名称="本命法宝开孔"
            玩家数据[数据].最后对话.模型=玩家数据[id].角色.模型
    发送数据(玩家数据[数据].连接id,1501,{名称="本命法宝开孔",模型=玩家数据[id].角色.模型,对话=对话1,选项=选项1})
        return
    elseif   玩家数据[id].角色.本命法宝.额外格子[2].属性~="无" then
       local 对话1="当前孔位已经镶嵌了门派秘籍，请问是否摧毁本位置的秘籍？（每次消耗1000W银子）"
        local 选项1={"确定摧毁助战本命法宝二孔","我再考虑考虑"}
    发送数据(玩家数据[数据].连接id,1501,{名称="本命法宝开孔",模型=玩家数据[id].角色.模型,对话=对话1,选项=选项1})
       return
    else
        玩家数据[数据].给予数据 = {类型 = 1, 事件 = "本命法宝助战二孔镶嵌"}
       发送数据(玩家数据[数据].连接id, 3530, {道具 = 玩家数据[数据].道具:索要道具1(数据), 名称 = "本命法宝镶嵌", 类型 = "NPC"})
    end
end
function 简单_本命法宝:本命法宝助战格子三镶嵌(id,序号,数据)
    if  玩家数据[id].角色.本命法宝.开启 ==false then
        常规提示(id,"#P/未开启本命法宝，请前往门派师傅处进行开启")
        return
    end
    玩家数据[数据].助战本命=id
    if  玩家数据[id].角色.本命法宝.额外格子[3]==nil then
       local 对话1="当前未开启本镶嵌孔位，开启本孔位后可镶嵌门派秘籍，额外增加属性，但有几率失败，2000W银子开启一次，请问是否开启？"
        local 选项1={"确定开启助战本命法宝三孔","我再考虑考虑"}
            玩家数据[数据].最后对话={}
            玩家数据[数据].最后对话.名称="本命法宝开孔"
            玩家数据[数据].最后对话.模型=玩家数据[id].角色.模型
    发送数据(玩家数据[数据].连接id,1501,{名称="本命法宝开孔",模型=玩家数据[id].角色.模型,对话=对话1,选项=选项1})
        return
    elseif   玩家数据[id].角色.本命法宝.额外格子[3].属性~="无" then
       local 对话1="当前孔位已经镶嵌了门派秘籍，请问是否摧毁本位置的秘籍？（每次消耗1000W银子）"
        local 选项1={"确定摧毁助战本命法宝三孔","我再考虑考虑"}
    发送数据(玩家数据[数据].连接id,1501,{名称="本命法宝开孔",模型=玩家数据[id].角色.模型,对话=对话1,选项=选项1})
       return
    else
        玩家数据[数据].给予数据 = {类型 = 1, 事件 = "本命法宝助战三孔镶嵌"}
       发送数据(玩家数据[数据].连接id, 3530, {道具 = 玩家数据[数据].道具:索要道具1(数据), 名称 = "本命法宝镶嵌", 类型 = "NPC"})
    end
end
function 简单_本命法宝:本命法宝格子一镶嵌(id,序号,数据)

    if  玩家数据[id].角色.本命法宝.开启 ==false then
        常规提示(id,"#P/未开启本命法宝，请前往门派师傅处进行开启")
        return
    end
    if  玩家数据[id].角色.本命法宝.额外格子[1]==nil then
       local 对话1="当前未开启本镶嵌孔位，开启本孔位后可镶嵌门派秘籍，额外增加属性，但有几率失败，2000W银子开启一次，请问是否开启？"
        local 选项1={"确定开启本命法宝一孔","我再考虑考虑"}
            玩家数据[id].最后对话={}
            玩家数据[id].最后对话.名称="本命法宝开孔"
            玩家数据[id].最后对话.模型=玩家数据[id].角色.模型
  发送数据(玩家数据[id].连接id,1501,{名称="本命法宝开孔",模型=玩家数据[id].角色.模型,对话=对话1,选项=选项1})
        return
    elseif   玩家数据[id].角色.本命法宝.额外格子[1].属性~="无" then
       local 对话1="当前孔位已经镶嵌了门派秘籍，请问是否摧毁本位置的秘籍？（每次消耗1000W银子）"
        local 选项1={"确定摧毁本命法宝一孔","我再考虑考虑"}
  发送数据(玩家数据[id].连接id,1501,{名称="本命法宝开孔",模型=玩家数据[id].角色.模型,对话=对话1,选项=选项1})
       return
    else
        玩家数据[id].给予数据 = {类型 = 1, 事件 = "本命法宝一孔镶嵌"}
       发送数据(玩家数据[id].连接id, 3530, {道具 = 玩家数据[id].道具:索要道具1(id), 名称 = "本命法宝镶嵌", 类型 = "NPC"})
    end
end
function 简单_本命法宝:本命法宝格子二镶嵌(id,序号,数据)

    if  玩家数据[id].角色.本命法宝.开启 ==false then
        常规提示(id,"#P/未开启本命法宝，请前往门派师傅处进行开启")
        return
    end
    if  玩家数据[id].角色.本命法宝.额外格子[2]==nil then
       local 对话1="当前未开启本镶嵌孔位，开启本孔位后可镶嵌门派秘籍，额外增加属性，但有几率失败，2000W银子开启一次，请问是否开启？"
        local 选项1={"确定开启本命法宝二孔","我再考虑考虑"}
            玩家数据[id].最后对话={}
            玩家数据[id].最后对话.名称="本命法宝开孔"
            玩家数据[id].最后对话.模型=玩家数据[id].角色.模型
            发送数据(玩家数据[id].连接id,1501,{名称="本命法宝开孔",模型=玩家数据[id].角色.模型,对话=对话1,选项=选项1})
        return
    elseif   玩家数据[id].角色.本命法宝.额外格子[2].属性~="无" then
       local 对话1="当前孔位已经镶嵌了门派秘籍，请问是否摧毁本位置的秘籍？（每次消耗1000W银子）"
        local 选项1={"确定摧毁本命法宝二孔","我再考虑考虑"}
  发送数据(玩家数据[id].连接id,1501,{名称="本命法宝开孔",模型=玩家数据[id].角色.模型,对话=对话1,选项=选项1})
       return
    else
        玩家数据[id].给予数据 = {类型 = 1, 事件 = "本命法宝二孔镶嵌"}
       发送数据(玩家数据[id].连接id, 3530, {道具 = 玩家数据[id].道具:索要道具1(id), 名称 = "本命法宝镶嵌", 类型 = "NPC"})
    end
end
function 简单_本命法宝:本命法宝格子三镶嵌(id,序号,数据)

    if  玩家数据[id].角色.本命法宝.开启 ==false then
        常规提示(id,"#P/未开启本命法宝，请前往门派师傅处进行开启")
        return
    end
    if  玩家数据[id].角色.本命法宝.额外格子[3]==nil then
       local 对话1="当前未开启本镶嵌孔位，开启本孔位后可镶嵌门派秘籍，额外增加属性，但有几率失败，2000W银子开启一次，请问是否开启？"
        local 选项1={"确定开启本命法宝三孔","我再考虑考虑"}
            玩家数据[id].最后对话={}
            玩家数据[id].最后对话.名称="本命法宝开孔"
            玩家数据[id].最后对话.模型=玩家数据[id].角色.模型
  发送数据(玩家数据[id].连接id,1501,{名称="本命法宝开孔",模型=玩家数据[id].角色.模型,对话=对话1,选项=选项1})
       return
    elseif   玩家数据[id].角色.本命法宝.额外格子[3].属性~="无" then
       local 对话1="当前孔位已经镶嵌了门派秘籍，请问是否摧毁本位置的秘籍？（每次消耗1E银子）"
        local 选项1={"确定摧毁本命法宝三孔","我再考虑考虑"}
  发送数据(玩家数据[id].连接id,1501,{名称="本命法宝开孔",模型=玩家数据[id].角色.模型,对话=对话1,选项=选项1})
       return
    else
        玩家数据[id].给予数据 = {类型 = 1, 事件 = "本命法宝三孔镶嵌"}
       发送数据(玩家数据[id].连接id, 3530, {道具 = 玩家数据[id].道具:索要道具1(id), 名称 = "本命法宝镶嵌", 类型 = "NPC"})
   -- 发送数据(玩家数据[id].连接id,3011,{名称="袁天罡" ,id=9832,道具=ItemControl:索要道具2(id,"包裹")})
    end
end



function 简单_本命法宝:本命法宝开启处理(id,序号,数据)
        if  玩家数据[id].角色.本命法宝 == nil then
        玩家数据[id].角色.本命法宝 ={开启=false,等级=0,精华=0,耐久=200,两仪洗炼=0,四象洗炼=0,镶嵌格子=0,镶嵌属性={},两仪={},四象={},额外格子={},名称=本命法宝[玩家数据[id].角色.门派][1]}
    end
     玩家数据[id].角色.本命法宝.开启=true
     玩家数据[id].角色.本命法宝.等级=1
     local 副属性 ={"法术伤害" ,"法术防御" ,"治疗能力" ,"气血回复效果" ,"固定伤害" ,"法术伤害结果" ,"格挡值" ,"狂暴等级" ,"穿刺等级" ,"抗物理暴击等级" ,"法术暴击等级" ,"封印命中等级" ,"物理暴击等级" ,"抗法术暴击等级" ,"抵抗封印等级"}

     临时属性=副属性[取随机数(1,#副属性)]
     玩家数据[id].角色.本命法宝.四象[1]={属性=临时属性,数值=取随机数(1,10)}
     玩家数据[id].角色:刷新信息()
     常规提示(id,"#P/本命法宝开启成功，请打开-背包-法宝进行查看")
end


function 简单_本命法宝:本命法宝突破处理(id,序号,数据)
    玩家数据[id].角色.本命法宝.等级= 玩家数据[id].角色.本命法宝.等级+1
    if 玩家数据[id].角色.本命法宝.等级==10 then
        local 阴阳="阴"
        if 取随机数(1, 100) < 50 then
            阴阳="阳"
        end
     local 副属性 ={"法术伤害" ,"法术防御" ,"治疗能力" ,"气血回复效果" ,"固定伤害" ,"法术伤害结果" ,"格挡值" ,"狂暴等级" ,"穿刺等级" ,"抗物理暴击等级" ,"法术暴击等级" ,"封印命中等级" ,"物理暴击等级" ,"抗法术暴击等级" ,"抵抗封印等级"}
     临时属性=副属性[取随机数(1,#副属性)]
     玩家数据[id].角色.本命法宝.四象[2]={属性=临时属性,数值=取随机数(1,10)}
     local 主属性 ={"命中","气血","法防","灵力","魔法","速度","防御","伤害"}
       临时属性=主属性[取随机数(1,#主属性)]
     玩家数据[id].角色.本命法宝.两仪[1]={属性=临时属性,数值=取随机数(1,5),阴阳=阴阳}
    elseif 玩家数据[id].角色.本命法宝.等级==19 then
      local 阴阳="阴"
        if 取随机数(1, 100) < 50 then
            阴阳="阳"
        end
     local 副属性 ={"法术伤害" ,"法术防御" ,"治疗能力" ,"气血回复效果" ,"固定伤害" ,"法术伤害结果" ,"格挡值" ,"狂暴等级" ,"穿刺等级" ,"抗物理暴击等级" ,"法术暴击等级" ,"封印命中等级" ,"物理暴击等级" ,"抗法术暴击等级" ,"抵抗封印等级"}
     临时属性=副属性[取随机数(1,#副属性)]
     玩家数据[id].角色.本命法宝.四象[3]={属性=临时属性,数值=取随机数(1,10)}
     local 主属性 ={"命中","气血","法防","灵力","魔法","速度","防御","伤害"}
       临时属性=主属性[取随机数(1,#主属性)]
     玩家数据[id].角色.本命法宝.两仪[2]={属性=临时属性,数值=取随机数(1,5),阴阳=阴阳}
     elseif 玩家数据[id].角色.本命法宝.等级==28 then
      local 阴阳="阴"
        if 取随机数(1, 100) < 50 then
            阴阳="阳"
        end
     local 副属性 ={"法术伤害" ,"法术防御" ,"治疗能力" ,"气血回复效果" ,"固定伤害" ,"法术伤害结果" ,"格挡值" ,"狂暴等级" ,"穿刺等级" ,"抗物理暴击等级" ,"法术暴击等级" ,"封印命中等级" ,"物理暴击等级" ,"抗法术暴击等级" ,"抵抗封印等级"}
     临时属性=副属性[取随机数(1,#副属性)]
     玩家数据[id].角色.本命法宝.四象[4]={属性=临时属性,数值=取随机数(1,10)}
     local 主属性 ={"命中","气血","法防","灵力","魔法","速度","防御","伤害"}
       临时属性=主属性[取随机数(1,#主属性)]
     玩家数据[id].角色.本命法宝.两仪[3]={属性=临时属性,数值=取随机数(1,5),阴阳=阴阳}
    end
    玩家数据[id].角色:刷新信息()
end



function 简单_本命法宝:本命法宝升级处理(id,序号,数据)
    if  玩家数据[id].角色.本命法宝.开启 ==false then
        常规提示(id,"#P/未开启本命法宝，请前往门派师傅处进行开启")
        return
    end
    if  玩家数据[id].角色.本命法宝.等级==9 or 玩家数据[id].角色.本命法宝.等级==18 or 玩家数据[id].角色.本命法宝.等级==27 then
        常规提示(id,"#P/当前法宝已经到达此阶段满级，请先前往门派师傅突破后再进行升级")
        return
    end
     if  玩家数据[id].角色.本命法宝.等级>=36 then
          常规提示(id,"#P/当前法宝已经到达此阶段满级")
        return
     end
    local 所需经验=  玩家数据[id].角色.本命法宝.等级*15
     if 玩家数据[id].角色.本命法宝.等级 >= 9 and 玩家数据[id].角色.本命法宝.等级<18 then
        所需经验=所需经验*2
        elseif  玩家数据[id].角色.本命法宝.等级 >= 18 and 玩家数据[id].角色.本命法宝.等级<27 then
        所需经验=所需经验*3
    elseif  玩家数据[id].角色.本命法宝.等级 >= 27  then
        所需经验=所需经验*4
     end
        local 银子 =   玩家数据[id].角色.本命法宝.等级*10000000
        local 经验 =   玩家数据[id].角色.本命法宝.等级*30000000
        if 数据 then
            if 玩家数据[id].角色.当前经验 < 经验 then
                常规提示(数据,"#P/你的经验不足以进行升级,升级需花费"..(经验/100000000).."亿经验")
                return
            end
            if 玩家数据[数据].角色.银子 < 银子 then
                常规提示(数据,"#P/你的银子不足以进行升级,升级需花费"..银子.."银子")
                return
            end
        else
            if 玩家数据[id].角色.当前经验 < 经验 then
                常规提示(id,"#P/你的经验不足以进行升级,升级需花费"..(经验/100000000).."亿经验")
                return
            end
            if 玩家数据[id].角色.银子 < 银子 then
                常规提示(id,"#P/你的银子不足以进行升级,升级需花费"..银子.."银子")
                return
            end
        end

          if  self:扣除法宝精华(id,数据,所需经验) then
        -- if 玩家数据[id].角色:扣除银子(银子,0,0,"本命法宝升级",1) then

            if 数据 then
            玩家数据[id].角色.当前经验 = 玩家数据[id].角色.当前经验-经验
            玩家数据[数据].角色.银子=玩家数据[数据].角色.银子-银子
            else
            玩家数据[id].角色.当前经验 = 玩家数据[id].角色.当前经验-经验
            玩家数据[id].角色.银子=玩家数据[id].角色.银子-银子
            end
            玩家数据[id].角色.本命法宝.等级=玩家数据[id].角色.本命法宝.等级+1
            常规提示(id,"#P/当前法宝升级成功")
            self:本命法宝显示信息(id,数据)
            玩家数据[id].角色:刷新信息()
        end
end
function 简单_本命法宝:本命法宝修复处理(id,序号,数据)
    local 所需经验=  10
          if  self:扣除法宝精华(id,数据,所需经验) then
     玩家数据[id].角色.本命法宝.精华= 玩家数据[id].角色.本命法宝.精华-所需经验
    玩家数据[id].角色.本命法宝.耐久=玩家数据[id].角色.本命法宝.耐久+50
    常规提示(id,"#P/当前消耗10点系统经验，增加法宝#R/50点#P/耐久度，当前法宝耐久度#R/："..玩家数据[id].角色.本命法宝.耐久)
        end
    self:本命法宝显示信息(id,数据)
    玩家数据[id].角色:刷新信息()
end


function 简单_本命法宝:本命法宝四象属性转换(id,序号,数据)
    if  玩家数据[id].角色.本命法宝.开启 ==false then
        常规提示(id,"#P/未开启本命法宝，请前往门派师傅处进行开启")
        return
    end
    local 主属性 ={"法术伤害" ,"法术防御" ,"治疗能力" ,"气血回复效果" ,"固定伤害" ,"法术伤害结果" ,"格挡值" ,"狂暴等级" ,"穿刺等级" ,"抗物理暴击等级" ,"法术暴击等级" ,"封印命中等级" ,"物理暴击等级" ,"抗法术暴击等级" ,"抵抗封印等级"}
    临时属性=主属性[取随机数(1,#主属性)]
    if 玩家数据[id].角色.本命法宝.等级<=9 then

          if  self:扣除法宝精华(id,数据,50) then
        玩家数据[id].角色.本命法宝.四象[1].属性=临时属性
        常规提示(id,"#P/你的#R/首条#P/四象属性更换成功，当前四象：增加"..临时属性)
            end
    elseif  玩家数据[id].角色.本命法宝.等级>9 and 玩家数据[id].角色.本命法宝.等级<=18 then

          if  self:扣除法宝精华(id,数据,50) then
        玩家数据[id].角色.本命法宝.四象[2].属性=临时属性
        常规提示(id,"#P/你的#R/第二条#P/四象属性更换成功，当前四象：增加"..临时属性)
        end
    elseif   玩家数据[id].角色.本命法宝.等级>18 and 玩家数据[id].角色.本命法宝.等级<=27 then

          if  self:扣除法宝精华(id,数据,50) then
        玩家数据[id].角色.本命法宝.四象[3].属性=临时属性
        常规提示(id,"#P/你的#R/第二条#P/四象属性更换成功，当前四象：增加"..临时属性)
        end
    elseif   玩家数据[id].角色.本命法宝.等级>27 then
          if  self:扣除法宝精华(id,数据,50) then
        玩家数据[id].角色.本命法宝.四象[4].属性=临时属性
        常规提示(id,"#P/你的#R/第二条#P/四象属性更换成功，当前四象：增加"..临时属性)
        end
    end
    self:本命法宝显示信息(id,数据)
    玩家数据[id].角色:刷新信息()
end

function 简单_本命法宝:本命法宝四象数值转换(id,序号,数据)
    if  玩家数据[id].角色.本命法宝.开启 ==false then
        常规提示(id,"#P/未开启本命法宝，请前往门派师傅处进行开启")
        return
    end

          if  self:扣除法宝精华(id,数据,50) then
    local 主属性 ={"法术伤害" ,"法术防御" ,"治疗能力" ,"气血回复效果" ,"固定伤害" ,"法术伤害结果" ,"格挡值" ,"狂暴等级" ,"穿刺等级" ,"抗物理暴击等级" ,"法术暴击等级" ,"封印命中等级" ,"物理暴击等级" ,"抗法术暴击等级" ,"抵抗封印等级"}
    临时属性=取随机数(1,3)
    if 取随机数(1,100)<20 then
        临时属性=取随机数(1,50)
    elseif  取随机数(1,100)<35 then
        临时属性=取随机数(1,55)
    elseif  取随机数(1,100)<40 then
        临时属性=取随机数(1,60)
    elseif  取随机数(1,100)<45 then
        临时属性=取随机数(1,65)
    elseif  取随机数(1,100)<60 then
        临时属性=取随机数(1,70)
    elseif  取随机数(1,100)<80 then
        临时属性=取随机数(1,75)
    elseif  取随机数(1,100)<90 then
        临时属性=取随机数(1,80)
    elseif  取随机数(1,100)<93 then
        临时属性=取随机数(1,85)
    elseif  取随机数(1,100)<96 then
        临时属性=取随机数(1,90)
    elseif  取随机数(1,100)<98 then
        临时属性=取随机数(1,95)
    elseif  取随机数(1,100)<100 then
        临时属性=取随机数(1,100)
    end
    if 玩家数据[id].角色.本命法宝.等级<=9 then
        玩家数据[id].角色.本命法宝.四象[1].数值=临时属性
        常规提示(id,"#P/你的#R/首条#P/四象属性更换成功")
    elseif  玩家数据[id].角色.本命法宝.等级>9 and 玩家数据[id].角色.本命法宝.等级<=18 then
        玩家数据[id].角色.本命法宝.四象[2].数值=临时属性
        常规提示(id,"#P/你的#R/第二条#P/四象属性更换成功")
    elseif   玩家数据[id].角色.本命法宝.等级>18 and 玩家数据[id].角色.本命法宝.等级<=27 then
        玩家数据[id].角色.本命法宝.四象[3].数值=临时属性
        常规提示(id,"#P/你的#R/第三条#P/四象属性更换成功")
    elseif   玩家数据[id].角色.本命法宝.等级>27 then
        玩家数据[id].角色.本命法宝.四象[4].数值=临时属性
        常规提示(id,"#P/你的#R/第四条#P/四象属性更换成功")
    end
    self:本命法宝显示信息(id,数据)
end
end


function 简单_本命法宝:本命法宝两仪属性转换(id,序号,数据)
    if  玩家数据[id].角色.本命法宝.等级<9 then
        常规提示(id,"#P/当前法宝未开启两仪属性，请提升至2级本命法宝后再来转换")
        return
    end
    local 主属性 ={"命中","气血","法防","灵力","魔法","速度","防御","伤害"}
    临时属性=主属性[取随机数(1,#主属性)]
    if  玩家数据[id].角色.本命法宝.等级>9 and 玩家数据[id].角色.本命法宝.等级<=18 then

          if  self:扣除法宝精华(id,数据,50) then
        玩家数据[id].角色.本命法宝.两仪[1].属性=临时属性
        常规提示(id,"#P/你的#R/首条#P/两仪属性更换成功，当前两仪：增加"..临时属性)
    end
    elseif   玩家数据[id].角色.本命法宝.等级>18 and 玩家数据[id].角色.本命法宝.等级<=27 then

          if  self:扣除法宝精华(id,数据,50) then
        玩家数据[id].角色.本命法宝.两仪[2].属性=临时属性
        常规提示(id,"#P/你的#R/第二条#P/两仪属性更换成功，当前两仪：增加"..临时属性)
       end
    elseif   玩家数据[id].角色.本命法宝.等级>27 then

          if  self:扣除法宝精华(id,数据,50) then
        玩家数据[id].角色.本命法宝.两仪[3].属性=临时属性
        常规提示(id,"#P/你的#R/第三条#P/两仪属性更换成功，当前两仪：增加"..临时属性)
    end
    end
    self:本命法宝显示信息(id,数据)
    玩家数据[id].角色:刷新信息()
end

function 简单_本命法宝:本命法宝两仪数值转换(id,序号,数据)
    if  玩家数据[id].角色.本命法宝.等级<9 then
        常规提示(id,"#P/当前法宝未开启两仪属性，请提升至2级本命法宝后再来转换")
        return
    end

          if  self:扣除法宝精华(id,数据,50) then
    临时属性=取随机数(1,50)
    local 随机几率=取随机数(1,68)
    if 随机几率<30 then
    临时属性=取随机数(1,50)
    elseif  随机几率<40 then
    临时属性=取随机数(1,55)
    elseif  随机几率<45 then
    临时属性=取随机数(1,60)
    elseif  随机几率<50 then
    临时属性=取随机数(1,65)
    elseif  随机几率<55 then
    临时属性=取随机数(1,70)
    elseif  随机几率<58 then
    临时属性=取随机数(1,75)
    elseif  随机几率<60 then
    临时属性=取随机数(1,80)
    elseif  随机几率<62 then
    临时属性=取随机数(1,85)
    elseif  随机几率<64 then
    临时属性=取随机数(1,90)
    elseif  随机几率<66 then
    临时属性=取随机数(1,95)
    elseif  随机几率<68 then
    临时属性=取随机数(1,100)
    end
    if  玩家数据[id].角色.本命法宝.等级>9 and 玩家数据[id].角色.本命法宝.等级<=18 then
        玩家数据[id].角色.本命法宝.两仪[1].数值=临时属性
        常规提示(id,"#P/你的#R/首条#P/两仪数值转换成功")
    elseif   玩家数据[id].角色.本命法宝.等级>18 and 玩家数据[id].角色.本命法宝.等级<=27 then
        玩家数据[id].角色.本命法宝.两仪[2].数值=临时属性
        常规提示(id,"#P/你的#R/第二条#P/两仪数值转换成功")
    elseif   玩家数据[id].角色.本命法宝.等级>27 then
        玩家数据[id].角色.本命法宝.两仪[3].数值=临时属性
        常规提示(id,"#P/你的#R/第三条#P/两仪数值转换成功")
    end
        self:本命法宝显示信息(id,数据)
        玩家数据[id].角色:刷新信息()
    end
end
function 简单_本命法宝:本命法宝两仪阴阳转换(id,序号,数据)
    if  玩家数据[id].角色.本命法宝.等级<9 then
        常规提示(id,"#P/当前法宝未开启两仪属性，请提升至2级本命法宝后再来转换")
        return
    end

          if  self:扣除法宝精华(id,数据,20) then
    local 阴阳="阴"
    if 取随机数(1, 100) < 50 then
        阴阳="阳"
    end
    if  玩家数据[id].角色.本命法宝.等级>9 and 玩家数据[id].角色.本命法宝.等级<=18 then
    玩家数据[id].角色.本命法宝.两仪[1].阴阳=阴阳
        常规提示(id,"#P/你的首条两仪属性更换成功，当前两仪："..阴阳.."属性")
    elseif  玩家数据[id].角色.本命法宝.等级>18 and  玩家数据[id].角色.本命法宝.等级<=27 then
        玩家数据[id].角色.本命法宝.两仪[2].阴阳=阴阳
        常规提示(id,"#P/你的#R/第二条#P/两仪属性更换成功，当前两仪："..阴阳.."属性")
    elseif  玩家数据[id].角色.本命法宝.等级>27  then
        玩家数据[id].角色.本命法宝.两仪[3].阴阳=阴阳
        常规提示(id,"#P/你的#R/第三条#P/两仪属性更换成功，当前两仪："..阴阳.."属性")
    end
self:本命法宝显示信息(id,数据)
玩家数据[id].角色:刷新信息()
    end


end


return 简单_本命法宝