-- @作者: baidwwy
-- @邮箱:  313738139@qq.com
-- @创建时间:   2021-01-31 22:08:19
-- @最后修改来自: baidwwy
-- @Last Modified time: 2026-05-24 18:04:11
local sj = 取随机数
local format = string.format
local insert = table.insert
local ceil = math.ceil
local floor = math.floor
local wps = 取物品数据
local typ = type
local random = 取随机数

__GWdh111[1099]=function(连接id,数字id,序列,标识,地图)
	local 对话数据={}
		对话数据.模型=任务数据[标识].模型
		对话数据.名称=任务数据[标识].名称
		if 任务数据[标识].zhandou==nil then
			if 玩家数据[数字id].角色:取任务(1099)==标识 then
				对话数据.对话="#G让我瞅瞅，这都是啥好东西啊，桀桀桀，嗯？你是谁？哎呀~你~干~嘛~啊"
				对话数据.选项={"可恶的小偷，把东西还给我","嘿嘿嘿，你好啊"}
			else
				对话数据.对话="我好像不认识你吧？？？"
			end
		else
			对话数据.对话="我正在战斗中，请勿打扰。"
		end
	return 对话数据
end

__GWdh222[1099]=function (连接id,数字id,序号,内容)
	local 事件=内容[1]
	local 名称=内容[3]
	if 事件=="可恶的小偷，把东西还给我"  then
		if 任务数据[玩家数据[数字id].地图单位.标识].zhandou~=nil then 常规提示(数字id,"#Y/对方正在战斗中") return  end
		if 玩家数据[数字id].队伍==nil then
			常规提示(数字id,"#Y/请先组队！")
			return
		end
		local 比较xy={x=qz(玩家数据[数字id].角色.地图数据.x/20),y=qz(玩家数据[数字id].角色.地图数据.y/20)}
		local 假人数据={x=任务数据[玩家数据[数字id].地图单位.标识].x,y=任务数据[玩家数据[数字id].地图单位.标识].y}
		if 玩家数据[数字id].角色.地图数据.编号~=任务数据[玩家数据[数字id].地图单位.标识].地图编号 or 取两点距离(比较xy,假人数据)>20 then
			-- 发送数据(数字id,7,"#Y/这个npc距离太远了")
			print("辰年任务:脚本距离="..取两点距离(比较xy,假人数据))
			return
		end
		local 符合=false
		for n=1,#任务数据[玩家数据[数字id].地图单位.标识].队伍组 do
			if 任务数据[玩家数据[数字id].地图单位.标识].队伍组[n]==数字id then
				符合=true
			end
		end
		if 符合 then
			战斗准备类:创建战斗(数字id+0,150055,玩家数据[数字id].地图单位.标识)
			任务数据[玩家数据[数字id].地图单位.标识].zhandou=true
			玩家数据[数字id].地图单位=nil
		else
			发送数据(玩家数据[数字id].连接id,1501,{内容="你是谁？我们认识吗#55",模型=任务数据[玩家数据[数字id].地图单位.标识].模型,名称=任务数据[玩家数据[数字id].地图单位.标识].名称})
		end
		return
	end
end

function 设置任务1099(id)
	local 队伍id=玩家数据[id].队伍
 	if 队伍id==0 or 玩家数据[id].队长==false  then
		 常规提示(id,"#Y/该任务必须组队完成且由队长领取")
		 return
	elseif 取队伍最低等级(队伍id,69) then
		 常规提示(id,"#Y/等级小于69级的玩家无法领取此任务")
		 return
	elseif 取队伍任务(队伍id,1099) then
		 常规提示(id,"#Y/队伍中已有队员领取过此任务了")
		 return
	elseif 取队伍人数(id)<3 then
		常规提示(id,"#Y/本任务至少需要三人组队完成")
		--return
	end
	local 任务id,ZU=取唯一任务(1099,id)
	local 地图范围={1501,1193,1506}
	local 地图=地图范围[取随机数(1,#地图范围)]
	local 随机参数=取随机数()
	local 模型="鼠先锋"
	local 名称 = "偷年糕的鼠辈"
	local xy=地图处理类.地图坐标[地图]:取随机点()
	任务数据[任务id]={
		领取人id=ZU,
		id=任务id,
		起始=os.time(),
		结束=3600,
		DWZ=ZU,
		销毁=true,
		玩家id=0,
		队伍组=ZU,
		名称=名称,
		模型=模型,
		x=xy.x,
		y=xy.y,
		进程=1,
		地图编号=地图,
		地图名称=取地图名称(地图),
		类型=1099
	}
	地图处理类:添加单位(任务id)
	for n=1,#队伍数据[队伍id].成员数据 do
		local 临时id=队伍数据[队伍id].成员数据[n]
		玩家数据[临时id].角色:添加任务(任务id)
		发送数据(玩家数据[临时id].连接id,1501,{名称="辰年上卿",模型="考官2",对话=format("可恶的#Y/%s#W/竟然偷走了百官预呈献的龙年贡品，现已跑到了#G/%s(%s,%s)#W/处，请少侠速速帮我追讨回来！。",任务数据[任务id].名称,任务数据[任务id].地图名称,任务数据[任务id].x,任务数据[任务id].y)})
	end
end
function 设置任务1100(id)
	local 队伍id=玩家数据[id].队伍
	if 队伍id==0 or 队伍数据[队伍id]==nil then
		常规提示(id,"#Y/该任务必须组队完成")
		return
	elseif 取队伍最低等级(队伍id,69) then
		常规提示(id,"#Y/等级小于25级的玩家无法领取此任务")
		return
	elseif 取队伍任务(队伍id,1100) then
		常规提示(id,"#Y/队伍中已有队员领取过此任务了")
		return
	elseif 取队伍人数(id)<3 then
		常规提示(id,"#Y/本任务至少需要三人组队完成")
	end
	local 任务id,ZU=取唯一任务(1100,id)
	任务数据[任务id]={
		领取人id=ZU,
		id=任务id,
		DWZ=ZU,
		销毁=true,
		起始=os.time(),
		结束=99999999,
		玩家id=id,
		队伍组=ZU,
		类型=1100
	}
	任务数据[任务id].人物="辰年上卿"
	任务数据[任务id].人物地图=1001
	for n=1,#队伍数据[队伍id].成员数据 do
		local 临时id=队伍数据[队伍id].成员数据[n]
		if 玩家数据[临时id] and 玩家数据[临时id].角色 then
			玩家数据[临时id].角色:添加任务(任务id)
		end
	end
	添加最后对话(id,format("请帮把贡品送回#Y%s#W的#R%s#W，事出紧急，切勿在路上耽搁。",取地图名称(任务数据[任务id].人物地图),任务数据[任务id].人物))
end


function 设置任务1200()
  三界书院 = {
    答案 = "",
    开关 = true,
    结束 = 25,
    起始 = os.time(),
    间隔 = 取随机数(30, 90) * 60,
    名单 = {}
  }
  local 题目序号 = 取随机数(1, #三界题库 - 1)
  三界书院.答案 = 三界题库[题目序号].答案
  广播消息({内容="#Y/大家好，又到了考验大家知识水平的时间了。10秒内在世界频道中回答正确的玩家可以获得丰厚奖励噢。问题如下：#W/" .. 三界题库[题目序号].问题 .. "？",频道="xt"})
end



function 完成辰年任务(任务id,id,地图)
	if 任务数据[任务id]==nil then
		return
	end
	for i=1,#任务数据[任务id].队伍组 do
		local cyid=任务数据[任务id].队伍组[i]
		if 玩家数据[cyid]==nil then
		elseif 玩家数据[cyid].角色.地图数据.编号~=地图 then
			发送数据(玩家数据[cyid].连接id,998,"请注意你的角色异常！已经对你进行下线处理")
			__S服务:断开连接(玩家数据[cyid].连接id)
		else
			local 等级=玩家数据[cyid].角色.等级
			local 等级1=math.floor(玩家数据[cyid].角色.等级/5)
			local 经验=qz(等级*等级*等级1*2)
			local 银子=qz(等级*等级*等级1*0.2)
			玩家数据[cyid].角色:添加银子(银子,"辰年任务",1)
			玩家数据[cyid].角色:添加经验(经验,"辰年任务",1)
			local 几率 = 取随机数(1,100)
			if 几率<=4 then
				local 数量= 1
				local 链接 = {提示=format("#S(辰年任务)#G/%s#Y顺利完成押送贡品任务，上官奖励了他%s个",玩家数据[cyid].角色.名称,数量),频道="hd",结尾="#"..取随机数(1,110).."#Y！"}
				玩家数据[cyid].道具:给予超链接道具(cyid,"特殊兽诀·碎片",数量,nil,链接,"成功")
			elseif 几率<=6 then
				local data = {"上古玉魄·阴","上古玉魄·阳"}
				local 数量= 1
				local 链接 = {提示=format("#S(辰年任务)#G/%s#Y顺利完成押送贡品任务，上官奖励了他%s个",玩家数据[cyid].角色.名称,数量),频道="hd",结尾="#"..取随机数(1,110).."#Y！"}
				玩家数据[cyid].道具:给予超链接道具(cyid,data[取随机数(1,2)],数量,nil,链接,"成功")
			elseif 几率<=10 then
				local 数量= math.floor(玩家数据[cyid].角色.等级/50)
				local 链接 = {提示=format("#S(辰年任务)#G/%s#Y顺利完成押送贡品任务，上官奖励了他%s个",玩家数据[cyid].角色.名称,数量),频道="hd",结尾="#"..取随机数(1,110).."#Y！"}
				玩家数据[cyid].道具:给予超链接道具(cyid,"蕴灵晶体",数量,nil,链接,"成功")
			elseif 几率<=20 then
				local 数量= 取随机数(1,3)
				local 链接 = {提示=format("#S(辰年任务)#G/%s#Y顺利完成押送贡品任务，上官奖励了他%s个",玩家数据[cyid].角色.名称,数量),频道="hd",结尾="#"..取随机数(1,110).."#Y！"}
				玩家数据[cyid].道具:给予超链接道具(cyid,"称号材料礼包",数量,nil,链接,"成功")
			elseif 几率<=15 then
				local 数量= 1
				local 链接 = {提示=format("#S(辰年任务)#G/%s#Y顺利完成押送贡品任务，上官奖励了他%s个",玩家数据[cyid].角色.名称,数量),频道="hd",结尾="#"..取随机数(1,110).."#Y！"}
				玩家数据[cyid].道具:给予超链接道具(cyid,"神兜兜",数量,nil,链接,"成功")
			elseif 几率<=25 then
				local 随机属性={"固定伤害","法术伤害","伤害","封印命中等级","法术暴击等级","物理暴击等级","狂暴等级","穿刺等级","法术伤害结果","治疗能力","速度"}
				local 随机属性1=随机属性[取随机数(1,#随机属性)]
				local 随机防御属性={"气血回复效果","气血","防御","抗法术暴击等级","格挡值","法术防御","抗物理暴击等级"}
				local 随机防御属性1=随机防御属性[取随机数(1,#随机防御属性)]
				local 随机部位={"戒指","耳饰"}
				local 随机部位1=随机部位[取随机数(1,#随机部位)]
				local 随机防御部位={"佩饰","手镯"}
				local 随机防御部位1=随机防御部位[取随机数(1,#随机防御部位)]
				if 取随机数(1,100) < 30 then
					local 物品名称 = 制造装备[随机防御部位1][60]
					玩家数据[cyid].道具:给予道具(cyid,nil,nil,nil,nil,nil,玩家数据[cyid].道具:自选灵饰处理(cyid,物品名称,60,随机防御部位1,随机防御属性1))
				else
					local 物品名称 = 制造装备[随机部位1][60]
					玩家数据[cyid].道具:给予道具(cyid,nil,nil,nil,nil,nil,玩家数据[cyid].道具:自选灵饰处理(cyid,物品名称,60,随机部位1,随机属性1))
				end
				广播消息({内容="#S(辰年任务)#G"..玩家数据[cyid].角色.名称.."#Y运气爆棚，竟然获得了上官奖励的#R60级三属性灵饰！",频道="hd"})
			elseif 几率<=35 then
				local 数量= 1
				local 链接 = {提示=format("#S(辰年任务)#G/%s#Y顺利完成押送贡品任务，上官奖励了他%s个",玩家数据[cyid].角色.名称,数量),频道="hd",结尾="#"..取随机数(1,110).."#Y！"}
				玩家数据[cyid].道具:给予超链接道具(cyid,"仙露丸子",数量,nil,链接,"成功")
			elseif 几率<=40 then
				local 数量= 1
				local 链接 = {提示=format("#S(辰年任务)#G/%s#Y顺利完成押送贡品任务，上官奖励了他%s个",玩家数据[cyid].角色.名称,数量),频道="hd",结尾="#"..取随机数(1,100).."#Y！"}
				玩家数据[cyid].道具:给予超链接道具(cyid,"锦红彩笺",数量,nil,链接,"成功")
			elseif 几率<=60 then
				local 链接 = {提示=format("#S(辰年任务)#G/%s#Y顺利完成押送贡品任务，上官奖励了他",玩家数据[cyid].角色.名称),频道="hd",结尾="#"..取随机数(1,100).."#Y！"}
				玩家数据[cyid].道具:给予超链接道具(cyid,"金柳露",1,nil,链接,"成功")
			else
				local 链接 = {提示=format("#S(辰年任务)#G/%s#Y顺利完成押送贡品任务，上官奖励了他",玩家数据[cyid].角色.名称),频道="hd",结尾="#"..取随机数(1,110).."#Y！"}
				玩家数据[cyid].道具:给予超链接道具(cyid,"金银锦盒",取随机数(1,30),nil,链接,"成功")
			end
			玩家数据[cyid].角色:取消任务(任务id)
			添加活跃(cyid,1)
			更新玩家每日1(cyid,"日常任务","辰年")
		end
	end
	任务数据[任务id]=nil
end



function 胜利MOB_150055(id组,战斗类型,任务id) --辰年任务

	local id=id组[1]
	for n=1,#id组 do
		local cyid=id组[n]
		if 玩家数据[cyid] and 玩家数据[cyid].角色 then
			local 等级=玩家数据[cyid].角色.等级
			local 等级1=math.floor(玩家数据[cyid].角色.等级/5)
			local 经验=qz(等级*等级*等级1*5)
			local 银子=qz(等级*等级*等级1)
			玩家数据[cyid].角色:添加银子(银子,"辰年任务",1)
			玩家数据[cyid].角色:添加经验(经验,"辰年任务",1)
		end
		设置任务1100(cyid)
		玩家数据[id].角色:取消任务(任务id)
		任务数据[任务id]=nil
	end
end

function 任务说明1099(玩家id,任务id)
	local 说明 = {}
	说明={"辰年任务",format("前往#Y/%s(%s,%s)#W/#L/处找到#G/%s#L夺回龙年百官准备上交的贡品",任务数据[任务id].地图名称,任务数据[任务id].x,任务数据[任务id].y,任务数据[任务id].名称),"可获得经验、银子、储备金"}
	return 说明
end
function 任务说明1100(玩家id,任务id)
	local 说明 = {}
	说明={"辰年任务",format("请把贡品送回#Y/辰年上卿#W/处（长安城227，106）"),"可获得经验、银子、几率获得红包碎纸"}
	return 说明
end