
function 设置任务502(id)
	if 玩家数据[id].角色:取任务(13)~=0 then 添加最后对话(id,"人物修炼和召唤兽修炼和铸魂任务不能同时进行")return end
	if 玩家数据[id].角色:取任务(501)~=0 then 添加最后对话(id,"人物修炼和召唤兽修炼和铸魂任务不能同时进行")return end
	if 玩家数据[id].角色:取任务(502)~=0 then 添加最后对话(id,"你已经有人物修炼了任务了")return end
	if 玩家数据[id].角色.等级<60 then
		添加最后对话(id,"只有等级达到60级的玩家才可以领取本任务。")
		return
	-- elseif 玩家数据[id].角色.善恶点<100 then
	-- 	添加最后对话(id,"你没有那么多的善恶点。")
	-- 	return
	end
	-- 玩家数据[id].角色:扣除善恶点(100,0,0,"领取铸魂任务",1)
	local 任务id=id.."_502_"..os.time()
	local 结束时间=99999999
	任务数据[任务id]={
		id=任务id,
		起始=os.time(),
		结束=结束时间,
		玩家id=id,
		队伍组={},
		名称=1,
		模型=1,
		地图编号=1001,
		地图名称=1,
		积分=0,
		次数=1,
		类型=502
	}
	玩家数据[id].角色:添加任务(任务id)
	GetUpMOB502(id,任务id)
end

function GetUpMOB502(id,任务id)
	local data = {1,2,3,4,5,6,7,8,9,10,11,12,13,14} --任务类型
	local 类型=data[取随机数(1,#data)]
	if 类型<=11 then
		类型=11
	end
	if 调试模式 then
	    类型=14
	end

	local 序列=取随机数(1,#Q_随机人物)
	local 地图=Q_随机人物[序列].地图
	local 名称=Q_随机人物[序列].人物[取随机数(1,#Q_随机人物[序列].人物)]
	--地图=1111
	--名称="马真人"
	任务数据[任务id].地图编号=地图
	任务数据[任务id].地图名称=取地图名称(地图)
	任务数据[任务id].名称=名称
	任务数据[任务id].分类=类型
	任务数据[任务id].传说=nil
	if 类型==11 then
	 添加最后对话(id,format("前些日子%s的%s帮了我不少忙，请你前去替我感谢他吧。",任务数据[任务id].地图名称,任务数据[任务id].名称))
	elseif 类型==12 then --索要环装
		local 临时等级=取随机数(6,8)
		任务数据[任务id].等级=临时等级
		临时限制=临时等级
		local 物品名称=装备处理类.打造物品[取随机数(1,23)][临时限制+1]
		if type(物品名称)=="table" then
			物品名称=物品名称[取随机数(1,#物品名称)]
		end
		任务数据[任务id].物品= 物品名称
		if 任务数据[任务id].物品==nil then
		 任务数据[任务id].物品="追星踏月"
		 任务数据[任务id].等级=6
		end
	 添加最后对话(id,format("听闻%s的%s正在四处搜寻#Y%s#W，请你帮他寻找一个吧。",任务数据[任务id].地图名称,任务数据[任务id].名称,任务数据[任务id].物品))
	elseif 类型==13 then
	 local  物品表={"烤肉","醉生梦死","蛇胆酒","百味酒","梅花酒","长寿面","翡翠豆腐","桂花丸","佛跳墙","佛跳墙","佛跳墙","珍露酒","烤鸭","烤鸭","豆斋果","烤鸭","臭豆腐","佛跳墙","烤鸭","虎骨酒"}
	 任务数据[任务id].物品=物品表[取随机数(1,#物品表)]
	 添加最后对话(id,format("听闻%s的%s正在四处搜寻#Y%s#W，请你帮他寻找一个吧。",任务数据[任务id].地图名称,任务数据[任务id].名称,任务数据[任务id].物品))
	elseif 类型==14 then
	 local  物品表={"金香玉","小还丹","千年保心丹","风水混元丹","定神香","蛇蝎美人","九转回魂丹","佛光舍利子","十香返生丸","五龙丹"}
	 任务数据[任务id].物品=物品表[取随机数(1,#物品表)]
	 添加最后对话(id,format("听闻%s的%s正在四处搜寻#Y%s#W，请你帮他寻找一个吧。",任务数据[任务id].地图名称,任务数据[任务id].名称,任务数据[任务id].物品))

	elseif 类型==16 then---家具
	 local  物品表={"黑麻垂曼帘","桦木圆桌","桦木立柜","草编地毯","漆花竹凳","榛木床","印花屏风","文竹","君子兰","蝴蝶兰","水仙","仙人掌","银烛台","玉瓷画瓶","踏春图","漆花地板","白鹤展翅帘","蓝绸绣花帘","红木八仙桌","嵌玉虎纹桌","双鱼吉庆柜","彩绘立柜","兽皮地毯","麻布地毯","桦木靠背椅","月牙凳","八卦镇邪塌","神仙帐","狮子图屏风","花鸟图屏风","天山云雪","龟鹤延年灯","长信宫灯","雕花马桶","彩绘花瓶","夕阳山水图","猛虎坐山图","桦木地板"}---自己加
	 任务数据[任务id].物品=物品表[取随机数(1,#物品表)]
	 添加最后对话(id,format("听闻%s的%s正在四处搜寻#Y%s#W，请你帮他寻找一个吧。",任务数据[任务id].地图名称,任务数据[任务id].名称,任务数据[任务id].物品))
	end
	玩家数据[id].角色:刷新任务跟踪()
end

function 完成任务_502(id,任务id)
	if 任务数据[任务id]==nil then return  end
	local 次数=任务数据[任务id].次数
	local 积分=0
	if 次数<=5 then
		积分=2
	elseif 次数<=20 then
		积分=3
	elseif 次数<=30 then
		积分=4
	elseif 次数<=40 then
		积分=5
	elseif 次数<=50 then
		积分=6
	elseif 次数<=60 then
		积分=7
	elseif 次数<=70 then
		积分=8
	elseif 次数<=80 then
		积分=9
	elseif 次数<=90 then
		积分=10
	else
		积分=11
	end
	任务数据[任务id].次数=任务数据[任务id].次数+1
	任务数据[任务id].积分=任务数据[任务id].积分+1
	-- if 玩家数据[id].队伍 ~= 0 then
	-- 	for n=1,#队伍数据[玩家数据[id].队伍].成员数据 do
	-- 		local id1 = 队伍数据[玩家数据[id].队伍].成员数据[n]
	-- 		if id1 ~= id then
	-- 			local 积分1 = qz(积分)
	-- 			玩家数据[id1].角色:添加玉魄积分(积分1)
	-- 		end
	-- 	end
	-- end
   	玩家数据[id].角色:添加玉魄积分(积分)
	if 任务数据[任务id].次数>=101 then
		local 链接 = {提示=format("#S(铸魂任务)#G/%s#W在#R铸魂任务#W任务中的完成了100环任务，获得",玩家数据[id].角色.名称),频道="hd",结尾="#W以资鼓励！#85"}
		local data = {"上古玉魄·阴","上古玉魄·阳"}
        		玩家数据[id].道具:给予超链接道具(id,data[取随机数(1,2)],1,nil,链接,"不存共享")
		玩家数据[id].角色:取消任务(任务id)
		常规提示(id,"#Y恭喜你完成了全部的铸魂任务")
		任务数据[任务id].次数=0
		任务数据[任务id].积分=0
		任务数据[任务id]=nil
	else
		GetUpMOB502(id,任务id)
	end
end

function 任务说明502(玩家id,任务id)
	local 说明 = {}
	if 任务数据[任务id].分类==11 then
		说明={"铸魂任务",format("#L找到%s的#R/qqq|%s*%s*npc查询/%s#L,当前第%s环，任务积分%s分。",任务数据[任务id].地图名称,任务数据[任务id].名称,任务数据[任务id].地图名称,任务数据[任务id].名称,任务数据[任务id].次数,任务数据[任务id].积分)}
	elseif 任务数据[任务id].分类==12 or 任务数据[任务id].分类==13 or 任务数据[任务id].分类==14 or 任务数据[任务id].分类==16 then
		说明={"铸魂任务",format("#L将#Y/qqq|%s*物品查询*/%s#L交给%s的#R/qqq|%s*%s*npc查询/%s#L,当前第%s环，任务积分%s分。",任务数据[任务id].物品,任务数据[任务id].物品,任务数据[任务id].地图名称,任务数据[任务id].名称,任务数据[任务id].地图名称,任务数据[任务id].名称,任务数据[任务id].次数,任务数据[任务id].积分)}
	-- elseif 任务数据[任务id].分类==15 then
	-- 	说明={"铸魂任务",format("#L将#Y%s#L交给%s的%s,当前第%s环，任务积分%s分。",任务数据[任务id].bb,任务数据[任务id].地图名称,任务数据[任务id].名称,任务数据[任务id].次数,任务数据[任务id].积分)}
	 end
	return 说明
end